{
  "passages": [
    {
      "pid": 1,
      "name": "Starting Out",
      "text": "{(set: $flyntcoal to false)\n(set: $adarkroom to true)\n(set: $knife to false)\n(set: $satiated to false)\n(set: $savage to 0)<!-- Strength, grit, DETERMINATION -->\n(set: $candescent to 0)<!-- Perception, intelligence, pragmatism -->\n(set: $wolves to 0) <!-- You are being watched. -->\n(set: $chaotic to 0) <!-- There is something stirring. -->\n(set: $wounds to 0) <!-- Don't let it hit 3.-->\n(set: $mood to \"melancholy\")\n(set: $lastPassage to \"\")\n(set: $deco to \"\")\n(set: $lastPassage to \"Starting Out\")\n(set: $thename to false)\n(set: $mark to \"\")\n(set: $guide to \"Your guide\")\n(set: $implement to \"\")\n(set: $time to \"\")}\nYou can barely see now; the world blurs by, green and grey and black. Instead you focus on what you can hear - the slap of your feet against hard-packed dirt, the rasp of your breath, the rustle of leaves and branches catching on your bare arms, and in the distance a chorus of howls.\n\nYour foot snags on a branch. Desperately you fling your arms forward; they take the brunt of it as you collapse to the ground. Tears spring to your eyes, but you cannot rest.\n\n[[Crawl]]\n[[Look back]]",
      "links": [
        {
          "text": "<set>",
          "destination": {
            "name": "Starting Out",
            "pid": 1
          }
        },
        {
          "text": "Crawl",
          "destination": {
            "name": "Crawl",
            "pid": 2
          }
        },
        {
          "text": "Look back",
          "destination": {
            "name": "Look back",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "Crawl",
      "text": "(set: $savage to it + 1)\nGritting your teeth, you dig your elbows into the ground and lurch forward. There's a tree nearby with roots thick and gnarled enough to hide in. You nestle between them, heart pounding rabbit-fast, listening for your pursuers.\n\nNothing. Have you outrun [[them]]?",
      "links": [
        {
          "text": "them",
          "destination": {
            "name": "them",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "Look back",
      "text": "(set: $candescent to it +1)\nWith a gasp of pain you force yourself to sit up. Your pulse drums in your ears as you slowly turn to face behind you, where your pursuers are surely about to arrive.\n\nA minute passes. Two. Nothing happens. Have you outrun [[them]]?",
      "links": [
        {
          "text": "them",
          "destination": {
            "name": "them",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "them",
      "text": "As your breathing steadies, you take in your surroundings. You've run further than you'd thought. More than likely the villagers have long since returned, satisfied that you will not.\n\nThe howling fades out. It seems the wolves haven't caught your scent, despite the village's best efforts. You don't know whether to [[laugh]] or [[cry]].",
      "links": [
        {
          "text": "laugh",
          "destination": {
            "name": "laugh",
            "pid": 5
          }
        },
        {
          "text": "cry",
          "destination": {
            "name": "cry",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "laugh",
      "text": "(set: $savage to it + 1)(set: $mood to \"defiant\")\nLaughter bubbles up your throat. You lean back, palms pressing into the dirt, and give in to it. It's a desperate hysterical sound that fills the empty air. You think of their patronising words, the satisfaction in their eyes as they sent you away--and for what? Your blood will not nourish their crops. The wolves will not be sated with your flesh. You laugh loud and hard, until your sides ache and you're gasping for air.\n\nYou are alive.\n\n[[Now what?]]",
      "links": [
        {
          "text": "Now what?",
          "destination": {
            "name": "Now what?",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "cry",
      "text": "(set: $candescent to it + 1)(set: $mood to \"melancholy\")\nHuddling in on yourself, you press your forehead to your knees and take a deep, shuddering breath. Immediately the tears you've been suppressing begin to flow. It's a quiet, hopeless grief that overwhelms you. You think of your parents--the grim line of your father's mouth, your mother's anguished screams. They will already be in mourning. After all, you should be dead.\n\nBut you're not. Not yet. You steady your breathing and raise your head.\n\n[[Now what?]] ",
      "links": [
        {
          "text": "Now what?",
          "destination": {
            "name": "Now what?",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "Now what?",
      "text": "You get unsteadily to your feet and take a look around. A cold breeze brushes past you, raising goosebumps on your arms. \n\nWhat little moonlight makes it through the canopy isn't enough to see by, so instead you listen. Somewhere to your right you can faintly make out the sound of [[rushing water]].",
      "links": [
        {
          "text": "rushing water",
          "destination": {
            "name": "rushing water",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "rushing water",
      "text": "You go slowly now, testing the ground before each step. As your heartbeat slows, your ears fill with the sounds of the forest - rustling leaves, chittering insects, the soft hoot of an owl. It's strangely peaceful.\n\nThe trees start to thin as you approach a winding stream. Here the moonlight is so bright it seems like day. The water is clear and shallow, and when you kneel and dip one hand in it's wonderfully cool.\n\nRunning through the night air has dehydrated you more than you'd realised. You gulp the water down greedily until your stomach hurts and you're gasping for breath. As you exhale you stare down at the water, where [[your blurred reflection]] stares back.",
      "links": [
        {
          "text": "your blurred reflection",
          "destination": {
            "name": "your blurred reflection",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "your blurred reflection",
      "text": "You can barely make out any of your features in the rushing water. It mostly looks like a second full moon. If you lean in close, so the tip of your nose brushes the water, you can just distinguish the pale blue of your eyes.\n\nA shiver jolts through you, almost knocking you off balance. You manage to scramble upright just in time. It's a sharp reminder that you don't have time to be messing around.\n\nAs you stand up you feel your calves start to cramp. Thankfully you spot a [[tree stump]] nearby, almost perfectly flat on top. It makes an excellent perch from which you can survey the [[clearing]].",
      "links": [
        {
          "text": "tree stump",
          "destination": {
            "name": "tree stump",
            "pid": 10
          }
        },
        {
          "text": "clearing",
          "destination": {
            "name": "clearing",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "tree stump",
      "text": "You run your hands idly over the wizened wood. There are a few uneven chunks along the edge, but overall it makes a comfortable seat. Not far from you there's a smaller stump that looks as though it was felled with one clean blow.\n\nNow that you think of it, you're pretty deep into the forest. The hunters barely come this far in, let alone the woodchoppers. Your hands fall still. Cautiously you get to your feet.\n\nFollowing the stumps, you wander deeper into the woods. The trees thicken, then clear again. You breathe in sharply.\n\nStanding before you is a small, sturdy-looking hut.\n\n[[Approach it->The Hut - outside]]",
      "links": [
        {
          "text": "Approach it",
          "destination": {
            "name": "The Hut - outside",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "clearing",
      "text": "You take in your surroundings as best you can in the dim moonlight. The river cuts the clearing in half; it's too wide to jump, but there's a few stones you could use to cross safely. \n\nOn this side there are several more tree-stumps. Now that you think of it, they don't look like they fell naturally. There's also patches of ground that look well-trodden. Cautiously you get to your feet.\n\nFollowing the stumps, you wander deeper into the woods. The trees thicken, then clear again. You breathe in sharply.\n\nStanding before you is a small, sturdy-looking hut.\n\n[[Approach it->The Hut - outside]].",
      "links": [
        {
          "text": "Approach it",
          "destination": {
            "name": "The Hut - outside",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "The Hut - outside",
      "text": "You edge towards the hut, ears pricked for any sign of life. The air remains eerily still. \n\nAnother shiver derails your train of thought. You wrap your arms tighter around yourself. If someone takes offense to you taking shelter here, you can deal with it once you're warm.\n\nA cursory look over the hut reveals both a [[door->thedoor]] and a [[window->thewindow]] just big enough to climb through. You also spot a large pile of [[firewood->Firewood]].",
      "links": [
        {
          "text": "door",
          "destination": {
            "name": "thedoor",
            "pid": 15
          }
        },
        {
          "text": "window",
          "destination": {
            "name": "thewindow",
            "pid": 14
          }
        },
        {
          "text": "firewood",
          "destination": {
            "name": "Firewood",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "The Hut - inside",
      "text": "(unless: (history:) contains (\"The Hut - inside\"))[\n(if: (history:) contains (\"thedoor\"))[The door gives way the moment you touch it, swinging inwards with barely a sound. You linger in the doorway until the wind whips up again, the need for warmth. trumping your fear]\n(if: (history:) contains (\"thewindow\"))[With a grunt of effort you manage to yank the window loose. It creaks in protest, but you are determined, and soon there's enough of a gap for you to squeeze through. It's low enough that you barely have to jump. Your hands grip the rough stone, and with one great heave you tumble forward.\n\nYou land firmly on your arse, which you suppose is better than your head. When you look up, you see the door swinging, knocked loose by the impact of your fall.]\n\nYou hold your breath for a moment, eyes darting from shadow to shadow. When nothing lunges out, you take a hesistant step towards the centre of the room. Your boot knocks against a stone. Peering down, you see a round [[firepit]] set into the floor. Squashed up against the opposite wall is a primitive [[bed]]. To your left, there's a [[bench]].\n\n[[Go back outside->The Hut - outside]]]\n\n(else:)[(either: \"The hut is surprisingly roomy.\", \"You survey the hut from the doorway.\", \"Every movement in here sets off a swirl of dust motes.\") There's a [[firepit]] in the centre of the room, a [[bed]] on the far wall, and a [[bench->bench]] to your left. (if: $adarkroom is false)[The fire provides a warm, comforting light.]\n\n[[Go back outside->The Hut - outside]]]",
      "links": [
        {
          "text": "firepit",
          "destination": {
            "name": "firepit",
            "pid": 16
          }
        },
        {
          "text": "bed",
          "destination": {
            "name": "bed",
            "pid": 17
          }
        },
        {
          "text": "bench",
          "destination": {
            "name": "bench",
            "pid": 18
          }
        },
        {
          "text": "Go back outside",
          "destination": {
            "name": "The Hut - outside",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "thewindow",
      "text": "(if: (history:) contains (\"The Hut - inside\"))[The door's unlocked, so there's no need to go through the window.]\n(else:)[Set into one side of the hut is a glassless window. Two crossed planks of wood divide it into four parts, none large enough for you to squeeze through, but if you could get it open ...\n[[Try to go in through the window ->The Hut - inside]]]\n\n[[Go back->The Hut - outside]] ",
      "links": [
        {
          "text": "Try to go in through the window ",
          "destination": {
            "name": "The Hut - inside",
            "pid": 13
          }
        },
        {
          "text": "Go back",
          "destination": {
            "name": "The Hut - outside",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "thedoor",
      "text": "The door, like the rest of the hut, is made entirely out of wood, including the intricately carved hinges and lock. Though you can't see how it's held together, it looks pretty sturdy.\n(unless: (history:) contains (\"The Hut - inside\"))[\n[[Try to open the door->The Hut - inside]]]\n(else:)[[[Go inside->The Hut - inside]]]\n[[Go back->The Hut - outside]] \n",
      "links": [
        {
          "text": "Try to open the door",
          "destination": {
            "name": "The Hut - inside",
            "pid": 13
          }
        },
        {
          "text": "Go inside",
          "destination": {
            "name": "The Hut - inside",
            "pid": 13
          }
        },
        {
          "text": "Go back",
          "destination": {
            "name": "The Hut - outside",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "firepit",
      "text": "You hold one hand over the pit. It's cold. There are still coals and ash inside, though.\n\n(if: $flyntcoal is false)[Unfortunately, there's nothing you can use to light it.]\n(else:)[{}[[Light the fire->Light the fire]]]\n[[Come back later.->The Hut - inside]] ",
      "links": [
        {
          "text": "Light the fire",
          "destination": {
            "name": "Light the fire",
            "pid": 19
          }
        },
        {
          "text": "Come back later.",
          "destination": {
            "name": "The Hut - inside",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "bed",
      "text": "(if: $adarkroom is false)[With the soft crackling of the fire in your ears, you kneel beside the bed and pull back the covers. Beneath them is a pelt of thick, soft fur. Your limbs turn to lead and your eyelids droop. Fleetingly you wonder if the hut's owner will return, but your mind is too foggy to worry about it. \n\nCurled up beneath the blanket, you can pretend you're in your own bed. Any moment now, your mother will come in and press a kiss to your forehead.\n\n[[Any moment now ...->dream1]]]\n\n(else:)[Gingerly you kneel beside the bed and pull back the covers. Underneath is some kind of pelt - you don't recognise the animal. You press your hands into the thick fur; it's incredibly soft and inviting. Still, the thin fabric that serves as a blanket won't be enough to keep you warm throughout the night. You'll need a source of heat before you can sleep.\n\n[[Go back->The Hut - inside]]]",
      "links": [
        {
          "text": "Any moment now ...",
          "destination": {
            "name": "dream1",
            "pid": 21
          }
        },
        {
          "text": "Go back",
          "destination": {
            "name": "The Hut - inside",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "bench",
      "text": "Bending down, you see that it's not so much a bench as it is a plank of roughly-hewn wood balanced atop two sturdy logs. Even so it barely wobbles under your touch. There are a few grooves in the surface, as though something sharp had been dragged over it. (if: $adarkroom is true)[The area below it is too dark to make out.]\n\n(if: ($adarkroom is false) and ($knife is false))[Something gleams underneath the bench. You reach towards it and touch cool metal. It's only a little knife, but the edge still bites your skin. It'll serve you well.\n(set: $knife to true)]\n[[Go back->The Hut - inside]] ",
      "links": [
        {
          "text": "Go back",
          "destination": {
            "name": "The Hut - inside",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "Light the fire",
      "text": "Hands shaking, you strike your flint. Nothing. Two, three more times, and then -- a spark lands on your little pile of tinder. You drop, eyes fixed on the orange glow. The sight of it spreading is at once comforting and hypnotic; you almost forget to keep adding sticks. Soon your shivers have stopped completely. (set: $adarkroom to false)\n\n[[Go back->The Hut - inside]] \n\n",
      "links": [
        {
          "text": "Go back",
          "destination": {
            "name": "The Hut - inside",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "Firewood",
      "text": "(if: $flyntcoal is false)[There's firewood stacked up by the wall of the hut, under a roughly-constructed awning. Surprisingly, it's in good condition. When you crouch down to inspect it, you spot a flint and steel tucked between two logs. That solves one problem.\n(set: $flyntcoal to true)]\n(else:)[There's dry firewood stacked up under a roughly-constructed awning. If you're careful, it'll probably last you a few months.]\n[[Go back->The Hut - outside]] ",
      "links": [
        {
          "text": "Go back",
          "destination": {
            "name": "The Hut - outside",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "dream1",
      "text": "The warmth of the sun beats down upon you, but something soft and cool surrounds you. It brushes against your side, shifts beneath your head, twines around your legs. Your fingertips slide through it, like stroking the fur of some great beast. The scent of fresh dew fills the air.\n\nThere is a rumble like thunder at the edge of your hearing. At first you shut your eyes tighter, willing it away, but it only grows louder until it reverberates through your bones. The sunlight fades and you begin to shiver. Finally, when the sound is so loud you cannot think, you force your eyes open.\n\nA pair of piercing red eyes stare back at you. Terror freezes you in place. It leans in until you feel the heat of its breath, its teeth bared --\n\n[[Wake.]]",
      "links": [
        {
          "text": "Wake.",
          "destination": {
            "name": "Wake.",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "Wake.",
      "text": "(unless: (history:) contains (\"Wake.\"))[It's morning! Your stomach rumbles. ]\n\nNow that daylight is streaming in it seems much roomier in here. You can see the [[firepit->firepit2]], the [[bed->bed2]] and the [[bench->bench2]]\n\nLet's go [[outside]].",
      "links": [
        {
          "text": "firepit",
          "destination": {
            "name": "firepit2",
            "pid": 29
          }
        },
        {
          "text": "bed",
          "destination": {
            "name": "bed2",
            "pid": 30
          }
        },
        {
          "text": "bench",
          "destination": {
            "name": "bench2",
            "pid": 31
          }
        },
        {
          "text": "outside",
          "destination": {
            "name": "outside",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "outside",
      "text": "Right now your best bet for food is likely the [[clearing->clearing2]]. As you look around, though, you notice a set of [[pawprints]] leading further into the forest. You can't be sure if they were there last night.",
      "links": [
        {
          "text": "clearing",
          "destination": {
            "name": "clearing2",
            "pid": 24
          }
        },
        {
          "text": "pawprints",
          "destination": {
            "name": "pawprints",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "clearing2",
      "text": "(if: $satiated is true)[Your meal in hand, you begin your walk back to the hut. You make it about halfway before a low growl startles you. Barely keeping your balance, you turn to see a [[young wolf]] staring at you from nearby. Its head and tail both hang low, and its dark eyes are narrowed.]\n\n(else:)[The clearing is undisturbed from yesterday. The river babbles softly, and you see the [[glint of light on fish-scales->Fish]] within. Alternatively, it should be easy enough to find some [[edible mushrooms and nuts->Forage]] in the underbrush.]",
      "links": [
        {
          "text": "young wolf",
          "destination": {
            "name": "young wolf",
            "pid": 37
          }
        },
        {
          "text": "glint of light on fish-scales",
          "destination": {
            "name": "Fish",
            "pid": 26
          }
        },
        {
          "text": "edible mushrooms and nuts",
          "destination": {
            "name": "Forage",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "pawprints",
      "text": "There are pawprints circling the hut. It looks like something has been pacing around here. They lead off into the forest.\n\n(unless: (history:) contains \"remains\")[\n[[Follow.]]\n[[Do not.->outside]]]\n(else:)[[[To the corpse->remains]]\n[[Back->outside]]]\n\n",
      "links": [
        {
          "text": "Follow.",
          "destination": {
            "name": "Follow.",
            "pid": 32
          }
        },
        {
          "text": "Do not.",
          "destination": {
            "name": "outside",
            "pid": 23
          }
        },
        {
          "text": "To the corpse",
          "destination": {
            "name": "remains",
            "pid": 33
          }
        },
        {
          "text": "Back",
          "destination": {
            "name": "outside",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "Fish",
      "text": "(if: $knife is false)[As you watch the flash of fins in the water, you contemplate your plan of attack. A spear ought to do the trick. There are some suitable sturdy branches here, but you need something to sharpen one with.]\n(else:)[(set: $savage to it + 1)\nA slender branch around the length of your arm hangs just within reach. You stretch out, wrap your hands around it, and pull. It comes down with a satisfying //crack//. A few minutes' work with the knife, and you've got yourself a usable spear.\n\nBy the time you've got the hang of spear-fishing, the hem of your dress is thoroughly soaked. You hike it up and tie it around your waist; it's not like there's anyone around to be scandalised by your calves. \n\nBefore long, you've got a handsome pile of dead fish sitting on the riverbank. They don't look particularly appetising with their guts spilled on the dirt, but your stomach growls all the same. It's about time to head home.\n(set: $satiated to true)]\n\n[[Go back->clearing2]]",
      "links": [
        {
          "text": "Go back",
          "destination": {
            "name": "clearing2",
            "pid": 24
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "Forage",
      "text": "(set: $candescent to it + 1)\nYou're pretty good at telling edible mushrooms from non-edible ones. One of the advantages of being raised a girl, you suppose. Picking a direction and wandering at random nets you an armful of tasty white and golden mushrooms.\n\nLooking up, you realise you've strayed from the river. The forest is thick and unfamiliar around you, but for a patch to your right that seems to thin out into a [[path]].",
      "links": [
        {
          "text": "path",
          "destination": {
            "name": "path",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "path",
      "text": "Picking your way over the thickly twisting roots, you follow the thinning trees. The sound of rushing water reaches the edge of your hearing. You quicken your pace, your stomach growling.\n\nA chill settles over your skin. You stop short. A glance around reveals no-one watching you, and yet your heart is pounding. You force yourself to step forward; your limbs are strangely unwilling.\n\nHere, finally, is the riverbank. This patch is unremarkable, but for a lone boulder. Looking along the river's length, you can just make out the flat stumps you started at.  \n\n[[Inspect the rock.]]\n[[Get going->cook your meal]].",
      "links": [
        {
          "text": "Inspect the rock.",
          "destination": {
            "name": "Inspect the rock.",
            "pid": 36
          }
        },
        {
          "text": "Get going",
          "destination": {
            "name": "cook your meal",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "firepit2",
      "text": "A few coals are still smouldering in the firepit.\n\n[[Go back->Wake.]]",
      "links": [
        {
          "text": "Go back",
          "destination": {
            "name": "Wake.",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "bed2",
      "text": "You straighten the covers out as best you can. It makes you feel a little more civilised.\n\n[[Go back->Wake.]]",
      "links": [
        {
          "text": "Go back",
          "destination": {
            "name": "Wake.",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "bench2",
      "text": "Bending down, you see that it's not so much a bench as it is a plank of roughly-hewn wood balanced atop two sturdy logs. Even so it barely wobbles under your touch. There are a few grooves in the surface, as though something sharp had been dragged over it. \n\n(if: $adarkroom is false and $knife is false)[Something gleams underneath the bench. You reach towards it and touch cool metal. It's only a little knife, but the edge still bites your skin. It'll serve you well.\n(set: $knife to true)]\n[[Go back->Wake.]]",
      "links": [
        {
          "text": "Go back",
          "destination": {
            "name": "Wake.",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "Follow.",
      "text": "Dark splotches in the dust. The smell of salt and metal. You tread lightly, clinging close to the trees. Your pulse throbs in your temples. There are more prints now, smaller ones. Scraps of fur stuck to the ground. You're close. Just a little further, and ...\n\nYou round the next tree and freeze. What greets you is all that [[remains]] of the hunt.",
      "links": [
        {
          "text": "remains",
          "destination": {
            "name": "remains",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "remains",
      "text": "A carcass lies in the dust. There's a broken antler by your foot. A stag, then. Most of its meat has been roughly torn away, but there's more than enough left to feed you. Still, even in its current state there's no way you can drag it back. If you had something sharp you could cut it up.\n\nOr, of course, you could just rip it up with your bare hands. The thought makes your stomach lurch.\n\n$knife[[[Carve.->carve]]]\n[[Rip.]]\n[[Go back.->outside]] ",
      "links": [
        {
          "text": "Carve.",
          "destination": {
            "name": "carve",
            "pid": 35
          }
        },
        {
          "text": "Rip.",
          "destination": {
            "name": "Rip.",
            "pid": 34
          }
        },
        {
          "text": "Go back.",
          "destination": {
            "name": "outside",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "Rip.",
      "text": "(set: $savage to it +1)\nYou dig your nails into the meat. It's not very effective; you manage to pull off a few shreds, but nothing substantial. Frustrated, you snarl, leaning forward heavily on your palms.\n\nSomething rustles behind you. Lurking behind a tree is a massive white wolf. Its eyes, bright red, watch you coldly. \n\nBefore you can move it's padding forward. It leans in close, and you can smell rotting meat on its breath. \n\n[[Back away]].",
      "links": [
        {
          "text": "Back away",
          "destination": {
            "name": "Back away",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "carve",
      "text": "(set: $candescent to it+1)\nA wolf approaches you and watches you carving.\n\n[[Offer it some]].\n[[Ignore it]].",
      "links": [
        {
          "text": "Offer it some",
          "destination": {
            "name": "Offer it some",
            "pid": 44
          }
        },
        {
          "text": "Ignore it",
          "destination": {
            "name": "Ignore it",
            "pid": 45
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "Inspect the rock.",
      "text": "(set: $chaotic to it + 1)You shift your haul to the crook of one elbow and reach out. The stone is cool to the touch. When you look closer, there's something carved delicately into the flat surface. It looks like two crosses, set at right angles. When the pad of one finger brushes against it, the hairs on the back of your neck stand on end.\n\nYour stomach growls again and you snatch your hand away. It's probably time you [[got back->cook your meal]].",
      "links": [
        {
          "text": "got back",
          "destination": {
            "name": "cook your meal",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "young wolf",
      "text": "You and the wolf regard each other silently. It doesn't seem aggressive, but equally seems intent on staying put, which might make returning to your hut difficult.\n\n[[Yell]].\n[[Speak soothingly]].\n[[Offer fish]].",
      "links": [
        {
          "text": "Yell",
          "destination": {
            "name": "Yell",
            "pid": 38
          }
        },
        {
          "text": "Speak soothingly",
          "destination": {
            "name": "Speak soothingly",
            "pid": 39
          }
        },
        {
          "text": "Offer fish",
          "destination": {
            "name": "Offer fish",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "Yell",
      "text": "(set: $savage to it + 1)You widen your stance, hold your arms out awkwardly, and let out a piercing shriek. It feels ridiculous, but the wolf flattens its ears and takes a step backwards. You shout again and it darts off out of sight. \n\nWith a sigh of relief, you [[keep walking->cook your meal]].",
      "links": [
        {
          "text": "keep walking",
          "destination": {
            "name": "cook your meal",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "Speak soothingly",
      "text": "(set: $candescent to it + 1)\"Hey there,\" you say, your voice soft and low. \"My home's that way. I don't want to have any trouble, so if you could just keep moving, I'd really appreciate it.\" \n\nThe wolf whines softly. It watches you for another minute, then wanders off. when it's completely out of sight, you let out a breath, hold your catch a little closer to your chest, and [[keep walking->cook your meal]].",
      "links": [
        {
          "text": "keep walking",
          "destination": {
            "name": "cook your meal",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "Offer fish",
      "text": "(set: $wolves to it + 1)\nYou pinch the tail of one of your precious fish and hold it up. The wolf's eyes follow it, its tongue lolling. It leaps forward as you toss the fish towards it. Within moments there's nothing left but bones. The wolf looks up at you, tail thumping loudly on the ground, then trots off.\n\nA sharp hunger pang jabs at your stomach. Wincing, you step over the scraps of bone and [[head home->cook your meal]].",
      "links": [
        {
          "text": "head home",
          "destination": {
            "name": "cook your meal",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "Back away",
      "text": "The wolf grabs a bit of meat in its teeth and starts ripping at it. It drops it by your side, then grabs a different piece. Soon the carcass is all but clean and there's a pile of shredded meat on the ground next to you. The wolf looks at you, nostrils flaring.\n\n[[Thank it]].\n[[Grab the meat]].",
      "links": [
        {
          "text": "Thank it",
          "destination": {
            "name": "Thank it",
            "pid": 42
          }
        },
        {
          "text": "Grab the meat",
          "destination": {
            "name": "Grab the meat",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "Thank it",
      "text": "(set: $candescent to it +1, $wolves to it + 1)\n\n\"Thank you.\" The wolf cocks its head at you and huffs through its nose. It looks pointedly between you and its handiwork, then trots off.\n\nYou sit there in silence for a long moment. Then, you gather yourself, bundle the meat up in your arms, and [[head back->cook your meal]].",
      "links": [
        {
          "text": "head back",
          "destination": {
            "name": "cook your meal",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "Grab the meat",
      "text": "(set: $savage to it +1, $wolves to it + 1)\nYou start gathering the shredded meat into your arms. The wolf makes a low whining noise, then gently nudges your shoulder with its nose. It then trots off, leaving you alone with armfuls of carrion and the rapidly cooling ghost of its breath on your neck. You get to your feet, slightly dazed, and [[make your way back->cook your meal]].",
      "links": [
        {
          "text": "make your way back",
          "destination": {
            "name": "cook your meal",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "Offer it some",
      "text": "(set: $wolves to it + 1)\nAfter a moment, the wolf grabs the strip of meat you offered it. It holds your gaze, then wanders off. You go home and [[cook your meal]].",
      "links": [
        {
          "text": "cook your meal",
          "destination": {
            "name": "cook your meal",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "Ignore it",
      "text": "The wolf watches you for a while, then wanders off. You head back and [[cook your meal]].",
      "links": [
        {
          "text": "cook your meal",
          "destination": {
            "name": "cook your meal",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "cook your meal",
      "text": "Back at the hut, you shovel mouthfuls of food into your mouth. It's a simple stew, but it might just be the most delicious meal you've ever eaten. Somehow, you feel ...\n\n[[Optimistic]].\n[[Lonely]].",
      "links": [
        {
          "text": "Optimistic",
          "destination": {
            "name": "Optimistic",
            "pid": 47
          }
        },
        {
          "text": "Lonely",
          "destination": {
            "name": "Lonely",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "Optimistic",
      "text": "(set: $savage to it +1)(set: $mood to \"defiant\")Another triumph over nature and the village elders. You're really starting to feel like you can do this. Life out here isn't so bad, really. It's not much worse than back home. Out here no-one makes fun of you for your appearance, at least.\n\nTime for [[bed->bed3]].",
      "links": [
        {
          "text": "bed",
          "destination": {
            "name": "bed3",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "Lonely",
      "text": "(set: $candescent to it + 1)(set: $mood to \"melancholy\")\nSure, you survived today. How many more? What's worse: dying young, or living out here until you're old and frail, without a single other person for company?\n\nYou shake your head. Enough of that. Time for [[bed->bed3]]",
      "links": [
        {
          "text": "bed",
          "destination": {
            "name": "bed3",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "bed3",
      "text": "You pull the covers over your head and tuck your knees up to your chest. Your aching eyelids fall shut almost instantly.\n\n(if: ($candescent >= $savage))[A dream of [[dark water]].]\n(else:)[A dream of [[red]].]",
      "links": [
        {
          "text": "dark water",
          "destination": {
            "name": "dark water",
            "pid": 57
          }
        },
        {
          "text": "red",
          "destination": {
            "name": "red",
            "pid": 50
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "red",
      "text": "The moon is shining red tonight, and there's blood on the wind. You are crouched in the dust, nose twitching. Everything is too bright, too loud. It's close. You flex your hand; your nails are long, thin, black.\n\nYou kick off the ground, slice through sinew with a single swipe, feel steaming-hot blood splatter on your face. Your tongue darts out. It tastes sweet.\n\n[[Wake->wake2]].",
      "links": [
        {
          "text": "Wake",
          "destination": {
            "name": "wake2",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "wake2",
      "text": "It takes a great deal of cajoling to force your aching eyelids open. Sleeping all day sounds remarkably pleasant, but the insistent grumble of your stomach finally forces you up. Blearily, you stretch and go [[outside->outside2]].",
      "links": [
        {
          "text": "outside",
          "destination": {
            "name": "outside2",
            "pid": 52
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "outside2",
      "text": "(if: $wolves > 0)[There are tracks outside your hut. Tracks, and a dead rabbit. There are teeth marks in what's left of its neck.(set: $cheevos's 1st to (1))]\n\n(if: $mood is \"defiant\")[The morning air stings the back of your throat. You inhale deeply, letting the cold clear your head. Every morning feels like a small victory. Maybe you should start keeping a little [[diary]].](else:)[The morning air stings the back of your throat. You inhale deeply, letting the cold clear your head. Another day stretches out before you. Perhaps you should start keeping a [[diary]], lest you lose track of the days.]",
      "links": [
        {
          "text": "diary",
          "destination": {
            "name": "diary",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "diary",
      "text": "You step back inside and regard your hut. The most obvious surface is the wide, flat wall that your bed is propped up against. You'll need some kind of writing implement, though.\n\n(if: $knife is true)[[[Carve->carveddiary]] it into the wood.]\nUse some [[charcoal]].",
      "links": [
        {
          "text": "Carve",
          "destination": {
            "name": "carveddiary",
            "pid": 54
          }
        },
        {
          "text": "charcoal",
          "destination": {
            "name": "charcoal",
            "pid": 55
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "carveddiary",
      "text": "(set: $implement to \"scratched letters\")\nOf course! You take out your trusty knife and kneel on your bed. It takes you a few tries, but it's sharp enough that you can write pretty neatly.\n\nHow will you start?\n[[\"To whoever finds this message...\"->findmessage]]\n[[Tally marks.]]",
      "links": [
        {
          "text": "\"To whoever finds this message...\"",
          "destination": {
            "name": "findmessage",
            "pid": 58
          }
        },
        {
          "text": "Tally marks.",
          "destination": {
            "name": "Tally marks.",
            "pid": 56
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "charcoal",
      "text": "(set: $implement to \"charcoal\")\nYou grab some charcoal from the firepit. It stains your finger black with soot as you turn it over.\n\nYou pick a flat piece of a wall and test out your pencil. It works remarkably well. Hopefully it won't wipe off. Alright, how will you do this?\n\n[[\"To whoever finds this message...\"->findmessage]]\n[[Tally marks.]]",
      "links": [
        {
          "text": "<set>",
          "destination": {
            "name": "charcoal",
            "pid": 55
          }
        },
        {
          "text": "\"To whoever finds this message...\"",
          "destination": {
            "name": "findmessage",
            "pid": 58
          }
        },
        {
          "text": "Tally marks.",
          "destination": {
            "name": "Tally marks.",
            "pid": 56
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "Tally marks.",
      "text": "(set: $savage to it + 1)\nYou make three short tally marks. There's a lot of space left around them. After a moment's consideration you scratch your name into the wood above them.\n\nYou step back and survey your handiwork. The wall reads:\nELLA NAMONE\n|||\nin $implement.\n\nYour eyes wander to the ground, and something odd catches your eye. Partially hidden by the covers, there are scratch marks in the wood. Frowning, you [[lean closer]].\n\n",
      "links": [
        {
          "text": "lean closer",
          "destination": {
            "name": "lean closer",
            "pid": 242
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "dark water",
      "text": "You are kneeling before a pool still as a mirror. Something gleams far below the surface. You reach down, down; the liquid clings to your skin. Your fingertips brush against something hot and pulsing --\n\n[[Wake->wake2]].",
      "links": [
        {
          "text": "Wake",
          "destination": {
            "name": "wake2",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "findmessage",
      "text": "(set: $candescent to it + 1)\n\"...//my name is Ella Namone. I am eighteen years old. The village elders sacrificed me to the forest because the crops were failing. That was two days ago. I intend to survive out here as long as I can.//\"\nYou step back and survey your handiwork. The wall has your first diary entry, written in $implement.\n\nYour eyes wander to the ground, and something odd catches your eye. Partially hidden by the covers, there are scratch marks in the wood. Frowning, you [[lean closer]].\n",
      "links": [
        {
          "text": "lean closer",
          "destination": {
            "name": "lean closer",
            "pid": 242
          }
        }
      ]
    },
    {
      "pid": 59,
      "name": "situation",
      "text": "You tug the bed from the wall, leaving the note completely uncovered. There's little point mourning those who came before you. All you can do for them now is survive. You choke down some of last night's leftovers, then stand up, stretch, and tie up your hair.\n\nYou've got work to do.\n\n[[CHAPTER ONE: END]]",
      "links": [
        {
          "text": "CHAPTER ONE: END",
          "destination": {
            "name": "CHAPTER ONE: END",
            "pid": 60
          }
        }
      ]
    },
    {
      "pid": 60,
      "name": "CHAPTER ONE: END",
      "text": "{(link:\"Save: Slot A\")[\n  (if:(save-game:\"Slot A\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n{(link:\"Save: Slot B\")[\n  (if:(save-game:\"Slot B\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n\n[[CHAPTER TWO]]",
      "links": [
        {
          "text": "CHAPTER TWO",
          "destination": {
            "name": "CHAPTER TWO",
            "pid": 61
          }
        }
      ]
    },
    {
      "pid": 61,
      "name": "CHAPTER TWO",
      "text": "Another morning. You yawn and roll your shoulders, feeling the joints pop. At least you didn't dream last night.\n\n[[Check your wall]].",
      "links": [
        {
          "text": "Check your wall",
          "destination": {
            "name": "Check your wall",
            "pid": 62
          }
        }
      ]
    },
    {
      "pid": 62,
      "name": "Check your wall",
      "text": "(if: (history:) contains (\"findmessage\"))[You've had to get concise with your diary entries. After all, it's almost been a month. Yesterday's just says 'I continue to be alive.']\n(else-if: (history:) contains (\"Tally marks.\"))[You count out the tally marks, even though you already know how many there are. Twenty nine. You'll add another one tonight before you sleep. It's your reward for making it through another day.]\n\nA month, already? It seems unbelievable, but here you are. This place is starting to feel like home. Last week you even started decorating. Just a couple of personal touches, of course.\n\n[[A little garden out the front]].\n[[Charms made of strings and feathers]].\n[[Some artfully placed bones]].\n",
      "links": [
        {
          "text": "A little garden out the front",
          "destination": {
            "name": "A little garden out the front",
            "pid": 63
          }
        },
        {
          "text": "Charms made of strings and feathers",
          "destination": {
            "name": "Charms made of strings and feathers",
            "pid": 64
          }
        },
        {
          "text": "Some artfully placed bones",
          "destination": {
            "name": "Some artfully placed bones",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 63,
      "name": "A little garden out the front",
      "text": "It's not much, but you've cobbled together two little patches of snowdrops to frame your doorway. There's a pathos in the delicate, white blooms braving the winter chill. You'll miss them when the weather warms. (set: $deco to \"flowers\")\n\n[[Next]].",
      "links": [
        {
          "text": "Next",
          "destination": {
            "name": "Next",
            "pid": 66
          }
        }
      ]
    },
    {
      "pid": 64,
      "name": "Charms made of strings and feathers",
      "text": "(set: $candescent to it + 1)\nYour hands are not as skilled as your mother's, but you remembered the way they weaved dried grass. This one for protection, strung over a doorway. This one for luck in the hunt, worn around the wrist. This one to ward off bad dreams, tucked under a pillow. You haven't had much success with the last one, but making them is relaxing. (set: $deco to \"charms\")\n\n[[Next]].",
      "links": [
        {
          "text": "Next",
          "destination": {
            "name": "Next",
            "pid": 66
          }
        }
      ]
    },
    {
      "pid": 65,
      "name": "Some artfully placed bones",
      "text": "(set: $savage to it + 1)\nYou figured out pretty quickly that if you leave out the remains of your hunt for a few days, they'll be stripped clean. Ribs form a crude fence around your hut. Two skulls stare from either side of your front door. You've even strung up a crude windchime of rabbit bones. It's a little macabre, but then, these days you're a macabre sort of person. (set: $deco to \"bones\")\n\n[[Next]].",
      "links": [
        {
          "text": "Next",
          "destination": {
            "name": "Next",
            "pid": 66
          }
        }
      ]
    },
    {
      "pid": 66,
      "name": "Next",
      "text": "You're nearly out of food again. The area around your hunt is growing barren; you'll need to venture out a bit further.\n\n(if: $knife is true)[You grab your trusty knife and slip it into your belt. (set: $weapon to (\"knife\"))]\n(else:)[You grab your makeshift spear - a sharpened piece of rock bound to a sturdy stick.(set: $weapon to (\"spear\"))]\n\n[[Off we go, then]].",
      "links": [
        {
          "text": "Off we go, then",
          "destination": {
            "name": "Off we go, then",
            "pid": 67
          }
        }
      ]
    },
    {
      "pid": 67,
      "name": "Off we go, then",
      "text": "You're getting pretty good at navigating the forest now. This is the furthest out you've gone since you first arrived.\n\nA rabbit goes bounding past you, too fast to catch. You're about to grumble when you hear something [[ahead of you]].",
      "links": [
        {
          "text": "ahead of you",
          "destination": {
            "name": "ahead of you",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 68,
      "name": "ahead of you",
      "text": "Voices. You know those voices. They're hunters from your village. You've strayed too close.\n\n[[Hide and observe]].\n[[Approach]].\n(if: $savage >= 4)[{}[[Attack]].]\n",
      "links": [
        {
          "text": "Hide and observe",
          "destination": {
            "name": "Hide and observe",
            "pid": 69
          }
        },
        {
          "text": "Approach",
          "destination": {
            "name": "Approach",
            "pid": 70
          }
        },
        {
          "text": "Attack",
          "destination": {
            "name": "Attack",
            "pid": 72
          }
        }
      ]
    },
    {
      "pid": 69,
      "name": "Hide and observe",
      "text": "(if: $candescent > 3)[You slip behind a tree, nestled into a crack in its trunk.\n\n\".... I can //feel// it, I swear.\"\n\n\"You've never felt shit before. You know how many kids died out here? Hundreds. If there were gonna be ghosts here, we'd've seen one already.\"\n\n\"Yeah, but that was ages ago. This was recent. And you know how creepy she was. She was practically one already.\"\n\nThe second hunter stops to glare at his comrade. They're thoroughly distracted.\n\n[[Approach]].\n[[Leave]].]\n(else:)[You slip behind a tree, nestled into a crack in its trunk.\n\n\".... I can //feel// it, I swear.\"\n\n\"You've never felt shit before. You know how many kids died out here? Hundreds. If there were gonna be ghosts here, we'd've ... seen ...\" He trails off. You realise, too late, he's staring straight at you.\n\nThe first hunter takes a step back, visibly trembling. He starts to stutter something, but you don't get a chance to hear it before his comrade charges forward and [[takes a swing at you->combat]].]",
      "links": [
        {
          "text": "Approach",
          "destination": {
            "name": "Approach",
            "pid": 70
          }
        },
        {
          "text": "Leave",
          "destination": {
            "name": "Leave",
            "pid": 82
          }
        },
        {
          "text": "takes a swing at you",
          "destination": {
            "name": "combat",
            "pid": 71
          }
        }
      ]
    },
    {
      "pid": 70,
      "name": "Approach",
      "text": "You step out into the open, hands half-raised in a gesture of peace. It takes them a moment to realise you're there.\n\n\"Uh,\" one of them says. His jaw hangs slack.\n\n\"You,\" the other snarls, and [[reaches for the knife on his belt.->combat]].",
      "links": [
        {
          "text": "reaches for the knife on his belt.",
          "destination": {
            "name": "combat",
            "pid": 71
          }
        }
      ]
    },
    {
      "pid": 71,
      "name": "combat",
      "text": "Instinctively you half-crouch, feeling the adrenalin surge through you. You have a split second as the hunter charges towards you to make your decision. \n\n[[Fight back]].\n[[Flee]].",
      "links": [
        {
          "text": "Fight back",
          "destination": {
            "name": "Fight back",
            "pid": 80
          }
        },
        {
          "text": "Flee",
          "destination": {
            "name": "Flee",
            "pid": 81
          }
        }
      ]
    },
    {
      "pid": 72,
      "name": "Attack",
      "text": "Without warning, you lunge forward and drive your $weapon into the closer one's back. You feel something puncture as he gives a strangled scream. The other hunter tries to nock an arrow, but his hands are shaking and you're already darting forward. His nose flattens under your fist with a sickening //crunch//. The sight of his blood splattered on your pale skin makes your heart race. \n\nWhile he's shocked you grab his still-sheathed blade. It's beautifully heavy. You admire the sharpness of it as you line it up between his ribs. Then you're raising your arms up high, and with all your strength --\n\n[[It's done]].",
      "links": [
        {
          "text": "It's done",
          "destination": {
            "name": "It's done",
            "pid": 73
          }
        }
      ]
    },
    {
      "pid": 73,
      "name": "It's done",
      "text": "Your ragged breathing fills the air. The hot blood on your hands begins to cool. The hunter stares at you, eyes dull.\n\nYou have to do something with them. Right?\n(if: $wolves >= 2)[{}[[Howl]].]\n(if: $savage >= 5)[{}[[Carve up the meat]].]\n(if: $candescent > 3)[{}[[Make it look like an accident]].]\n[[Leave a message]].\n[[Just go]].",
      "links": [
        {
          "text": "Howl",
          "destination": {
            "name": "Howl",
            "pid": 75
          }
        },
        {
          "text": "Carve up the meat",
          "destination": {
            "name": "Carve up the meat",
            "pid": 92
          }
        },
        {
          "text": "Make it look like an accident",
          "destination": {
            "name": "Make it look like an accident",
            "pid": 84
          }
        },
        {
          "text": "Leave a message",
          "destination": {
            "name": "Leave a message",
            "pid": 74
          }
        },
        {
          "text": "Just go",
          "destination": {
            "name": "Just go",
            "pid": 76
          }
        }
      ]
    },
    {
      "pid": 74,
      "name": "Leave a message",
      "text": "What kind of message?\n\nA [[warning]].\nA [[plea]].\n(if: $chaotic > 0)[A [[star with eight points]].]",
      "links": [
        {
          "text": "warning",
          "destination": {
            "name": "warning",
            "pid": 77
          }
        },
        {
          "text": "plea",
          "destination": {
            "name": "plea",
            "pid": 78
          }
        },
        {
          "text": "star with eight points",
          "destination": {
            "name": "star with eight points",
            "pid": 79
          }
        }
      ]
    },
    {
      "pid": 75,
      "name": "Howl",
      "text": "You breath in until you feel your muscles strain against your ribs, then lift your chin and howl. Your voice tears through the silent air. \n\nA moment passes. Two. Then there is an answering call. Without thinking you join in, and soon there is a chorus. Your head swims. Your chest burns with a feeling you cannot name.\n\nA shewolf slinks towards you, sniffing the air. You take a step back, your movements measured and slow. Others approach cautiously, then eagerly as they realise you're sharing your hunt. The sound of ripping flesh overwhelms you. You cannot look away.\n\nSomething cold and wet brushes your arm. Startled, you pull away (if: (history:) contains \"remains\")[ At your side stands the greatwolf. Does he remember you from before? He looks up at you briefly, then returns to observing his pack.](else:)[ At your side stands a greatwolf, white fur stark against the dark of the forest. It -- he? -- looks up at you briefly, then returns to observing his pack.]\n\n[[Watch quietly]].\n[[Pet him]].",
      "links": [
        {
          "text": "Watch quietly",
          "destination": {
            "name": "Watch quietly",
            "pid": 94
          }
        },
        {
          "text": "Pet him",
          "destination": {
            "name": "Pet him",
            "pid": 95
          }
        }
      ]
    },
    {
      "pid": 76,
      "name": "Just go",
      "text": "You leave the bodies where they lie.\n\n[[There's nothing more for you here->Back to the hut]].",
      "links": [
        {
          "text": "There's nothing more for you here",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 77,
      "name": "warning",
      "text": "(set: $mood to \"defiant\")(set: $savage to it + 1)\n//This is my territory now. Don't come back.//\n\nYou stand, wiping a smear of blood from your chin.\n\n[[There's nothing more for you here->Back to the hut]].",
      "links": [
        {
          "text": "There's nothing more for you here",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 78,
      "name": "plea",
      "text": "(set: $mood to \"melancholy\")//Please. I don't want to hurt anyone. Please don't come here anymore.//\n\nYou brush tears from your eyes, then stand up.\n\n[[There's nothing more for you here->Back to the hut]].",
      "links": [
        {
          "text": "There's nothing more for you here",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 79,
      "name": "star with eight points",
      "text": "(set: $chaotic to it + 1)Do you know why you're doing this? One line down the middle, from collarbone to navel. \n\nDoes it matter? Another line, a slash straight across the middle. \n\nIs this a message for the village? Upper left to lower right.\n\nOr for someone else? Lower left, upper right. Blood oozes, half-congealed, from the cuts. Your hands are trembling. Your blood hums.\n\n[[It's time to go->Back to the hut]].",
      "links": [
        {
          "text": "It's time to go",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 80,
      "name": "Fight back",
      "text": "(if: ($savage >= 2))[Without warning, you lunge forward and drive your $weapon into the second hunter's stomach. You feel something puncture as he gives a strangled scream. \n\nThe other is still staring, mouth forming noiseless words. Too late he reaches for the bow on his back. You leave your $weapon buried in flesh and launch towards him. His nose flattens under your fist with a sickening //crunch//. The sight of his blood splattered on your pale skin makes your heart race. \n\nWhile he's shocked you grab his still-sheathed blade. It's beautifully heavy. You admire the sharpness of it as you line it up between his ribs. Then you're raising your arms up high, and with all your strength --\n\n[[It's done]].]\n(else:)[{}Without warning, you lunge forward and drive your $weapon into the second hunter's stomach. You feel something puncture as he gives a strangled scream. He slips backwards. For a moment, the two of you hang in midair.\n\nThen there is a hand in your hair and a knee in your gut. You screech, flailing wildly, grabbing for the handle of your $weapon, but he pins you down. His eyes are focused, his mouth a grim line. He raises his hand, high in the air, and brings it down --\n\n[[There is a single, sickening crunch, and then, nothing.->Your consciousness fades]]]",
      "links": [
        {
          "text": "It's done",
          "destination": {
            "name": "It's done",
            "pid": 73
          }
        },
        {
          "text": "There is a single, sickening crunch, and then, nothing.",
          "destination": {
            "name": "Your consciousness fades",
            "pid": 93
          }
        }
      ]
    },
    {
      "pid": 81,
      "name": "Flee",
      "text": "(if: $candescent >= 3)[You throw all your weight to one side, launching yourself into a run. There's a shout behind you. \"//Kill// her!\"\n\nYou hop from tree-root to stone, avoiding the soft dirt. Looping back, you hear them go thundering past you.\n\n\"Shit -- if we let her live --\"\n\n\"-- wolves'll get her, c'mon, we gotta --\"\n\n\"-- it's bad luck!\"\n\n\"No-one has to know, alright? Let's just get back already.\"\n\nFinally, finally, they leave. With shaky breaths you find your way [[back home->Back to the hut]].]\n(else:)[You throw all your weight to one side, launching yourself into a run. There's a shout behind you. \"//Kill// her!\"\n\nYou hop from tree-root to stone, avoiding the soft dirt. Looping back, you hear them go thundering past you. They're shouting something, but whatever it is you can't make it out.\n\nFinally, finally, they leave. With shaky breaths you find your way [[back home->Back to the hut]].]",
      "links": [
        {
          "text": "back home",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 82,
      "name": "Leave",
      "text": "You leave them to their bickering, and slip back towards the hut.\n\n[[They'll never know you were there->Back to the hut]].",
      "links": [
        {
          "text": "They'll never know you were there",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 83,
      "name": "Back to the hut",
      "text": "You collapse next to the firepit, muscles aching. It's been two months since you've seen another human. If there was any doubt that you were unwanted, it's long gone. \n\nGod, but you're tired. Somehow you force yourself to eat a few mouthfuls of dinner, before you (if: (history:) contains \"star with eight points\")[[[pass out->voice in the depths]].](else-if: (history:) contains \"Howl\")[[[pass out->grassy field]].](else-if: (history:) contains \"It's done\")[[[pass out->home]].](else-if: (history:) contains \"Flee\" or it contains \"Leave\")[[[pass out->feast]].]",
      "links": [
        {
          "text": "pass out",
          "destination": {
            "name": "voice in the depths",
            "pid": 96
          }
        },
        {
          "text": "pass out",
          "destination": {
            "name": "grassy field",
            "pid": 99
          }
        },
        {
          "text": "pass out",
          "destination": {
            "name": "home",
            "pid": 97
          }
        },
        {
          "text": "pass out",
          "destination": {
            "name": "feast",
            "pid": 98
          }
        }
      ]
    },
    {
      "pid": 84,
      "name": "Make it look like an accident",
      "text": "You carefully arrange and stab at the bodies until their wounds look like bite-marks. They'll never know you were here.\n\n[[You'd better get back->Back to the hut]].",
      "links": [
        {
          "text": "You'd better get back",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 85,
      "name": "Startup Debugger",
      "text": "TEST: How savage are you?\n[Real savage]<c1|\n[Kinda savage]<c2|\n[Not savage at all]<c3|\n\n(click: ?c1)[(set: $savage to 6)<br>Your Savage is $savage.]\\\n\\(click: ?c2)[(set: $savage to 3)<br>Your Savage is $savage.]\\\n\\(click: ?c3)[(set: $savage to 0)<br>Your Savage is $savage.]\n\nTEST: How smart are you?\n[Real smart]<c4|\n[Kinda smart]<c5|\n[Not smart at all]<c6|\n\n(click: ?c4)[(set: $candescent to 6)<br>Your Candescent is $candescent.]\\\n\\(click: ?c5)[(set: $candescent to 3)<br>Your Candescent is $candescent]\\\n\\(click: ?c6)[(set: $candescent to 0)<br>Your Candescent is $candescent.]\n\nHow 'bout the wolves and the demons?\n[Wolves like me.]<c7|\n[Demons like me.]<c8|\n(click: ?c7)[(set: $wolves to 5)]\n(click: ?c8)[(set: $chaotic to 5)]\n\nHow many endings have you got?\n[0]<c9|\n[1]<c10|\n[4]<c11|\n[6, baby!]<c12|\n{(click: ?c9)[Aww.]\n(click: ?c10)[(set: ($endings's 1st to 1))]\n(click: ?c11)[(set: ($endings's 1st to 1))(set: ($endings's 2nd to 1))(set: ($endings's 3rd to 1))(set: ($endings's 4th to 1))]\n(click: ?c12)[(set: ($endings's 1st to 1))(set: ($endings's 2nd to 1))(set: ($endings's 3rd to (a:1)))(set: ($endings's 4th to 1))(set: ($endings's 5th to 1))(set: ($endings's 6th to 1))]}\nAchievements?\n[1]<c13|[2]<c14|[3]<c15|[4]<c16|[5]<c17|\n{(click: ?c13)[(set: $cheevos's 1st to (1))](click: ?c14)[(set: $cheevos's 2nd to 1)](click: ?c15)[(set: $cheevos's 3rd to 1)](click: ?c16)[(set: $cheevos's 4th to 1)](click: ?c17)[(set: $cheevos's 5th to 1)]}",
      "links": []
    },
    {
      "pid": 86,
      "name": "Footer",
      "text": "<br>\n\n<menu><menuholder1>[[Main Menu]]</menuholder1><menuholder>[[Save]]</menuholder><menuholder>[[Achievements]]</menuholder><menuholder>[[Credits]]</menuholder></menu>{\n\n<!-- I'll figure out the CSS to this...later.-->}",
      "links": [
        {
          "text": "Main Menu",
          "destination": {
            "name": "Main Menu",
            "pid": 88
          }
        },
        {
          "text": "Save",
          "destination": {
            "name": "Save",
            "pid": 123
          }
        },
        {
          "text": "Achievements",
          "destination": {
            "name": "Achievements",
            "pid": 87
          }
        },
        {
          "text": "Credits",
          "destination": {
            "name": "Credits",
            "pid": 122
          }
        }
      ]
    },
    {
      "pid": 87,
      "name": "Achievements",
      "text": "{(set: $cheevonumber to (count: ($cheevos), 1))(set: $endingcounter to (count: ($endings), 1))}\n\nYou've found $endingcounter of 3 endings.\nYou've found $cheevonumber of 5 achievements.<br>\n{(if: ($cheevos's 1st is 1))[(link-reveal: \"Achievement 1\")[ You did a thing!]](else:)[<del>Achievement 1</del>]<br>\\\n\\(if: ($cheevos's 2nd is 1))[(link-reveal: \"Tooth and Claw\")[ - You overpowered the hunters.]](else:)[<del>Tooth and Claw</del>]<br>\\\n\\(if: ($cheevos's 3rd is 1))[(link-reveal: \"Candle-bright\")[ - You outsmarted the hunters.]](else:)[<del>Candle-bright</del>]<br>\\\n\\(if: ($cheevos's 4th is 1))[(link-reveal: \"Devotee\")[ - You performed the ritual and summoned a demon.]](else:)[<del>Devotee</del>]<br>\\\n\\(if: ($cheevos's 5th is 1))[(link-reveal: \"A Singular Hunger\")[ - You didn't let good meat go to waste.]](else:)[<del>A Singular Hunger</del>]}\n(unless: $lastPassage is 0)[(link-goto: \"Return\", $lastPassage)]",
      "links": []
    },
    {
      "pid": 88,
      "name": "Main Menu",
      "text": "<img class=\"image\" src=\"ellafinal.png\"/></div>\n\n<mainmenu><mainmenuholder>[[New Game->Starting Out]]</mainmenuholder><mainmenuholder>[[Load]]</mainmenuholder><mainmenuholder>[[How to Play->Tips]]</mainmenuholder></mainmenu>",
      "links": [
        {
          "text": "New Game",
          "destination": {
            "name": "Starting Out",
            "pid": 1
          }
        },
        {
          "text": "Load",
          "destination": {
            "name": "Load",
            "pid": 89
          }
        },
        {
          "text": "How to Play",
          "destination": {
            "name": "Tips",
            "pid": 145
          }
        }
      ]
    },
    {
      "pid": 89,
      "name": "Load",
      "text": "(unless: $lastPassage is 0)[(link-goto: \"Autosave\", $lastPassage)]\n{(if: (saved-games:) contains \"Slot A\")[\n  (link: \"Load Slot A\")[(load-game:\"Slot A\")]\n](else:)[Slot A is empty.]}\n{(if: (saved-games:) contains \"Slot B\")[\n  (link: \"Load Slot B\")[(load-game:\"Slot B\")]\n]\n(else:)[Slot B is empty.]}\n\n(unless: $lastPassage is 0)[(link-goto: \"Return\", $lastPassage)]",
      "links": []
    },
    {
      "pid": 90,
      "name": "Last Passage Tracker",
      "text": "(if: not ((passage:)'s tags contains \"menu\"))[(set: $lastPassage to (passage:)'s name)]\n",
      "links": []
    },
    {
      "pid": 91,
      "name": "Startup",
      "text": "{(set: $endings to (a:))(set: $cheevos to (a:))}",
      "links": []
    },
    {
      "pid": 92,
      "name": "Carve up the meat",
      "text": "(set: $cheevos's 5th to 1)Your father taught you how to dress rabbits when you were little. One long cut from one end to the other. When the skin splits the meat looks the same. Your hands move quickly. The ribs splinter easily, too easily, under your palms. Here's the heart -- just a hunk of muscle. It hits the dirt with a wet thud.\n\nYou bundle up your steaks in a ragged shirt and leave the carcasses where they fell. Between them sits a pile of still-steaming entrails. No use to you, now. (if: (history:) contains \"Some artfully placed bones\")[But you do take one loose rib in hand. There's an empty space in your fence.]\n\nSpoils in hand, you head [[back to the hut->Back to the hut]].",
      "links": [
        {
          "text": "back to the hut",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 93,
      "name": "Your consciousness fades",
      "text": "ENDING 3 -- A LONELY DEATH (set: $endings's 3rd to 1)\n\n[[Start again?->Starting Out]]",
      "links": [
        {
          "text": "Start again?",
          "destination": {
            "name": "Starting Out",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 94,
      "name": "Watch quietly",
      "text": "The two of you stand in silence until the feast is done. (set: $wolves to it + 1) (set: $candescent to it + 1)Then, the greatwolf whines loudly and leads his pack away.\n\n[[You'd better get back, too->Back to the hut]].",
      "links": [
        {
          "text": "You'd better get back, too",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 95,
      "name": "Pet him",
      "text": "You pet the wolf. He seems surprised, but then leans into your touch. (set: $wolves to it + 2)\n\nWhen the feast is done, the greatwolf whines loudly and leads his pack away.\n\n[[You'd better get back, too->Back to the hut]].",
      "links": [
        {
          "text": "You'd better get back, too",
          "destination": {
            "name": "Back to the hut",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 96,
      "name": "voice in the depths",
      "text": "You kneel at the edge of a glass-still pool. It is impossibly deep, and impossibly clear. As you stretch one hand towards the surface it swells, extends, shapes itself into a hand. Palm outstretched -- an invite.\n\n//You're so close//, a voice murmurs. It echoes through your brain. //Just a little further, child. Can you do it?//\n\nYour fingers twitch. You lean forward.\n\n[[Wake->wake3]].",
      "links": [
        {
          "text": "Wake",
          "destination": {
            "name": "wake3",
            "pid": 100
          }
        }
      ]
    },
    {
      "pid": 97,
      "name": "home",
      "text": "The village is bathed in the golden glow of sunset. Grass crunches under your feet. A bead of sweat slinks down your neck. You smell charcoal, cooked meat, sweet spices. Through the heat-haze, you see the crowd, and beyond them, flames licking at the air.\n\nYou try to step forward, but your feet are rooted to the ground. One villager turns. He stares at you, eyes empty. Blood drips from the gash in his neck. One by one they all turn to you. You cannot see their faces, only their dark, empty eyes.\n\nThe hunter raises his hand. You raise your blade.\n\n[[Wake->wake3]].",
      "links": [
        {
          "text": "Wake",
          "destination": {
            "name": "wake3",
            "pid": 100
          }
        }
      ]
    },
    {
      "pid": 98,
      "name": "feast",
      "text": "The village is bathed in the golden glow of sunset. Grass crunches under your feet. A bead of sweat slinks down your neck. You smell charcoal, cooked meat, sweet spices. Through the heat-haze, you see the crowd, and beyond them, flames licking at the air.\n\nYou slip past them like a breath of air. A pot, waist-height, bubbles over the fire. One by one, people are adding to it. Chunks of raw meat. Shrivelled vegetables. Handfuls of herbs, soil still clinging to the roots.\n\nYou look down at your cupped hands, overflowing with shiny black berries. They hiss and pop as you tip them into the broth. You reach into your pocket. More berries. You tip them into the broth. It's turning black now. One more handful. \n\nWith a dull thud someone collapses. Your hands are turning black with juice. The roar of the fire masks the sound of screaming. One more handful.\n\n[[Wake->wake3]].",
      "links": [
        {
          "text": "Wake",
          "destination": {
            "name": "wake3",
            "pid": 100
          }
        }
      ]
    },
    {
      "pid": 99,
      "name": "grassy field",
      "text": "The warmth of the sun beats down upon you, but something soft and cool surrounds you. It brushes against your side, shifts beneath your head, twines around your legs. Your fingertips slide through it, like stroking the fur of some great beast. The scent of fresh dew fills the air.\n\nSomething shifts beside you. Your eyelids flutter open, enough to see a mound of white fur. Its ears prick; it raises its head and looks straight at you. There's a weariness in its eyes. When you lay your hand against its neck it relaxes into your touch.\n\nYou begin to hum an old lullaby. Soon the beast's breathing evens out. Yours does, too. Surely you can rest here, just for a little while.\n\n[[Wake->wake3]].",
      "links": [
        {
          "text": "Wake",
          "destination": {
            "name": "wake3",
            "pid": 100
          }
        }
      ]
    },
    {
      "pid": 100,
      "name": "wake3",
      "text": "It's still dark out. Your heart is pounding. It sounds like something's moving around outside.\n\n[[Go investigate]].\n[[Go back to sleep]].",
      "links": [
        {
          "text": "Go investigate",
          "destination": {
            "name": "Go investigate",
            "pid": 101
          }
        },
        {
          "text": "Go back to sleep",
          "destination": {
            "name": "Go back to sleep",
            "pid": 102
          }
        }
      ]
    },
    {
      "pid": 101,
      "name": "Go investigate",
      "text": "You get to your feet and cautiously approach the door. Had you left it unlatched? It creaks as you push it open, just enough to peer outside.\n\nA heavy fog has crept through the trees. It's pure white, and so thick you imagine you could float on it. Every so often it surges forward, stopping at the line formed by your $deco. You watch, clinging to the door, as two pinpricks of red light shine from within.\n\nYou wake on the ground, head resting against the still-open door. Heart thumping, you lean out. Did you dream it? ...Have some of your $deco moved?\n\n[[CHAPTER TWO: END]]",
      "links": [
        {
          "text": "CHAPTER TWO: END",
          "destination": {
            "name": "CHAPTER TWO: END",
            "pid": 104
          }
        }
      ]
    },
    {
      "pid": 102,
      "name": "Go back to sleep",
      "text": "You firmly grab the edge of the blanket and yank it up over your head. It's probably just the wind.\n\n[[CHAPTER TWO: END]]",
      "links": [
        {
          "text": "CHAPTER TWO: END",
          "destination": {
            "name": "CHAPTER TWO: END",
            "pid": 104
          }
        }
      ]
    },
    {
      "pid": 103,
      "name": "CHAPTER THREE",
      "text": "You wake groggily. Another bad night's sleep. This one was unusually bad, though.\n\n[[Check your wall->checkwall2]].",
      "links": [
        {
          "text": "Check your wall",
          "destination": {
            "name": "checkwall2",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 104,
      "name": "CHAPTER TWO: END",
      "text": "{(link:\"Save: Slot A\")[\n  (if:(save-game:\"Slot A\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n{(link:\"Save: Slot B\")[\n  (if:(save-game:\"Slot B\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n\n\n[[CHAPTER THREE]]",
      "links": [
        {
          "text": "CHAPTER THREE",
          "destination": {
            "name": "CHAPTER THREE",
            "pid": 103
          }
        }
      ]
    },
    {
      "pid": 105,
      "name": "checkwall2",
      "text": "(if: (history:) contains (\"findmessage\"))[You run your eyes over the full contents of your diary. Without it, you think you'd barely notice the passage of time. Yesterday's entry notes that you're coming up on the end of your second month.]{\n}(else-if: (history:) contains (\"Tally marks.\"))[You're coming up on 60 marks now. Sometimes you feel like you should make milestones. Maybe at 100 you'll try making something that isn't rabbit stew for dinner.]\n\nYou get to your feet with a groan and try not to think about occupying yourself for another day.\n\n[[Go outside]].",
      "links": [
        {
          "text": "Go outside",
          "destination": {
            "name": "Go outside",
            "pid": 106
          }
        }
      ]
    },
    {
      "pid": 106,
      "name": "Go outside",
      "text": "For a moment you stand stock-still in the doorway, trying to process what you're seeing. Your $deco are strewn around the clearing along with broken branches and other detritus. One of the trees has cracked down the middle. The wood is blackened around the split. Lightning? No wonder you slept so poorly.\n\nYou'd better go check out the [[rest of the damage]].",
      "links": [
        {
          "text": "rest of the damage",
          "destination": {
            "name": "rest of the damage",
            "pid": 107
          }
        }
      ]
    },
    {
      "pid": 107,
      "name": "rest of the damage",
      "text": "You don't get far before the dirt turns to mud beneath your feet.  You skirt the edges, using stumps like stepping-stones. Though the flood is already starting to recede, the water has turned a muddy brown.\n\nAs you're looking around, something catches your eye. Half-buried in the mud, there's something [[smooth and white]].",
      "links": [
        {
          "text": "smooth and white",
          "destination": {
            "name": "smooth and white",
            "pid": 108
          }
        }
      ]
    },
    {
      "pid": 108,
      "name": "smooth and white",
      "text": "Your stomach turns as you slide off the stump and pick your way over to the thing. You brush away a little of the mud and suck in a breath. It is unmistakably a human skull.\n\n[[Drop it]].\n[[Uncover it]].",
      "links": [
        {
          "text": "Drop it",
          "destination": {
            "name": "Drop it",
            "pid": 109
          }
        },
        {
          "text": "Uncover it",
          "destination": {
            "name": "Uncover it",
            "pid": 110
          }
        }
      ]
    },
    {
      "pid": 109,
      "name": "Drop it",
      "text": "You shriek and pull your hand back. Where were these before? Buried in the river, perhaps, and dislodged by the storm. What an awful ending. You shudder, uncomfortably aware of your own bones.\n\nWith a heavy heart, you look up and along the bank. Sure enough, there are [[spots of white->restofhim]] trailing into the distance.",
      "links": [
        {
          "text": "spots of white",
          "destination": {
            "name": "restofhim",
            "pid": 111
          }
        }
      ]
    },
    {
      "pid": 110,
      "name": "Uncover it",
      "text": "With a few handfuls of water you wash away the surrounding mud. Gingerly you retrieve your prize. You can't tell much, only that it's a large skull. Bigger than yours, you think. A man's, maybe? It's relatively intact.\n\nYou can't figure out much from the skull alone. The rest of him has to be around here somewhere. When you look up, you immediately spot [[other bones->restofhim]] surfacing from the mud. First, though, you put the skull down safely on a stump.",
      "links": [
        {
          "text": "other bones",
          "destination": {
            "name": "restofhim",
            "pid": 111
          }
        }
      ]
    },
    {
      "pid": 111,
      "name": "restofhim",
      "text": "Here's half a rib-cage, still attached. Here's a few knucklebones. Over here, a femur juts out of the ground. You stop inspecting each one; there are just too many. Instead you just follow them along the river.\n\nWhen you reach the last one, you look up. You're in an unfamiliar part of the forest. The dirt here is lighter, the trees more sparse. [One in particular]<weirdtree| looks like it's been struck by lightning. There's also a [[clearing->wolfclearing]] on the other side of the river.\n{\n(click: ?weirdtree)[On closer examination, it looks like someone has hit the tree with an axe over and over. Trying to figure out the pattern, you run your fingers over the marks. The hairs on your neck stand on end.\n\n(if: $chaotic > 0)[Haven't you seen this symbol [[someplace before]]?](else:)[Frustrated, you step back.]]}",
      "links": [
        {
          "text": "clearing",
          "destination": {
            "name": "wolfclearing",
            "pid": 113
          }
        },
        {
          "text": "someplace before",
          "destination": {
            "name": "someplace before",
            "pid": 112
          }
        }
      ]
    },
    {
      "pid": 112,
      "name": "someplace before",
      "text": "(set: $chaotic to it + 1)Here it is again -- the star with eight points. How did it get here? And what does it mean?\n\n{(if: $chaotic >= 4)[Your mind whirrs. Carvings. It's all about carvings. The hut, this tree, the hunter ... The stone. Who carved the stone?\n\n[[Go to the stone]].](else:)[You shake your head, squeezing your eyes tightly shut. Whatever it is, you can figure it out later.]}\n\n[[Back to the clearing->wolfclearing]].",
      "links": [
        {
          "text": "Go to the stone",
          "destination": {
            "name": "Go to the stone",
            "pid": 114
          }
        },
        {
          "text": "Back to the clearing",
          "destination": {
            "name": "wolfclearing",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 113,
      "name": "wolfclearing",
      "text": "There's a cave -- no, a den. As you peer inside, you see about seven wolves, all curled up asleep. (if: (history:) contains \"Howl\" or it contains \"remains\")[The greatwolf stretches out near the entrance, a barrier of white fur.](else:)[A huge wolf stretches out near the entrance, a barrier of white fur.] Suddenly his ears prick and he lifts his head.\n\n[[Stay where you are]].\n[[Take a step back]].",
      "links": [
        {
          "text": "Stay where you are",
          "destination": {
            "name": "Stay where you are",
            "pid": 115
          }
        },
        {
          "text": "Take a step back",
          "destination": {
            "name": "Take a step back",
            "pid": 116
          }
        }
      ]
    },
    {
      "pid": 114,
      "name": "Go to the stone",
      "text": "Your heart beats erratically. Nothing has changed since you were last here. You spread your palm over the symbol. This is the place. Something has guided you here; for what, you don't know. What will you do?\n\n[[Carve->carve2]].\n[[Turn back->wolfclearing]].",
      "links": [
        {
          "text": "Carve",
          "destination": {
            "name": "carve2",
            "pid": 128
          }
        },
        {
          "text": "Turn back",
          "destination": {
            "name": "wolfclearing",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 115,
      "name": "Stay where you are",
      "text": "(set: $savage to it + 1)The wolf regards you (if: $wolves >=3)[with interest](else:)[cautiously]. After a few moments he rolls over, leaving enough room for you to enter the cave.\n\n[[Go in]].\n[[Wait]].",
      "links": [
        {
          "text": "Go in",
          "destination": {
            "name": "Go in",
            "pid": 117
          }
        },
        {
          "text": "Wait",
          "destination": {
            "name": "Wait",
            "pid": 118
          }
        }
      ]
    },
    {
      "pid": 116,
      "name": "Take a step back",
      "text": "(set: $candescent to it + 1)The wolf tilts its head and regards you (if: $wolves >=3)[with interest](else:)[cautiously]. After a few moments he rolls over, leaving enough room for you to enter the cave. You cautiously move closer. He doesn't move.\n\n[[Go in]].\n[[Wait]].",
      "links": [
        {
          "text": "Go in",
          "destination": {
            "name": "Go in",
            "pid": 117
          }
        },
        {
          "text": "Wait",
          "destination": {
            "name": "Wait",
            "pid": 118
          }
        }
      ]
    },
    {
      "pid": 117,
      "name": "Go in",
      "text": "You have to stoop slightly at the entrance, but once inside you're able to stand. The other wolves haven't stirred, but the greatwolf still has his eyes open.\n\n[[Take a look around]].\n[[Make conversation]].",
      "links": [
        {
          "text": "Take a look around",
          "destination": {
            "name": "Take a look around",
            "pid": 119
          }
        },
        {
          "text": "Make conversation",
          "destination": {
            "name": "Make conversation",
            "pid": 120
          }
        }
      ]
    },
    {
      "pid": 118,
      "name": "Wait",
      "text": "After a few minutes, the greatwolf raises its head again and fixes you with a stare. It moves its head in a way that looks like a gesture to come in. Only when you step closer does it lay back down.\n\n[[Go in]].",
      "links": [
        {
          "text": "Go in",
          "destination": {
            "name": "Go in",
            "pid": 117
          }
        }
      ]
    },
    {
      "pid": 119,
      "name": "Take a look around",
      "text": "The cave's about the size of your hut. Most of the smooth stone floor is currently occupied by [the pack]<gr2|. At its highest point you can stand up, but towards the back it tapers down. It looks like there are some [trinkets]<gr1| stashed back there.\n\nThe [[greatwolf->Make conversation]] is watching you from the entrance.\n\n(click: ?gr1)[A sudden growl from the entrance startles you into almost toppling over. You look over your shoulder to see the greatwolf's ears flattened.\n\n[[Look anyway]]]\n\n(click: ?gr2)[Altogether there's seven wolves. All of them are much smaller than the greatwolf, with dappled grey and brown fur. Two of them, you note, have swollen bellies.]",
      "links": [
        {
          "text": "greatwolf",
          "destination": {
            "name": "Make conversation",
            "pid": 120
          }
        },
        {
          "text": "Look anyway",
          "destination": {
            "name": "Look anyway",
            "pid": 124
          }
        }
      ]
    },
    {
      "pid": 120,
      "name": "Make conversation",
      "text": "You take a seat by the entrance and rest your head against the stone wall. The greatwolf regards you with apparent interest.\n\n[<br>\"I like your cave.\"<br>]<cn1|(click: ?cn1)[<br>He lifts his head, looks around the cave, then thumps his tail.<br>][<br>\"I like your fur.\"<br>]<cn2|(click: ?cn2)[<br>He tilts his head. You wind a lock of your own hair around your fingers and hold it up. \"See? We're the same.\" He whines softly.<br>][<br>\"So there was a big storm last night ...\"<br>]<cn3|(click: ?cn3)[<br>He sits up a little and looks outside, ears twitching. \"Yeah, the river flooded and everything.\" He growls softly, then flops back down.<br>][<br>\"Guess they were wrong about the curse, huh?\"]<cn6|(click: ?cn6)[<br>He sit ups and stares at you intently. Startled, you continue. \"The [[village curse]], I mean.\"<br>](if: (history:) contains \"grassy field\")[[<br>\"I think you were in my dream last night.\"<br>]<cn4|](click: ?cn4)[<br>He cracks open one eye. \"We were in this nice grassy field, sleeping. You looked tired.\" Much the same as he does now. He makes a 'hrmph' noise and nestles his snout between his paws.<br>](if: (history:) contains \"Howl\")[[<br>\"Thanks. For helping with the hunters, I mean.\"<br>]<cn5|](click: ?cn5)[<br>He closes his eyes and thumps his tail against the floor.<br>](if: (history:) contains \"Look anyway\")[[<br>\"What happened to her?\"<br>]<cn7|](click: ?cn7)[<br>He pointedly turns to look outside.<br>]\n\n[[Take a look around]]",
      "links": [
        {
          "text": "village curse",
          "destination": {
            "name": "village curse",
            "pid": 121
          }
        },
        {
          "text": "Take a look around",
          "destination": {
            "name": "Take a look around",
            "pid": 119
          }
        }
      ]
    },
    {
      "pid": 121,
      "name": "village curse",
      "text": "You start from the beginning: the failing crops, the illness-ravaged people, the whispers of ancient curses and the traditions that could dispel them. He bristles, a low growl rumbling from his throat.\n\n\"Not a fan either, huh?\"\n\nHe snorts, then rolls over onto one side. There, along its ribs, is a long jagged scar. (if: $candescent >= 3)[There's something not quite right about the way it's healed; it's too perfect, as though it was stitched. ]\n\n\"[[I'm guessing, considering you haven't tried to eat me, that you're not all that interested in sacrifices.->notinterested]]\"\n\n\"[[You and I should team up. We could take them down->teamup]].\"",
      "links": [
        {
          "text": "I'm guessing, considering you haven't tried to eat me, that you're not all that interested in sacrifices.",
          "destination": {
            "name": "notinterested",
            "pid": 126
          }
        },
        {
          "text": "You and I should team up. We could take them down",
          "destination": {
            "name": "teamup",
            "pid": 127
          }
        }
      ]
    },
    {
      "pid": 122,
      "name": "Credits",
      "text": "Cover art by (link:\"Dominika Cesarz\")[(open-URL:\"http://rroyality.tumblr.com\").]\n\n(unless: $lastPassage is 0)[(link-goto: \"Return\", $lastPassage)]",
      "links": []
    },
    {
      "pid": 123,
      "name": "Save",
      "text": "{(link:\"Save to slot A\")[\n  (if:(save-game:\"Slot A\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n{(link:\"Save to slot B\")[\n  (if:(save-game:\"Slot B\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n(unless: $lastPassage is 0)[(link-goto: \"Continue\", $lastPassage)]",
      "links": []
    },
    {
      "pid": 124,
      "name": "Look anyway",
      "text": "(set: $wolves to it - 1) Ignoring the grumbling of the [[greatwolf->Make conversation]], you kneel and peer into the deepest recesses of the cave. There are plenty of animal bones and scraps of fur, but right at the back you find something [that makes you recoil]<gr3|.\n\n(click: ?gr3)[The dry, cool air of the cave has preserved this body well. It lies curled up like a child, leathery hands still clutching tight at its arms. From what's left of its clothing, it seems to have once been a young girl.\n\nThe greatwolf gives a long, low whine.]\n\n[[Look at the rest of the cave]].",
      "links": [
        {
          "text": "greatwolf",
          "destination": {
            "name": "Make conversation",
            "pid": 120
          }
        },
        {
          "text": "Look at the rest of the cave",
          "destination": {
            "name": "Look at the rest of the cave",
            "pid": 125
          }
        }
      ]
    },
    {
      "pid": 125,
      "name": "Look at the rest of the cave",
      "text": "The cave's about the size of your hut. Most of the smooth stone floor is currently occupied by [the pack]<gr2|. At its highest point you can stand up, but towards the back it tapers down. There's a stash of bones and paper towards the back.\n\nThe [[greatwolf->Make conversation]] is watching you from the entrance.\n\n(click: ?gr2)[Altogether there's seven wolves. All of them are much smaller than the greatwolf, with dappled grey and brown fur. Two of them, you note, have swollen bellies.]",
      "links": [
        {
          "text": "greatwolf",
          "destination": {
            "name": "Make conversation",
            "pid": 120
          }
        }
      ]
    },
    {
      "pid": 126,
      "name": "notinterested",
      "text": "(set: $candescent to it + 1)\n\nHe snorts. You chuckle quietly to yourself.\n\nHmm. You've been here a while. If you leave now, you can make it back before dusk ... but it's so peaceful here.\n\n[[Get going]].\n[[Close your eyes]].",
      "links": [
        {
          "text": "Get going",
          "destination": {
            "name": "Get going",
            "pid": 136
          }
        },
        {
          "text": "Close your eyes",
          "destination": {
            "name": "Close your eyes",
            "pid": 137
          }
        }
      ]
    },
    {
      "pid": 127,
      "name": "teamup",
      "text": "(set: $savage to it + 1)\n\nHe snorts. You grin, leaning back. It's a comforting thought.\n\nHmm. You've been here a while. If you leave now, you can make it back before dusk ... but it's so peaceful here.\n\n[[Get going]].\n[[Close your eyes]].",
      "links": [
        {
          "text": "Get going",
          "destination": {
            "name": "Get going",
            "pid": 136
          }
        },
        {
          "text": "Close your eyes",
          "destination": {
            "name": "Close your eyes",
            "pid": 137
          }
        }
      ]
    },
    {
      "pid": 128,
      "name": "carve2",
      "text": "You scratch the symbol onto your palm. When blood beads at the cuts, you fit it back over the stone and hold your breath.\n\nThere is an almighty groan. The ground beneath you shakes, then slowly, slowly opens up. When the sound stops there is a hole just big enough to [[squeeze through]] at the base of the stone.",
      "links": [
        {
          "text": "squeeze through",
          "destination": {
            "name": "squeeze through",
            "pid": 129
          }
        }
      ]
    },
    {
      "pid": 129,
      "name": "squeeze through",
      "text": "You drop into a small cave. The air is cool and heavy. You stand at the edge of a glass-still pool. It's unnaturally clear, and in the depths you see something glowing red.\n\n[[Dive]].",
      "links": [
        {
          "text": "Dive",
          "destination": {
            "name": "Dive",
            "pid": 130
          }
        }
      ]
    },
    {
      "pid": 130,
      "name": "Dive",
      "text": "You undress, leaving your clothes in a (if: $candescent > $savage)[neat](else:)[messy] pile on the ledge. The water is bitingly cold, but you must endure. Your lungs ache and burn. Your limbs grow heavy. You are so close.\n\n[[Reach out]].",
      "links": [
        {
          "text": "Reach out",
          "destination": {
            "name": "Reach out",
            "pid": 131
          }
        }
      ]
    },
    {
      "pid": 131,
      "name": "Reach out",
      "text": "Your fingertips brush the glowing thing -- a jewel, smooth and warm. It dims under your touch.\n\nThere is a flash of movement, then something wraps around your wrist and pulls.\n\n[[Struggle]].\n[[Relax]].",
      "links": [
        {
          "text": "Struggle",
          "destination": {
            "name": "Struggle",
            "pid": 132
          }
        },
        {
          "text": "Relax",
          "destination": {
            "name": "Relax",
            "pid": 133
          }
        }
      ]
    },
    {
      "pid": 132,
      "name": "Struggle",
      "text": "(set: $savage to it + 1) Bubbles trail from your gaping mouth as you try to kick away. The thing only grips tighter. It looks like a vine, if vines were pitch-black. More of them snare your other arm, wrap tight around your waist.\n\nAs your vision fades, you think you hear a voice.\n\n//\"Shh, child. [[It'll be over soon->matemnayes]].\"//",
      "links": [
        {
          "text": "It'll be over soon",
          "destination": {
            "name": "matemnayes",
            "pid": 134
          }
        }
      ]
    },
    {
      "pid": 133,
      "name": "Relax",
      "text": "(set: $candescent to it + 1) You feel your chest muscles start to seize, at odds with the serenity of your mind. The thing holding you relaxes too. It feels almost friendly.\n\nAs your vision fades, you think you hear a voice.\n\n//\"Well done, child. [[It will be over soon->matemnayes]].\"//",
      "links": [
        {
          "text": "It will be over soon",
          "destination": {
            "name": "matemnayes",
            "pid": 134
          }
        }
      ]
    },
    {
      "pid": 134,
      "name": "matemnayes",
      "text": "You wake in your bed, fully clothed. Night has fallen. Were you dreaming?\n\nYour hand throbs. Looking down, you see a faded, pearlescent scar in the shape of an eight-pointed star.\n\nExhaustion overcomes you. You lie down, holding your injured hand to your chest, and [[sleep]](set: $cheevos's 4th to 1).",
      "links": [
        {
          "text": "sleep",
          "destination": {
            "name": "sleep",
            "pid": 135
          }
        }
      ]
    },
    {
      "pid": 135,
      "name": "sleep",
      "text": "The warmth of the sun beats down upon you. Something cold and slimy surrounds you. It prickles against your side, shifts beneath your head, twines around your legs. Your fingertips slide through it, feeling it ripple like silk. The scent of saltwater fills the air.\n\nA weight settles on your chest. You crack open one eyelid. There is only blackness, and the sound of something laughing.\n\n[[Wake up->Next1]].",
      "links": [
        {
          "text": "Wake up",
          "destination": {
            "name": "Next1",
            "pid": 143
          }
        }
      ]
    },
    {
      "pid": 136,
      "name": "Get going",
      "text": "(set: $candescent to it + 1)The wolf whines quietly as you step past him. The sun is already past its peak, and going home in the dark doesn't seem wise.\n\nFollowing the river, you make it back well before dusk. It felt a much greater distance on the way there. You're starting to recognise the trees surrounding the area you've come to think of as yours. \n\nYou take a little time to tidy up and rearrange your $deco. When you're done, you can barely tell there was a storm at all. Satisfied, you head inside and start stoking the fire for [[dinner]].",
      "links": [
        {
          "text": "dinner",
          "destination": {
            "name": "dinner",
            "pid": 138
          }
        }
      ]
    },
    {
      "pid": 137,
      "name": "Close your eyes",
      "text": "(set: $savage to it + 1)You decide not to fight the urge to let your head droop. One of the wolves snuffles in her sleep. With your eyes closed it's like you're home, listening to your father's snoring from the other room.\n\nSomething nudges your side. You groan and turn away, but it is insistent. You force your eyes open and see ... pretty much nothing. It's pitch black outside, with only the barest hint of moonlight. Your eyes adjust after a few minutes, enough to see one of the smaller wolves is the one pressing her nose into your ribs. The others are nowhere to be seen.\n\nYou stumble out of the cave, still half-asleep. Your companion brushes up against your legs. As you start back towards the river, she stays a few steps ahead of you, occasionally looking back. Only when you're in sight of your hut does she bound off into the night.\n\nYour stomach growls, reminding you that you haven't eaten since breakfast. Better stoke up the fire and put [[dinner]] on.",
      "links": [
        {
          "text": "dinner",
          "destination": {
            "name": "dinner",
            "pid": 138
          }
        }
      ]
    },
    {
      "pid": 138,
      "name": "dinner",
      "text": "As you stir yet another venison stew, your mind wanders. You never thought you'd yearn for something as simple as bread. At least it's almost spring; you'll be able to find herbs that aren't rosemary.\n\n[[Come to think of it]]...",
      "links": [
        {
          "text": "Come to think of it",
          "destination": {
            "name": "Come to think of it",
            "pid": 139
          }
        }
      ]
    },
    {
      "pid": 139,
      "name": "Come to think of it",
      "text": "With a bowl of hot stew in your hands, you sit cross-legged on your bed and examine your diary. If you've kept track correctly, it's about the beginning of March now. The Spring Festival should be in about three weeks. People back home are probably getting excited, just like you. Spring is rejuvenation, new life, new possibilities.\n\n[[I wish I could be there]].\n[[They shouldn't get to celebrate after what they've done]].\n[[I'll just have to have my own festival]].",
      "links": [
        {
          "text": "I wish I could be there",
          "destination": {
            "name": "I wish I could be there",
            "pid": 140
          }
        },
        {
          "text": "They shouldn't get to celebrate after what they've done",
          "destination": {
            "name": "They shouldn't get to celebrate after what they've done",
            "pid": 141
          }
        },
        {
          "text": "I'll just have to have my own festival",
          "destination": {
            "name": "I'll just have to have my own festival",
            "pid": 142
          }
        }
      ]
    },
    {
      "pid": 140,
      "name": "I wish I could be there",
      "text": "(set: $mood to \"melancholy\")Making wreaths of flowers, baking sweet tarts with peaches and cherries, dancing under the moonlight ... You close your eyes and will yourself not to cry. Are they still mourning you? Will they notice you're not there?\n\nYou take a breath. Maybe you can't be there, but you can still enjoy the spring in your own way. Perhaps you'll experiment with something other than stew.\n\nEither way, you have to keep moving foward.\n\n[[CHAPTER THREE: END]].",
      "links": [
        {
          "text": "CHAPTER THREE: END",
          "destination": {
            "name": "CHAPTER THREE: END",
            "pid": 144
          }
        }
      ]
    },
    {
      "pid": 141,
      "name": "They shouldn't get to celebrate after what they've done",
      "text": "(set: $mood to \"defiant\")(set: $savage to it + 1)Your nails leave marks in the flesh of your palm. Will they even notice you're not there? Have they forgotten what they did to you?\n\nWhatever. If they get to have fun, then you should too. First step: figure out how to cook something that isn't stew.\n\n[[CHAPTER THREE: END]]",
      "links": [
        {
          "text": "CHAPTER THREE: END",
          "destination": {
            "name": "CHAPTER THREE: END",
            "pid": 144
          }
        }
      ]
    },
    {
      "pid": 142,
      "name": "I'll just have to have my own festival",
      "text": "(set: $mood to \"defiant\")What's done is done. If you're stuck out here, you may as well have some fun. It's satisfying, being alive in spite of their best efforts.\n\nNo matter what, you'll keep moving forward.\n\n[[CHAPTER THREE: END]]",
      "links": [
        {
          "text": "CHAPTER THREE: END",
          "destination": {
            "name": "CHAPTER THREE: END",
            "pid": 144
          }
        }
      ]
    },
    {
      "pid": 143,
      "name": "Next1",
      "text": "You wake to the first rays of dawn streaming through the window. Groaning, you roll over and check your diary. You're behind by a day; you'll need to fix that. \n\nCome to think of it, if you've kept track correctly, it's about the beginning of March now. The Spring Festival should be in about three weeks. People back home are probably getting excited -- spring means the end of winter rationing, the start of longer days and warmer weather.\n\nHmm. Perhaps you'll have a celebration of your own.\n\nStill, don't you feel kind of strange? There's a dull ache somewhere behind your breastbone. No, not an ache, more like the chill you get in the dead of winter. The kind that seeps deep into the marrow of your bones.\n\nNo matter, no matter. You must keep moving forward.\n\n[[CHAPTER THREE: END]]",
      "links": [
        {
          "text": "CHAPTER THREE: END",
          "destination": {
            "name": "CHAPTER THREE: END",
            "pid": 144
          }
        }
      ]
    },
    {
      "pid": 144,
      "name": "CHAPTER THREE: END",
      "text": "{(link:\"Save: Slot A\")[\n  (if:(save-game:\"Slot A\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n{(link:\"Save: Slot B\")[\n  (if:(save-game:\"Slot B\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n\n\n[[CHAPTER FOUR]]",
      "links": [
        {
          "text": "CHAPTER FOUR",
          "destination": {
            "name": "CHAPTER FOUR",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 145,
      "name": "Tips",
      "text": "To the Wolves is a choose-your-own-adventure style game. Click on links to advance the story. Choices you make will lead you down different paths.\n\nYou have two stats, ''Savagery'' and ''Candescence''. ''Savagery'' measures your physical strength, bravery, and determination, while ''Candescence'' measures your intelligence, perception, and problem-solving. Depending on which skills you nurture, different options may be available to you later.\n\nYou can save at any time from the ''Save'' link below. The autosave function remembers the last passage you were in. A word of warning: your save file is stored in cookies. If you clear your cookies from this site, your save file -- including any achievements -- will be deleted.",
      "links": []
    },
    {
      "pid": 146,
      "name": "CHAPTER FOUR",
      "text": "It's hard to tell without a clock, but you get the feeling you're waking up earlier and earlier. You stare up at your wall and double-count the days. The [[equinox]] should be in three days' time.\n",
      "links": [
        {
          "text": "equinox",
          "destination": {
            "name": "equinox",
            "pid": 147
          }
        }
      ]
    },
    {
      "pid": 147,
      "name": "equinox",
      "text": "Of the four village festivals, the Spring Equinox is usually the biggest. This year marks the first time you'll participate as an adult, and thus be expected to bring something you'd crafted as a gift.\n\nOr, you would, if they hadn't [[left you for dead]].",
      "links": [
        {
          "text": "left you for dead",
          "destination": {
            "name": "left you for dead",
            "pid": 148
          }
        }
      ]
    },
    {
      "pid": 148,
      "name": "left you for dead",
      "text": "(if: $mood is \"melancholy\")[You lean your head against the wall. Tempting as it is to wallow in your misery, you can't give up. Preparing for the equinox has proved a useful distraction thus far.](else:)[You slam the side of your fist against the wall. Thinking about them only makes you more determined to enjoy yourself.]\n\nThere are a couple of things left to do before the equinox. Specifically, you haven't decided what your gift will be. Growing up you'd either help your mother weave an intricate [[charm]] to bless the harvest, or prepare your father's [[kills]] for the feast.",
      "links": [
        {
          "text": "charm",
          "destination": {
            "name": "charm",
            "pid": 149
          }
        },
        {
          "text": "kills",
          "destination": {
            "name": "kills",
            "pid": 150
          }
        }
      ]
    },
    {
      "pid": 149,
      "name": "charm",
      "text": "(set: $candescent to it + 1)(if: $deco is \"charms\")[You've already got some practice with the charms that adorn your hut, but this will be on a far grander scale. ]The festival charms take your mother weeks of preparation, and are longer than you are tall. Yours won't be so large, and the thought of blessing the village with good harvests leaves a sour taste in your mouth. Something else, perhaps.\n\n[[Protection]].\n[[Blessings on the forest]].\n[[Ill fortune upon those who've wronged you]].",
      "links": [
        {
          "text": "Protection",
          "destination": {
            "name": "Protection",
            "pid": 152
          }
        },
        {
          "text": "Blessings on the forest",
          "destination": {
            "name": "Blessings on the forest",
            "pid": 153
          }
        },
        {
          "text": "Ill fortune upon those who've wronged you",
          "destination": {
            "name": "Ill fortune upon those who've wronged you",
            "pid": 154
          }
        }
      ]
    },
    {
      "pid": 150,
      "name": "kills",
      "text": "(set: $savage to it + 1)Rabbit isn't going to cut it here. You're going to need to go after something big. Something like one of the young stags that wander the forest this time of year.\n\nTaking one down by yourself won't be easy. But then, that hasn't stopped you before.\n\n[[Prepare for the hunt]]!",
      "links": [
        {
          "text": "Prepare for the hunt",
          "destination": {
            "name": "Prepare for the hunt",
            "pid": 151
          }
        }
      ]
    },
    {
      "pid": 151,
      "name": "Prepare for the hunt",
      "text": "With your dressing-knife at your belt and your spear gripped loosely in one hand, you head off.\n\nYou find a young buck grazing by himself near the river. Silently you creep up behind a tree. You're about to pounce when you hear the familiar //twang// of a bowstring.\n\n[[Hide->hunterhide]].\n[[Flee->hunterflee]].\n[[Turn around]].",
      "links": [
        {
          "text": "Hide",
          "destination": {
            "name": "hunterhide",
            "pid": 157
          }
        },
        {
          "text": "Flee",
          "destination": {
            "name": "hunterflee",
            "pid": 158
          }
        },
        {
          "text": "Turn around",
          "destination": {
            "name": "Turn around",
            "pid": 159
          }
        }
      ]
    },
    {
      "pid": 152,
      "name": "Protection",
      "text": "You close your eyes and imagine your mother sitting in the window, weaving ropes of rosemary and cedar-twigs. Those were for protection from misfortune. You're not sure that will help you now, but you can make them to protect you from those who would do you harm.\n\nThere's not much time, and you'll need plenty of materials. You'd better [[get going->herbfinder]].",
      "links": [
        {
          "text": "get going",
          "destination": {
            "name": "herbfinder",
            "pid": 156
          }
        }
      ]
    },
    {
      "pid": 153,
      "name": "Blessings on the forest",
      "text": "The forest has given you plenty over the last few months. It deserves your blessing. It should be simple enough to repurpose the usual harvest charm. Perhaps you'll add a tuft of white wolf-fur.\n\nIf you're going to get this done by the equinox you'll need to [[get going->herbfinder]].",
      "links": [
        {
          "text": "get going",
          "destination": {
            "name": "herbfinder",
            "pid": 156
          }
        }
      ]
    },
    {
      "pid": 154,
      "name": "Ill fortune upon those who've wronged you",
      "text": "One night, when you were small, you slipped out of bed. Candle in hand you crept out to the old shrine on the edge of town. No-one went there any more, besides your mother, and her mother before her. You were forbidden from there, as all children were.\n\n\"I bet she summons demons there,\" one boy had said. \"Maybe that's where she summoned you.\"\n\nThere were no demons in the alcove. Only dried flowers, half-melted candles, and tucked away in a corner, a dusty book marked with an eight-pointed star.\n\nYour mother had always said magic was for helping people. That night, you learned that she had lied.\n\n[[You still remember the charm, don't you->illfortune]]?",
      "links": [
        {
          "text": "You still remember the charm, don't you",
          "destination": {
            "name": "illfortune",
            "pid": 155
          }
        }
      ]
    },
    {
      "pid": 155,
      "name": "illfortune",
      "text": "Hemlock, crow's feathers, the thorns from a white rose. Finding them won't be an easy task, but you have time.\n\nYou'd better [[get going->herbfinder]].",
      "links": [
        {
          "text": "get going",
          "destination": {
            "name": "herbfinder",
            "pid": 156
          }
        }
      ]
    },
    {
      "pid": 156,
      "name": "herbfinder",
      "text": "You wander around for a while, collecting herbs. You're almost finished when you hear the familiar //twang// of a bowstring.\n\n[[Hide->hunterhide]].\n[[Flee->hunterflee]].\n[[Turn around]].",
      "links": [
        {
          "text": "Hide",
          "destination": {
            "name": "hunterhide",
            "pid": 157
          }
        },
        {
          "text": "Flee",
          "destination": {
            "name": "hunterflee",
            "pid": 158
          }
        },
        {
          "text": "Turn around",
          "destination": {
            "name": "Turn around",
            "pid": 159
          }
        }
      ]
    },
    {
      "pid": 157,
      "name": "hunterhide",
      "text": "You try to duck behind a tree, but the hunters spot you. They surround you, weapons ready.\n\nOne of them approaches you. You know him. Adam Barlow, the butcher's youngest son. He's only a year older than you. Now he stares at you with fear in his eyes.\n\n\"How the hell are you still alive?\"\n(if: (history:) contains \"matemnayes\")[\"[[I'm not]].\"](else:)[\n\"[[Stay back]]!\"\n\"[[You can't kill me that easily]].\"\n[[Attack him]].\n[[Flee->adamflee]].]",
      "links": [
        {
          "text": "I'm not",
          "destination": {
            "name": "I'm not",
            "pid": 164
          }
        },
        {
          "text": "Stay back",
          "destination": {
            "name": "Stay back",
            "pid": 160
          }
        },
        {
          "text": "You can't kill me that easily",
          "destination": {
            "name": "You can't kill me that easily",
            "pid": 161
          }
        },
        {
          "text": "Attack him",
          "destination": {
            "name": "Attack him",
            "pid": 162
          }
        },
        {
          "text": "Flee",
          "destination": {
            "name": "adamflee",
            "pid": 163
          }
        }
      ]
    },
    {
      "pid": 158,
      "name": "hunterflee",
      "text": "You start running, but one of the hunters cuts you off. You're surrounded.\n\nOne of them approaches you. You know him. Adam Barlow, the butcher's youngest son. He's only a year older than you. Now he stares at you with fear in his eyes.\n\n\"How the hell are you still alive?\"\n\n\"[[Stay back]]!\"\n\"[[You can't kill me that easily]].\"\n[[Attack him]].\n[[Flee->adamflee]].\n(if: (history:) contains \"matemnayes\")[\"[[I'm not]].\"]",
      "links": [
        {
          "text": "Stay back",
          "destination": {
            "name": "Stay back",
            "pid": 160
          }
        },
        {
          "text": "You can't kill me that easily",
          "destination": {
            "name": "You can't kill me that easily",
            "pid": 161
          }
        },
        {
          "text": "Attack him",
          "destination": {
            "name": "Attack him",
            "pid": 162
          }
        },
        {
          "text": "Flee",
          "destination": {
            "name": "adamflee",
            "pid": 163
          }
        },
        {
          "text": "I'm not",
          "destination": {
            "name": "I'm not",
            "pid": 164
          }
        }
      ]
    },
    {
      "pid": 159,
      "name": "Turn around",
      "text": "You turn towards the source of the sound, one arm raised for protection. Staring back at you, fear in his eyes, is a young hunter. It takes you a moment to recall his name. Adam Barlow, the butcher's youngest son. He's only a year older than you.\n\n\"How the hell are you still alive?\"\n\n\"[[Stay back]]!\"\n\"[[You can't kill me that easily]].\"\n[[Attack him]].\n[[Flee->adamflee]].\n(if: (history:) contains \"matemnayes\")[\"[[I'm not]].\"]",
      "links": [
        {
          "text": "Stay back",
          "destination": {
            "name": "Stay back",
            "pid": 160
          }
        },
        {
          "text": "You can't kill me that easily",
          "destination": {
            "name": "You can't kill me that easily",
            "pid": 161
          }
        },
        {
          "text": "Attack him",
          "destination": {
            "name": "Attack him",
            "pid": 162
          }
        },
        {
          "text": "Flee",
          "destination": {
            "name": "adamflee",
            "pid": 163
          }
        },
        {
          "text": "I'm not",
          "destination": {
            "name": "I'm not",
            "pid": 164
          }
        }
      ]
    },
    {
      "pid": 160,
      "name": "Stay back",
      "text": "\"We don't have to do this.\" You hold up your hands, looking from one hunter to another. You knew these people once. Somewhere behind you, a bow creaks as someone nocks an arrow.\n\nYou lock eyes with Adam. His head shakes, almost imperceptibly.\n\n[[Lunge]].\n[[Run]].",
      "links": [
        {
          "text": "Lunge",
          "destination": {
            "name": "Lunge",
            "pid": 171
          }
        },
        {
          "text": "Run",
          "destination": {
            "name": "Run",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 161,
      "name": "You can't kill me that easily",
      "text": "Your lips curl back, baring your teeth. Adam flinches back, but behind you there is the telltale creak of a bow being drawn.\n\nYou lock eyes with Adam. His head shakes, almost imperceptibly.\n\n[[Lunge]].\n[[Run]].",
      "links": [
        {
          "text": "Lunge",
          "destination": {
            "name": "Lunge",
            "pid": 171
          }
        },
        {
          "text": "Run",
          "destination": {
            "name": "Run",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 162,
      "name": "Attack him",
      "text": "(if: $savage >= 11)[You look at them, one by one. There was a time you admired these men. Perhaps you even longed to walk amongst them. Now they look like so many soft, young boys. What do they know of the forest? What do they know of strength? You'll show them true strength.\n\nNo, not strength. [[Savagery]].](else:)[You look at them, one by one. There was a time you admired these men. Perhaps you even longed to walk amongst them. Now they look at you as though you're not even human. It's not so different from before.\n\nYou grab the knife off your belt and lunge at Adam, your teeth bared in a desperate snarl. The blade finds purchase in the soft flesh of his belly, just as a white-hot pain streaks through your shoulder. You hit the ground together.\n\nAs the strength leaves your body, you are aware, dimly, of a distant [[howl->matemnawake]].]",
      "links": [
        {
          "text": "Savagery",
          "destination": {
            "name": "Savagery",
            "pid": 174
          }
        },
        {
          "text": "howl",
          "destination": {
            "name": "matemnawake",
            "pid": 178
          }
        }
      ]
    },
    {
      "pid": 163,
      "name": "adamflee",
      "text": "Exhale. Steady your nerves. You're surrounded, but you know this forest far better than they do. Some of them are murmuring amongst themselves. You hear 'witch' and 'curse' and 'kill her'.\n\nMaybe you can use that to your advantage.\n\n[[Distract them, then make a break for it]].",
      "links": [
        {
          "text": "Distract them, then make a break for it",
          "destination": {
            "name": "Distract them, then make a break for it",
            "pid": 165
          }
        }
      ]
    },
    {
      "pid": 164,
      "name": "I'm not",
      "text": "He laughs, an awkward choked sound. Your eyes do not leave his.\n\nA bow stretches, creaks. \"Kill her,\" someone snarls. You stay perfectly still. You listen for the frantic drum-beat of your pulse. There is only silence.\n\nWhen the arrow pierces your chest, you look down, puzzled. Black blood drips down the front of your dress. No, not blood, the consistency's all wrong. It's water. Ice-cold water.\n\nYou look back up at the hunters. One of them nocks another arrow.\n\n[[Raise your hand]].",
      "links": [
        {
          "text": "Raise your hand",
          "destination": {
            "name": "Raise your hand",
            "pid": 166
          }
        }
      ]
    },
    {
      "pid": 165,
      "name": "Distract them, then make a break for it",
      "text": "(if: $candescent >= 10)[You jerk backwards, eyes wide, and give  a shrill cry. As one the hunters follow your gaze. Then you're off, feet slapping against the dirt. By the time they notice you've put a good five minutes between you.\n\nYou dart over the river, then back. You scale trees, leap between branches, curl up in nooks where you cannot be seen. They cannot stay here forever. You can.\n\nA long, long time passes. The coolness of dusk soothes your racing heart.\n\n[[Return home]].(set: $cheevos's 3rd to 1)](else:)[You jerk backwards, eyes wide, and give  a shrill cry. Startled, the hunters follow your gaze. All but one. You hear his bow draw just as you break into a sprint.\n\nYou drop into a crouch to avoid the first arrow. You scramble to your feet, veering hard left behind a tree. The second arrow splits the skin of your upper arm. In surprise and pain you stumble, and the third arrow slips between your ribs. When you look down, the tip of an arrowhead is jutting through your clothes.\n\nAs the strength leaves your body and your knees hit the dirt, you are aware, dimly, of a distant [[howl->matemnawake]].]",
      "links": [
        {
          "text": "Return home",
          "destination": {
            "name": "Return home",
            "pid": 173
          }
        },
        {
          "text": "howl",
          "destination": {
            "name": "matemnawake",
            "pid": 178
          }
        }
      ]
    },
    {
      "pid": 166,
      "name": "Raise your hand",
      "text": "You examine the mark upon your left hand. It burns like frostbite. Experimentally, you curl your fingers inwards, then flick them out.\n\nYour hand bursts into flame.\n\n\"Good lord,\" you hear one hunter say. Others are backing away. You turn your attention to the bowman. His arms are trembling so hard it's a wonder he can keep his arrow nocked.\n\n[[Ignite]].",
      "links": [
        {
          "text": "Ignite",
          "destination": {
            "name": "Ignite",
            "pid": 167
          }
        }
      ]
    },
    {
      "pid": 167,
      "name": "Ignite",
      "text": "Palm out, you make a pushing motion towards the bowman. There is a flash of light, then a scream, then a clatter as his bow hits the ground, consumed by blue-white flames. In a matter of moments it is nothing but ash.\n\nSlowly you raise your head and stare at the bowman. He whimpers. For a moment you think he's going to faint. Then, he turns tail and flees.\n\n[[Pursue]].\n[[Do not]].",
      "links": [
        {
          "text": "Pursue",
          "destination": {
            "name": "Pursue",
            "pid": 168
          }
        },
        {
          "text": "Do not",
          "destination": {
            "name": "Do not",
            "pid": 169
          }
        }
      ]
    },
    {
      "pid": 168,
      "name": "Pursue",
      "text": "Could you run this fast before? Certainly you should be out of breath. Are you even breathing? Your prey is. His throat rasps with every gulp of precious air.\n\nYou stretch out your hand, grasping for his back. The ground before you erupts in cold fire. He stops short, stumbles, and then you're upon him. The skin of his neck cracks and blackens under your grip. His hands claw at your wrists, then fall to the ground.\n\nYou stand, unsteady. The fire dies out. There's an ache below your rib -- oh. The arrow. The trickle of black water has stopped, but you should probably remove it. Your head spins. You need to [[get home]].",
      "links": [
        {
          "text": "get home",
          "destination": {
            "name": "get home",
            "pid": 170
          }
        }
      ]
    },
    {
      "pid": 169,
      "name": "Do not",
      "text": "You watch until every last one of them is out of sight. The flames on your hand flicker and fade. Your head spins.\n\nYou stumble, leaning hard against a tree. Water drips from your mouth and nose. The arrow in your chest is a dull ache. If you can just get home, everything will be fine. \n\n[[One foot in front of the other->get home]]. ",
      "links": [
        {
          "text": "One foot in front of the other",
          "destination": {
            "name": "get home",
            "pid": 170
          }
        }
      ]
    },
    {
      "pid": 170,
      "name": "get home",
      "text": "Exhausted, you collapse onto your bed. It takes all your energy to sit up and fumble for your knife. You cannot sleep like this.\n\nThe slickness of raw flesh makes it difficult for you to grasp the arrowhead. Eventually your nails find purchase. It pops out in a fine mist of blood and tissue. Your stomach lurches. Tossing it aside, you turn over and force yourself to close your eyes.\n\n[[And then, you dream->And you dream]].",
      "links": [
        {
          "text": "And then, you dream",
          "destination": {
            "name": "And you dream",
            "pid": 175
          }
        }
      ]
    },
    {
      "pid": 171,
      "name": "Lunge",
      "text": "(if: $savage >= 11)[You look at them, one by one. There was a time you admired these men. Perhaps you even longed to walk amongst them. Now they look like so many soft, young boys. What do they know of the forest? What do they know of strength? You'll show them true strength.\n\nNo, not strength. [[Savagery]].](else:)[You look at them, one by one. There was a time you admired these men. Perhaps you even longed to walk amongst them. Now they look at you as though you're not even human. It's not so different from before.\n\nYou grab the knife off your belt and lunge at Adam, your teeth bared in a desperate snarl. The blade finds purchase in the soft flesh of his belly, just as a white-hot pain streaks through your shoulder. You hit the ground together.\n\nAs the strength leaves your body, you are aware, dimly, of a distant [[howl->matemnawake]].]",
      "links": [
        {
          "text": "Savagery",
          "destination": {
            "name": "Savagery",
            "pid": 174
          }
        },
        {
          "text": "howl",
          "destination": {
            "name": "matemnawake",
            "pid": 178
          }
        }
      ]
    },
    {
      "pid": 172,
      "name": "Run",
      "text": "Exhale. Steady your nerves. You're surrounded, but you know this forest far better than they do. Some of them are murmuring amongst themselves. You hear 'witch' and 'curse' and 'kill her'.\n\nMaybe you can use that to your advantage.\n\n[[Distract them, then make a break for it]].",
      "links": [
        {
          "text": "Distract them, then make a break for it",
          "destination": {
            "name": "Distract them, then make a break for it",
            "pid": 165
          }
        }
      ]
    },
    {
      "pid": 173,
      "name": "Return home",
      "text": "Exhausted, you collapse onto your bed. Your throat burns with the urge to cry. Emotions whirl in your chest, never settling long enough to be examined. You force yourself to close your eyes.\n\n[[And you dream->dream2]].",
      "links": [
        {
          "text": "And you dream",
          "destination": {
            "name": "dream2",
            "pid": 177
          }
        }
      ]
    },
    {
      "pid": 174,
      "name": "Savagery",
      "text": "In one smooth movement you grab the knife from your belt and launch yourself at Adam. He barely has time to react. Your knife finds easy purchase in his neck; his blood sprays you as you hit the ground. You pivot, dive behind a tree as an arrow looses. \n\nTwo men face you, weapons readied. A gutteral snarl erupts from your throat. You grab the long hunting-knife beside Adam's body and dart at the nearest. Instinctively he raises his arms; you slash for his wrist and collect the dropped blade as he screams. The other reaches for the bow on his back. A stab to the gut and he drops hard.\n\nAn arrow strikes the ground beside you. Two bowmen stand on the other side of the clearing. You take cover behind a tree and take a deep breath. Then you look up, and [[grin]].\n(set: $cheevos's 2nd to 1)",
      "links": [
        {
          "text": "grin",
          "destination": {
            "name": "grin",
            "pid": 176
          }
        }
      ]
    },
    {
      "pid": 175,
      "name": "And you dream",
      "text": "You open your eyes.\n\nThe world around you is pitch-black. You are lying on something smooth, cold, unyielding. The air is heavy and cool, as though a storm is brewing.\n\n[[Sit up->situp3]].",
      "links": [
        {
          "text": "Sit up",
          "destination": {
            "name": "situp3",
            "pid": 230
          }
        }
      ]
    },
    {
      "pid": 176,
      "name": "grin",
      "text": "A few dropped branches are all you need to distract them. They stand next to each other, right below your perch. //Idiots//. You drop, one knife in each hand plunging into their spines. They barely manage a scream.\n\nYou heave a deep, satisfied sigh. Quickly you check over the bodies, retrieving anything of use. Your muscles are beginning to ache, and you're getting hungry.\n\n(if: ($history) contains \"Carve up the meat\")[{}[[You'll eat well tonight->Return home]]{}](else:)[{}[[Return home]].]",
      "links": [
        {
          "text": "You'll eat well tonight",
          "destination": {
            "name": "Return home",
            "pid": 173
          }
        },
        {
          "text": "Return home",
          "destination": {
            "name": "Return home",
            "pid": 173
          }
        }
      ]
    },
    {
      "pid": 177,
      "name": "dream2",
      "text": "You open your eyes.\n\nThe world around you is pitch-black. You are lying on something smooth, cold, unyielding. The air is heavy and cool, as though a storm is brewing.\n\n[[Sit up->situp2]].",
      "links": [
        {
          "text": "Sit up",
          "destination": {
            "name": "situp2",
            "pid": 195
          }
        }
      ]
    },
    {
      "pid": 178,
      "name": "matemnawake",
      "text": "You open your eyes.\n\nThe world around you is pitch-black. You are lying on something smooth, cold, unyielding. The air is heavy and cool, as though a storm is brewing.\n\n[[Sit up]].",
      "links": [
        {
          "text": "Sit up",
          "destination": {
            "name": "Sit up",
            "pid": 179
          }
        }
      ]
    },
    {
      "pid": 179,
      "name": "Sit up",
      "text": "As you prop yourself up on your elbows, your eyes begin to adjust to the darkness.\n\nYou're lying by the edge of a glass-still pool. In its depths you see something glowing red, your only source of light. Touching your chest, you feel the sticky residue of blood and at its centre, a puncture.\n\nThe glowing-thing moves. Black ink-like swirls trail behind it as it rises to the surface. It's some kind of jewel, you think; perfectly spherical, slightly transluscent. It bobs just within arm's reach of you.\n\n[[Pick it up]].\n[[Get back]].",
      "links": [
        {
          "text": "Pick it up",
          "destination": {
            "name": "Pick it up",
            "pid": 180
          }
        },
        {
          "text": "Get back",
          "destination": {
            "name": "Get back",
            "pid": 181
          }
        }
      ]
    },
    {
      "pid": 180,
      "name": "Pick it up",
      "text": "Water clings like oil to your fingers as you lift the jewel free. In your cupped hands it pulses with a strange warmth. Something stirs in your chest.\n\nThe rivulets running down your arms slow, grow thick, twine like affectionate cats. They form a net around the base of the jewel and lift it until it is eye level with you.\n\nA voice echoes through your mind, each syllable timed with the flicker of light within the orb.\n\n\"//Hello there//.\"\n\n\"[[Hello]].\"\n[[Drop the jewel]].\n",
      "links": [
        {
          "text": "Hello",
          "destination": {
            "name": "Hello",
            "pid": 182
          }
        },
        {
          "text": "Drop the jewel",
          "destination": {
            "name": "Drop the jewel",
            "pid": 183
          }
        }
      ]
    },
    {
      "pid": 181,
      "name": "Get back",
      "text": "You slowly shift backwards, careful not to open the wound on your chest any further. The orb bobs silently in the water for a few moments. Then, it rolls forward until it hits the edge of the pool. The water surges around it to push it up onto the stone. As you watch, black tendrils snake out from the surface, cradling the jewel; they lift it up, until it is sitting eye-level with you.\n\nA voice echoes through your mind, each syllable timed with the flicker of red light.\n\n\"//Hello there//.\"\n\n\"[[Hello]].\"\n[[Retreat further]].\n",
      "links": [
        {
          "text": "Hello",
          "destination": {
            "name": "Hello",
            "pid": 182
          }
        },
        {
          "text": "Retreat further",
          "destination": {
            "name": "Retreat further",
            "pid": 194
          }
        }
      ]
    },
    {
      "pid": 182,
      "name": "Hello",
      "text": "It hums contentedly. \"//I'm glad you're awake. I've been looking forward to meeting you, you know. Ah, but hold on --//\" The tendrils shift and swell, swallowing the jewel from sight. After a few moments they settle again. Sitting across from you is a young woman, dark-skinned and dark-haired, with glowing red eyes.\n\n\"//There we go,//\" she says. \"//Now, I'm sure you have some questions.//\"\n\n\"[[Who are you]]?\"\n\"[[//What// are you]]?\"\n\"[[Where am I]]?\"\n\"[[I'm fairly certain I should be dead]].\"\n\"[[Actually, not particularly]].\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "Who are you",
            "pid": 188
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "//What// are you",
            "pid": 189
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "Where am I",
            "pid": 190
          }
        },
        {
          "text": "I'm fairly certain I should be dead",
          "destination": {
            "name": "I'm fairly certain I should be dead",
            "pid": 191
          }
        },
        {
          "text": "Actually, not particularly",
          "destination": {
            "name": "Actually, not particularly",
            "pid": 193
          }
        }
      ]
    },
    {
      "pid": 183,
      "name": "Drop the jewel",
      "text": "You pull your hands back, instinctively crossing them over your chest. The jewel bobs freely on its tower of black tendrils. \"//Oh,//\" it says mildly. \"//Did I startle you? Forgive me. Let's try something else//.\" The tendrils shift and swell, swallowing the jewel from sight. After a few moments they settle again. Sitting across from you is a young woman, dark-skinned and dark-haired, with glowing red eyes.\n\n\"//Better?//\" she asks.\n\n\"[[Yes]].\"\n\"[[That wasn't the problem]].\"\n\"[[What]]?\"\n[[Continue to move back]].",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "Yes",
            "pid": 184
          }
        },
        {
          "text": "That wasn't the problem",
          "destination": {
            "name": "That wasn't the problem",
            "pid": 185
          }
        },
        {
          "text": "What",
          "destination": {
            "name": "What",
            "pid": 186
          }
        },
        {
          "text": "Continue to move back",
          "destination": {
            "name": "Continue to move back",
            "pid": 187
          }
        }
      ]
    },
    {
      "pid": 184,
      "name": "Yes",
      "text": "\"//Excellent. Now, I'm sure you have some questions for me.//\"\n\n\"[[Who are you]]?\"\n\"[[//What// are you]]?\"\n\"[[Where am I]]?\"\n\"[[I'm fairly certain I should be dead]].\"\n\"[[Actually, not particularly]].\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "Who are you",
            "pid": 188
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "//What// are you",
            "pid": 189
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "Where am I",
            "pid": 190
          }
        },
        {
          "text": "I'm fairly certain I should be dead",
          "destination": {
            "name": "I'm fairly certain I should be dead",
            "pid": 191
          }
        },
        {
          "text": "Actually, not particularly",
          "destination": {
            "name": "Actually, not particularly",
            "pid": 193
          }
        }
      ]
    },
    {
      "pid": 185,
      "name": "That wasn't the problem",
      "text": "She tilts her head. \"//No? Hm.//\" A frown. \"//What, then?//\"\n\n\"[[Who are you]]?\"\n\"[[//What// are you]]?\"\n\"[[Where am I]]?\"\n\"[[I'm fairly certain I should be dead]].\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "Who are you",
            "pid": 188
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "//What// are you",
            "pid": 189
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "Where am I",
            "pid": 190
          }
        },
        {
          "text": "I'm fairly certain I should be dead",
          "destination": {
            "name": "I'm fairly certain I should be dead",
            "pid": 191
          }
        }
      ]
    },
    {
      "pid": 186,
      "name": "What",
      "text": "\"//You'll need to be a little more specific,//\" she says, amusement in her voice, \"//but I'm happy to answer any questions you have.//\"\n\n\"[[Who are you]]?\"\n\"[[//What// are you]]?\"\n\"[[Where am I]]?\"\n\"[[I'm fairly certain I should be dead]].\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "Who are you",
            "pid": 188
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "//What// are you",
            "pid": 189
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "Where am I",
            "pid": 190
          }
        },
        {
          "text": "I'm fairly certain I should be dead",
          "destination": {
            "name": "I'm fairly certain I should be dead",
            "pid": 191
          }
        }
      ]
    },
    {
      "pid": 187,
      "name": "Continue to move back",
      "text": "She sighs. \"//Listen -- I don't intend to harm you. Quite the opposite, actually.//\" She holds up her hands, palms out. \"//I'm sure you have questions, so please, go ahead.//\"\n\n\"[[Who are you]]?\"\n\"[[//What// are you]]?\"\n\"[[Where am I]]?\"\n\"[[I'm fairly certain I should be dead]].\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "Who are you",
            "pid": 188
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "//What// are you",
            "pid": 189
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "Where am I",
            "pid": 190
          }
        },
        {
          "text": "I'm fairly certain I should be dead",
          "destination": {
            "name": "I'm fairly certain I should be dead",
            "pid": 191
          }
        }
      ]
    },
    {
      "pid": 188,
      "name": "Who are you",
      "text": "(set: $thename to true)She smiles, revealing several rows of needle-like teeth. \"//How rude of me. My name is Matemna, clan Chaotic.//\" She sits up a little straighter, her chest puffed out. \"//[Your name is Ella, yes?]<e1|//\"\n\n(click: ?e1)[\"How do you know that?\" you ask, frowning. She gives a lopsided shrug.\n\n\"//There are ways and means. I might not be able to travel far from [this place]<e2|, but there are those that can.//\"]\n\n(click: ?e2)[\"//Ah, yes. This is a portal, of a sort.//\" She gestures to the water behind her. \"//Dive deep enough and you'll reach ... hm. It doesn't translate well. Suffice to say it's full of [creatures like myself]<k2|.//\"]\n\n(click: ?k2)[\"//Another concept that translates poorly. I know your people have referred to me as a 'spirit' or a 'demon'. When they acknowledged my presence, that is.//\" Her mouth twists in irritation.\n\n\"//Anyway. There's something else I should [[explain]].//]",
      "links": [
        {
          "text": "explain",
          "destination": {
            "name": "explain",
            "pid": 192
          }
        }
      ]
    },
    {
      "pid": 189,
      "name": "//What// are you",
      "text": "She clicks her tongue. \"//It translates poorly in your language. I know your people have referred to me as a 'spirit' or a 'demon'. When they acknowledged my presence, that is.//\" Her nostrils flare.\n\n\"//Anyway. There's something I should [[explain]].//\"",
      "links": [
        {
          "text": "explain",
          "destination": {
            "name": "explain",
            "pid": 192
          }
        }
      ]
    },
    {
      "pid": 190,
      "name": "Where am I",
      "text": "\"//Oh, that's an easy one//,\" she says cheerfully. \"//You're in a small cavern that serves as a portal between [my world]<k1| and yours.//\"\n\n(click: ?k1)[She gestures to the water behind her. \"//Dive deep enough and you'll reach ... hm. It doesn't translate well. Suffice to say it's full of [creatures like myself]<k2|.//\"]\n\n(click: ?k2)[\"//Another concept that translates poorly. I know your people have referred to me as a 'spirit' or a 'demon'. When they acknowledged my presence, that is.//\" Her mouth twists in irritation.\n\nShe shakes her head. \"//Anyway. There's something else I should [[explain]].//]\n\n\n\n",
      "links": [
        {
          "text": "explain",
          "destination": {
            "name": "explain",
            "pid": 192
          }
        }
      ]
    },
    {
      "pid": 191,
      "name": "I'm fairly certain I should be dead",
      "text": "You indicate the sizable wound on your chest. \"//Oh//,\" she says, nodding in understanding. \"//Yes, that. You are dead. Or you will be, soon enough. Unless you choose not to be. [[Let me explain->explain]].//\"\n\n\"Wait, hold on...\n\n...[[Who are you]]?\"\n...[[//What// are you]]?\"\n...[[Where am I]]?\"\n\n",
      "links": [
        {
          "text": "Let me explain",
          "destination": {
            "name": "explain",
            "pid": 192
          }
        },
        {
          "text": "Who are you",
          "destination": {
            "name": "Who are you",
            "pid": 188
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "//What// are you",
            "pid": 189
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "Where am I",
            "pid": 190
          }
        }
      ]
    },
    {
      "pid": 192,
      "name": "explain",
      "text": "(unless: $thename is true)[\"//First, allow me to introduce myself.//\" She sits up straight, puffing out her chest. \"//My name is Matemna, of clan Chaotic.//\"](else:)[\"//Hm ... where to start?//.\" She hums to herself, lost in thought, then nods.]\n\n\"//When this place was young,//\" Matemna says, folding her hands in her lap, \"//a spirit was stranded here, cast out by his fellows. He protected the inhabitants of the forest, and for a time, the humans that settled nearby. Until they grew frightened and attacked him.//\n\n\"//At that time, I approached the beast and offered him a place in my clan. He refused, for reasons that remain mysterious to me. Until today.//\" She stares at you, unblinking. \"//Today, he approached me, dragging the corpse of a human girl in his jaws. He said to me, 'Matemna, if you save her, I will join you.' [[And so, here we are]].//\"",
      "links": [
        {
          "text": "And so, here we are",
          "destination": {
            "name": "And so, here we are",
            "pid": 211
          }
        }
      ]
    },
    {
      "pid": 193,
      "name": "Actually, not particularly",
      "text": "She tilts her head. \"//Very well. That saves us some time. There are some things I need to [[explain]], anyway.//\"",
      "links": [
        {
          "text": "explain",
          "destination": {
            "name": "explain",
            "pid": 192
          }
        }
      ]
    },
    {
      "pid": 194,
      "name": "Retreat further",
      "text": "You pull back, instinctively crossing your arms over your chest. The jewel bobs slightly on its writhing column. \"//Oh,//\" it says mildly. \"//Did I startle you? Forgive me. Let's try something else//.\" The tendrils shift and swell, swallowing the jewel from sight. After a few moments they settle again. Sitting across from you is a young woman, dark-skinned and dark-haired, with glowing red eyes.\n\n\"//Better?//\" she asks.\n\n\"[[Yes]].\"\n\"[[That wasn't the problem]].\"\n\"[[What]]?\"\n[[Continue to move back]].",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "Yes",
            "pid": 184
          }
        },
        {
          "text": "That wasn't the problem",
          "destination": {
            "name": "That wasn't the problem",
            "pid": 185
          }
        },
        {
          "text": "What",
          "destination": {
            "name": "What",
            "pid": 186
          }
        },
        {
          "text": "Continue to move back",
          "destination": {
            "name": "Continue to move back",
            "pid": 187
          }
        }
      ]
    },
    {
      "pid": 195,
      "name": "situp2",
      "text": "As you prop yourself up on your elbows, your eyes begin to adjust to the darkness.\n\nYou're lying by the edge of a glass-still pool. In its depths you see something glowing red, your only source of light. \n\nThe glowing-thing moves. Black ink-like swirls trail behind it as it rises to the surface. It's some kind of jewel, you think; perfectly spherical, slightly transluscent. It bobs just within arm's reach of you.\n\n[[Pick it up->pickup2]].\n[[Get back->getback2]].",
      "links": [
        {
          "text": "Pick it up",
          "destination": {
            "name": "pickup2",
            "pid": 196
          }
        },
        {
          "text": "Get back",
          "destination": {
            "name": "getback2",
            "pid": 197
          }
        }
      ]
    },
    {
      "pid": 196,
      "name": "pickup2",
      "text": "Water clings like oil to your fingers as you lift the jewel free. In your cupped hands it pulses with a strange warmth. Something stirs in your chest.\n\nThe rivulets running down your arms slow, grow thick, twine like affectionate cats. They form a net around the base of the jewel and lift it until it is eye level with you.\n\nA voice echoes through your mind, each syllable timed with the flicker of light within the orb.\n\n\"//Hello there//.\"\n\n\"[[Hello->hello2]].\"\n[[Drop the jewel->drop2]].\n",
      "links": [
        {
          "text": "Hello",
          "destination": {
            "name": "hello2",
            "pid": 198
          }
        },
        {
          "text": "Drop the jewel",
          "destination": {
            "name": "drop2",
            "pid": 199
          }
        }
      ]
    },
    {
      "pid": 197,
      "name": "getback2",
      "text": "You slowly shift backwards. The orb bobs silently in the water for a few moments. Then, it rolls forward until it hits the edge of the pool. The water surges around it to push it up onto the stone. As you watch, black tendrils snake out from the surface, cradling the jewel; they lift it up, until it is sitting eye-level with you.\n\nA voice echoes through your mind, each syllable timed with the flicker of red light.\n\n\"//Hello there//.\"\n\n\"[[Hello->hello2]].\"\n[[Drop the jewel->contcontback]].\n",
      "links": [
        {
          "text": "Hello",
          "destination": {
            "name": "hello2",
            "pid": 198
          }
        },
        {
          "text": "Drop the jewel",
          "destination": {
            "name": "contcontback",
            "pid": 209
          }
        }
      ]
    },
    {
      "pid": 198,
      "name": "hello2",
      "text": "It hums contentedly. \"//I'm glad you're awake. I've been looking forward to meeting you, you know. Ah, but hold on --//\" The tendrils shift and swell, swallowing the jewel from sight. After a few moments they settle again. Sitting across from you is a young woman, dark-skinned and dark-haired, with glowing red eyes.\n\n\"//There we go,//\" she says. \"//Now, I'm sure you have some questions.//\"\n\n\"[[Who are you->who2]]?\"\n\"[[//What// are you->whatare2]]?\"\n\"[[Where am I->where2]]?\"\n\"[[Why am I here]]?\"\n\"[[I assumed you had something you wanted to say to me->assumed]]\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "who2",
            "pid": 206
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "whatare2",
            "pid": 208
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "where2",
            "pid": 207
          }
        },
        {
          "text": "Why am I here",
          "destination": {
            "name": "Why am I here",
            "pid": 204
          }
        },
        {
          "text": "I assumed you had something you wanted to say to me",
          "destination": {
            "name": "assumed",
            "pid": 205
          }
        }
      ]
    },
    {
      "pid": 199,
      "name": "drop2",
      "text": "You pull your hands back, instinctively crossing them over your chest. The jewel bobs freely on its tower of black tendrils. \"//Oh,//\" it says mildly. \"//Did I startle you? Forgive me. Let's try something else//.\" The tendrils shift and swell, swallowing the jewel from sight. After a few moments they settle again. Sitting across from you is a young woman, dark-skinned and dark-haired, with glowing red eyes.\n\n\"//Better?//\" she asks.\n\n\"[[Yes->yes2]].\"\n\"[[That wasn't the problem->problem2]].\"\n\"[[What->what2]]?\"\n[[Continue to move back->contback2]].",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "yes2",
            "pid": 200
          }
        },
        {
          "text": "That wasn't the problem",
          "destination": {
            "name": "problem2",
            "pid": 201
          }
        },
        {
          "text": "What",
          "destination": {
            "name": "what2",
            "pid": 202
          }
        },
        {
          "text": "Continue to move back",
          "destination": {
            "name": "contback2",
            "pid": 203
          }
        }
      ]
    },
    {
      "pid": 200,
      "name": "yes2",
      "text": "\"//Excellent. Now, I'm sure you have some questions for me.//\"\n\n\"[[Who are you->who2]]?\"\n\"[[//What// are you->whatare2]]?\"\n\"[[Where am I->where2]]?\"\n\"[[Why am I here]]?\"\n\"[[I assumed you had something you wanted to say to me->assumed]].\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "who2",
            "pid": 206
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "whatare2",
            "pid": 208
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "where2",
            "pid": 207
          }
        },
        {
          "text": "Why am I here",
          "destination": {
            "name": "Why am I here",
            "pid": 204
          }
        },
        {
          "text": "I assumed you had something you wanted to say to me",
          "destination": {
            "name": "assumed",
            "pid": 205
          }
        }
      ]
    },
    {
      "pid": 201,
      "name": "problem2",
      "text": "She tilts her head. \"//No? Hm.//\" A frown. \"//What, then?//\"\n\n\"[[Who are you->who2]]?\"\n\"[[//What// are you->whatare2]]?\"\n\"[[Where am I->where2]]?\"\n\"[[Why am I here]]?\"\n\"[[I assumed you had something you wanted to say to me->assumed]].\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "who2",
            "pid": 206
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "whatare2",
            "pid": 208
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "where2",
            "pid": 207
          }
        },
        {
          "text": "Why am I here",
          "destination": {
            "name": "Why am I here",
            "pid": 204
          }
        },
        {
          "text": "I assumed you had something you wanted to say to me",
          "destination": {
            "name": "assumed",
            "pid": 205
          }
        }
      ]
    },
    {
      "pid": 202,
      "name": "what2",
      "text": "\"//You'll need to be a little more specific,//\" she says, amusement in her voice, \"//but I'm happy to answer any questions you have.//\"\n\n\"[[Who are you->who2]]?\"\n\"[[//What// are you->whatare2]]?\"\n\"[[Where am I->where2]]?\"\n\"[[Why am I here]]?\"\n\"[[I assumed you had something you wanted to say to me->assumed]].\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "who2",
            "pid": 206
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "whatare2",
            "pid": 208
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "where2",
            "pid": 207
          }
        },
        {
          "text": "Why am I here",
          "destination": {
            "name": "Why am I here",
            "pid": 204
          }
        },
        {
          "text": "I assumed you had something you wanted to say to me",
          "destination": {
            "name": "assumed",
            "pid": 205
          }
        }
      ]
    },
    {
      "pid": 203,
      "name": "contback2",
      "text": "She sighs. \"//Listen -- I don't intend to harm you. Quite the opposite, actually.//\" She holds up her hands, palms out. \"//I'm sure you have questions, so please, go ahead.//\"\n\n\"[[Who are you->who2]]?\"\n\"[[//What// are you->whatare2]]?\"\n\"[[Where am I->where2]]?\"\n\"[[Why am I here]]?\"\n\"[[I assumed you had something you wanted to say to me->assumed]].\"",
      "links": [
        {
          "text": "Who are you",
          "destination": {
            "name": "who2",
            "pid": 206
          }
        },
        {
          "text": "//What// are you",
          "destination": {
            "name": "whatare2",
            "pid": 208
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "where2",
            "pid": 207
          }
        },
        {
          "text": "Why am I here",
          "destination": {
            "name": "Why am I here",
            "pid": 204
          }
        },
        {
          "text": "I assumed you had something you wanted to say to me",
          "destination": {
            "name": "assumed",
            "pid": 205
          }
        }
      ]
    },
    {
      "pid": 204,
      "name": "Why am I here",
      "text": "She grins, revealing rows upon rows of needle-like teeth. \"//I'm glad you asked! Actually, as it happens, I wanted to [[talk to you about something->ask you]].//\"",
      "links": [
        {
          "text": "talk to you about something",
          "destination": {
            "name": "ask you",
            "pid": 210
          }
        }
      ]
    },
    {
      "pid": 205,
      "name": "assumed",
      "text": "She chuckles. \"//I suppose that's fair. Yes, I had something I wanted to [[ask you]].//\"",
      "links": [
        {
          "text": "ask you",
          "destination": {
            "name": "ask you",
            "pid": 210
          }
        }
      ]
    },
    {
      "pid": 206,
      "name": "who2",
      "text": "(set: $thename to true)She smiles, revealing several rows of needle-like teeth. \"//How rude of me. My name is Matemna, clan Chaotic.//\" She sits up a little straighter, her chest puffed out. \"//[Your name is Ella, yes?]<e1|//\"\n\n(click: ?e1)[\"How do you know that?\" you ask, frowning. She gives a lopsided shrug.\n\n\"//There are ways and means. I might not be able to travel far from [this place]<e2|, but there are those that can.//\"]\n\n(click: ?e2)[\"//Ah, yes. This is a portal, of a sort.//\" She gestures to the water behind her. \"//Dive deep enough and you'll reach ... hm. It doesn't translate well. Suffice to say it's full of [creatures like myself]<k2|.//\"]\n\n(click: ?k2)[\"//Another concept that translates poorly. I know your people have referred to me as a 'spirit' or a 'demon'. When they acknowledged my presence, that is.//\" Her mouth twists in irritation.\n\n\"//Anyway. There's something else I'd like to [[ask you]].//]",
      "links": [
        {
          "text": "ask you",
          "destination": {
            "name": "ask you",
            "pid": 210
          }
        }
      ]
    },
    {
      "pid": 207,
      "name": "where2",
      "text": "\"//Oh, that's an easy one//,\" she says cheerfully. \"//You're in a small cavern that serves as a portal between [my world]<k1| and yours.//\"\n\n(click: ?k1)[She gestures to the water behind her. \"//Dive deep enough and you'll reach ... hm. It doesn't translate well. Suffice to say it's full of [creatures like myself]<k2|.//\"]\n\n(click: ?k2)[\"//Another concept that translates poorly. I know your people have referred to me as a 'spirit' or a 'demon'. When they acknowledged my presence, that is.//\" Her mouth twists in irritation.\n\nShe shakes her head. \"//Anyway. There's something else I'd like to [[ask you]].//]\n\n\n\n",
      "links": [
        {
          "text": "ask you",
          "destination": {
            "name": "ask you",
            "pid": 210
          }
        }
      ]
    },
    {
      "pid": 208,
      "name": "whatare2",
      "text": "She clicks her tongue. \"//It translates poorly in your language. I know your people have referred to me as a 'spirit' or a 'demon'. When they acknowledged my presence, that is.//\" Her nostrils flare.\n\n\"//Anyway. There's something I'd like to [[ask you]].//\"",
      "links": [
        {
          "text": "ask you",
          "destination": {
            "name": "ask you",
            "pid": 210
          }
        }
      ]
    },
    {
      "pid": 209,
      "name": "contcontback",
      "text": "You pull back, instinctively crossing your arms over your chest. The jewel bobs slightly on its writhing column. \"//Oh,//\" it says mildly. \"//Did I startle you? Forgive me. Let's try something else//.\" The tendrils shift and swell, swallowing the jewel from sight. After a few moments they settle again. Sitting across from you is a young woman, dark-skinned and dark-haired, with glowing red eyes.\n\n\"//Better?//\" she asks.\n\n\"[[Yes->yes2]].\"\n\"[[That wasn't the problem->problem2]].\"\n\"[[What->what2]]?\"\n[[Continue to move back->contback2]].",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "yes2",
            "pid": 200
          }
        },
        {
          "text": "That wasn't the problem",
          "destination": {
            "name": "problem2",
            "pid": 201
          }
        },
        {
          "text": "What",
          "destination": {
            "name": "what2",
            "pid": 202
          }
        },
        {
          "text": "Continue to move back",
          "destination": {
            "name": "contback2",
            "pid": 203
          }
        }
      ]
    },
    {
      "pid": 210,
      "name": "ask you",
      "text": "(unless: $thename is true)[\"//First, allow me to introduce myself.//\" She sits up straight, puffing out her chest. \"//My name is Matemna, of clan Chaotic.//\"](else:)[\"//Hm ... where to start?//\" She hums to herself, lost in thought, then nods.]\n\n\"//When this place was young,//\" Matemna says, folding her hands in her lap, \"//a spirit was stranded here, cast out by his fellows. He protected the inhabitants of the forest, and for a time, the humans that settled nearby. Until they grew frightened and attacked him.//\n\n\"//At that time, I approached the beast and offered him a place in my clan. He refused, for reasons that remain mysterious to me. But still I watched him, just in case. And that's how I found you.//\" There's a gleam in her eyes. \"//Ella Namone. [[The girl who would not be sacrificed]].//\"",
      "links": [
        {
          "text": "The girl who would not be sacrificed",
          "destination": {
            "name": "The girl who would not be sacrificed",
            "pid": 214
          }
        }
      ]
    },
    {
      "pid": 211,
      "name": "And so, here we are",
      "text": "She extends her hand, one long finger pointed squarely at the hole in your chest. It burns; you double over in pain. \"//I can save you. But there is a price.//\" Smoke curls up from your torn flesh. \"//When it is done, [you will no longer be human]<d1|. That is the only way.//\" \n\n(click: ?d1)[\"What will I become, then?\" you ask. \n\nMatemna gestures towards herself with a grin. \"//Better.//\"]\n\nThe heat in your chest subsides as Matemna leans back on her palms, \"//Unfortunately, I can't give you much time to decide. If I don't start soon, you'll be beyond my help. So: will you let me save you?//\"\n\n[[Yes->becomebetter]].\n[[No]].",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "becomebetter",
            "pid": 213
          }
        },
        {
          "text": "No",
          "destination": {
            "name": "No",
            "pid": 212
          }
        }
      ]
    },
    {
      "pid": 212,
      "name": "No",
      "text": "Matemna stares at you, brow creasing in confusion. \"//Right now, the only reason you're alive is because of me. If I don't save you, you'll die. Are you really okay with that?//\"\n\n\"[[Yes->readytodie]].\"\n\"[[...No. Save me->becomebetter]].\"",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "readytodie",
            "pid": 226
          }
        },
        {
          "text": "...No. Save me",
          "destination": {
            "name": "becomebetter",
            "pid": 213
          }
        }
      ]
    },
    {
      "pid": 213,
      "name": "becomebetter",
      "text": "Matemna clasps her hands together, eyes shining with delight. \"//You won't regret it,//\" she says, even as she's reaching for your hands. Her fingers are unnaturally smooth and pliable, like gelatin. \"//Close your eyes, girl.//\"\n\nThere's a sharp pinch on your wrist. You pull back, alarmed, but her grip is like iron. Matemna makes a soothing sound, the burble of a gentle stream. Something icy snakes its way up your veins.\n\nWhen it reaches your heart your muscles go slack. The last thing you feel is Matemna's arms -- tentacles? -- [[coiling around you->saved]].",
      "links": [
        {
          "text": "coiling around you",
          "destination": {
            "name": "saved",
            "pid": 229
          }
        }
      ]
    },
    {
      "pid": 214,
      "name": "The girl who would not be sacrificed",
      "text": "Matemna leans back on her palms, lips quirked up in a smirk. \"//So, here's your situation. You're stuck out here in the forest, alone for the rest of your miserable life. You know that if the villagers see you again they'll kill you on sight. You don't have the strength to take them out.//\" The smirk grows into a too-wide grin. \"//Alone, that is.//\n\n\"//I will give you strength. I will release you from the shackles of your humanity. I will give you what a soul like yours deserves.//\"\n\n\"[[What's the catch?]]\"\n\"[[What if I don't want that?]]\"\n\"[[I'm listening]].\"\n\n",
      "links": [
        {
          "text": "What's the catch?",
          "destination": {
            "name": "What's the catch?",
            "pid": 215
          }
        },
        {
          "text": "What if I don't want that?",
          "destination": {
            "name": "What if I don't want that?",
            "pid": 216
          }
        },
        {
          "text": "I'm listening",
          "destination": {
            "name": "I'm listening",
            "pid": 222
          }
        }
      ]
    },
    {
      "pid": 215,
      "name": "What's the catch?",
      "text": "Matemna laughs, but her eyes are fixed on you, watching for your reaction. \"//I want you to join my clan. Your (if: $candescence > $strength)[cunning](else:)[determination] is exceptional. I could use that.//\" She leans forward. \"//Trust me. I can make it worth your while//.\"\n\nThe intensity of her stare makes concentrating difficult. You close your eyes and think it over.\n\n[[Agree to the offer]].\n[[Refuse]].",
      "links": [
        {
          "text": "Agree to the offer",
          "destination": {
            "name": "Agree to the offer",
            "pid": 217
          }
        },
        {
          "text": "Refuse",
          "destination": {
            "name": "Refuse",
            "pid": 218
          }
        }
      ]
    },
    {
      "pid": 216,
      "name": "What if I don't want that?",
      "text": "Matemna's face clouds with childlike confusion. \"//You ... well. I suppose I'd ask: what //do// you want//?\"\n\n\"[[To go home]].\"\n\"[[To keep going as I am]].\"\n\"[[I don't know]].\"",
      "links": [
        {
          "text": "To go home",
          "destination": {
            "name": "To go home",
            "pid": 219
          }
        },
        {
          "text": "To keep going as I am",
          "destination": {
            "name": "To keep going as I am",
            "pid": 220
          }
        },
        {
          "text": "I don't know",
          "destination": {
            "name": "I don't know",
            "pid": 221
          }
        }
      ]
    },
    {
      "pid": 217,
      "name": "Agree to the offer",
      "text": "Matemna clasps her hands together, eyes shining with delight. \"//You won't regret it,//\" she says, even as she's reaching for your hands. Her fingers are unnaturally smooth and pliable, like gelatin. \"//Close your eyes, girl.//\"\n\nThere's a sharp pinch on your wrist. You pull back, alarmed, but her grip is like iron. Matemna makes a soothing sound, the burble of a gentle stream. Something icy snakes its way up your veins.\n\nWhen it reaches your heart your muscles go slack. The last thing you feel is Matemna's arms -- tentacles? -- [[coiling around you]].",
      "links": [
        {
          "text": "coiling around you",
          "destination": {
            "name": "coiling around you",
            "pid": 223
          }
        }
      ]
    },
    {
      "pid": 218,
      "name": "Refuse",
      "text": "Matemna stares at you. \"//Just so we're clear, if you do not accept my offer, you are almost certain to die. If by some miracle you don't, you'll live out the rest of your life in that cabin. Are you really okay with that?//\"\n\n\"[[Yes->okwiththat]].\"\n[[Wait, no. I want to accept->Agree to the offer]]",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "okwiththat",
            "pid": 224
          }
        },
        {
          "text": "Wait, no. I want to accept",
          "destination": {
            "name": "Agree to the offer",
            "pid": 217
          }
        }
      ]
    },
    {
      "pid": 219,
      "name": "To go home",
      "text": "Matemna's voice is soft, almost maternal. \"//I'm sorry, child. There is no home for you to return to now. They will not rest until you are dead. They fear you, as they fear him.//\" She leans forward and cups your cheek in her hand. \"//Make a new home with us.//\"\n\n[[Agree to the offer]].\n[[Refuse]].",
      "links": [
        {
          "text": "Agree to the offer",
          "destination": {
            "name": "Agree to the offer",
            "pid": 217
          }
        },
        {
          "text": "Refuse",
          "destination": {
            "name": "Refuse",
            "pid": 218
          }
        }
      ]
    },
    {
      "pid": 220,
      "name": "To keep going as I am",
      "text": "Matemna's voice is soft, almost maternal. \"//For how long? I can tell you now, they will not rest until you are dead. They fear you, as they fear him.//\" She leans forward and cups your cheek in her hand. \"//Give them reason.//\"\n\n[[Agree to the offer]].\n[[Refuse]].",
      "links": [
        {
          "text": "Agree to the offer",
          "destination": {
            "name": "Agree to the offer",
            "pid": 217
          }
        },
        {
          "text": "Refuse",
          "destination": {
            "name": "Refuse",
            "pid": 218
          }
        }
      ]
    },
    {
      "pid": 221,
      "name": "I don't know",
      "text": "Matemna's voice is soft, almost maternal. \"//I cannot say I understand, but I have asked this of other mortals, and I have received this answer before. Even so...//\" She leans forward and cups your cheek in her hand. \"//There is nothing left for you in this world. But there are other worlds. Let me show you.//\"\n\n[[Agree to the offer]].\n[[Refuse]].",
      "links": [
        {
          "text": "Agree to the offer",
          "destination": {
            "name": "Agree to the offer",
            "pid": 217
          }
        },
        {
          "text": "Refuse",
          "destination": {
            "name": "Refuse",
            "pid": 218
          }
        }
      ]
    },
    {
      "pid": 222,
      "name": "I'm listening",
      "text": "Matemna's eyes brighten. \"//You won't regret it//,\" she assures you. \"//I will turn you into one of my own kind. I'll teach you how to use your new powers, of course. Then you can do what you wish with those who have wronged you. All I ask in return is that when you're done, you join my clan. I could use someone with your exceptional (if: $candescence > $strength)[cunning](else:)[determination].//\"\n\nThe intensity of her stare makes concentrating difficult. You close your eyes and think it over.\n\n[[Agree to the offer]].\n[[Refuse]].",
      "links": [
        {
          "text": "Agree to the offer",
          "destination": {
            "name": "Agree to the offer",
            "pid": 217
          }
        },
        {
          "text": "Refuse",
          "destination": {
            "name": "Refuse",
            "pid": 218
          }
        }
      ]
    },
    {
      "pid": 223,
      "name": "coiling around you",
      "text": "(set: $mark to \"wrist\")Consciousness returns to you in fits and starts. You recognise the familiar rough fabric of your blanket, the scratches on the wall that are your diary. There is a faint prickle somewhere above your heart.\n\nFinally you wake properly. Instinctively you look down at your wrist. There are faint purple bruises wrapped around the length of your arm, and on the translucent skin above your veins there is a silvery scar. Four lines intersecting, forming an eight-pointed scar.\n\nYou get to your feet, wobbling slightly. Nothing feels particularly different, aside from a sense of bein well-rested. Experimentally, you [[take a look around->lookaround2]].",
      "links": [
        {
          "text": "take a look around",
          "destination": {
            "name": "lookaround2",
            "pid": 237
          }
        }
      ]
    },
    {
      "pid": 224,
      "name": "okwiththat",
      "text": "Matemna shakes her head. \"//Well. I suppose there's nothing to be done, then.//\" There is a great rumbling sound, and the roof above you slides back. Moonlight pours down onto you. \"//I wish you well,//\" Matemna says. She raises one hand.\n\nYou climb out onto the riverbank. Behind you, the standing-stone slides neatly back into place, no trace of the cave remaining.\n\nThere's nothing left to do but [[go back home]].",
      "links": [
        {
          "text": "go back home",
          "destination": {
            "name": "go back home",
            "pid": 225
          }
        }
      ]
    },
    {
      "pid": 225,
      "name": "go back home",
      "text": "The hut is dark and silent, as always. You stumble inside, jamming the door shut behind you. Your muscles ache as you climb into your bed, curling up tight. \n\nPerhaps tomorrow the hunters will come for you again. Perhaps they will not, and you will live out your life in peace. Perhaps one day you'll come for them, instead.\n\n[[For now, you sleep.]]",
      "links": [
        {
          "text": "For now, you sleep.",
          "destination": {
            "name": "For now, you sleep.",
            "pid": 228
          }
        }
      ]
    },
    {
      "pid": 226,
      "name": "readytodie",
      "text": "Matemna is silent for a painfully long moment. Then: \"//Okay. I cannot say I understand, but ...//\" There's frustration and pain in her voice. \"//I hope you have no regrets.//\"\n\nShe reaches out again, and curls her fingers inwards. There is a jolt in your chest. White smoke billows from within you, and with it you feel your energy draining. You slump to one side. The impact barely registers. Matemna's eyes are downcast; their crimson glow is the last thing you see before your vision [[fades completely]].",
      "links": [
        {
          "text": "fades completely",
          "destination": {
            "name": "fades completely",
            "pid": 227
          }
        }
      ]
    },
    {
      "pid": 227,
      "name": "fades completely",
      "text": "ENDING 3 -- A LONELY DEATH (set: $endings's 3rd to 1)\n\n[[Start again?->Starting Out]]",
      "links": [
        {
          "text": "Start again?",
          "destination": {
            "name": "Starting Out",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 228,
      "name": "For now, you sleep.",
      "text": "ENDING 2 -- MORTALITY (set: $endings's 2nd to 1)\n\n[[Start again?->Starting Out]]",
      "links": [
        {
          "text": "Start again?",
          "destination": {
            "name": "Starting Out",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 229,
      "name": "saved",
      "text": "(set: $mark to \"chest\")Consciousness returns to you in fits and starts. You recognise the familiar rough fabric of your blanket, the scratches on the wall that are your diary. There is a faint prickle somewhere above your heart.\n\nFinally you wake properly. Propping yourself up on your elbow, you instinctively raise one hand to your chest. Your dress is still torn, but beneath it the skin is whole. Silvery scar tissue radiates from where the wound once was. On closer observation, the thin lines form an eight-pointed scar.\n\nYou're alive. You're //alive//. (if: ($history) contains \"Laugh\")[Relieved laughter bubbles up from your throat.](else:)[Your chest convulses with sobs of relief.]\n\nYou get to your feet, wobbling slightly, and [[take a look around->lookaround2]].",
      "links": [
        {
          "text": "take a look around",
          "destination": {
            "name": "lookaround2",
            "pid": 237
          }
        }
      ]
    },
    {
      "pid": 230,
      "name": "situp3",
      "text": "As you prop yourself up on your elbows, your eyes begin to adjust to the darkness.\n\nYou're lying by the edge of a glass-still pool. In its depths you see something glowing red, your only source of light.\n\nThe glowing-thing moves. Black ink-like swirls trail behind it as it rises to the surface. It's some kind of jewel, you think; perfectly spherical, slightly transluscent. It bobs just within arm's reach of you.\n\n[[Remember]].",
      "links": [
        {
          "text": "Remember",
          "destination": {
            "name": "Remember",
            "pid": 231
          }
        }
      ]
    },
    {
      "pid": 231,
      "name": "Remember",
      "text": "Cold water spills from your mouth. You lean forward, gagging. As it pools around you the red-thing glides forward, the water surging around it to push it up onto the stone. As you watch, black tendrils snake out from the surface, cradling the jewel; they lift it up, until it is sitting eye-level with you.\n\nA voice echoes through your mind, each syllable timed with the flicker of red light.\n\n\"//Hello there//.\"\n\n[[Choke]].",
      "links": [
        {
          "text": "Choke",
          "destination": {
            "name": "Choke",
            "pid": 232
          }
        }
      ]
    },
    {
      "pid": 232,
      "name": "Choke",
      "text": "\"//Ah.//\" One tendril snakes forward, brushes lovingly against your lips. The water drains from your throat. \"//There we go. Look at you. I knew you had potential.//\"\n\nAs you gasp for air, it continues. \"//Fire, hm? You have a penchant for destruction. I can definitely work with that. Oh, but where are my manners?//\" The shadows shift and swell, swallowing the jewel from sight. After a few moments they settle again. Sitting across from you is a young woman, dark-skinned and dark-haired, with glowing red eyes.\n\n\"//There we go,//\" she says. \"//My name is Matemna. I've been looking forward to meeting you//.\"\n\n\"[[What are you]]?\"\n\"[[Where am I->where3]]?\"\n\"[[You're the one I've been looking for, aren't you]]?\"",
      "links": [
        {
          "text": "What are you",
          "destination": {
            "name": "What are you",
            "pid": 233
          }
        },
        {
          "text": "Where am I",
          "destination": {
            "name": "where3",
            "pid": 235
          }
        },
        {
          "text": "You're the one I've been looking for, aren't you",
          "destination": {
            "name": "You're the one I've been looking for, aren't you",
            "pid": 234
          }
        }
      ]
    },
    {
      "pid": 233,
      "name": "What are you",
      "text": "\"//An excellent question. But a better one is: what are //you?\" She throws her head back in a raucous laugh. You catch a glimpse of needle-like teeth. \"//The answer to both questions is the same. But I'd better start [[from the beginning]], don't you think?//\"",
      "links": [
        {
          "text": "from the beginning",
          "destination": {
            "name": "from the beginning",
            "pid": 236
          }
        }
      ]
    },
    {
      "pid": 234,
      "name": "You're the one I've been looking for, aren't you",
      "text": "Matemna leans foward and takes your hand in hers. Her skin is unnaturally smooth and pliable, as though if you pushed hard enough you could puncture it and water would come gushing through. \"//It would seem so,//\" she says. \"//I'll admit, I wasn't sure what to make of you at first. Not many humans have the cunning and determination to seek me out on their own. I believe you are the second.//\" Her mouth splits into a grin, revealing rows of needle-like teeth. \"//Let me start [[from the beginning]].//\"",
      "links": [
        {
          "text": "from the beginning",
          "destination": {
            "name": "from the beginning",
            "pid": 236
          }
        }
      ]
    },
    {
      "pid": 235,
      "name": "where3",
      "text": "\"//You don't recognise it?//\" Matemna laughs. You catch a glimpse of sharp, gleaming teeth. \"//We've met here once before. That was when ... ah, but I should start [[from the beginning]].//\"",
      "links": [
        {
          "text": "from the beginning",
          "destination": {
            "name": "from the beginning",
            "pid": 236
          }
        }
      ]
    },
    {
      "pid": 236,
      "name": "from the beginning",
      "text": "\"//When this place was young,//\" Matemna says, folding her hands in her lap, \"//when the last leaves fell from the trees, they would take a youth and give them over to the forest. They thought they could sate the hunger of gods, call down blessings on themselves. There were no gods. Until me.//\"\n\n\"//Where the grudges of hundreds of souls coalesced, I was able to manifest. I grew fat on their hatred for years. But then the sacrifices went out of fashion and I retreated, sought out other places. Until I felt something calling me back here. Someone performing the old rites.//\" There's a gleam in her eyes. \"//Ella Namone. [[The girl who would summon demons->summoner]]. And so, here I am.//\"",
      "links": [
        {
          "text": "The girl who would summon demons",
          "destination": {
            "name": "summoner",
            "pid": 241
          }
        }
      ]
    },
    {
      "pid": 237,
      "name": "lookaround2",
      "text": "Lying on the table is what remains of your festival preparations. You never did end up (if: ($history) contains \"charm\")[completing your charm](else:)[getting that stag]. Still, you've got enough to make yourself a decent meal. You deserve it after everything you've been through today.\n\nAs you reach for your flint and steel, something tingles in your fingertips. A single word echoes through your mind. It sounds like Matemna's voice.\n\n[[Ignite->ignite2]].",
      "links": [
        {
          "text": "Ignite",
          "destination": {
            "name": "ignite2",
            "pid": 238
          }
        }
      ]
    },
    {
      "pid": 238,
      "name": "ignite2",
      "text": "The firepit erupts into white-blue flames, so hot you recoil without thinking. \n\nYou stare at your hand, still stretched taut. You tilt it slightly; the heat recedes. (if: $mood is $defiant)[A grin tugs at the corners of your lips. With the other hand, you reach for your pot.](else:)[At a loss, you reach blindly for the pot.]\n\n[[CHAPTER FOUR: END]]",
      "links": [
        {
          "text": "CHAPTER FOUR: END",
          "destination": {
            "name": "CHAPTER FOUR: END",
            "pid": 239
          }
        }
      ]
    },
    {
      "pid": 239,
      "name": "CHAPTER FOUR: END",
      "text": "{(link:\"Save: Slot A\")[\n  (if:(save-game:\"Slot A\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n{(link:\"Save: Slot B\")[\n  (if:(save-game:\"Slot B\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n\n[[CHAPTER FIVE]]",
      "links": [
        {
          "text": "CHAPTER FIVE",
          "destination": {
            "name": "CHAPTER FIVE",
            "pid": 240
          }
        }
      ]
    },
    {
      "pid": 240,
      "name": "CHAPTER FIVE",
      "text": "You wake to your stomach churning violently. You scramble out of bed and make it to the door in time to spit up a mix of bile and black liquid.\n\nAs you kneel in the dirt, still retching, memories of the night before come back to you. Once more you check your $mark -- the flesh is still scarred with that distinctive symbol.\n\nOnce you're certain there's nothing left in your stomach, you stumble back to your bed. Out of habit, you look at your [[diary->diary2]].",
      "links": [
        {
          "text": "diary",
          "destination": {
            "name": "diary2",
            "pid": 250
          }
        }
      ]
    },
    {
      "pid": 241,
      "name": "summoner",
      "text": "Matemna regards you with amusement. \"//So. What is it that you desire, girl?//\"\n\n\"[[Vengeance]].\"\n\"[[Peace]].\"\n\"[[To leave this place]].\"",
      "links": [
        {
          "text": "Vengeance",
          "destination": {
            "name": "Vengeance",
            "pid": 243
          }
        },
        {
          "text": "Peace",
          "destination": {
            "name": "Peace",
            "pid": 244
          }
        },
        {
          "text": "To leave this place",
          "destination": {
            "name": "To leave this place",
            "pid": 245
          }
        }
      ]
    },
    {
      "pid": 242,
      "name": "lean closer",
      "text": "Pushing your covers aside, you squint at the thin lines. It takes you a moment to recognise them as letters.\n\n\"LET THIS PLACE STAND AS TESTAMENT: I DID NOT DIE FOR THEM. C.M.\"\n\nYou run your fingers over the words. So it //was// someone like you who built the hut. They must be long dead by now, but their work lives on, and now it protects you. Someone else survived the wolves. Someone else refused to die.\n\n(if: $candescent >= 2)[There's something beside the note, too. At first it looks like an errant crack, but when you look close it is deliberate. Four lines crossing at right angles, forming a star. (set: $chaotic to it + 1)]\n\nYou close your hand into a fist, [[and stand up->situation]].",
      "links": [
        {
          "text": "and stand up",
          "destination": {
            "name": "situation",
            "pid": 59
          }
        }
      ]
    },
    {
      "pid": 243,
      "name": "Vengeance",
      "text": "Matemna's grin widens, stretching far past what should be possible.  \"//That//,\" she says, \"//I can grant. No -- you will grant it yourself. Take it in your hands. But there is one thing [[I ask of you]].//\"",
      "links": [
        {
          "text": "I ask of you",
          "destination": {
            "name": "I ask of you",
            "pid": 246
          }
        }
      ]
    },
    {
      "pid": 244,
      "name": "Peace",
      "text": "Matemna's voice is soft, almost maternal. \"//There is no peace for beings like us.//\" She leans forward and cups your cheek in her hand. \"//But I can give you everything you need to destroy those who'd harm you. You've already tasted it. That's all the peace you'll ever need. In return, I ask [[one thing of you->I ask of you]].//\"",
      "links": [
        {
          "text": "one thing of you",
          "destination": {
            "name": "I ask of you",
            "pid": 246
          }
        }
      ]
    },
    {
      "pid": 245,
      "name": "To leave this place",
      "text": "Matemna's voice is soft, almost maternal. \"//Of course. This world is small.//\" She leans forward and cups your cheek in her hand. \"//Make a new home with us. But first, there is one thing [[I must ask of you->I ask of you]].//\"",
      "links": [
        {
          "text": "I must ask of you",
          "destination": {
            "name": "I ask of you",
            "pid": 246
          }
        }
      ]
    },
    {
      "pid": 246,
      "name": "I ask of you",
      "text": "\"//Every soul that has come before you, the ones that paved the way for you to find me -- they tie you to this place. Find the source of their grudge. Destroy it. Then, you will be free.//\"\n\n\"[[Which is]]...?\"\n\"[[Alright, I'll do it]].\"\n\"[[And if I refuse]]?\"",
      "links": [
        {
          "text": "Which is",
          "destination": {
            "name": "Which is",
            "pid": 247
          }
        },
        {
          "text": "Alright, I'll do it",
          "destination": {
            "name": "Alright, I'll do it",
            "pid": 248
          }
        },
        {
          "text": "And if I refuse",
          "destination": {
            "name": "And if I refuse",
            "pid": 249
          }
        }
      ]
    },
    {
      "pid": 247,
      "name": "Which is",
      "text": "Matemna gives a one-sided shrug. \"//You'll have to ask them. I suspect it won't be difficult to find; these things do have a certain ... resonance.//\"\n\n\"[[Alright, I'll do it]].\"\n(unless: ($history) contains \"And if I refuse\")[\"[[And if I refuse]]?\"]",
      "links": [
        {
          "text": "Alright, I'll do it",
          "destination": {
            "name": "Alright, I'll do it",
            "pid": 248
          }
        },
        {
          "text": "And if I refuse",
          "destination": {
            "name": "And if I refuse",
            "pid": 249
          }
        }
      ]
    },
    {
      "pid": 248,
      "name": "Alright, I'll do it",
      "text": "Matemna closes her eyes, a look of bliss on her face. \"//Can you feel them? The lost spirits that haunt this place. They will lend you their power.//\"\n\nSomething swells inside you, a warm sensation that spreads through your veins. There are whispers at the edges of your mind. You cannot quite understand them, but there is an excitement bordering on desperation in their tone.\n\n\"//There you go, child. I'll return you now. If you need me, you know where to go.//\" Matemna's voice is tinged with genuine affection. She runs one hand through your hair, brushes her thumb against your cheek, and then your vision turns black.\n\n[[CHAPTER FOUR: END->CH4END2]]",
      "links": [
        {
          "text": "CHAPTER FOUR: END",
          "destination": {
            "name": "CH4END2",
            "pid": 253
          }
        }
      ]
    },
    {
      "pid": 249,
      "name": "And if I refuse",
      "text": "Matemna gives you a quizzical look. \"//You'll be trapped here, wandering this forest for eternity, finding neither peace nor vengeance.//\"\n\n\"[[So, this 'source of their grudge'->Which is]]...?\"\n\"[[Alright, I'll do it]].\"",
      "links": [
        {
          "text": "So, this 'source of their grudge'",
          "destination": {
            "name": "Which is",
            "pid": 247
          }
        },
        {
          "text": "Alright, I'll do it",
          "destination": {
            "name": "Alright, I'll do it",
            "pid": 248
          }
        }
      ]
    },
    {
      "pid": 250,
      "name": "diary2",
      "text": "It takes you a moment to register the extra marks on the wall. In neat block letters, someone has written a note.(if: (history:) contains (\"Tally marks.\"))[ That same someone has also helpfully scratched in extra tally marks for you. Counting them, you conclude you've been asleep for two days.]\n\n\"//Good morning! The first day is always difficult. Be sure to get plenty of rest.\n\nYou may notice that you're now sensitive to the spirits that roam this forest. They will not hurt you; far from it. It is their pain and their grudges that fuel your powers. They were sacrificed here, much as you were. Which leads to my next point: there is something they, and I, [[must ask of you]].//\"",
      "links": [
        {
          "text": "must ask of you",
          "destination": {
            "name": "must ask of you",
            "pid": 251
          }
        }
      ]
    },
    {
      "pid": 251,
      "name": "must ask of you",
      "text": "\"//You are in a unique position to seek vengeance, not just for yourself, but for everyone who came before you. Somewhere in your village, there is something that is keeping all these spirits tied here. Destroy it, and you will be free.\n\nIf you need me, seek out the stone by the river with my mark upon it. I wish you well, girl.\n\n(if: (history:) contains (\"findmessage\"))[P.S. You've been asleep for two days. Thought you'd like to know.]//\"\n\nYou take [[a deep breath]].",
      "links": [
        {
          "text": "a deep breath",
          "destination": {
            "name": "a deep breath",
            "pid": 252
          }
        }
      ]
    },
    {
      "pid": 252,
      "name": "a deep breath",
      "text": "You close your eyes, focus on the sensation of breathing. Something swells inside you, a warm sensation that spreads through your veins. There are whispers at the edges of your mind. You cannot quite understand them, but there is an excitement bordering on desperation in their tone.\n\n\"[[Hello->highost]]...?\"",
      "links": [
        {
          "text": "Hello",
          "destination": {
            "name": "highost",
            "pid": 255
          }
        }
      ]
    },
    {
      "pid": 253,
      "name": "CH4END2",
      "text": "{(link:\"Save: Slot A\")[\n  (if:(save-game:\"Slot A\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n{(link:\"Save: Slot B\")[\n  (if:(save-game:\"Slot B\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n\n[[CHAPTER FIVE->ch52]]",
      "links": [
        {
          "text": "CHAPTER FIVE",
          "destination": {
            "name": "ch52",
            "pid": 254
          }
        }
      ]
    },
    {
      "pid": 254,
      "name": "ch52",
      "text": "You wake, as promised, tucked up in your bed. There's a faint queasiness in your belly as you sit up, but otherwise you feel remarkably well for a dead girl.\n\nThe voices of the dead continue to press gently against the edges of your hearing. You strain to listen, but they are no more intelligible than before. It seems you'll need to assist them somehow.\n\n[[Go out and investigate on your own]].\n[[Ask Matemna for help]].",
      "links": [
        {
          "text": "Go out and investigate on your own",
          "destination": {
            "name": "Go out and investigate on your own",
            "pid": 256
          }
        },
        {
          "text": "Ask Matemna for help",
          "destination": {
            "name": "Ask Matemna for help",
            "pid": 257
          }
        }
      ]
    },
    {
      "pid": 255,
      "name": "highost",
      "text": "The whispers grow briefly louder, but remain unintelligible. They seem intent on communicating //something//, but it seems you'll need to assist them somehow.\n\n[[Go out and investigate on your own]].\n[[Ask Matemna for help]].",
      "links": [
        {
          "text": "Go out and investigate on your own",
          "destination": {
            "name": "Go out and investigate on your own",
            "pid": 256
          }
        },
        {
          "text": "Ask Matemna for help",
          "destination": {
            "name": "Ask Matemna for help",
            "pid": 257
          }
        }
      ]
    },
    {
      "pid": 256,
      "name": "Go out and investigate on your own",
      "text": "You're all but a part of this forest now. You don't need anyone's help to explore it.\n\nWhen you step outside, your head spins and you briefly lose your balance. Your vision has not improved, exactly, but it as though someone has laid a pane of glass over the world. On it, wisps of light flicker, and at the same time you hear the murmurings of spirits.\n\n[[Focus]].",
      "links": [
        {
          "text": "Focus",
          "destination": {
            "name": "Focus",
            "pid": 258
          }
        }
      ]
    },
    {
      "pid": 257,
      "name": "Ask Matemna for help",
      "text": "While you could probably muddle through on your own, it will be much quicker to just ask Matemna.\n\nWhen you step outside, your head spins and you briefly lose your balance. Your vision has not improved, exactly, but it as though someone has laid a pane of glass over the world. On it, wisps of light flicker, and at the same time you hear the murmurings of spirits. Grimacing, you squeeze your eyes shut and will it to go away.\n\nAfter a few moments, the noise subsides. You crack open an eye. The lights have dimmed. [[Excellent]].",
      "links": [
        {
          "text": "Excellent",
          "destination": {
            "name": "Excellent",
            "pid": 263
          }
        }
      ]
    },
    {
      "pid": 258,
      "name": "Focus",
      "text": "Sight, sound, touch. You concentrate, probing the air for the source of the whispering, watching for shifts in the dancing lights. Eventually, you narrow it down to a few possible directions. The only question is, which will you track first?\n\n[[The wolf's den]].\n[[The riverbank]].\n[[Towards the village]].\n[[Your hut]].",
      "links": [
        {
          "text": "The wolf's den",
          "destination": {
            "name": "The wolf's den",
            "pid": 259
          }
        },
        {
          "text": "The riverbank",
          "destination": {
            "name": "The riverbank",
            "pid": 260
          }
        },
        {
          "text": "Towards the village",
          "destination": {
            "name": "Towards the village",
            "pid": 261
          }
        },
        {
          "text": "Your hut",
          "destination": {
            "name": "Your hut",
            "pid": 262
          }
        }
      ]
    },
    {
      "pid": 259,
      "name": "The wolf's den",
      "text": "You follow the river and your senses up to the den. Once again the pack is resting. One of the girls snuffles at you as you approach. A closer look reveals a few small bundles of fur, sleeping peacefully against her belly.\n\nYou look around for the greatwolf, but he's nowhere to be seen. More to the point, there is something lurking [[at the very back of the cave]].",
      "links": [
        {
          "text": "at the very back of the cave",
          "destination": {
            "name": "at the very back of the cave",
            "pid": 268
          }
        }
      ]
    },
    {
      "pid": 260,
      "name": "The riverbank",
      "text": "Few traces remain of the storm from a month ago. Even so, instinct and memory combined bring you quickly to where you found those old bones. They're buried again now. In their place a young woman sits by the riverbank, translucent fingers trailing in the water. She looks up at you with empty eyes and pats the ground beside her.\n\n[[Sit down]].\n\"[[Hello->hidrowned]].\"",
      "links": [
        {
          "text": "Sit down",
          "destination": {
            "name": "Sit down",
            "pid": 278
          }
        },
        {
          "text": "Hello",
          "destination": {
            "name": "hidrowned",
            "pid": 279
          }
        }
      ]
    },
    {
      "pid": 261,
      "name": "Towards the village",
      "text": "The energy trails lead you through the trees, into unfamiliar territory. Only when you come to a stop do you recognise it. Months ago a pair of hunters crossed your path here. (if: ($history) contains \"It's done\")[There's no trace of their bodies. In the shade of a tree, though, there is a hunting-knife plunged into the ground, a string of beads around its hilt.]\n\nAn abrupt shout shatters the silence. You whirl, hands raised. Behind you a young man flinches backwards. His form fades to near-transparent until you lower your arms. \"Sorry, sorry,\" he says with a nervous laugh. \"Didn't mean to scare you.\"\n\n\"[[Then you shouldn't've yelled]].\"\n\"[[Who are you->whoboy]]?\"\n",
      "links": [
        {
          "text": "Then you shouldn't've yelled",
          "destination": {
            "name": "Then you shouldn't've yelled",
            "pid": 283
          }
        },
        {
          "text": "Who are you",
          "destination": {
            "name": "whoboy",
            "pid": 284
          }
        }
      ]
    },
    {
      "pid": 262,
      "name": "Your hut",
      "text": "You find her sitting cross-legged on your bed, fingers tracing the messages you've left. She's older than you, broader, hair cropped boyishly short. At her belt is a woodsman's axe.\n\n\"So it's true, then. You're gonna give those fuckers what-for.\" She flashes you a toothy grin. Her form shimmers and distorts as she stands. \"Clara Mason. Atcher service.\"\n\n\"[[You built this place]]?\"\n\"[['Those fuckers']]?\"",
      "links": [
        {
          "text": "You built this place",
          "destination": {
            "name": "You built this place",
            "pid": 271
          }
        },
        {
          "text": "'Those fuckers'",
          "destination": {
            "name": "'Those fuckers'",
            "pid": 272
          }
        }
      ]
    },
    {
      "pid": 263,
      "name": "Excellent",
      "text": "(if: ($history) contains \"Inspect the rock.\")[You retrace your steps to the standing-stone, guided by a familiar energy that grows stronger as you approach its source.](else:)[First, you have to find her. Amongst the surge of noise in your brain, you pick out a familiar energy. Following it brings you to a standing-stone, marked with an eight-pointed star.]\n\nAs you approach, the stone slides backwards with a deafening groan. At its base, there is a hole just big enough to [[fit through]].",
      "links": [
        {
          "text": "fit through",
          "destination": {
            "name": "fit through",
            "pid": 264
          }
        }
      ]
    },
    {
      "pid": 264,
      "name": "fit through",
      "text": "You drop barely a metre onto cold stone. Within seconds the pool is writhing before you. You take a seat, the same place as before, while Matemna takes form.\n\n\"//That was quick//,\" she says cheerfully. \"//What can I do for you?//\"\n\n[[What to do]].\n[[Ask about powers]].\n[[Get going->getgoing2]].",
      "links": [
        {
          "text": "What to do",
          "destination": {
            "name": "What to do",
            "pid": 265
          }
        },
        {
          "text": "Ask about powers",
          "destination": {
            "name": "Ask about powers",
            "pid": 266
          }
        },
        {
          "text": "Get going",
          "destination": {
            "name": "getgoing2",
            "pid": 267
          }
        }
      ]
    },
    {
      "pid": 265,
      "name": "What to do",
      "text": "\"//Well//,\" she says, \"//I'd start by looking around. There are hundreds of vengeful spirits around here, but not all of them are strong enough to take form. You should be able to sense their energies, so just ... follow those.//\" She shrugs. \"//I let some of them know about our little agreement, so they'll be expecting you.//\"\n\n(unless: ($history) contains \"Ask about powers\")[{}[[Ask about powers]].]\n[[Get going->getgoing2]].",
      "links": [
        {
          "text": "Ask about powers",
          "destination": {
            "name": "Ask about powers",
            "pid": 266
          }
        },
        {
          "text": "Get going",
          "destination": {
            "name": "getgoing2",
            "pid": 267
          }
        }
      ]
    },
    {
      "pid": 266,
      "name": "Ask about powers",
      "text": "Matemna rubs her hands together. \"//That's the exciting part. I have no idea! Well, we know you can generate fire. In general, you're stronger, faster, more resilient. You're sensitive to the presence of magic. Hmm...//\" She studies you, tilting her head from side to side. \"//It's mostly about instinct. Don't think, just do. And let me know how it goes.//\"\n\n(unless: ($history) contains \"What to do\")[{}[[What to do]].]\n[[Get going->getgoing2]].",
      "links": [
        {
          "text": "What to do",
          "destination": {
            "name": "What to do",
            "pid": 265
          }
        },
        {
          "text": "Get going",
          "destination": {
            "name": "getgoing2",
            "pid": 267
          }
        }
      ]
    },
    {
      "pid": 267,
      "name": "getgoing2",
      "text": "You concentrate, probing the air for the source of the whispering, watching for shifts in the dancing lights. Eventually, you narrow it down to a few possible directions. The only question is, which will you track first?\n\n[[The wolf's den]].\n[[The riverbank]].\n[[Towards the village]].\n[[Your hut]].",
      "links": [
        {
          "text": "The wolf's den",
          "destination": {
            "name": "The wolf's den",
            "pid": 259
          }
        },
        {
          "text": "The riverbank",
          "destination": {
            "name": "The riverbank",
            "pid": 260
          }
        },
        {
          "text": "Towards the village",
          "destination": {
            "name": "Towards the village",
            "pid": 261
          }
        },
        {
          "text": "Your hut",
          "destination": {
            "name": "Your hut",
            "pid": 262
          }
        }
      ]
    },
    {
      "pid": 268,
      "name": "at the very back of the cave",
      "text": "Here: a little pile of bleach-white bones, and curled up on them a young girl. She glows a translucent blue, details distorting under your gaze. Her chest rises and falls.\n\n[[Say something]].\n[[Wait->ghostwait]].",
      "links": [
        {
          "text": "Say something",
          "destination": {
            "name": "Say something",
            "pid": 269
          }
        },
        {
          "text": "Wait",
          "destination": {
            "name": "ghostwait",
            "pid": 270
          }
        }
      ]
    },
    {
      "pid": 269,
      "name": "Say something",
      "text": "You say a hesitant 'hello'. The girl stirs, looks up at you with half-lidded eyes.\n\n\"Oh. You're that lady,\" she says, her voice thick with sleep. Now that she's sitting up you can see the way her skin clings to her bones. \"H'lo.\"\n\n[[Introduce yourself]].\n\"[[That lady]]?\"",
      "links": [
        {
          "text": "Introduce yourself",
          "destination": {
            "name": "Introduce yourself",
            "pid": 275
          }
        },
        {
          "text": "That lady",
          "destination": {
            "name": "That lady",
            "pid": 276
          }
        }
      ]
    },
    {
      "pid": 270,
      "name": "ghostwait",
      "text": "You settle against the cave wall. The girl's face is peaceful, at odds with the way her skin clings painfully tight to her bones. Eventually she rouses. She startles briefly when her eyes land on you.\n\n\"Oh. You're that lady,\" she says, her voice thick with sleep. \"H'lo.\"\n\n[[Introduce yourself]].\n\"[[That lady]]?\"",
      "links": [
        {
          "text": "Introduce yourself",
          "destination": {
            "name": "Introduce yourself",
            "pid": 275
          }
        },
        {
          "text": "That lady",
          "destination": {
            "name": "That lady",
            "pid": 276
          }
        }
      ]
    },
    {
      "pid": 271,
      "name": "You built this place",
      "text": "\"Aye.\" Her grin is the epitome of self-satisfied. \"Not bad, huh? They thought I was the devil's work, a girl who could beat a man. Well, I showed 'em.\" There's a fondness in her voice, in the lightness of her fingertips brushing against the walls. \"Always hoped this place would help someone else like me.\"\n\n\"[[You were sacrificed too]].\" It's not a question.",
      "links": [
        {
          "text": "You were sacrificed too",
          "destination": {
            "name": "You were sacrificed too",
            "pid": 273
          }
        }
      ]
    },
    {
      "pid": 272,
      "name": "'Those fuckers'",
      "text": "She snorts a laugh. \"Aye. The village elders. Loada old ...\" She coughs. \"Yeah. It's fine to kill innocent kids s'long as it's traditional, right?\"\n\n\"[[You were sacrificed too]].\" It's not a question.",
      "links": [
        {
          "text": "You were sacrificed too",
          "destination": {
            "name": "You were sacrificed too",
            "pid": 273
          }
        }
      ]
    },
    {
      "pid": 273,
      "name": "You were sacrificed too",
      "text": "She nods, her mouth a thin hard line. \"Yeah. [Unanimous vote]<c1|, I heard.\"\n\n(click: ?c1)[\"Oh, yeah. Been a while, right? 'Tem was saying something like that. Well, they used to have a vote every couple years, 'round wintertime. 'Which sucker are we gonna throw to the wolves this time?', that kinda thing. Almost always a girl. Had a feeling my time was up, but I didn't expect my own Papa to vote for me.\"\n\nShe exhales deeply, one hand grasping at her hair. \"I don't blame him, not really. The ones to blame are the elders. I just know they did something to him. He wouldn't've...\" She trails off with a one-shouldered shrug. \"Anyway. Doesn't matter now.\"\n\n[[She turns away from you, apparently lost in thought->readytogo]].]",
      "links": [
        {
          "text": "She turns away from you, apparently lost in thought",
          "destination": {
            "name": "readytogo",
            "pid": 274
          }
        }
      ]
    },
    {
      "pid": 274,
      "name": "readytogo",
      "text": "You wander back, towards the clearing by the river. Gentle sunlight streams down through the trees. You sit down on a stump and close your eyes. For a moment, you are at peace.\n\nTomorrow. The equinox should be tomorrow. Somehow, it seems appropriate. While the rest of the village is distracted you can slip in and confront the elders.\n\nBut that's tomorrow. Right now, the sun is warm on your skin. You'll enjoy one last day in your forest.\n\n[[CHAPTER FIVE: END]]",
      "links": [
        {
          "text": "CHAPTER FIVE: END",
          "destination": {
            "name": "CHAPTER FIVE: END",
            "pid": 286
          }
        }
      ]
    },
    {
      "pid": 275,
      "name": "Introduce yourself",
      "text": "\"El-lah,\" she repeats, carefully sounding out the syllables. \"Tem told me 'bout you. You're gonna hurt the bad people so I can sleep.\" She smiles up at you, one hand rubbing at a dark-ringed eye. \"The bad people have a box thing that tells them who has to go to the forest. You gotta break it, okay?\"\n\nBefore you can say anything else, her eyes start to fall shut again. She snuggles back down into her corner.\n\nBehind you, you hear the [[click of claws on stone]].",
      "links": [
        {
          "text": "click of claws on stone",
          "destination": {
            "name": "click of claws on stone",
            "pid": 277
          }
        }
      ]
    },
    {
      "pid": 276,
      "name": "That lady",
      "text": "\"Mm. Tem said a lady was gonna hurt the bad people so I can go to sleep,\" she says, rubbing at one dark-ringed eye. \"She said ... oh, yeah. I gotta tell you where to go.\" Her cheeks puff out in concentration. \"The bad people have a box thing that tells them who has to go to the forest. You gotta break it.\" She nods, satisfied with herself. \n\nBefore you can say anything else, her eyes start to fall shut again. She snuggles back down into her corner.\n\nBehind you, you hear the [[click of claws on stone]].",
      "links": [
        {
          "text": "click of claws on stone",
          "destination": {
            "name": "click of claws on stone",
            "pid": 277
          }
        }
      ]
    },
    {
      "pid": 277,
      "name": "click of claws on stone",
      "text": "The greatwolf pads over to you, head hanging low. You shift over and let him pass. The girl murmurs something as he presses his nose to her side. She raises a hand, ruffles the fur at his neck. He whines softly. His eyes are on you.\n\n[[You should probably go->readytogo]].",
      "links": [
        {
          "text": "You should probably go",
          "destination": {
            "name": "readytogo",
            "pid": 274
          }
        }
      ]
    },
    {
      "pid": 278,
      "name": "Sit down",
      "text": "You take a seat beside the girl. She looks away, hesitation written on her face. There's something around her neck that catches your eye. A necklace of twine, you realise, and as its pendant a heavy stone.\n\nAfter a few minutes the girl moves over, putting space between the two of you. She bends over and starts drawing something in the soft dirt. There's an eight-pointed star, and a crude humanoid that might be you. Then, an arrow, a few houses, and ... fire? She looks up at you expectantly.\n\n\"[[You want me to set the village on fire]]?\"",
      "links": [
        {
          "text": "You want me to set the village on fire",
          "destination": {
            "name": "You want me to set the village on fire",
            "pid": 281
          }
        }
      ]
    },
    {
      "pid": 279,
      "name": "hidrowned",
      "text": "The girl opens her mouth, but all that comes out is a strange gargled noise. She shrugs, resigned, then starts dragging her fingers over the soft ground of the bank. \n\nYou crouch to get a better look. There's a crudely drawn human figure, then an arrow pointing to a few squiggly lines. The girl mimes diving, then choking. She looks at you expectantly.\n\n\"[[You drowned]]?\"",
      "links": [
        {
          "text": "You drowned",
          "destination": {
            "name": "You drowned",
            "pid": 280
          }
        }
      ]
    },
    {
      "pid": 280,
      "name": "You drowned",
      "text": "She points to her throat and makes another gurgling sound. You notice, now, a length of twine looped around her neck. At its end is tied a heavy-looking stone that lies on her chest.\n\nApparently satisfied that you understand, she smooths away her previous drawing and replaces it with an eight-pointed star and what looks like ... you? Underneath, she draws a group of houses surrounded by flames.\n\n\"[[You want me to set the village on fire]]?\"",
      "links": [
        {
          "text": "You want me to set the village on fire",
          "destination": {
            "name": "You want me to set the village on fire",
            "pid": 281
          }
        }
      ]
    },
    {
      "pid": 281,
      "name": "You want me to set the village on fire",
      "text": "Her eyes light up. With her palm she smooths over the drawing, then starts again. A big house -- no, that's the roof of the village hall. An arrow, and a drawing of a box. A group of humanoids with angry faces. A girl, crying. Trees. Wolves. A river.\n\nThe girl watches your face carefully, gauging your reaction. She jabs insistently at the box. Then, she starts drawing flames on it.\n\n\"[['Destroy the box']]?\"",
      "links": [
        {
          "text": "'Destroy the box'",
          "destination": {
            "name": "'Destroy the box'",
            "pid": 282
          }
        }
      ]
    },
    {
      "pid": 282,
      "name": "'Destroy the box'",
      "text": "She nods fervently. The corners of her lips twitch up into an awkward smile. Her eyes linger on you for a little while, then she turns away, staring at her hands folded in her lap.\n\n[[You should probably go->readytogo]].",
      "links": [
        {
          "text": "You should probably go",
          "destination": {
            "name": "readytogo",
            "pid": 274
          }
        }
      ]
    },
    {
      "pid": 283,
      "name": "Then you shouldn't've yelled",
      "text": "\"You're right. Just wasn't sure if you could hear me.\" You can't be sure if the remorse in his tone is genuine. \"But you're like her now, aren't you? You can see us,\" he says, looking at you curiously. \"She was saying you might be 'round. Name's Charlie. It's nice to meet you.(if: ($history) contains \"It's done\")[ \"Nice work before, by the way,\" he says offhandedly. You follow his gaze to the knife-memorial. \"Best I can do is rustle some leaves. I miss being solid.\" He waves one hand through a tree trunk for emphasis.](else:)[\"]\n\nThe two of you stand in silence for a minute. Charlie kicks at the ground, hands in his pockets. \"So,\" he says. \"You're gonna go do it, right? [[Destroy the thing]]?\"",
      "links": [
        {
          "text": "Destroy the thing",
          "destination": {
            "name": "Destroy the thing",
            "pid": 285
          }
        }
      ]
    },
    {
      "pid": 284,
      "name": "whoboy",
      "text": "\"What? Oh. I'm Charlie.\" He rubs at the back of his neck and flashes a gap-toothed smile. \"She was saying you might be 'round. It's nice to meet you.(if: ($history) contains \"It's done\")[ \"Nice work before, by the way,\" he says offhandedly. You follow his gaze to the knife-memorial. \"Best I can do is rustle some leaves. I miss being solid.\" He waves one hand through a tree trunk for emphasis.](else:)[\"]\n\nThe two of you stand in silence for a minute. The boy kicks at the ground, hands in his pockets. \"So,\" he says. \"You're gonna go do it, right? [[Destroy the thing]]?\"",
      "links": [
        {
          "text": "Destroy the thing",
          "destination": {
            "name": "Destroy the thing",
            "pid": 285
          }
        }
      ]
    },
    {
      "pid": 285,
      "name": "Destroy the thing",
      "text": "\"The ...y'know.\" Charlie's mouth twists in frustration. \"In the town hall, there's this box thing. It's how they choose who to ... well.\" He pauses, staring at the ground. \"Yeah. I don't really get how it works, but if you destroy it, we can leave. Dunno where we go, but ... anyway.\"\n\nMore awkward silence. Charlie bounces from one foot to another. You should probably [[let him go->readytogo]].",
      "links": [
        {
          "text": "let him go",
          "destination": {
            "name": "readytogo",
            "pid": 274
          }
        }
      ]
    },
    {
      "pid": 286,
      "name": "CHAPTER FIVE: END",
      "text": "{(link:\"Save: Slot A\")[\n  (if:(save-game:\"Slot A\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n{(link:\"Save: Slot B\")[\n  (if:(save-game:\"Slot B\"))[\n    Game saved!\n  ](else: )[\n    Sorry, I couldn't save your game.\n  ]\n]}\n\n[[CHAPTER SIX]]",
      "links": [
        {
          "text": "CHAPTER SIX",
          "destination": {
            "name": "CHAPTER SIX",
            "pid": 287
          }
        }
      ]
    },
    {
      "pid": 287,
      "name": "CHAPTER SIX",
      "text": "(if: $candescent >= $savage)[(set: $time to \"night\")The last rays of sunlight fade into blackness. A chill settles over the forest. The feast will be over now, and the last revelers wandering back to their beds. The hall will be empty; you will slip in and out like the breeze. [[Simple, quiet, efficient]].](else:)[(set: $time to \"day\")The sun hangs low in the sky. It's a few hours yet before nightfall. The villagers will now be gathered by the square, preparing for the last part of the celebration. All eyes will be on the hall. That is where you'll [[make your strike]].]",
      "links": [
        {
          "text": "Simple, quiet, efficient",
          "destination": {
            "name": "Simple, quiet, efficient",
            "pid": 288
          }
        },
        {
          "text": "make your strike",
          "destination": {
            "name": "make your strike",
            "pid": 289
          }
        }
      ]
    },
    {
      "pid": 288,
      "name": "Simple, quiet, efficient",
      "text": "You move silently through the forest, cautious of stray villagers.(if: $wolves >=5)[ A familiar heavy thumping follows you. The greatwolf slinks to your side, gently bumping your leg with his head before taking the lead.](else:)[ There's nothing but your own footfalls and the occasional hoot of an owl.]\n\nBefore long, the trees thin out. The first glimpse of a house stops you, briefly. You swallow the instinct to run.\n\n[[It's time->time1]].",
      "links": [
        {
          "text": "It's time",
          "destination": {
            "name": "time1",
            "pid": 291
          }
        }
      ]
    },
    {
      "pid": 289,
      "name": "make your strike",
      "text": "You move purposefully through the forest, hands balled into fists.(if: $wolves >=5)[ A familiar heavy thumping follows you. The greatwolf slinks to your side, gently bumping your leg with his head before taking the lead.](else:)[ White-hot adrenalin surges through you, deafening you to everything but your own footfalls.]\n\nBefore long, the trees thin out. The first glimpse of a house stops you, briefly. You swallow the instinct to run.\n\n[[It's time->time2]].",
      "links": [
        {
          "text": "It's time",
          "destination": {
            "name": "time2",
            "pid": 290
          }
        }
      ]
    },
    {
      "pid": 290,
      "name": "time2",
      "text": "The village is bathed in the golden glow of sunset. Grass crunches under your feet. A bead of sweat slinks down your neck. You smell charcoal, cooked meat, sweet spices. Through the heat-haze, you see the crowd, and beyond them, flames licking at the air.\n\nYou stop at the edge of the crowd. Someone glances back and beckons you forward, words slurred with mead and joy in equal measure. He stops, hand still in the air.\n\nAnother person looks back. Then another. The chorus disappates. Some of them avert their gaze. A few start backing away. For a few precious moments, you are the centre of their world.\n\n[[Have your revenge]].\n[[Ignore them]].",
      "links": [
        {
          "text": "Have your revenge",
          "destination": {
            "name": "Have your revenge",
            "pid": 292
          }
        },
        {
          "text": "Ignore them",
          "destination": {
            "name": "Ignore them",
            "pid": 293
          }
        }
      ]
    },
    {
      "pid": 291,
      "name": "time1",
      "text": "The village is bathed in silvery moonlight. The air is eerily still, and the scent of spiced meat lingers on. It's dark, but you know the way.\n\nYou pause at the edge of the main square. Oil-lamps flicker in the windows, casting silhouettes against the shades. A meeting this late at night? But you cannot turn back now.\n\n[[Confront them]].\n[[Sneak in]].",
      "links": [
        {
          "text": "Confront them",
          "destination": {
            "name": "Confront them",
            "pid": 294
          }
        },
        {
          "text": "Sneak in",
          "destination": {
            "name": "Sneak in",
            "pid": 295
          }
        }
      ]
    },
    {
      "pid": 292,
      "name": "Have your revenge",
      "text": "You've known these faces all your life. They've always looked at you with revulsion, with fear. They stood by, watched the hunters chase you into the forest with the same stupid slack-jawed expression they wear now. \n\nAnger spikes through you. You raise one tightly-balled fist.\n\nA column of white flames erupts around the nearest man. He barely has time to scream before it devours the oxygen from his lungs. Your lips curl back into a satisfied snarl.\n\nThe flames are spreading. People surge towards you with whatever's at hand - knives, fire-pokers, their fists. Your body moves easily; your touch blackens flesh, warps metal. There is laughter. You almost don't recognise it as your own.\n\n[[Soon, there is nothing but ashes->end this2]].",
      "links": [
        {
          "text": "Soon, there is nothing but ashes",
          "destination": {
            "name": "end this2",
            "pid": 297
          }
        }
      ]
    },
    {
      "pid": 293,
      "name": "Ignore them",
      "text": "The crowd parts before you. Whispers surround you, but none dare to approach. As it should be.\n\nLights flicker inside the town hall. Are the elders holding a meeting, now of all times? Well, it doesn't matter. One way or another, you're going to [[end this]].",
      "links": [
        {
          "text": "end this",
          "destination": {
            "name": "end this",
            "pid": 296
          }
        }
      ]
    },
    {
      "pid": 294,
      "name": "Confront them",
      "text": "Double-click this passage to edit it.",
      "links": []
    },
    {
      "pid": 295,
      "name": "Sneak in",
      "text": "You slip into the darkened kitchen, the only part of the hall left empty. From the other side of the thin wall you hear relaxed chatter. More importantly, there's an all-encompassing sense of misery that seems to originate nearby. So: you'll wait until they're distracted, grab what you came for, and leave.\n\nWhile you're waiting for your moment, something catches your eye. There's a pot of soup simmering, unattended, on the stove. For their supper, no doubt. They'd never notice if, say, someone stirred a handful of berries into it.\n\n[[Fetch some berries]].\n[[Don't bother->to business]].",
      "links": [
        {
          "text": "Fetch some berries",
          "destination": {
            "name": "Fetch some berries",
            "pid": 303
          }
        },
        {
          "text": "Don't bother",
          "destination": {
            "name": "to business",
            "pid": 304
          }
        }
      ]
    },
    {
      "pid": 296,
      "name": "end this",
      "text": "The elders rise as you slam open the door, noises of protest dying in their throats. These faces you know, too. That one waved sticks of burning cedar. This one dressed young, strong men in wolf hides. Others just watched. None of them stepped in.\n\nThere are murmurs of confusion, of fear, of anger. You ignore them. [[They can't touch you]].\n",
      "links": [
        {
          "text": "They can't touch you",
          "destination": {
            "name": "They can't touch you",
            "pid": 300
          }
        }
      ]
    },
    {
      "pid": 297,
      "name": "end this2",
      "text": "Lights flicker inside the town hall. Are the elders holding a meeting, now of all times? Well, it doesn't matter. One way or another you'll get what you came for.\n\nThe elders rise as you slam open the door, noises of protest dying in their throats. These faces you know, too. That one waved sticks of burning cedar. This one dressed young, strong men in wolf hides. Others just watched. None of them stepped in.\n\nThere are murmurs of confusion, of fear, of anger. You ignore them. [[They can't touch you]].\n",
      "links": [
        {
          "text": "They can't touch you",
          "destination": {
            "name": "They can't touch you",
            "pid": 300
          }
        }
      ]
    },
    {
      "pid": 298,
      "name": "Destroy the box",
      "text": "You sniff, and smell something rotten. With a flick of your wrist the altar is set alight. Behind you the elders are screaming and shouting threats, like so many insects buzzing in your ears. You ignore them, focusing only on what you came for.\n\nAs the altar crumbles to ash, something in your chest uncoils. You're almost lifted off your feet by a flood of relief, of gratitude. All at once the whispering in your mind disappears, leaving you with only yourself.\n\nWhen you turn to leave, you see some of the elders -- the ones who didn't run -- huddled in a corner. A cruel smirk plays on your lips. Let them live. [[Let them remember this]].",
      "links": [
        {
          "text": "Let them remember this",
          "destination": {
            "name": "Let them remember this",
            "pid": 301
          }
        }
      ]
    },
    {
      "pid": 299,
      "name": "Burn the whole place down",
      "text": "You sniff, and smell something rotten. With a flick of your wrist the altar is set alight. Behind you the elders are screaming and shouting threats, like so many insects buzzing in your ears. Irritated, you focus on making the flames roar higher, burn hotter. They start to spread. Tongues of fire lick at your ankles like so many faithful pups.\n\nAs the altar crumbles to ash, something in your chest uncoils. You're almost lifted off your feet by a flood of relief, of gratitude. All at once the whispering in your mind disappears, leaving you with only yourself.\n\nYou close the door behind you when you leave, and torch it too for good measure. [[Only fire can cleanse this place now->Let them remember this]].",
      "links": [
        {
          "text": "Only fire can cleanse this place now",
          "destination": {
            "name": "Let them remember this",
            "pid": 301
          }
        }
      ]
    },
    {
      "pid": 300,
      "name": "They can't touch you",
      "text": "You turn away. What catches your eye immediately is the altar where all the accoutrements of the village traditions are kept. You've glimpsed it a few times before, on the rare occasion you were permitted into the hall.\n\nAt its centre is an intricately carved wooden box. It would be beautiful, were it not emanating pure misery. The murmurings from the elders grow louder, realising what you plan to do.\n\n[[Destroy the box]].\n[[Burn the whole place down]].",
      "links": [
        {
          "text": "Destroy the box",
          "destination": {
            "name": "Destroy the box",
            "pid": 298
          }
        },
        {
          "text": "Burn the whole place down",
          "destination": {
            "name": "Burn the whole place down",
            "pid": 299
          }
        }
      ]
    },
    {
      "pid": 301,
      "name": "Let them remember this",
      "text": "(if: $wolves >= 5)[The greatwolf is waiting for you outside, his tail wagging. \"All done,\" you tell him, and scratch behind his ears. He huffs and nips playfully at your fingers.](else:)[Matemna is waiting for you outside, a wicked grin on her face. \"Well, look at you!\" she crows. \"Not bad for a first-timer. Knew I could rely on you.\" She bumps shoulders with you playfully.]\n\nYou look out over the village one last time. (if: ($history) contains \"Have your revenge\")[What's left of it, anyway. A charred corpse crumbles under your careless footsteps. There are still some flashes of movement, eyes peering out fearfully from windows. Not that it matters. There's nothing here for you now.](else:)[Were it not for the occasional fearful peeking out of windows, you might think it had been abandoned. They'll recover sooner or later. But they won't forget you.]\n\n(if: $wolves >= 5)[There's a gentle tugging on your skirt. The greatwolf growls softly. He takes a few steps towards the forest, then looks back expectantly.\n\nYou laugh, and with one fleeting look at your former home, you [[follow him->I'm ready]].](else:)[There's a palm against your palm, fingers twining with yours. \"Well?\" Matemna says, tugging at your arm. \"Ready to go?\"\n\n\"Yeah,\" you say. \"[[I'm ready]].\"]",
      "links": [
        {
          "text": "follow him",
          "destination": {
            "name": "I'm ready",
            "pid": 302
          }
        },
        {
          "text": "I'm ready",
          "destination": {
            "name": "I'm ready",
            "pid": 302
          }
        }
      ]
    },
    {
      "pid": 302,
      "name": "I'm ready",
      "text": "ENDING 1 -- VICTORIOUS (set: $endings's 1st to 1)\n\n[[Start again?->Starting Out]]",
      "links": [
        {
          "text": "Start again?",
          "destination": {
            "name": "Starting Out",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 303,
      "name": "Fetch some berries",
      "text": "By the doctor's house there is a beautiful tree, its boughs weighed low with shiny black berries. You lean over the fence that had kept your curious hands away as a child, and pluck it bare. This small act of defiance sends a thrill through you.\n\nThe berries hiss and pop as you tip them into the broth. Not enough, you think. You can't be sure they'll work. You reach into your pocket. More berries. You tip them into the broth. It's turning black now. One more handful.\n\nThere is one berry left. You roll it between your fingertips, then pop it into your mouth. It's oddly sweet.\n\nNow, [[to business]].",
      "links": [
        {
          "text": "to business",
          "destination": {
            "name": "to business",
            "pid": 304
          }
        }
      ]
    },
    {
      "pid": 304,
      "name": "to business",
      "text": "You open the door into the hall, just a crack. If they looked over now, they'd see one pale blue eye staring out from the darkness. You're half-tempted to get their attention just for the reaction. But, no: you have better things to do. Once you're sure they're not about to look over, you take a cautious glance around.\n\nWhat catches your eye immediately is the altar where all the accoutrements of the village traditions are kept. You've glimpsed it a few times before, on the rare occasion you were permitted into the hall. At its centre is an intricately carved wooden box. It would be beautiful, were it not emanating pure misery.\n\nThe elders seem reasonably distracted, but you will take no chances. With a flick of your wrist, a curtain on the far wall catches alight. In the confusion you grab hold of the box and slip back out [[into the night]].",
      "links": [
        {
          "text": "into the night",
          "destination": {
            "name": "into the night",
            "pid": 305
          }
        }
      ]
    },
    {
      "pid": 305,
      "name": "into the night",
      "text": "You kneel, setting the box down in the grass. There is a slot in its lid, and when you open it up little strips of paper flutter out. Unrolling one, you find your own name. You put it back and pick up another. Your name again, printed in a different hand. Numbness creeps through you as you sort through them. Every last one bears your name. This is how you were chosen to die.\n\nAnger flares through you. The papers burn to nothing in an instant, and then the box, too. When you're done all that's left is a scorch mark on the ground. \n\nSomething in your chest uncoils. You're almost lifted off your feet by a flood of relief, of gratitude. All at once the whispering in your mind disappears, leaving you with only yourself.\n\n[[It's over]].",
      "links": [
        {
          "text": "It's over",
          "destination": {
            "name": "It's over",
            "pid": 306
          }
        }
      ]
    },
    {
      "pid": 306,
      "name": "It's over",
      "text": "(if: $wolves >= 5)[There's a low huff from behind you. The greatwolf lays down beside you, head tilted inquisitively. \"All done,\" you say, and scratch behind his ears. He snorts and nips playfully at your fingers.](else:)[A rippling sound is your only warning before Matemna appears beside you. \"Well, look at you!\" she crows, flashing you a wicked grin. \"Not bad for a first-timer. Knew I could rely on you.\" She bumps shoulders with you playfully.]\n\nYou look out over the village one last time. Sights that were once so familiar now feel alien. Will anyone here remember you? (if: ($history) contains \"Fetch some berries\")[When the elders lay gasping for air, is it your name they'll curse?]\n\n(if: $wolves >= 5)[The greatwolf whines as he gets up, stretching out his spine. He takes a few steps towards the forest, then looks back at you expectantly.\n\nYou laugh, and with one fleeting look at your former home, [[get to your feet->I'm ready]].](else:)[There's a palm against your palm, fingers twining with yours. \"Well?\" Matemna says, tugging at your arm. \"Ready to go?\"\n\n\"Yeah,\" you say. \"[[I'm ready]].\"]",
      "links": [
        {
          "text": "get to your feet",
          "destination": {
            "name": "I'm ready",
            "pid": 302
          }
        },
        {
          "text": "I'm ready",
          "destination": {
            "name": "I'm ready",
            "pid": 302
          }
        }
      ]
    }
  ]
}