{
  "passages": [
    {
      "pid": 1,
      "name": "AboutThonkasMagarum",
      "text": "In a rage one night Thonkas Magarum stormed into the bedchamber of Glorgrim Morgyth as he lay with the Queen. \\n\\nThonkas lifted the Solid Quicksilver Miner's Pick from it's resting place and buried the pick's sharp point into the couple as they slept.\\n\\nBut legend says he [[didn't stop|AboutRevolt]] at that heinous act!\\n\\n[[...continue...|previous()]]",
      "links": [
        {
          "text": "didn't stop",
          "destination": {
            "name": "AboutRevolt",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "UnlockAllMechPortcullis",
      "text": "A familiar sound echos throughout the halls of the vaults. The sounds of ancient gears turning and mechanical portcullis sliding into waiting sleeves finally comes to an end.\\n\\n<i>'This will be interesting,'</i> you mutter aloud.\\n\\n[[...continue...|Gatehouse]]\\n\\n<<set $MechPortcullis = 'raised'>>\\n",
      "links": [
        {
          "text": "...continue...",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "QuicksilverNook",
      "text": "You slide the large chest over to the wall, just below the opening. It is difficult to climb up into the small entrance which leads to a dark crawl space.\\n\\nThere would be just enough space for a large dwarf to worm his way back into this tiny recess. The small tunnel immediately turns to the left, revealing a slight glowing blue light. \\n\\nResting quietly on a simple square of granite, undisturbed for centuries, is the [[Solid Quicksilver Miner's Pick|TakeMinersPick]] of Legendary Dwarf Mason Glorgrim Morgyth.\\n\\nThe light blue glow of the enchanted dwarven mercury dances off the surfaces of the crawl space as the pick's surface ripples and flows like water.",
      "links": [
        {
          "text": "Solid Quicksilver Miner's Pick",
          "destination": {
            "name": "TakeMinersPick",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "AboutBattleMap",
      "text": "This battle map covers a vast expanse of territory. With one eye closed, you bend closer to the ancient etched leather for a closer look.\\n\\nThe dim light of your lantern helps as you attempt to decipher the map's symbols and scripts.\\n\\nYou compare known landmarks, a few towns that still exist, and more that now stand in ruins scattered across the map. The [[Great University|AboutGreatUniversity]] stands out as being in the proper location, but is shown as less prominent than it is today. The ancient Dwarven runes used on the huge map are well beyond your linguistic skill.\\n\\nPicking out runes still used by the Dwarves today, you do manage to decipher a few phrases. Resting a moment to take stock of the discovery, you recall folklore whispered in noisy taverns.\\n\\nThe first Dwarven rune deciphered most likely points to The Labyrinth of Agoch. The second is most certainly The Tomb of Ninebi the Elemental. Far to one corner of the battle map is a rune indicating where to find The Halls of the Gargoyle Empress. The final Dwarven rune deciphered indicates the location of The Cavern of Black Souls.\\n\\n[[...continue...|InnerSanctum]]",
      "links": [
        {
          "text": "Great University",
          "destination": {
            "name": "AboutGreatUniversity",
            "pid": 29
          }
        },
        {
          "text": "...continue...",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "OpenLivingStatueTrap",
      "text": "The statues suddenly come alive! The nearest figure grabs your wrist tightly, while looking through you with blind eyes of stone.\\n\\nYou hear the hammering grind of stone feet colliding with ancient stone floor as the other statues surround you.\\n\\nBefore you can make sense of what is happening, or attempt to flee, they tear every limb from your torso with cold marble hands.\\n\\nAs your lifeless body collapses to the floor the statues return to their pedestals and reset the trap.\\n\\n<center>T H E &nbsp;&nbsp; E N D</center>",
      "links": []
    },
    {
      "pid": 6,
      "name": "MainHall",
      "text": "The room resembles the storage chambers of an ancient museum. <<if $Bookshelf eq 'open'>>Not what you would expect to find hidden behind a [[bookshelf|BookshelfToGatehouse]].<<else if $Bookshelf eq 'closed'>><<endif>>\\n\\nThere is a vast and varied collection of solid gold items displayed throughout the Main Hall. <<if $CurrentRune eq 'sun'>>Bright light bounces and refracts off hanging gems and crystals, creating rainbows around the expanse.<<else if ($CurrentRune eq 'moon') and ($LanternLight eq 'on')>>The gems and crystals adorning the ceiling glow with the soothing light blue glow of moonlight.<<else if ($CurrentRune eq 'ice') or ($CurrentRune eq 'giant') or ($CurrentRune eq 'wealth') or ($CurrentRune eq 'ocean')>>The gems and crystals adorning the ceiling hang lifeless and dark.<<endif>>\\n\\nA [[massive archway|MainHallToInnerSanctum]] invites visitors into the next chamber to the east. A mural of geometric patterns covers the ceiling, Where the mural fails to cover the ceiling it is adorned with naturally growing crystalline stalactites.\\n\\nNear each corner of the massive room sits a tall marble statue. The <<if $StatuesPuzzle eq 'unsolved'>>[[statues|ExamineStatuePuzzle]]<<endif>><<if $StatuesPuzzle eq 'solved'>>statues<<endif>> appear to be symbolically gesturing to one another. One of the statues looks like [[King Iderdg|AboutKingDecree]] of legend.\\n\\n<<if $StatuesPuzzle eq 'solved'>>A narrow door which receded into the floor has revealed a tiny room. The [[alcove|Alcove]] is paneled with an ornate scene made of carved wood. The mural depicts a stout Dwarf holding a large block covered in runes. Light beams eminating from the rune block fill the scene.<<endif>>\\n",
      "links": [
        {
          "text": "bookshelf",
          "destination": {
            "name": "BookshelfToGatehouse",
            "pid": 24
          }
        },
        {
          "text": "massive archway",
          "destination": {
            "name": "MainHallToInnerSanctum",
            "pid": 50
          }
        },
        {
          "text": "statues",
          "destination": {
            "name": "ExamineStatuePuzzle",
            "pid": 60
          }
        },
        {
          "text": "King Iderdg",
          "destination": {
            "name": "AboutKingDecree",
            "pid": 32
          }
        },
        {
          "text": "alcove",
          "destination": {
            "name": "Alcove",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "AboutQuicksilver",
      "text": "Solid Quicksilver is quite special because of the unique nature of dwarven mercury, actually being a solid metal, though the surface ripples and flows as if it were water. Items constructed of Solid Quicksilver will float in water, regardless of their weight. \\n\\n[[...continue...|ExamineDowelsPuzzle]]",
      "links": [
        {
          "text": "...continue...",
          "destination": {
            "name": "ExamineDowelsPuzzle",
            "pid": 61
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "InsideKasChest",
      "text": "Inside you find a woven cord necklace made of three strands of thick mithril thread. Hanging from the center of the rare jewelry is a rough hewn stone. Engraved in the face of the pendant is the ancient Dwarven rune for 'giant'.\\n\\nPlacing the [[necklace|PrivateChambers][$GiantNecklace = 'worn']] over your head, you continue to inspect the chamber.\\n\\n",
      "links": [
        {
          "text": "necklace",
          "destination": {
            "name": "PrivateChambers",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "YourselfEnding",
      "text": "Wielding the great power of the Solid Quicksilver Miner's Pick of Legendary Dwarf Mason Glorgrim Morgyth fills you with a surge of energy.\\n\\nYou slither out of the secret nook in which Kas the Betrayer hid the instrument so long ago. It is said the pick is enchanted with the power to literally seperate and shape stone to the wielder's will.\\n\\nLooking around at the secret chamber, your eyes fall on the far wall. Leveling the miner's pick, you will the wall to melt away. And it does.\\n\\nPeering through the hole you just created there is a huge tunnel. Digging through the granite of The Highwall Peaks around the vault, by something gargantuan, must have shaken the mountain itself. \\n\\nA tunnel, with a circumference vast enough to allow a raiding party led by war elephants three astride, opens up to you.\\n\\nYour suspicion as to what caused the earthquakes in the region is confirmed immediately. From the mouth of the entrance just created, a Large Monstrous Centipede approached you!\\n\\n<center>T H E &nbsp;&nbsp; E N D</center>\\n",
      "links": []
    },
    {
      "pid": 10,
      "name": "RuneBlock",
      "text": "After careful consideration, you place the rune block into the recessed base with the Dwarven rune for [['ice'|RuneResult][$CurrentRune = 'ice']], [['giant'|RuneResult][$CurrentRune = 'giant']], [['sun'|RuneResult][$CurrentRune = 'sun']], [['moon'|RuneResult][$CurrentRune = 'moon']], [['wealth'|RuneResult][$CurrentRune = 'wealth']], or [['ocean'|RuneResult][$CurrentRune = 'ocean']] facing up.",
      "links": [
        {
          "text": "'ice'",
          "destination": {
            "name": "RuneResult",
            "pid": 13
          }
        },
        {
          "text": "'giant'",
          "destination": {
            "name": "RuneResult",
            "pid": 13
          }
        },
        {
          "text": "'sun'",
          "destination": {
            "name": "RuneResult",
            "pid": 13
          }
        },
        {
          "text": "'moon'",
          "destination": {
            "name": "RuneResult",
            "pid": 13
          }
        },
        {
          "text": "'wealth'",
          "destination": {
            "name": "RuneResult",
            "pid": 13
          }
        },
        {
          "text": "'ocean'",
          "destination": {
            "name": "RuneResult",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "Start",
      "text": "You are standing amid a rubble pile of scree, upturned dirt, broken branches, and massive trees snapped like twigs. The earthen mound which once covered the towering [[granite wall|AboutGraniteWall]] lies at your feet. Beyond the granite wall The Highwall Peaks extend into the eastern horizon.\\n\\nAn ornately carved stone doorway lies ajar. The entry is open just enough that a grown man might slip through with significant effort. [[Beyond|EntranceHallway]] the doorway, inky black darkness swallows the daylight.\\n\\n<<set $SlidingDoor1 = 'closed'>>\\n\\n<<set $Backpack = 'none'>>\\n<<set $ClimberKit = 'none'>>\\n<<set $IronRations = 'none'>>\\n<<set $EmptySacks = '0'>>\\n<<set $Crowbar = 'none'>>\\n<<set $Flint = 'none'>>\\n<<set $RemovedClothes = 'hanging'>>\\n<<set $Inkwell = 'none'>>\\n<<set $Bookshelf = 'closed'>>\\n<<set $Lantern = 'none'>>\\n<<set $LanternLight = 'off'>>\\n\\n<<set $DowelOne = 'center'>>\\n<<set $DowelTwo = 'center'>>\\n<<set $DowelThree = 'center'>>\\n<<set $DowelFour = 'center'>>\\n\\n<<set $MechPortcullis = 'lowered'>>\\n\\n<<set $UnlockTreasure = 'hidden'>>\\n\\n<<set $StatuesPuzzle = 'unsolved'>>\\n<<set $KingStatue = 'praying'>>\\n<<set $QueenStatue = 'offering'>>\\n<<set $DwarfStatue = 'blessing'>>\\n<<set $HoodedStatue = 'praising'>>\\n\\n<<set $CurrentRune = 'sun'>>\\n\\n<<set $GiantNecklace = 'hidden'>>\\n",
      "links": [
        {
          "text": "granite wall",
          "destination": {
            "name": "AboutGraniteWall",
            "pid": 45
          }
        },
        {
          "text": "Beyond",
          "destination": {
            "name": "EntranceHallway",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "AboutChamberRunes",
      "text": "The six walls of the chamber have been embedded with five glowing runes. <<if ($CurrentRune eq 'ice') or ($CurrentRune eq 'giant') or ($CurrentRune eq 'sun') or ($CurrentRune eq 'moon') or ($CurrentRune eq 'ocean')>>The rune symbolizing '<<$CurrentRune>>' glows more brightly than the others.<<endif>>\\n\\nOn a chamber wall the Dwarven run for 'ice' stands tall and narrow. A single slit, deeply carved, down the center of the large round stone glyph.\\n\\nAcross the room, above the entrance, a rune for 'giant' glows. The pointed arrow looks right, defying opposition. While the strong back stands tall on the far left of the engraving.\\n\\nOn opposing walls you notice the 'sun' and 'moon' runes. Jagged edges and slanting lines flow beside one another to symbolize the light reaching Dwarves from the sun high above. While the 'moon' rune lays these symbols on their sides.\\n\\nFinally, the last visible rune is that carved token for 'ocean'. A single great wave. Starting at one corner of the rounded stone, and rising sharply to the top, only to cascade back down again at a crashing angle.\\n\\n[[...continue...|previous()]]",
      "links": []
    },
    {
      "pid": 13,
      "name": "RuneResult",
      "text": "<<if $CurrentRune eq 'ice'>>Placing the heavy block into the recessed base, you hear the sound of an endless waterfall. The cascade is muffled, but nearby.<<endif>><<if $CurrentRune eq 'giant'>>Placing the heavy block into the recessed base, you notice the light of the Main Hall flicker and dim slightly. The entire vault seems eerily quiet.<<endif>><<if $CurrentRune eq 'sun'>>Placing the heavy block into the recessed base, you notice the light of the Main Hall brightens suddenly. Looking over your shoulder you notice the hanging gems and crystals are beaming with bright light.<<endif>><<if $CurrentRune eq 'moon'>>Placing the heavy block into the recessed base, you notice the light of the Main Hall dims suddenly. Looking over your shoulder you notice the hanging gems and crystals now emit a soft blue glow.<<endif>><<if $CurrentRune eq 'wealth'>>Placing the heavy block into the recessed base, you do not detect any change in the alcove or the Main Hall. The entire vault seems eerily quiet.<<endif>><<if $CurrentRune eq 'ocean'>>Placing the heavy block into the recessed base, you hear the sound of pressure violently escaping through a small opening. The hiss is muffled, but nearby.<<endif>>\\n\\nWith the rune firmly in place, you return to the [[Main Hall|MainHall]] to continue exploring.",
      "links": [
        {
          "text": "Main Hall",
          "destination": {
            "name": "MainHall",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "DowelOneUpDown",
      "text": "<<if $DowelOne eq \"up\">>\\nReaching out, you grasp the dowel firmly. With considerable effort you move the first dowel [[to the center|RemoveClothes][$DowelOne = \"center\"]].\\n\\n<<else if $DowelOne eq \"center\">>\\nReaching out, you grasp the dowel firmly. With considerable effort you consider moving first dowel either [[up|RemoveClothes][$DowelOne = \"up\"]] or [[down|RemoveClothes][$DowelOne = \"down\"]].\\n\\n<<else if $DowelOne eq \"down\">>\\nReaching out, you grasp the dowel firmly. With considerable effort you move the first dowel [[to the center|RemoveClothes][$DowelOne = \"center\"]].\\n\\n<<endif>>",
      "links": [
        {
          "text": "to the center",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        },
        {
          "text": "up",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        },
        {
          "text": "down",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "ExamineBunkbed",
      "text": "You glance underneath the bottom bunk and spot a very basic backpack. It's contents indicate that another adventurer had explored at least this far into the vaults in the past.\\n\\nInside you find a climber's kit, some iron rations, a flint and tender, two large empty sacks, and a battered crowbar.\\n\\nYou sling the backpack over one shoulder and take note of the western wall. <<if $RemovedClothes eq 'hanging'>>A row of thick leather coats and blacksmithing aprons hangs on wooden dowels there.<<else if $RemovedClothes eq 'removed'>>A row of four empty wooden dowels is there.<<endif>>\\n\\n[[...continue...|Gatehouse]]\\n\\n<<set $Backpack = 'backpack'>>\\n<<set $ClimberKit = 'kit'>>\\n<<set $IronRations = 'ration'>>\\n<<set $EmptySacks = '2'>>\\n<<set $Crowbar = 'crowbar'>>\\n<<set $Flint = 'flint'>>\\n",
      "links": [
        {
          "text": "...continue...",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "DwarfStatueAlter",
      "text": "<<if $DwarfStatue eq \"praising\">>\\nThe uplifted arms praise the Dwarf's diety. You pull one arm down and create a [[blessing|AlterStatues][$DwarfStatue = \"blessing\"]] gesture.\\n\\n<<else if $DwarfStatue eq \"blessing\">>\\nOne of the Dwarf's arms is lifed high to receive his dieties power, the other hand is held out to bless the faithful. Lifting his low hand allows the Dwarf to [[praise|AlterStatues][$DwarfStatue = \"praising\"]]. But pulling the two arms into his chest displays a Dwarf deep in [[prayer|AlterStatues][$DwarfStatue = \"praying\"]].\\n\\n<<else if $DwarfStatue eq \"praying\">>\\nThe Dwarf is deep in prayer, both hands pressed together at his chest. He can [[bless|AlterStatues][$DwarfStatue = \"blessing\"]] followers by extending one arm to his diety, and leveling the other to his followers. Still, the Dwarf may want to make an [[offering|AlterStatues][$DwarfStatue = \"offering\"]] at this time.\\n\\n<<else if $DwarfStatue eq \"offering\">>\\nLowered in a sign of surrender, the Dwarf holds out an offering. Lifting his hands to his chest, and pressing them together, he begins [[praying|AlterStatues][$DwarfStatue = \"praying\"]].\\n\\n<<endif>>",
      "links": [
        {
          "text": "blessing",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "praise",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "prayer",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "bless",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "offering",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "praying",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "ChambersToInnerSanctum",
      "text": "Leaving the private chamber of Kas the Betrayer, you squeeze through the [[narrow passage|InnerSanctum]] to the Inner Sanctum.",
      "links": [
        {
          "text": "narrow passage",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "RevealBookshelf",
      "text": "As the lantern passes by, shadows dance behind the books resting upon each of the deep shelves.\\n\\nOn the lowest shelf you notice an ornate compass made of several shades of wood. The edges of the compass are raised slightly. \\n\\nYour fingers fall over the edge as you clear the dust away to examine the pattern more closely. Brushing aside a thick layer of dust, the gloss on the compass still shines in the lantern light.\\n\\n<<if $Inkwell eq 'inkwell'>>\\nThe circumference of the compass is close to that of the inkwell's base. Hefting the weighty item from your backpack, you place it upon the [[ornate compass|OpenBookshelf]].\\n<<endif>>\\n\\n",
      "links": [
        {
          "text": "ornate compass",
          "destination": {
            "name": "OpenBookshelf",
            "pid": 52
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "BackToEntranceHallway",
      "text": "Leaving the Inner Sanctum, you turn to  go through the portcullis into the [[hallway|EntranceHallway]].",
      "links": [
        {
          "text": "hallway",
          "destination": {
            "name": "EntranceHallway",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "OpenFireTrap",
      "text": "You tilt your head back to catch a glimpse of what is causing the disturbance to the chamber. \\n\\nThrough the thick cloud of ancient dust you discern the outline of a small panel which has been revealed. \\n\\nWaving a hand in front of your face to clear the fine grains of stone ash from your view is pointless.\\n\\nSeconds after the panel slides open a torrent of fire hotter than a blacksmith's forge descends upon you.\\n\\nYou are engulfed in a life extingushing flame. The warm air lifts your bone ash up into the ceiling as the trap resets itself.\\n\\n<center>T H E &nbsp;&nbsp; E N D</center>",
      "links": []
    },
    {
      "pid": 21,
      "name": "QueenStatueAlter",
      "text": "<<if $QueenStatue eq \"praising\">>\\nThe uplifted arms praise the Queen's diety. You pull one arm down and create a [[blessing|AlterStatues][$QueenStatue = \"blessing\"]] gesture.\\n\\n<<else if $QueenStatue eq \"blessing\">>\\nOne of the Queen's arms is lifed high to receive her dieties power, the other hand is held out to bless the faithful. Lifting her low hand allows the Queen to [[praise|AlterStatues][$QueenStatue = \"praising\"]]. But pulling the two arms into her chest displays a Queen deep in [[prayer|AlterStatues][$QueenStatue = \"praying\"]].\\n\\n<<else if $QueenStatue eq \"praying\">>\\nThe Queen is deep in prayer, both hands pressed together at her chest. She can [[bless|AlterStatues][$QueenStatue = \"blessing\"]] followers by extending one arm to her diety, and leveling the other to her followers. Still, the Queen may want to make an [[offering|AlterStatues][$QueenStatue = \"offering\"]] at this time.\\n\\n<<else if $QueenStatue eq \"offering\">>\\nLowered in a sign of surrender, the Queen holds out an offering. Lifting her hands to her chest, and pressing them together, she begins [[praying|AlterStatues][$QueenStatue = \"praying\"]].\\n\\n<<endif>>",
      "links": [
        {
          "text": "blessing",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "praise",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "prayer",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "bless",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "offering",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "praying",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "EntranceHallway",
      "text": "The stone doorway provides a tight entrance to the narrow corridor beyond. A sense that the hallway was used to channel and expel enemies from this lair is overwhelming. \\n\\nThe passage continues for several paces and turns sharply south. The southern arm of the hall extends only a few more paces. <<if $MechPortcullis eq 'raised'>>At the end of the hallway is a <<$MechPortcullis>> [[portcullis|OpenInnerSanctum]].<<else if $MechPortcullis eq 'lowered'>>At the end of the hallway is a <<$MechPortcullis>> portcullis.<<endif>>\\n\\n<<if $SlidingDoor1 eq 'closed'>>Just around the corner, a large leather strap hangs from a brass orb embedded at the top of a <<$SlidingDoor1>> [[wooden door|OpenGatehouse][$SlidingDoor1 = 'open']].<<else if $SlidingDoor1 eq 'open'>>The large leather strap rests on the floor, attached to the <<$SlidingDoor1>> wooden door hidden in the floor. Beyond the door is the [[small gatehouse|Gatehouse][$SlidingDoor1 = 'open']].<<endif>>\\n",
      "links": [
        {
          "text": "portcullis",
          "destination": {
            "name": "OpenInnerSanctum",
            "pid": 31
          }
        },
        {
          "text": "wooden door",
          "destination": {
            "name": "OpenGatehouse",
            "pid": 35
          }
        },
        {
          "text": "small gatehouse",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "Alcove",
      "text": "A tile labyrinth covers the floor of the alcove revealed in the wall of the [[Main Hall|MainHall]]. One of the tiles is a large block, loosely recessed into the center of the floor.\\n\\nThe block is easily [[removable|ExamineAlcovePuzzle]], and each face is engraved with a single ancient Dwarven rune.",
      "links": [
        {
          "text": "Main Hall",
          "destination": {
            "name": "MainHall",
            "pid": 6
          }
        },
        {
          "text": "removable",
          "destination": {
            "name": "ExamineAlcovePuzzle",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "BookshelfToGatehouse",
      "text": "Leaving the grand Main Hall, you slip quietly through the [[hidden passage|Gatehouse]] revealed behind the bookshelf, and back into Gatehouse.",
      "links": [
        {
          "text": "hidden passage",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "AboutQueenIderdg",
      "text": "During an expansion of the Kingdom late in the Third Age, then Queen Iderdg Geiridotr secretly enlisted the help of a handful of dwarven clans to penetrate deep into the Dimish Mountains.\\n\\nThonkas Magarum was an Accomplished Engraver of the Dwarven Clan Valduum. However, he was extremely jealous of the attention his teacher, the Legendary Dwarf Mason Glorgrim Morgyth, received from the Queen during their envoys.\\n\\n[[...continue...|InnerSanctum]]",
      "links": [
        {
          "text": "...continue...",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "OpenPrivateChambers",
      "text": "<<if $CurrentRune eq 'ice'>>\\nFour stone flaps jostle in the upper corners of the small passage. A steady flow of sand grains pour out of the open maws. Rapidly, the deluge of granite sand and thick powdery ash has filled the tiny corridor. The mixture quickly piles up on the cold granite floor preventing entry.\\n\\nBehind you is the [[Inner Sanctum|InnerSanctum]].\\n<<else if $CurrentRune eq 'ocean'>>\\nBarely visible nozzels shoot a noxious gas into the passage. The jets of highly pressurized vapors fill the passage making it inaccessilbe. As the cloud expands, the gas spills over into the Inner Sanctum. If you don't retreat, the fumes could kill you.\\n\\nBehind you is the [[Inner Sanctum|InnerSanctum]].\\n\\n<<else if $CurrentRune eq 'giant'>>The Dwarven rune engraved in the wall is now glowing brightly. [[Pressing|PrivateChambers]] your hand on the large rune opens the back wall of the passageway.\\n\\nBehind you is the [[Inner Sanctum|InnerSanctum]].<<endif>>\\n\\n<<if ($CurrentRune eq 'sun') or ($CurrentRune eq 'moon') or ($CurrentRune eq 'wealth')>>\\n<<if ($GiantNecklace eq 'worn')>>At the end of the hall you see a dark rune engraved in the wall. You feel quite powerful wearing the necklace marked with the Dwarven rune for 'giant'. [[Pressing|PrivateChambers]] your hand on the large rune opens the back wall of the passageway.<<else if ($GiantNecklace eq 'hidden')>> At the end of the hall you see a dark rune engraved in the wall. Pressing your hand on the large rune depresses the stone, but does nothing else.<<endif>>\\n\\nThe floor of the tunnel features several grates. Above your head, you notice them as well.\\n\\nBehind you is the [[Inner Sanctum|InnerSanctum]].<<endif>>",
      "links": [
        {
          "text": "Inner Sanctum",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        },
        {
          "text": "Pressing",
          "destination": {
            "name": "PrivateChambers",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "BrotherhoodEnding",
      "text": "Wielding the great power of the Solid Quicksilver Miner's Pick of Legendary Dwarf Mason Glorgrim Morgyth fills you with a surge of energy.\\n\\nYou slither out of the secret nook in which Kas the Betrayer hid the instrument so long ago. It is said the pick is enchanted with the power to literally seperate and shape stone to the wielder's will.\\n\\nReaching into the backpack you obtained in the Gatehouse, you wrap the miner's pick in the two large sacks. The item sticks out of the backpack as you leave the vault behind.\\n\\nWithout detection you slip into the city under the cover of night. Snaking through the tunnels below the cobblestoned streets you reach the meeting place for the Brotherhood of the Gloved Hand.\\n\\nHanding over the artifact you are cheered as a hero, and seated at a place of honor among the theives you call family. In the coming weeks, the Brotherhood plots the largest heist in the history of Aberaeron. The success of that mission is thanks completely to the work you accomplished!\\n\\n<center>T H E &nbsp;&nbsp; E N D</center>",
      "links": []
    },
    {
      "pid": 28,
      "name": "RemoveClothes",
      "text": "You swiftly remove all the leather coats and blacksmithing aprons hanging from the four nondescript dowels.\\n\\nThe [[first dowel|DowelOneUpDown]] is in the <<$DowelOne>> position, the [[next dowel|DowelTwoUpDown]] is in the <<$DowelTwo>> position, the [[following dowel|DowelThreeUpDown]] is in the <<$DowelThree>> position, the [[final dowel|DowelFourUpDown]] is in the <<$DowelFour>> position.\\n\\n<<if ($DowelOne is 'up') and ($DowelTwo is 'center') and ($DowelThree is 'up') and ($DowelFour is 'up')>>Manipulating the dowels into the correct positions sets a mechanism behind the wall into <<choice [[motion|UnlockAllMechPortcullis]]>>.<<endif>><<if ($DowelOne is 'down') and ($DowelTwo is 'down') and ($DowelThree is 'center') and ($DowelFour is 'up')>>Manipulating the dowels into the correct positions sets a mechanism behind the wall into motion. The floor below your feet begins to <<choice [[tremble|OpenPitTrap]]>>.<<endif>><<if ($DowelOne is 'up') and ($DowelTwo is 'down') and ($DowelThree is 'down') and ($DowelFour is 'center')>>Manipulating the dowels into the correct positions sets a mechanism behind the wall into motion. Dust and gravel being to fall on your head from <<choice [[above|OpenFireTrap]]>>.<<endif>>\\n\\n<<set $RemovedClothes = 'removed'>>",
      "links": [
        {
          "text": "first dowel",
          "destination": {
            "name": "DowelOneUpDown",
            "pid": 14
          }
        },
        {
          "text": "next dowel",
          "destination": {
            "name": "DowelTwoUpDown",
            "pid": 55
          }
        },
        {
          "text": "following dowel",
          "destination": {
            "name": "DowelThreeUpDown",
            "pid": 37
          }
        },
        {
          "text": "final dowel",
          "destination": {
            "name": "DowelFourUpDown",
            "pid": 57
          }
        },
        {
          "text": "motion",
          "destination": {
            "name": "UnlockAllMechPortcullis",
            "pid": 2
          }
        },
        {
          "text": "tremble",
          "destination": {
            "name": "OpenPitTrap",
            "pid": 64
          }
        },
        {
          "text": "above",
          "destination": {
            "name": "OpenFireTrap",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "AboutGreatUniversity",
      "text": "Comparative research by the Great University and a brief review of local lore revealed this as the possible location of 'The Secret Vaults of Kas the Betrayer'.\\n\\nThe story is forgotten legend now, merely an insignificant footnote of the Third Age. However, if the stories are true then the vault must be explored extensively - at once.\\n\\n[[...continue...|InnerSanctum]]",
      "links": [
        {
          "text": "...continue...",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "AboutGoddessLaw",
      "text": "You move to the tapestry, sensually illustrating the Goddess of Law, on the wall. The threads of the aged ornament are surprisingly strong and well preserved for being so old.\\n\\nHowever, there is something odd about this wall covering. The normally sober and refined Lady of The Law is depicted as being voluptuous in this instance.\\n\\nOn closer inspection, her face resembles [[Queen Iderdg|AboutQueenIderdg]] more so than the traditional Goddess with which you are familiar.\\n\\n[[...continue...|InnerSanctum]]",
      "links": [
        {
          "text": "Queen Iderdg",
          "destination": {
            "name": "AboutQueenIderdg",
            "pid": 25
          }
        },
        {
          "text": "...continue...",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "OpenInnerSanctum",
      "text": "<<if $LanternLight eq 'off'>>You approach the recently opened portcullis with extreme caution. The light of your dagger does very little to ward off the darkness enveloping this room.\\n\\nYou let one hand slide along the smooth granite wall while entering the room. After taking several large steps into the darkness you relize it would be far too [[dangerous to continue|EntranceHallway]] without a more substantial source of light.<<endif>>\\n<<if $LanternLight eq 'on'>>Raising the lantern high above your head pierces the darkness enveloping this room. \\n\\nYou stride confidently through the <<$MechPortcullis>> [[portcullis|InnerSanctum]].\\n<<endif>>",
      "links": [
        {
          "text": "dangerous to continue",
          "destination": {
            "name": "EntranceHallway",
            "pid": 22
          }
        },
        {
          "text": "portcullis",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "AboutKingDecree",
      "text": "Through his embarassment and grief, the King outlawed and banished the small band of dwarves who pulled off the heist. Thonkas Magarum was soon known throughout the land as Kas the Betrayer.\\n\\nAttempts to locate the party failed, primarily because of poor villagers being paid for their silence by Kas's crew.\\n\\nThe few reports that did reach the King's court consisted of rumors about a dwarf who split the mountain and built a palace filled with riches before the sunset on a single day.\\n\\n[[...continue...|previous()]]",
      "links": []
    },
    {
      "pid": 33,
      "name": "StoryTitle",
      "text": "The Secret Vaults of Kas the Betrayer",
      "links": []
    },
    {
      "pid": 34,
      "name": "ExamineAlcovePuzzle",
      "text": "<<if $CurrentRune eq 'ice'>>Removing the heavy block from the recessed base, you hear the sound of grates opening, and locking into place.<<endif>><<if $CurrentRune eq 'giant'>>Removing the heavy block from the recessed base, you notice the light of the Main Hall flicker and dim slightly. The entire vault seems eerily quiet.<<endif>><<if $CurrentRune eq 'sun'>>Removing the heavy block from the recessed base, you notice the light of the Main Hall dims suddenly. Looking over your shoulder you notice the hanging gems and crystals are now a dull mixture of light and shadow.<<endif>><<if $CurrentRune eq 'moon'>>Removing the heavy block from the recessed base, you notice the light of the Main Hall dims suddenly. Looking over your shoulder you notice the hanging gems and crystals are now a dull mixture of light and shadow.<<endif>><<if $CurrentRune eq 'wealth'>>Removing the heavy block from the recessed base, you cannot detect a change in the alcove or the Main Hall. The entire vault seems eerily quiet.<<endif>><<if $CurrentRune eq 'ocean'>>Removing the heavy block from the recessed base, you hear the sound grates opening and a strong wind howling through the vaults.<<endif>>\\n\\nThe top of the [[rune block|RuneBlock]] in your hands shows the ancient Dwarven rune for '<<$CurrentRune>>'. You think carefully before placing the rune back into position.",
      "links": [
        {
          "text": "rune block",
          "destination": {
            "name": "RuneBlock",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "OpenGatehouse",
      "text": "You put the full extent of your strength into pulling on the leather strap in an attempt to open the wooden door. With ease, the door slides down and embeds itself into the stone floor.\\n\\nSomewhere in the dark hallways beyond a slamming sound is heard which echos throughout the vaults.\\n\\nYour vision is severely limited. Without a torch, you creep through the halls feeling your way along. Opening the door does not reveal what is beyond the threshold - stepping into the [[dark room|Gatehouse]] might... \\n\\n<<set $SlidingDoor1 = 'open'>>\\n<<set $SlidingDoor4 = 'closed'>>\\n",
      "links": [
        {
          "text": "dark room",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "RevealAlcove",
      "text": "A narrow door receded into the floor, revealing a tiny room. The alcove is paneled with an ornate scene made of carved wood. The mural depicts a stout Dwarf holding a large block covered in runes.\\n\\nLight beams eminating from the rune block fill the scene. Several strips of shiny metal emboss some of the light beams. A similar strip of metal is curved, and hangs from the Dwarf's belt in the shape of a [[large pick|AboutTreasure]].\\n\\n[[...continue...|Alcove]]\\n\\n<<set $StatuesPuzzle = 'solved'>>\\n",
      "links": [
        {
          "text": "large pick",
          "destination": {
            "name": "AboutTreasure",
            "pid": 38
          }
        },
        {
          "text": "...continue...",
          "destination": {
            "name": "Alcove",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "DowelThreeUpDown",
      "text": "<<if $DowelThree eq \"up\">>\\nTaking the third dowel in your grasp, you move it [[to the center|RemoveClothes][$DowelThree = \"center\"]].\\n\\n<<else if $DowelThree eq \"center\">>\\nThe third dowel will move either [[up|RemoveClothes][$DowelThree = \"up\"]] or [[down|RemoveClothes][$DowelThree = \"down\"]], nowhere else.\\n\\n<<else if $DowelThree eq \"down\">>\\nAt first it appears stuck, but the third dowel finally moves [[to the center|RemoveClothes][$DowelThree = \"center\"]].\\n\\n<<endif>>",
      "links": [
        {
          "text": "to the center",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        },
        {
          "text": "up",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        },
        {
          "text": "down",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "AboutTreasure",
      "text": "While Kas the Betrayer stole many irreplaceable valuables from the royal family of his day - the only item the Great University has interest in retrieving is the Solid Quicksilver Miner's Pick of Legendary Dwarf Mason Glorgrim Morgyth.\\n\\n[[...continue...|previous()]]",
      "links": []
    },
    {
      "pid": 39,
      "name": "Gatehouse",
      "text": "<<if $LanternLight eq 'off'>>You raise your enchanted dagger and allow the glowing steel to enhance your vision - if only slightly. In the faint light of the glowing dagger you scan the floor and walls carefully. <<endif>>\\n\\nThe room is sparsely furnished with items befitting a captain of the guard. The walls are smooth granite, clearly carved by master masons. This room is all the further those who [[discovered|AboutDiscovery]] the vaults were able to explore.\\n\\nIn the center of the room a large [[oaken desk|ExamineDesk]] sits undisturbed. Along the western wall a row of thick leather coats and blacksmithing aprons hangs on [[wooden dowels|ExamineDowelsPuzzle]]. One of the dowels appears empty.\\n\\nA [[bunk bed|ExamineBunkbed]] is placed squarely in one corner. The southern wall is home to a large [[bookshelf|ExamineBookshelf]] filled with a guard's watch logs and ledgers.\\n\\n<<if $LanternLight eq 'on'>><<if $Inkwell eq 'used'>>The inkwell keeps the ornate compass supressed, leaving the [[bookshelf|MainHall]] open to the Main Hall.<<else if $Inkwell eq 'inkwell'>>In the dancing light of the lantern you notice an arc worn and scraped into the stone floor at the base of the [[bookshelf|RevealBookshelf]].<<endif>> You can also clearly see the [[entire room|Gatehouse]], and the door out to the [[hallway|EntranceHallway]].\\n<<endif>>",
      "links": [
        {
          "text": "discovered",
          "destination": {
            "name": "AboutDiscovery",
            "pid": 43
          }
        },
        {
          "text": "oaken desk",
          "destination": {
            "name": "ExamineDesk",
            "pid": 56
          }
        },
        {
          "text": "wooden dowels",
          "destination": {
            "name": "ExamineDowelsPuzzle",
            "pid": 61
          }
        },
        {
          "text": "bunk bed",
          "destination": {
            "name": "ExamineBunkbed",
            "pid": 15
          }
        },
        {
          "text": "bookshelf",
          "destination": {
            "name": "ExamineBookshelf",
            "pid": 65
          }
        },
        {
          "text": "bookshelf",
          "destination": {
            "name": "MainHall",
            "pid": 6
          }
        },
        {
          "text": "bookshelf",
          "destination": {
            "name": "RevealBookshelf",
            "pid": 18
          }
        },
        {
          "text": "entire room",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        },
        {
          "text": "hallway",
          "destination": {
            "name": "EntranceHallway",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "OpenPraisePortalTrap",
      "text": "All of the statues have their hands raised high above their heads in praise. A strong breeze fills the chamber, knocking over ancient paintings and other ornaments. \\n\\nHigh above your head, in the center of the ceiling, a glowing orb appears. It pulsates and grows with the rising wind.\\n\\nThe force of the gale knocks you off your feet, and carries you into the air like a helpless leaf. Higher and higher you rise, until you are thrust toward the disc of blue light.\\n\\nYou are swallowed by the magical portal which collapses as the trap resets itself.\\n\\n<center>T H E &nbsp;&nbsp; E N D</center>",
      "links": []
    },
    {
      "pid": 41,
      "name": "HoodedStatueAlter",
      "text": "<<if $HoodedStatue eq \"praising\">>\\nThe uplifted arms praise the Hooded Figure's diety. You pull one arm down and create a [[blessing|AlterStatues][$HoodedStatue = \"blessing\"]] gesture.\\n\\n<<else if $HoodedStatue eq \"blessing\">>\\nOne of the Hooded Figure's arms is lifed high to receive it's dieties power, the Hooded Figure's hand is held out to bless the faithful. Lifting it's low hand allows the Hooded  Figure to [[praise|AlterStatues][$HoodedStatue = \"praising\"]]. But pulling the two arms into it's chest displays a Hooded Figure deep in [[prayer|AlterStatues][$HoodedStatue = \"praying\"]].\\n\\n<<else if $HoodedStatue eq \"praying\">>\\nThe Hooded Figure is deep in prayer, both hands pressed together at it's chest. It can [[bless|AlterStatues][$HoodedStatue = \"blessing\"]] followers by extending one arm to it's diety, and leveling the other to it's followers. Still, the Hooded Figure may want to make an [[offering|AlterStatues][$HoodedStatue = \"offering\"]] at this time.\\n\\n<<else if $HoodedStatue eq \"offering\">>\\nLowered in a sign of surrender, the Hooded Figure holds out an offering. Lifting it's hands to it's chest, and pressing them together, it begins [[praying|AlterStatues][$HoodedStatue = \"praying\"]].\\n\\n<<endif>>",
      "links": [
        {
          "text": "blessing",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "praise",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "prayer",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "bless",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "offering",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "praying",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "OpenTapestryTreasure",
      "text": "Lacking a proper lock, you assume there was little value to the contents. However, you are quite surprised upon opening the chest to find forty gold pieces and a polished Dwarven Waraxe.\\n\\n[[...continue...|InnerSanctum]]\\n\\n<<set $UnlockTreasure = 'accquired'>>\\n",
      "links": [
        {
          "text": "...continue...",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "AboutDiscovery",
      "text": "Four guards were sent to investigate an ornately carved stone doorway revealed on the face of the granite wall. They were able to pry the stone entry open just enough to slip through.\\n\\nDuring their preliminary search a map was found in a room off the hallway they explored. The room resembled a gatehouse or officer's quarters the guards stated.\\n\\n[[...continue...|previous()]]",
      "links": []
    },
    {
      "pid": 44,
      "name": "AlterStatues",
      "text": "Examining the statue's shoulders and elbows more closely you see they are hinged. It is clear the arms are adjustable.\\n\\nThe [[King|KingStatueAlter]] statue appears to be <<$KingStatue>>, while the [[Queen's|QueenStatueAlter]] arms are <<$QueenStatue>>. On the other side of the room a [[Dwarf|DwarfStatueAlter]] is <<$DwarfStatue>>. The [[Hooded|HoodedStatueAlter]] figure appears to be <<$HoodedStatue>>.\\n\\n<<if ($KingStatue is 'praising') and ($QueenStatue is 'praising') and ($HoodedStatue is 'praying') and ($DwarfStatue is 'offering')>>As the statue's arm moves into position, a narrow door recedes into the floor. Glancing into the opening, you see a [[tiny room|RevealAlcove]] is revealed.<<endif>><<if ($KingStatue is 'blessing') and ($QueenStatue is 'praying') and ($HoodedStatue is 'praying') and ($DwarfStatue is 'praying')>>As the statue's arm moves into position, you notice a glint of light dance across its [[marble eyes|OpenLivingStatueTrap]].<<endif>><<if ($KingStatue is 'offering') and ($QueenStatue is 'offering') and ($HoodedStatue is 'blessing') and ($DwarfStatue is 'praising')>>As the statue's arm moves into position, the statues all begin moving on their own with the precision of [[soldiers|OpenPraisePortalTrap]].<<endif>><<if ($KingStatue is 'praising') and ($QueenStatue is 'praising') and ($HoodedStatue is 'praising') and ($DwarfStatue is 'praising')>>As the statue's arm moves into position, you stand back to observe the [[configuration|OpenPraisePortalTrap]].<<endif>>",
      "links": [
        {
          "text": "King",
          "destination": {
            "name": "KingStatueAlter",
            "pid": 59
          }
        },
        {
          "text": "Queen's",
          "destination": {
            "name": "QueenStatueAlter",
            "pid": 21
          }
        },
        {
          "text": "Dwarf",
          "destination": {
            "name": "DwarfStatueAlter",
            "pid": 16
          }
        },
        {
          "text": "Hooded",
          "destination": {
            "name": "HoodedStatueAlter",
            "pid": 41
          }
        },
        {
          "text": "tiny room",
          "destination": {
            "name": "RevealAlcove",
            "pid": 36
          }
        },
        {
          "text": "marble eyes",
          "destination": {
            "name": "OpenLivingStatueTrap",
            "pid": 5
          }
        },
        {
          "text": "soldiers",
          "destination": {
            "name": "OpenPraisePortalTrap",
            "pid": 40
          }
        },
        {
          "text": "configuration",
          "destination": {
            "name": "OpenPraisePortalTrap",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "AboutGraniteWall",
      "text": "Earthquakes have been reported in a region south of Aberaeron. A landslide has cleared large swaths of land away from a massive granite wall once buried deep under the hillside. This granite wall is merely the edge of the much greater Highwall Peaks mountain range.\\n\\nOn the edge of the granite wall the entrance to a vault has been reported to the Great University Exploration Committee. \\n\\nYou were \"recruited\" (pressed into service) to secretly head to the vaults at once. Discover what you can and report back to the Brotherhood of the Gloved Hand.\\n\\nShould you happen across the Solid Quicksilver Miner's Pick - you are instructed to do all within your power to obtain the enchanted item, and return it as well.\\n\\n[[...continue...|previous()]]",
      "links": []
    },
    {
      "pid": 46,
      "name": "AboutRevolt",
      "text": "Still angry and fueled by bloodlust, Thonkas stormed the deep mountain vaults his people had labored to fill for the insatiable Queen, and crushed every stone door in his path. \\n\\nEnlisting the help of several disgruntled drawves, the small band of theives made off with an untold amount of treasure intended for the royal coffers.\\n\\n[[...continue...|Gatehouse]]",
      "links": [
        {
          "text": "...continue...",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "InnerSanctum",
      "text": "When ornamenting the ideal space for passing time, relaxation, planning, and private entertaining - the master of this hall certainly took care in this space. The Inner Sanctum is clearly a place only the most trusted visitors, dignitaries, and emissaries ever breached.\\n\\n<<if $MechPortcullis eq 'lowered'>>One end of the chamber is blocked by a tightly secured, <<$MechPortcullis>> portcullis. Nearby there are deep leather chairs and benches for sitting.<<else if $MechPortcullis eq 'raised'>>Near the <<$MechPortcullis>> [[portcullis|BackToEntranceHallway]] are deep leather chairs and benches for sitting.<<endif>> Small tables are within easy reach so goblets of fine wine might be set down and grasped once again with ease.\\n\\nA tapestry of a [[Goddess of Law|AboutGoddessLaw]] hangs from the west wall. Another tapestry has fallen off the opposite wall into a <<if $UnlockTreasure eq 'accquired'>>bundle<<else if $UnlockTreasure eq 'hidden'>>[[bundle|RevealTapestryTreasure]]<<endif>> on the floor. Several pieces of spoiled meat are scattered throughout the room.\\n\\nLarge squared tables fit into the room snuggly. One table displaying a [[massive map|AboutBattleMap]] burned with care into a heavy leather hide. Along it's sides are several nets holding figurines for planning battle strategy. \\n\\nThe other table is etched with several ancient game boards on the surface. Between the tables, a massive door rests slightly [[ajar|MainHall]]. Several comfortable chairs surround the game table. Opening the silver knobbed drawers reveals hidden gaming pieces.\\n\\nA [[narrow slit|OpenPrivateChambers]] in the far wall likely served as Kas the Betrayer's attendant's passage.",
      "links": [
        {
          "text": "portcullis",
          "destination": {
            "name": "BackToEntranceHallway",
            "pid": 19
          }
        },
        {
          "text": "Goddess of Law",
          "destination": {
            "name": "AboutGoddessLaw",
            "pid": 30
          }
        },
        {
          "text": "bundle",
          "destination": {
            "name": "RevealTapestryTreasure",
            "pid": 53
          }
        },
        {
          "text": "massive map",
          "destination": {
            "name": "AboutBattleMap",
            "pid": 4
          }
        },
        {
          "text": "ajar",
          "destination": {
            "name": "MainHall",
            "pid": 6
          }
        },
        {
          "text": "narrow slit",
          "destination": {
            "name": "OpenPrivateChambers",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "UniversityEnding",
      "text": "Wielding the great power of the Solid Quicksilver Miner's Pick of Legendary Dwarf Mason Glorgrim Morgyth fills you with a surge of energy.\\n\\nYou slither out of the secret nook in which Kas the Betrayer hid the instrument so long ago. It is said the pick is enchanted with the power to literally seperate and shape stone to the wielder's will.\\n\\nReaching into the backpack you obtained in the Gatehouse, you wrap the miner's pick in the two large sacks. The item sticks out of the backpack as you leave the vault behind.\\n\\nSlipping through the night, you pass the Explorers sent by the University. Little do they know you will be enjoying the rewards offered by the Royal Family for a mission accomplished successfully!\\n\\n<center>T H E &nbsp;&nbsp; E N D</center>",
      "links": []
    },
    {
      "pid": 49,
      "name": "TakeMinersPick",
      "text": "You reach out and grasp the Legendary Miner's Pick. The glistening solid metal surface ripples and flows as if it were a pool of water.\\n\\nAs you consider all Kas the Betrayer went through to obtain the powerful enchanted artifact, you consider keeping the relic for <<choice [[yourself|YourselfEnding]]>>.\\n\\nOn the otherhand, the tragic events allowing Kas to acquire the pick should be laid to rest by returning the powerful instrument to the <<choice [[rightful owner|UniversityEnding]]>>.\\n\\nStill, it was under direct order of the <<choice [[Brotherhood|BrotherhoodEnding]]>> that you took on this quest in the first place. Who are you to meddle with the guild's future plans?\\n\\n",
      "links": [
        {
          "text": "yourself",
          "destination": {
            "name": "YourselfEnding",
            "pid": 9
          }
        },
        {
          "text": "rightful owner",
          "destination": {
            "name": "UniversityEnding",
            "pid": 48
          }
        },
        {
          "text": "Brotherhood",
          "destination": {
            "name": "BrotherhoodEnding",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "MainHallToInnerSanctum",
      "text": "Leaving the massive great hall, you walk along the [[wide hall|InnerSanctum]] to the Inner Sanctum.",
      "links": [
        {
          "text": "wide hall",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "AboutGlorgrimMorgyth",
      "text": "The personal journal of Thonkas Magarum - better known as Kas the Betrayer - records memories of his once revered teacher Glorgrim Morgyth.\\n\\nIt is said that Legendary Dwarf Mason Glorgrim Morgyth had his solid quicksilver pick enchanted as well. The power to literally seperate and shape stone to the wielder's will was said to be how Glorgrim first gained the attention of Queen Iderdg.\\n\\n[[...continue...|previous()]]",
      "links": []
    },
    {
      "pid": 52,
      "name": "OpenBookshelf",
      "text": "As you place the inkwell on the ornate compass, they both slowly sink under the weight of the object.\\n\\nThe southern wall shakes once, then moans loudly. You freeze immediately and gaze at the slowly moving bookshelf. \\n\\nThe wall opens, grinding against the ancient stone floor, to reveal a [[secret hallway|MainHall]].\\n\\n[[...continue...|MainHall]]\\n\\n<<set $Inkwell = 'used'>>\\n<<set $Bookshelf = 'open'>>\\n",
      "links": [
        {
          "text": "secret hallway",
          "destination": {
            "name": "MainHall",
            "pid": 6
          }
        },
        {
          "text": "...continue...",
          "destination": {
            "name": "MainHall",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "RevealTapestryTreasure",
      "text": "You notice something interesting beneath the tapestry crumpled on the floor. Striding over to the tapestry you examine the area closely.\\n\\nBelow the tapestry sits a large [[iron chest|OpenTapestryTreasure]].\\n\\n[[...continue...|InnerSanctum]]",
      "links": [
        {
          "text": "iron chest",
          "destination": {
            "name": "OpenTapestryTreasure",
            "pid": 42
          }
        },
        {
          "text": "...continue...",
          "destination": {
            "name": "InnerSanctum",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "AboutPlayer",
      "text": "You are a Thief from the Brotherhood of the Gloved Hand, sent ahead of a band of University Explorers attempting to retrieve the [[Quicksilver|AboutQuicksilver]] Miner's Pick. The Brotherhood discovered the secret mission and wants you to arrive first, and obtain the powerful artifact.\\n\\nThe Royal Family also requests the item be returned immediately upon acquisition. They would like to finally put an end to anyone's ability to pick their deep pockets by chiseling through the royal vaults with such ease.\\n\\nThe Brotherhood has other plans.\\n\\n[[...continue...|previous()]]",
      "links": [
        {
          "text": "Quicksilver",
          "destination": {
            "name": "AboutQuicksilver",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "DowelTwoUpDown",
      "text": "<<if $DowelTwo eq \"up\">>\\nTaking ahold of the dowel firmly, you move the second dowel [[to the center|RemoveClothes][$DowelTwo = \"center\"]].\\n\\n<<else if $DowelTwo eq \"center\">>\\nSliding the second dowel along its grooved path you consider either the [[up|RemoveClothes][$DowelTwo = \"up\"]] or [[down|RemoveClothes][$DowelTwo = \"down\"]] position.\\n\\n<<else if $DowelTwo eq \"down\">>\\nWith little effort the second dowel slides [[to the center|RemoveClothes][$DowelTwo = \"center\"]].\\n\\n<<endif>>",
      "links": [
        {
          "text": "to the center",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        },
        {
          "text": "up",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        },
        {
          "text": "down",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "ExamineDesk",
      "text": "You approach the desk in the center of the room and begin to search the contents. Although you undertake a thorough search, the desk yields nothing of importance.\\n\\nExcept perhaps the antiquated inkwell which could fetch a small amount of gold at the market. When you pocket the item, as any good thief would, you notice it's substantial weight.\\n\\nAs you move away from the desk your foot bumps a [[small brass lantern|TakeLantern]] at rest on the floor. You had not noticed the object while being so focused on the room's center piece.\\n\\n[[...continue...|Gatehouse]]\\n\\n<<set $Inkwell = 'inkwell'>>\\n",
      "links": [
        {
          "text": "small brass lantern",
          "destination": {
            "name": "TakeLantern",
            "pid": 63
          }
        },
        {
          "text": "...continue...",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "DowelFourUpDown",
      "text": "<<if $DowelFour eq \"up\">>\\nWith considerable effort you move the fourth dowel [[to the center|RemoveClothes][$DowelFour = \"center\"]].\\n\\n<<else if $DowelFour eq \"center\">>\\nFrom this position, the fourth dowel can move either [[up|RemoveClothes][$DowelFour = \"up\"]] or [[down|RemoveClothes][$DowelFour = \"down\"]].\\n\\n<<else if $DowelFour eq \"down\">>\\nReturning the fourth dowel [[to the center|RemoveClothes][$DowelFour = \"center\"]] is easy.\\n\\n<<endif>>",
      "links": [
        {
          "text": "to the center",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        },
        {
          "text": "up",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        },
        {
          "text": "down",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "PrivateChambers",
      "text": "Light shines into the room from a chute above. Perhaps a refracting crystal capping the top draws light into this deep chamber the same way it is accomplished on ships.\\n\\nThe opulent furniture, fixtures, and paintings in the room clearly indicate this to be the private chamber of Kas the Betrayer. The six walls of the chamber have been embedded with five [[glowing runes|AboutChamberRunes]].\\n\\n<<if $CurrentRune eq 'wealth'>>The wall once covered in cave moss has opened to reveal [[a hole|QuicksilverNook]] the size of a tavern window. A slick puddle of green cave moss has pooled on the floor below the nook.<<else if ($CurrentRune eq 'ice') or ($CurrentRune eq 'giant') or ($CurrentRune eq 'sun') or ($CurrentRune eq 'moon') or ($CurrentRune eq 'ocean')>>One wall is partially coated with a flow of green cave moss which oozes like slime.<<endif>> Each rune is set around the room at equal distance, one on each wall. <<if ($CurrentRune eq 'ice') or ($CurrentRune eq 'giant') or ($CurrentRune eq 'sun') or ($CurrentRune eq 'moon') or ($CurrentRune eq 'ocean')>>The rune symbolizing '<<$CurrentRune>>' glows more brightly than the others.<<endif>>\\n\\nAmid the personal effects in the private chamber is a bed fit for a king. On a large <<if $GiantNecklace eq 'worn'>>storage chest<<else if $GiantNecklace eq 'hidden'>>[[storage chest|InsideKasChest]]<<endif>> sits a [[thick journal|AboutGlorgrimMorgyth]].\\n\\nAt any time you know you can return to the [[Inner Sanctum|ChambersToInnerSanctum]] through the narrow passage.",
      "links": [
        {
          "text": "glowing runes",
          "destination": {
            "name": "AboutChamberRunes",
            "pid": 12
          }
        },
        {
          "text": "a hole",
          "destination": {
            "name": "QuicksilverNook",
            "pid": 3
          }
        },
        {
          "text": "storage chest",
          "destination": {
            "name": "InsideKasChest",
            "pid": 8
          }
        },
        {
          "text": "thick journal",
          "destination": {
            "name": "AboutGlorgrimMorgyth",
            "pid": 51
          }
        },
        {
          "text": "Inner Sanctum",
          "destination": {
            "name": "ChambersToInnerSanctum",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 59,
      "name": "KingStatueAlter",
      "text": "<<if $KingStatue eq \"praising\">>\\nThe uplifted arms praise the King's diety. You pull one arm down and create a [[blessing|AlterStatues][$KingStatue = \"blessing\"]] gesture.\\n\\n<<else if $KingStatue eq \"blessing\">>\\nOne of the King's arms is lifed high to receive his dieties power, the other hand is held out to bless the faithful. Lifting his low hand allows the King to [[praise|AlterStatues][$KingStatue = \"praising\"]]. But pulling the two arms into his chest displays a King deep in [[prayer|AlterStatues][$KingStatue = \"praying\"]].\\n\\n<<else if $KingStatue eq \"praying\">>\\nThe King is deep in prayer, both hands pressed together at his chest. He can [[bless|AlterStatues][$KingStatue = \"blessing\"]] followers by extending one arm to his diety, and leveling the other to his followers. Still, the King may want to make an [[offering|AlterStatues][$KingStatue = \"offering\"]] at this time.\\n\\n<<else if $KingStatue eq \"offering\">>\\nLowered in a sign of surrender, the King holds out an offering. Lifting his hands to his chest, and pressing them together, he begins [[praying|AlterStatues][$KingStatue = \"praying\"]].\\n\\n<<endif>>",
      "links": [
        {
          "text": "blessing",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "praise",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "prayer",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "bless",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "offering",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "praying",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 60,
      "name": "ExamineStatuePuzzle",
      "text": "The Brotherhood's catalogs include many strange and archaic mechanisms. None of the tomes described statues like these.\\n\\nTheir arms are set in various gestures. You notice smooth, rounded edges at the shoulders and elbows.\\n\\nWhispered legends among theives tell of a set of figures which can [[control|AlterStatues]] their surroundings by commanding the dieties.\\n\\nThe risk of altering the statues to your detriment is more likely than successfully unlocking the mechanism. Perhaps these statues should be [[left alone|MainHall]].",
      "links": [
        {
          "text": "control",
          "destination": {
            "name": "AlterStatues",
            "pid": 44
          }
        },
        {
          "text": "left alone",
          "destination": {
            "name": "MainHall",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 61,
      "name": "ExamineDowelsPuzzle",
      "text": "The empty wooden dowel appears like it's neighbors. At rest in the center of a groove which extends above and below the dowel. The rungs are all well worn from use.\\n\\nThe past several years training under the [[Brotherhood|AboutPlayer]] were not spent in vain. You immediately recognize a portion of the complicated locking system known as a Halfendish's Gambit on the wall.\\n\\nThe problem will be to determine the [[sequence|RemoveClothes]] for this specific lock without triggering a trap. The risk is likely far greater than the reward, and the mechanism might be better [[left alone|Gatehouse]].\\n\\n\\n",
      "links": [
        {
          "text": "Brotherhood",
          "destination": {
            "name": "AboutPlayer",
            "pid": 54
          }
        },
        {
          "text": "sequence",
          "destination": {
            "name": "RemoveClothes",
            "pid": 28
          }
        },
        {
          "text": "left alone",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 62,
      "name": "StoryAuthor",
      "text": "A.E. Jackson",
      "links": []
    },
    {
      "pid": 63,
      "name": "TakeLantern",
      "text": "Righting the small brass lantern, you set it upon the desk. The sound of oil sloshing inside is like music to your ears.\\n\\nThe lantern is <<print $LanternLight>>.\\n\\n<<if $LanternLight eq 'off'>>\\n<<if $Flint eq 'none'>>\\n  You are [[unable|Gatehouse]] to light the lantern at this time.\\n  <<else if $Flint eq 'flint'>>\\n  You attempt to [[light|TakeLantern][$LanternLight = 'on']] the lantern with the flint and tinder.\\n  <<endif>>\\n<<else if $LanternLight eq 'on'>>In the dancing light of the lantern you notice an arc worn and scraped into the stone floor at the base of the [[bookshelf|RevealBookshelf]]. You can also clearly see the [[entire room|Gatehouse]], and the door out to the [[hallway|EntranceHallway]].\\n<<endif>> ",
      "links": [
        {
          "text": "unable",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        },
        {
          "text": "light",
          "destination": {
            "name": "TakeLantern",
            "pid": 63
          }
        },
        {
          "text": "bookshelf",
          "destination": {
            "name": "RevealBookshelf",
            "pid": 18
          }
        },
        {
          "text": "entire room",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        },
        {
          "text": "hallway",
          "destination": {
            "name": "EntranceHallway",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 64,
      "name": "OpenPitTrap",
      "text": "As your legs begin to shake violently, your knees buckle, and you tumble to the ground. \\n\\nThe ancient stone floor splits in two at the center, falling away below you, and crashing against the pit walls. \\n\\nYou fall, screaming, into a dark pit riddled with sharp pikes. \\n\\nLooking up at the hole you notice the stone panels are already lifting back into position. The trap has been set once again.\\n\\n<center>T H E &nbsp;&nbsp; E N D</center>",
      "links": []
    },
    {
      "pid": 65,
      "name": "ExamineBookshelf",
      "text": "You stride over to the large bookshelf and pluck a log from one of the lower shelves. Your fingers graze the dusty surface and your eyes scan the words printed there.\\n\\nAmong the notes and ledgers you learn a bit more about the small band of outlaws who accompanied the infamous [[Dwarven Engraver Thonkas Magarum|AboutThonkasMagarum]].\\n\\nIt seems once the band of dwarves were sealed in the vaults, little more than monotonous daily rituals took place. These ledgers and logs record every shift change, meal prepared, and slight infection the outcasts encountered.\\n\\nThe guard's watch logs carry on for years, until one passage indicates Thonkas stopped the formalities that Dwarven custom dictates. He declared the group disbanded and simply allowed the dwarves to live on here, or leave, of their own free will.\\n\\n[[...continue...|Gatehouse]]\\n",
      "links": [
        {
          "text": "Dwarven Engraver Thonkas Magarum",
          "destination": {
            "name": "AboutThonkasMagarum",
            "pid": 1
          }
        },
        {
          "text": "...continue...",
          "destination": {
            "name": "Gatehouse",
            "pid": 39
          }
        }
      ]
    }
  ]
}