{
  "passages": [
    {
      "pid": 1,
      "name": "Prologue",
      "text": "You think about that <a href=\"javascript:void(0)\" id='prologue_1'>night</a> often.\n<% if (localStorage.getItem('dgtzieatransientskies') !== null) { %>\n[[(skip prologue)->Starry Sky]]\n<% } %>\n\n[\nYou were sitting at the edge of the cliffside where you'd spent so many nights -- weeks now -- deep in contemplation, when you noticed <b>Doranin</b>, your village elder, was beside you.\n\nHow long has she been there?  She nods to you, then the sky.  \n\n\"Go, child,\" She intones. \"Apply. You are brave. Resourceful.  Curious. Diplomatic. You will get in. You will get a ship. And you will go, go away from this world.\"\n\n<a href=\"javascript:void(0)\" id='prologue_2'>\"But the village...\"</a>\n]{-#prologue_psg_1}\n[\n<b>\"But the village, our people...\"</b> you protest, but even you could hear the weakness in your voice.\n\n<b>Doranin</b> shakes her head. \"The village doesn't matter. None of us matter.\"  \n \nAnd she sweeps her hand outwards, at the glittering stars and the expanse of neon-green sky in front of the both of you. \"What matters is out there; out there is where we would've belonged, if things had been different. There is nothing for us down here, least of all each other. We band together to survive, but our true purpose is to expand outwards.\"\n\nHer tone grows stern. \"You know this.  It is why everything is the way it is, now. We are too restless a people for too small a planet.\"\n\n<a href=\"javascript:void(0)\" id='prologue_3'>\"So I should look for other planets...\"</a>\n]{-#prologue_psg_2}\n[\n<b>\"So I should look for other planets for us to live on?\"</b> you ask, brow furrowed. \"But our space explorers haven't found anything out there, except more conflict. And now the galactic federation doesn't want us to go anywhere anymore... And a cure - we still haven't-\"\n\n\"No, no. There is no future for us. You will be the last generation. Do not let a single planet tether you to a fate when there are so many other places, other stars, and other skies out there to see. Join up with our space program, get your license and your training. But the only real way out is if you show <i>them</i> you have no ties here.\"\n\n\"Galactic spacefaring, you mean?\" you ask tentatively.\n\n\"You know that's what is in your heart. All I ask is that you carry us forward, outward, as far as you can.\"\n\nYou want to say something, but there is nothing. You only nod.\n\n\"Tomorrow, say your goodbyes. And then let go of us, and all that keeps you rooted. And just take it all in, out there - you will be our civilization's last overreach.\" \n\n<b>Doranin</b> leaves.  \n\nAnd you look up.\n\nAnd the <a href=\"javascript:void(0)\" data-passage=\"Starry Sky\">sky</a> draws you in.\n]{-#prologue_psg_3}\n\n<% if (2 < 1) { %>\n[[sky->Starry Sky]]\n<% } %>\n<%\n$(function () {\ndocument.global.showNextPsg('#prologue_1', '#prologue_psg_1', false);\ndocument.global.showNextPsg('#prologue_2', '#prologue_psg_2');\ndocument.global.showNextPsg('#prologue_3', '#prologue_psg_3');\n});\n%>",
      "links": [
        {
          "text": "(skip prologue)",
          "destination": {
            "name": "Starry Sky",
            "pid": 181
          }
        },
        {
          "text": "sky",
          "destination": {
            "name": "Starry Sky",
            "pid": 181
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "No Fuel",
      "text": "You look down at the altimeter, and bite your lip.  Your hands are getting sore from how tightly you're gripping them, but you ignore that, and <a href=\"javascript:void(0)\" id='nf_1'>focus</a> on the task at hand: not dying!\n\n[\nThis planet's high, erratic, winds are batting your ship around, and there's no visibility through the hazy red clouds which filter sunlight through, bathing the cockpit in an eerie blood red.  It's making it hard to see the surface, so you're relying on your nav equipment, flying mostly blind.\n\nMaybe it wasn't a good idea trying to land <a href=\"javascript:void(0)\" id='nf_2'>here</a> after all.\n]{-#nf_psg_1}\n\n[\nBut this planet's rocky interior holds promise of the resources you need. And you hate skipping planets.  Even though it's been a painstaking process, there's a compulsion in you to visit every life-supporting or mineral-rich planet on your route.  \n\nBecause you know you're not going to ever come back this way, and no one else should be coming either, not for a long while, anyway.\n\nYou burst through the clouds, and see the surface below you.  Okay.  You can <a href=\"javascript:void(0)\" data-passage=\"Landing First Planet\">land</a> this.\n]{-#nf_psg_2}\n\n<% if (2 < 1) { %>\n[[land->Landing First Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.showNextPsg('#nf_1', '#nf_psg_1', false);\ndocument.global.showNextPsg('#nf_2', '#nf_psg_2', false);\ndocument.global.showNextPsg('#nf_3', '#nf_psg_3', false);\n});\n%>",
      "links": [
        {
          "text": "land",
          "destination": {
            "name": "Landing First Planet",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "Untitled Passage",
      "text": "\nglowing\nneon\ndripping\ntowering\njagged\npulsating\ndulled\nwavering\n\nair is ____\n\nthick\nhard to breathe\nthin \nswirling around you\nhazy\nchill\nserene\nmenacing\n\ndusty\ngrassy\nhazy\nmud-covered\narctic\nbone dry\nrocky\n\ntundras\nmeadows\ndeserts\njungles\nfields\nmountains\n\nbrush\nflowers\nprotruding vines\nseagrass\nfields of moss\nspindleweed\nspikey bushes\nhostile trees\n\nazure\nteal\nsea green\nhazel\nindigo\nmagenda\nsienna\ncharcoal\nivory\ngolden\ncrimson\nolive\n\nfly\namble\ncharge\ngallop\ncrawl\ndash\ntraipse\n\n___ about\n\nrock\nsandstone\nobsidian\ncrystal\ngranite\nice\n\nshellbacked\nfurry\nslimy\nchittering\nlanguid\nscalebound\nblocky\n\none\ntwo\nfour\nsix\neight\ntwenty-four\nforty-two\n\n____ feet tall.\n\nhorns\ntentacles\nspikes\npincers\nfeelers\nbarbs\nshells\nclaws\n\non its face\nback\ntail\nneck\nlegs\narms\nstomach\n\nspace cows.\n\nFIrst planet crash land.  Need to find resources, trade, to get off.\n\nHostile planet.  Survive!\n\nBoring Planet.\n\nFind a cat!\n\nBoring planet.\n\nTrade planet; cities.\n\nCycle thru four boring planets.\n\nfifth planet: going thru motions.\n\nStuck.  More options.  Waiting...  Aging.\n\nStay and build options.\n\nGo home?\n\nKeep going?\n\nSettle.\n\nenvironmental hazards\n\nhave to keep moving, your suit.\n\nexpectations.\n\nlet down.\n\nfrustration.\n\nrunning out of time; aging; progress;\n\nhopes.\n\ntranquility.\n\nboredom.\n\nOnward Skies\nNo One Sky\nUnbound Skies\nBeckoning Skies\nAeon Skies\n\niron\nzinc\nberyllium \nHafnium\nZircon\nColumbite\nMolybdenum\nCobalt\nColtan\nTantalite\nPanguite\nDavisite \n",
      "links": []
    },
    {
      "pid": 4,
      "name": "Landing First Planet",
      "text": "The surface comes closer into view. Flat fields of fuchsia grass: good. That helps.\n\nYou point the ship towards a promising spot, focus in as you continue your descent, try to use the lower level gravity on this planet to your advantage.\n\nA herd of quadrupedal creatures, squalid and thin, scatter as you come closer.\n\nFinally, you touch down hard, the landing gears at the front taking a bigger brunt of the impact than normal. But you're down. You're here.\n\nTaking a few moments, taking a breath, you take one more look at the displays, power down the ship, double check your suit, and step <b>[[out->First Planet]]</b> onto <b><%= _.s.firstPlanet %></b> and survey the scene.",
      "links": [
        {
          "text": "out",
          "destination": {
            "name": "First Planet",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "First Planet",
      "text": "<%\n_.s.visitedPlanetsOverall++;\n_.s.visitedPlanets++;\n%>\n\n<h1><%= _.s.firstPlanet %></h1>\n\n<i>The winds that caused you trouble landing are just as harsh down on the surface. They sweep through the fields of fuchsia grass and swirl spores and debris all around you. Thankfully, this area is quite marshy, or else dust being kicked up would be a bigger issue.</i>\n\nThe herd of <a href=\"javascript:void(0)\" id=\"scan_1pc1\">creatures</a> you saw before are a ways away now.  They regard you wearily. They don't seem immediately hostile to your presence.\n\n[\n<span class=\"added_text\">You focus the scanner in your navvisor on the creatures, and a couple moments later their data is added to your ship's database.</span>\n]{-#scanned_1pc1}\n\nYou consult your navvisor; there's a greater concentration of minerals coming from the east. Looking in that direction, you can see taller tree-like plants and elevated swells of land.\n\n<a href=\"javascript:void(0)\" data-passage=\"Explore First Planet\">Explore</a>\n\n<% if (2 < 1) { %>\n[[Explore->Explore First Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.scanListen('#scan_1pc1');\ndocument.global.showNextPsg('#scan_1pc1', '#scanned_1pc1');\n});\n%>",
      "links": [
        {
          "text": "Explore",
          "destination": {
            "name": "Explore First Planet",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "Naming First Planet",
      "text": "Inside the safe confines of your cockpit, you survey the discoveries you've made, and prepare to catalog them for your ship's databases.\n\n<h2>Planet</h2>\nName><input type=\"text\" name=\"fp_name\" id='fp_name' value=\"<%= _.s.firstPlanet %>\" required><br>\n<a href='javascript:void(0)' id='default1'>Default</a> or \n<a href='javascript:void(0)' id='accept1'>Done</a>\n\nYou check outside, and take a look at the weather mapping your ship's been doing in the meantime. It looks like a while longer before it passes, and you can leave.\n\nJust a bit of daylight left. You can sell off some of your excess cargo, and take a nap, then launch and make your way to your next planet. And on the trip there, you can check prices to see if you'll make enough on this trip to purchase that warp drive.\n\nNow, where to next?\n\n<%\n$(function(){\n\t$(\"#accept1\").on(\"click\", function () {\n\t\t_.s.first_planet = $(\"#fp_name\").val();\n\t\t//_.s.first_creature1 = $(\"#fp_creature1\").val();\n\t\t//_.s.first_creature2 = $(\"#fp_creature2\").val();\n\t\t//_.s.first_plant1 = $(\"#fp_plant1\").val();\n\t});\n});\n%>",
      "links": []
    },
    {
      "pid": 7,
      "name": "Explore First Planet",
      "text": "<h1><%= _.s.firstPlanet %></h1>\n\nYou head east.\n\nThe grass gives way to tall, bare trees, as you continue on.  \n\nThe <a href='javascript:void(0)' id='scan_1pp1'>trees</a> are barren, the bark a glossy black. In some of the branches, there are clusters of the spores you've seen floating around you.\n\nAmongst some extruding rocks, your visor shows <a href='javascript:void(0)' id='scan_1pm1'>23 units of iron</a>.\n\n[\n<span class='added_text'>You carve out the deposits of iron ore with your mining laser, and transfer it back to your ship's cargo hold with your teleport gun.</span>\n\nYour visor picks up some movement, and heat, in one of the trees. You stop, alert, and ready your blaster. The sound of your laser must've attracted attention.\n\nAn insectoid creature, slightly taller than you with a stick-like body, jumps down, brandishing its pincers and fangs at you.  It <span class='red_text'>charges</span>!\n\n<strike>Explore</strike>\n\n<a href=\"javascript:void(0)\" data-passage=\"Fight First Planet\">Fight</a>\n]{-#scanned_1pm1}\n\n<% if (2 < 1) { %>\n[[Fight->Fight First Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.scanListen('#scan_1pp1');\ndocument.global.mineListen(\"#scan_1pm1\", _.s.firstMineral);\ndocument.global.showNextPsg('#scan_1pm1', '#scanned_1pm1');\n});\n\n%>",
      "links": [
        {
          "text": "Fight",
          "destination": {
            "name": "Fight First Planet",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "Fight First Planet",
      "text": "<h1><%= _.s.firstPlanet %></h1>\n\nYou let loose a few blaster shots at the charging insectoid creature. One hits, and it pulls up screeching, surprised.\n\nYou circle briskly towards the nearest tree while firing off a more shots, but the creature is hard too hit with its thin spindly body.\n\nIt charges again. You keep firing, and another shot hits, but this time it doesn't slow down.  \n\nYou curse, and sprint behind the tree, charging a stronger blaster shot all the while, and back away.\n\nIt has to slow down. Hissing, it lunges around the tree, and you tag it right in its head.\n\nThat one hurt it. It rears back, goo gushing from its face.  You take more careful aim, and shoot it in its head a few more times, and the insectoid <a href='javascript:void(0)' id='scan_1pc2'>creature</a> collapses, <a href='javascript:void(0)' id='scavenge_1pc2'>dead</a>.  \n\n[\n<span class='added_text'>Its blood, your visor's analysis shows, contains an element which could be distilled and used as an ingredient in a polymer. You can trade this in. You use your teleport gun to carefully transport all of it you can into your ship's cargo hold.</span>\n\nThe winds have picked up again, harsh and chaotic, and dust is starting to fill the air.  The sun's dipped almost to the horizon.  \n\nYou check your suit readings on your visor, and tap back into your ship's sensors as well; you should know how much longer you can stay, and if you should be heading back to the ship now.\n\n<strike>Explore</strike><p>\n\n<strike>Fight</strike><p>\n\n<a href=\"javascript:void(0)\" data-passage=\"Survive First Planet\">Survive</a>\n]{-#scavenged_1pc2}\n\n<% if (2 < 1) { %>\n[[Survive->Survive First Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.scanListen('#scan_1pc2');\ndocument.global.scavengeListen('#scavenge_1pc2', _.s.firstHostile.drop);\ndocument.global.showNextPsg('#scavenge_1pc2', '#scavenged_1pc2', false);\n});\n%>",
      "links": [
        {
          "text": "Survive",
          "destination": {
            "name": "Survive First Planet",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "Survive First Planet",
      "text": "<h1><%= _.s.firstPlanet %></h1>\n\nTwo things out here that matter the most for your survival: your suit on the surface, and your ship out in space. You always diligently monitor the health of both, because your own health depends on them.\n\nYou've used 84% of your suit's energy, energy also used to power your tools and protect you: from heat, from radiation, from cold, from the elements. Your blaster is separate, and it'll recharge by itself.  \n\nIf your suit dips below 10%, it'll go into energy saving mode, and you'll lose the use of your navvisor system and scanner, your mining laser, and your teleport gun.  You'll have to return to your ship, where it'll take <% if (_.s.showTimePref !== false) { %>[[a couple galactic cycles->Calendar]]<% } else if (_.s.timePref == \"days\") { %><b>around a week</b><% } else {%><b>a couple galactic cycles</b><% } %> to fully recharge. \n\nThe environment isn't too harsh here, but the winds are picking up, and you wouldn't want to get caught out here in a dust storm. You decide to head back; you've collected enough data on this planet.\n\nAs the sun dips below the horizon, the skyline transitions through vivid gradients of golds and reds. But it's getting harder to see, through the thickening dust.\n\nYou love watching sunsets; you could've launched a bit earlier, and missed this, but why would you? \n\nEvery sunset, every sky, offers something different.\n\nYou decide to head back to your ship.\n\n[[> Explore elsewhere->Launch First Planet]]",
      "links": [
        {
          "text": "a couple galactic cycles",
          "destination": {
            "name": "Calendar",
            "pid": 28
          }
        },
        {
          "text": "> Explore elsewhere",
          "destination": {
            "name": "Launch First Planet",
            "pid": 173
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "Trade First Planet",
      "text": "You connect to the galactic databases, to upload all of the data you've acquired. For every planet you visit, you get <%= _.s.planetFee %> credits, and for every living thing you scan you get <%= _.s.scanFee %>.\n\n<% var addedCredits = 0; %>\n<% if (_.s.visitedPlanets < 1 || !_.isNumber(_.s.visitedPlanets)) { %>\nYou have no visited planets to report.\n<% } else { %>\n\t<% if (_.s.visitedPlanets == 1) { %>\nYou report <%= _.s.visitedPlanets %> undiscovered planet to the galactic databases.\n\n\t<% } else { %>\nYou report <%= _.s.visitedPlanets %> undiscovered planets to the galactic database. \n\t<% } %>\n<% addedCredits += _.s.visitedPlanets * _.s.planetFee;\n_.s.visitedPlanets = 0;\n_.change(_.s.stats.credits, addedCredits); %>\n\n<span class='green_text'>You earn <%= addedCredits %> credits!</span>\n<% } %>\n\n<% if (_.s.scanned < 1 || !_.isNumber(_.s.scanned)) { %>\nYou have no scanned objects to upload.\n<% } else { %>\n  <% if (_.s.scanned == 1) { %>\n  You upload <%= _.s.scanned %> object to the galactic databases.\n  <% } else { %>\n  You upload <%= _.s.scanned %> objects to the galactic database.\n  <% } %>\n<% \naddedCredits = 0;\naddedCredits += _.s.scanned * _.s.scanFee;\n_.s.scanned = 0;\n_.change(_.s.stats.credits, addedCredits);\n%>\n\n<span class='green_text'>You earn <%= addedCredits %> credits!</span>\n<% } %>\n\nYou have <%= _.s.stats.credits.num %> credits.\n\nYou are within travel distance of a trade hub! These are automated stations which were sent ahead of your assigned route, You can trade in your cargo and upgrade your ship with credits.\n\n[[Travel To Trade Hub->Trade Hub Intro 1]]",
      "links": [
        {
          "text": "Travel To Trade Hub",
          "destination": {
            "name": "Trade Hub Intro 1",
            "pid": 170
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "Insignia",
      "text": "The insignia -- the logo of your space program, the one supposed to symbolize your people's ventures into space -- has stayed, painted on the side of your ship, throughout.\n\nEverything else has been swapped: plating, sensors, warp drive, weapons. But the insignia's remained.\n\nEarlier on, you'd plant proud flags on the planets you discovered, with that insignia emblazoned on it. \n\nBut you stopped.\n\n<a href=\"javascript:void(0)\" id='insig_1'>These planets were not yours to claim.</a>\n[\n<b>These planets were not yours to claim.</b>\n\nYou were not a colonist. You had no interest in claiming these places, except insofar as to know that you had been there.  But that knowledge was fine, stored in your mind. It did not require a tacky marker.  \n\nThe flag was a foreign object, one that didn't belong.\n\nYou do your best now to leave planets in as natural a state as possible, taking care carve out rocks methodically, in careful chunks. Trees are not clear cut. Garbage is incinerated while in space, not left on the surfaces. You do not leave big traces, or try not to.\n\nIt felt right -- or better.\n]{-#insig_psg1}\n\n<a href=\"javascript:void(0)\" id='insig_2'>That wasn't what your mission was.</a>\n[\n<b>That wasn't what your mission was.</b>\n\nYou needed to focus, instead.\n\nYour old allegiances -- you needed to let them go.\n]{-#insig_psg2}\n\n<a href=\"javascript:void(0)\" id='insig_3'>You want to find another way to remember your people.</a>\n[\n<b>You want to find another way to remember your people.</b>\n\nAfter a while, the flags seemed almost mocking.\n\nEach one planted down was a reminder of every step further away from where you once were.\n\nEach one was a fabric of memory, left behind as your journey wore on.\n\nYou struggled with the planting of so many; the winds would whip them away, animals would attack them, the surface underneath would be too soft or too brittle to hold, or too tough to make it through.\n\nThere must be better ways to honor your people. \n\nThey can live on in your memories instead.\n\nIn the meantime, you decided to stop planting flags. Your cargo holds fourteen still, remnants of your last order before you stopped.\n]{-#insig_psg3}\n\n<a href=\"javascript:void(0)\" id='insig_4'>It didn't feel like a good use of your time on surface.</a>\n\n[\n<b>It didn't feel like a good use of your time on surface.</b>\n\nYou needed to be more efficient with your time, to explore as much as you could: minerals, wildlife, surface scans.\n\nAll important data, to be collected, and analyzed.\n\nAll valuable data, that could allow you to upgrade your ship, to see more and to survive more.\n\nAnd in the far-off distance in the sky, a glimmer: the center of the galaxy, where you're headed.\n]{-#insig_psg4}\n\n[\nThe insignia has still stayed on your uniform: a shoulder patch, faded now.  You can't really make it out anymore, and you only ever see it if you're looking closely in the reflection of your cockpit window, in certain angles and at certain distances from solar light.\n\n<a href=\"javascript:void(0)\" data-passage='Next Planet'>> Continue</a>\n]{-#insig_psg5}\n\n<% if (2 < 1) { %>\n[[Next Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.showNextPsg('#insig_1', '#insig_psg1', true, function() {_.change(_.s.stats.env, 1); $('#insig_2, #insig_3, #insig_4').hide(); $('#insig_psg5').show();});\n\ndocument.global.showNextPsg('#insig_2', '#insig_psg2', true, function() {_.change(_.s.stats.duty, 1); _.change(_.s.stats.galactic, 1); $('#insig_1, #insig_3, #insig_4').hide(); $('#insig_psg5').show();});\n\ndocument.global.showNextPsg('#insig_3', '#insig_psg3', true, function() {_.change(_.s.stats.home, 1); $('#insig_1, #insig_2, #insig_4').hide(); $('#insig_psg5').show();});\n\ndocument.global.showNextPsg('#insig_4', '#insig_psg4', true, function() {_.change(_.s.stats.duty, 1); _.change(_.s.stats.science, 1); $('#insig_1, #insig_2, #insig_3').hide(); $('#insig_psg5').show();});\n\n});\n%>",
      "links": [
        {
          "text": "Next Planet",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "2nd Planet",
      "text": "<%\n_.s.visitedPlanetsOverall++;\n_.s.visitedPlanets++;\n%>\n\n<h1><%= _.s.secondPlanet %></h1>\n\n<i>\nYour suit and ship are both quick to warn you of the perils on this radioactive and boiling hot landscape. Steam rises from the spongy-textured rocks and bubbling pools of liquid, and the air is thick and clogged.\n</i>\n\n[[Survive->Survive 2nd Planet]]\n\n[[Explore->Explore 2nd Planet]]",
      "links": [
        {
          "text": "Survive",
          "destination": {
            "name": "Survive 2nd Planet",
            "pid": 14
          }
        },
        {
          "text": "Explore",
          "destination": {
            "name": "Explore 2nd Planet",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "Explore 2nd Planet",
      "text": "<h1><%= _.s.secondPlanet %></h1>\n\nThe rocks are slick with moisture, and the steam is making it harder to watch your footing. There's the smell of rotten eggs that becomes stronger here; you're forced to turn on your odor filters, cutting off one of your senses.\n\nBut this is a promising spot for crystal deposits to have formed.\n\nKeep [[exploring->Pool 2nd Planet]] topside.\n\n<!--Soon you come across an opening in the side of a cliff that leads in and down.\n\nYou consider exploring [[downwards->Cave 2nd Planet]], inside the cave. \n\nOr maybe you want to explore [[topside->Pool 2nd Planet]] first?-->",
      "links": [
        {
          "text": "exploring",
          "destination": {
            "name": "Pool 2nd Planet",
            "pid": 32
          }
        },
        {
          "text": "downwards",
          "destination": {
            "name": "Cave 2nd Planet",
            "pid": 26
          }
        },
        {
          "text": "topside",
          "destination": {
            "name": "Pool 2nd Planet",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "Survive 2nd Planet",
      "text": "The suit will protect you from the radiation and heat, but you're not going to be able to spend as much time on-surface as on <b><%= _.s.firstPlanet %></b>.\n\nThe radiation level's actually fairly low-level; it's the heat which your suit's going to have to be working hard to counteract.\n\n[[<->2nd Planet]]",
      "links": []
    },
    {
      "pid": 15,
      "name": "Fight 2nd Planet",
      "text": "<h1><%= _.s.secondPlanet %></h1>\n\nYou send a volley of shots its way, but its scales seem thick, and it doesn't go down.\n\nIt's angry now.\n\nIt flares its nostrils, and a wave of steam shoots out, straight at you!\n\nyou duck back behind the rock, and hit the floor, turning your back as the hot air rushes past above you.\n\nLeaning around the rock, you shoot at it again, and manage to hit it in the eyes! As it's blinded, you take the oppurtunity to get closer, and pepper it with body shots, and it goes down hard.\n\nYou get closer to the corpse, and confirm that it's <a href='javascript:void(0)' id='scavenge_2pc2'>dead</a>.\n\nYou sigh in relief, and turn your attention to the [[crystals->Mining 2nd Planet]].\n\n<%\n$(function () {\ndocument.global.scanListen('#scan_2pc2');\n\ndocument.global.scavengeListen('#scavenge_2pc2', _.s.secondDrop);\n});\n%>\n\n",
      "links": [
        {
          "text": "crystals",
          "destination": {
            "name": "Mining 2nd Planet",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "Trade 2nd Planet",
      "text": "<h1><%= _.s.secondPlanet %></h1>\n\nYou offer the fish to the lizard.\n\nIt starts lumbering over at you. You quickly place the fish on the ground and back away.\n\nIt approaches you and the fish with suspicion, and you hold your breath as it sniffs your offering, all while keeping an eye on you.\n\nIt opens its mouth, and grabs the fish in its jaw, then, giving you one last look, disappears into a side tunnel deeper undergound.\n\nYou sigh in relief, and turn your attention to the [[crystals->Mining 2nd Planet]].",
      "links": [
        {
          "text": "crystals",
          "destination": {
            "name": "Mining 2nd Planet",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "3rd Planet",
      "text": "A medium-sized planet, rocky and mountainous.\n\nThe atmosphere is thin, and unwelcoming.\n\nSpindly plants poke out between rocks.\n\nNot much wildlife here.\n\n[[Explore->Explore 3rd Planet]]\n\n[[Fight->Fight 3rd Planet]]\n\n[[Survive->Survive 3rd Planet]]\n\n[[Trade->Trade 3rd Planet]]",
      "links": [
        {
          "text": "Explore",
          "destination": {
            "name": "Explore 3rd Planet",
            "pid": 19
          }
        },
        {
          "text": "Fight",
          "destination": {
            "name": "Fight 3rd Planet",
            "pid": 20
          }
        },
        {
          "text": "Survive",
          "destination": {
            "name": "Survive 3rd Planet",
            "pid": 18
          }
        },
        {
          "text": "Trade",
          "destination": {
            "name": "Trade 3rd Planet",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "Survive 3rd Planet",
      "text": "Double-click this passage to edit it.",
      "links": []
    },
    {
      "pid": 19,
      "name": "Explore 3rd Planet",
      "text": "Picking your way through the jagged valleys and hills, you see little sign of life other than lonely looking weeds and shivering fauna.\n\nThe mineral you see on the planet surface so far are worthless.  Too hard, too time consuming, too common.",
      "links": []
    },
    {
      "pid": 20,
      "name": "Fight 3rd Planet",
      "text": "Double-click this passage to edit it.",
      "links": []
    },
    {
      "pid": 21,
      "name": "Trade 3rd Planet",
      "text": "Double-click this passage to edit it.",
      "links": []
    },
    {
      "pid": 22,
      "name": "Orbiting Space",
      "text": "<h1>In Orbit</h1>\n\nYour spaceship is in space, in orbit around <b><%= _.s.firstPlanet %></b>.\n\n[[> Explore next planet->2nd Planet interlude]] \n\n[[Trade->Trade Space]]\n\n[[Fight->Fight Space]]\n\n[[Survive->Survive Space]] ",
      "links": [
        {
          "text": "> Explore next planet",
          "destination": {
            "name": "2nd Planet interlude",
            "pid": 151
          }
        },
        {
          "text": "Trade",
          "destination": {
            "name": "Trade Space",
            "pid": 91
          }
        },
        {
          "text": "Fight",
          "destination": {
            "name": "Fight Space",
            "pid": 92
          }
        },
        {
          "text": "Survive",
          "destination": {
            "name": "Survive Space",
            "pid": 93
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "Food",
      "text": "Your favorite food, the one you try to purchase whenever you can at trade hubs and ports, is a sort of cold fruit, which you've named snowprunes. They're a popular delicacy in sector <b><%= _.s.snowprunePlanet %></b>, and you understand they've got whole farm planets dedicated to growing them.\n\nYou wish you could visit that sector, but of course it was forbidden for someone of your access level to visit inhabited planets outside of their sanctioned trade zones, back when you could've.\n\nSnowprunes are a mildly sweet and tart fruit, with a soft texture and a bulbous, brittle seed which you can grind up and make into a spread or sauce. Snowprunes prefer colder climates, so you have to keep them in the fridge unit, but they're small so you can store quite a few.\n\n[\nYou don't get much meat to eat these days, because the options are so limited, in finding something your digestive system can handle. You still remember the feast you had on <b><%= _.s.feastPlanet %></b>, when you'd found and hunted down several huge antlered beasts, and roasted them that night over a fire while a star-streaked aurora of violets and oranges danced above you.\n]{-#hidden}\n\nThe food you eat now come from the trade hubs: the dietary analyzers back at <b><%=_.s.centralPlanet %></b> analyzed your body and your digestive system, and they generated a profile of diffrent foodstuffs that come in different shapes and forms fit for your palette: liquids, smoothie-like goop, goop solidified into nutribars, faux cookies.\n\nThe bars are okay. The goop are pretty bad, but it's convenient. Everything else is inedible.\n\n[[> Continue ->Next Planet]]",
      "links": [
        {
          "text": "> Continue ",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "Cat",
      "text": "<b><%= _.s.catName %></b> has taken up residence in the co-pilot seat.\n\nIt seems to be especially entranced by the resource analyzer display, which constantly spits out numbers and percentages at you, scrolling reams of virtual data going past.\n\nAfter unlooping a harness, you gave it a safety rope to play with.\n\nYou like petting <b><%= _.s.catName %></b>, feeling a living thing's body heat underneath your hand, rested on its back or its chin or behind its ears.\n\nYou try talking to it sporadically, haltingly, but your voice sounds foreign reverberating through your helmet, and you feel self-conscious.\n\nIt doesn't like you rubbing its stomach or its feet, you found out, and you have the scratch marks to prove it.  You consider cutting off its claws, but chalk it up as a reminder to be more careful instead. You've dealt with vicious wild animals of all shapes and sizes; you can handle <b><%= _.s.catName %></b>.\n\n[[> Continue ->Next Planet]]",
      "links": [
        {
          "text": "> Continue ",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "Mining 2nd Planet",
      "text": "<h1><%= _.s.secondPlanet %></h1>\n\nAmongst the crystals, your visor detects <a href='javascript:void(0)' id='mine_2pm1'>panguite</a> deposits.\n\n[\nYou spend <%= _.s.timePrefHours() %> carving the panguite into manageable chunks with your mining laser and teleporting it onto your hold. You gain 8 units of panguite!\n]{-#mined_2pm1.green_text}\n\nYou check your survival suit; it's almost out of energy! You'd better return to your ship.\n\n[[> Explore elsewhere->Back Ship 2nd Planet]]\n\n\n<%\n$(function () {\ndocument.global.mineListen(\"#mine_2pm1\", _.s.secondMineral);\n\ndocument.global.showNextPsg('#mine_2pm1', '#mined_2pm1', false);\n});\n%>",
      "links": [
        {
          "text": "> Explore elsewhere",
          "destination": {
            "name": "Back Ship 2nd Planet",
            "pid": 36
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "Cave 2nd Planet",
      "text": "<h1><%= _.s.secondPlanet %></h1>\n\nPeering into the cave, feeling the edges of the mouth of the entrance, it <i>seems</i> safe enough. Nothing to do but go in.\n\nYou flip on your suit's light, located on top of your helmet, and descend (after marking the entrance coordinates at where you're standing first).\n\nIt's quiet. On the surface, liquids bubbling and the roar of steam created a wall of noise, but in here, all you hear is the drip of water, distant and echoing.\n\nNarrow tunnels soon make way to a looming [[cavern->Cavern 2nd Planet]].",
      "links": [
        {
          "text": "cavern",
          "destination": {
            "name": "Cavern 2nd Planet",
            "pid": 37
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "The Center of the Galaxy",
      "text": "All the best galactic astrophysicists don't seem to know.\n\n(Or if they do they're keeping it hidden).\n\nA supermassive black hole, right? But what exactly is that?\n\nThere is the absence of light, sure. But there's other activity there as well, anomalous readings, measuring things beyond your comprehension. There is a structure to the galaxy beyond the gravitational. Sentient life only seems to exist at the margins, relatively speaking.\n\nWhy?\n\n<% if (_.s.dreams_of_youth == 'explorer') { %>\nCuriousity is what has always driven you.\n\nAll those unknown, unexplored, unmarked planets and stars and spaces out there, and this endeavor that puts you right at frontier of this question that has perplexed the entire galaxy.\n\nWhat more do you need?\n<% } else if (_.s.dreams_of_youth == 'pilot') { %>\nYou don't know if there's an answer out there.\n\nBut when you heard about it, it seemed like the exact type of mission you wanted to take on. One that would honor the memory of your people.\n\nWhat better endeavor than to travel further than anyone else in the galactic federation ever had?\n<% } else { //duty %>\nAll you know is, even the best minds want to know exactly what's there at the center of the galaxy. They don't know, but they want to. Your ship's equipped to take readings, but more importantly it can provide a relay to the center, if you can get it there. \n\nWith an endpoint for their signals, and you as a live operator, they can gather so much more data that will benefit overall galactic knowledge.\n\nIt was a more than worthy scientific endeavor, you'd felt, when you'd taken it on.\n<% } %>\n\n[[> Continue ->Next Planet]]",
      "links": [
        {
          "text": "> Continue ",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "Calendar",
      "text": "<% _.change(_.s.stats.galactic, 1); %>\n<% _.s.showTimePref = false; %>\nThe galactic standard cycle is roughly the equivalent of 52 hours, 3 minutes, and 11 seconds.\n\nYou've met some beings that look down on you, that find your relatively brief waking cycles to be a sign of weakness.  \n\nAnd you did feel weak, when you'd be out with them and have to dismiss yourself early to go to bed; you've tried staying awake for the full 52 hour cycle before, at a social gathering (it was a  ceremony for the aligning of the moons suns of <b><%= _.s.calendarPlanet %></b>), and you could barely stand on your feet at the end.\n\nIn your head, you prefer to use <a href=\"javascript: void(0);\" id='day_cycle_choice'>galactic cycles</a>.\n\n[[<->Survive First Planet]]\n\n<%\n$(function () {\n  $(\"#day_cycle_choice\").click(function() {\n  \tif ($(this).html() == \"days\") {\n\t\t$(this).hide().html(\"galactic cycles\").fadeIn(400);\n\t\t_.s.timePref = \"cycles\";\n\t\t_.change(_.s.stats.galactic, 1);\n\t\t_.change(_.s.stats.home, -1);\n\t}\n\telse {\n\t\t$(this).hide().html(\"days\").fadeIn(400);\n\t\t_.s.timePref = \"days\";\n\t\t_.change(_.s.stats.galactic, -1);\n\t\t_.change(_.s.stats.home, 1);\n\t}\n  });\n});\n%>",
      "links": []
    },
    {
      "pid": 29,
      "name": "Center End",
      "text": "On your navvisor, no matter where you are -- out in space or on the surface of a planet -- there was one waypoint that was always set to display. \n\nThe dot was small; you made sure it wouldn't distract you at the wrong moment. But it was a constant guiding presence: a marker for the center of the galaxy. And every planet you visited brought you closer to that final goal. \n\nYour helmet isn't showing the dot anymore. \n\nBut you know its coordinates by heart, and one night, you go to the top of a mountain, and with the starry sky above, you calculate out the location. And you focus on that point in the sky. \n\nThere may not be the diamond-shaped virtual waypoint overlaid on top of it right now, or the distance indicators beside it tracking how far away it is. But you've stared at this point across so many skies that it still feels familiar, in its place amongst the stars.\n\n<% if (_.s.stats.home.num > 1) { %>\n[\n<b>Doranin</b>'s words echo in your mind.\n\n\"All I ask is that you carry us forward, outward, as far as you can,\" she had said.\n\nAnd you will.\n]{#home_center}\n<% } else if (_.s.stats.duty.num > 1) { %>\n[\nYou take a breath, strenghen your resolve.\n\nYou have a mission to fulfill.\n]{#duty_center}\n<% } else if (_.s.stats.science.num > 1) { %>\n[\nAnd you think about all the important data you're collecting as you continue on.\n\nThe center of the galaxy will be the pinnacle of scientific achievement. \n]{#science_center}\n<% } else if (_.s.stats.discovery.num > 1) { %>\n[\nThis is your life's purpose, you know now.\n\nTo explore.\n]{#discovery_center}\n<% } %>\n\n<% if (_.s.stats.diplomacy.num > 0) { %>\n[\n\n]{#diplomacy_center}\n<% } %>\n\nAll your life, you've been driven by a restless desire to know what's out there. And outwards, forwards, there is so much more, to seek, to know, to discover.\n\nYou're not ready to stop yet.\n\n<% if (_.s.warpDrive.bought < 1) { %>\n(And hopefully, you'll soon be able to purchase that Warp Drive you've been keeping your eye on!)\n<% } %>\n\n<% if (_.has(_.s.inventory.cat)) { %>\nYou and <b><%= _.s.catName %></b> are only <span class='green_text'><%= document.global.travelDistance() %></span> away from the point in the [[sky->END]].\n<% } else { %>\nYou are only <span class='green_text'><%= document.global.travelDistance() %></span> away from the point in the [[sky->END]].\n<% } %>",
      "links": [
        {
          "text": "sky",
          "destination": {
            "name": "END",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "Home End",
      "text": "You think back to that night, as you so often do.\n\n<b>Doranin</b>, your village elder, she did not want you to feel beholden to your world. But she would not want you to feel beholden to her words either, you are certain.\n\nYou have journeyed across many stars now, visited a cavalcade of planets of every size and shape and configuration, seen wondrous creatures and confounding wonders, sat under ceaseless twinkling skies.\n\nYou are tired, and you want to go back.\n\nAll forward is, is whichever direction you decide to go.\n\n<% if (_.s.stats.science.num > 1) { %>\n[\nYou have seen the many things this galaxy has to offer. And now you want to study all the data you have collected, to understand the abnomalies, to pick out patterns in the endless static sea.\n]{#science_home}\n<% } else if (_.s.stats.galactic.num > 1) { %>\n[\nOut here, at the frontiers of space exploration, you've fairly often been stuck with a thought: you wish you'd spent more time exploring the civilized planets closer to home. \n\nYou'd fast-tracked yourself, spent as little time as possible as a space courier before you'd landed this gig, but that period when you were planet hopping around the sentient worlds was when you'd enjoyed yourself the most. \n\nYour eyes didn't feel like they were up to the task of taking in all the sights there were to see back then. Your mind felt like it was bursting at the planetside cultures on display.\n\nBut maybe there's still time.\n]{#galactic_home}\n<% } else if (_.s.stats.home.num > 1) { %>\n[\nYou wonder if there's anything left of your origin planet anymore. The quarantine means you can't find out. You know they were barely hanging on before.\n\nBut you're curious to find out. Even if its just to walk amongst the ruins of what's left. And if they managed to survive for this long?\n\nThis planet you're on now, it holds promise. This planet could sustain your people. \n\nThe logistics are difficult to envision. But you want to try.\n\nAnd if there's no one left, maybe you can spend your life somewhere closer to where you began, at least.\n]{#home_home}\n<% } %>\n\nYou look up, <% if (_.has(_.s.inventory.cat)) { %><b><%= _.s.catName %></b> at your side, <% } %>and think about all the skies between you and the way back. You've seen <%= (_.s.priorVisitedPlanets + _.s.visitedPlanetsOverall) %> so far.\n\nYou're done with this journey; it's time for your next one, you think.\n\nYou are <span class='green_text'><%= document.global.travelDistanceBack() %></span> away from [[home->END]].",
      "links": [
        {
          "text": "home",
          "destination": {
            "name": "END",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "Quarantine Old",
      "text": "You're standing in a bare oblong room with a ceiling that curves above you like the inside of top half of an egg. The walls are a neutral gray, and it's supposed to be calming, this room. But it isn't, not at the moment. Not while you're waiting.\n\nIt's been hours. There's nowhere to sit; you've contemplated sitting cross-legged on the floor, but that seemed undignified somehow, even though that's not a gesture you imagine any being here would be able to identify as such.\n\nFletke enters the room. They are your superior, your liason, and perhaps your closest ally here.\n\n\"H-h-hal loa,\" they gurgle at you. You nod at it.\n\n\"Hello, Fletke,\" you say carefully, before switching to Galactic Conlang through your visor. \"(Encouraging) improving.\"\n\nFletke lowers their head and raises it, then they sign smoothly back in universal through its own mounted gear. \"(Receptive) I express gratitude to you and greet you as a respected equal. (Apologetic) unbalanced situation resulting in a regrettable long wait.\"\n\nYou sign back: \"(Accepting) What is the council's decision?\"\n\nFletke: \"(Explaining) Origin systems people &#91;yours&#93; are undiplomatic. War done with many systems people &#91;other&#93;. Origin systems people [yours] unpopular and untrustworthy consequently amongst countless galactic spacefarer councillors.\"\n\n<a href=\"javascript:void(0)\" id='quar_1'>(Argumentative) Fight for your people</a>\n[\nYou: \"(Argumentative) Origin systems people &#91;mine&#93; dying. Help needed! Discussions long, cannot wait!  Dying!\"\n]{-#quar_psg1}\n\n<a href=\"javascript:void(0)\" id='quar_2'>(Defensive) Distance yourself</a>\n[\nYou: \"(Defensive) Origin systems people &#91;mine&#93; are something &#91;not&#93; I control.\n]{-#quar_psg2}\n\n<a href=\"javascript:void(0)\" id='quar_3'>(Accepting) Explain how isolated you are</a>\n[\nYou: \"(Accepting) I know origin systems people &#91;mine&#93; are undiplomatic. Important ones do not hear me anymore. (Emphatic) I am disconnected with origin systems people &#91;mine&#93;. I am isolated.\"\n]{-#quar_psg3}\n\nFletke: \"(Confused)\"\n\nYou: \"(Explaining) Important ones say I not represent origins systems people.\n\nFletke: \"(Sympathy)\"\n\nFletke: \"(Acknowledging). (Elaboration) You are solitary person beyond quarantine of origin systems people &#91;your&#93;. I believe you are not doing war. I cannot prove you are not doing war to the council. You do create unfortunate uncertainty. Council is discussing a prohibition of contact and travel between you and origin systems people &#91;your&#93;.\n\nYou: (Surprised). (Query) Can you explain this prohibition? I cannot travel to origin system &#91;mine&#93; or communicate with origin systems people &#91;mine&#93;?\n\nFletke: \"(Explaining) Council debates on prohibition of all contact and travel to the system between residents and allowed outsiders. Outsiders are diplomats and representatives and you. There are no other pilots from the system that will be allowed as they are all potential combatants.\n\nYou: (Query) There were no additional pilots from origin system &#91;mine&#93;?\n\nFletke: (Confirmation) There were no additional pilots from origin system &#91;yours&#93; that are considered permittable outside the quarantine.\n\n<%\n$(function () {\ndocument.global.showNextPsg('#quar_1', '#quar_psg1', null, function() {_.change(_.s.stats.home, 1)});\ndocument.global.showNextPsg('#quar_2', '#quar_psg2', null, function() {_.change(_.s.stats.diplomacy, 1)});\ndocument.global.showNextPsg('#quar_3', '#quar_psg3', null, function() {_.change(_.s.stats.galactic, 1)});\n});\n%>",
      "links": []
    },
    {
      "pid": 32,
      "name": "Pool 2nd Planet",
      "text": "<h1><%= _.s.secondPlanet %></h1>\n\nYou walk past the cave.\n\nOne of the larger pools of liquid catches your eye; peering into the bottom of one of the deeper pools, you can make out just barely the outlines of some fish-like creature swimming around. \n\nYou dive [[in->Diving 2nd Planet]].",
      "links": [
        {
          "text": "in",
          "destination": {
            "name": "Diving 2nd Planet",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "Diving 2nd Planet",
      "text": "<h1><%= _.s.secondPlanet %></h1>\n\n<b>You dive in</b>; the suit might be heavy, but it's also designed to counteract its own weight.\n\nThe liquid is translucent, thicker and cloudier than clear water is. It's a bit harder to move through.\n\n/*TODO data conversions */\nThe pool itself is maybe twice your height deep, but it's also deceptively large underground, and there are tunnels through rock extending in all directions.\n\nThe <a href='javascript:void(0)' id='scan_2c1'>fish</a> is about a the length of your arm, you see as you get closer.\n\n<!--[[Fight->Fight Fish 2nd Planet]]-->\n\nGo back [[up->Go back up 2nd Planet]].\n\n<%\ndocument.global.scanListen('#scan_2c1');\n%>",
      "links": [
        {
          "text": "Fight",
          "destination": {
            "name": "Fight Fish 2nd Planet",
            "pid": 34
          }
        },
        {
          "text": "up",
          "destination": {
            "name": "Go back up 2nd Planet",
            "pid": 35
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "Fight Fish 2nd Planet",
      "text": "<h1><%= _.s.secondPlanet %></h1>\n\nYou set your blaster (waterproof, of course) to stun, and take aim.\n\nThis specimen ignores you; evidently they are not scared by your blaster.\n\nSo it doesn't expect it when the bolt catches it flush.\n\nGrabbing your prize, you swim back up to the surface.\n<% _.s.inventory.fish = 1; %>\n\nYou produce a cloth and some rope, and wrap it up so it'll be easier to carry.\n\nIf only you could teleport it straight back to your ship, but no; teleportation doesn't mix well with living things.\n\nOn your way back, you come across the cave again, and it beckons to you.\n\nDo you go exploring [[in->Cave 2nd Planet]] the cave?\n\nOr do you [[return->Back Ship 2nd Planet]] to the ship?\n\n",
      "links": [
        {
          "text": "in",
          "destination": {
            "name": "Cave 2nd Planet",
            "pid": 26
          }
        },
        {
          "text": "return",
          "destination": {
            "name": "Back Ship 2nd Planet",
            "pid": 36
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "Go back up 2nd Planet",
      "text": "<% _.change(_.s.stats.env, 1); %>\n<h1><%= _.s.secondPlanet %></h1>\n\nThis fish will be a good add to your database.\n\nYou notice an opening in the side of a cliff that leads in and down.\n\nYou decide to continue exploring [[downwards->Cave 2nd Planet]], inside the cave.",
      "links": [
        {
          "text": "downwards",
          "destination": {
            "name": "Cave 2nd Planet",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "Back Ship 2nd Planet",
      "text": "You get back into your ship...\n\n[\nEquipment check: <b>good</b>, engines <b>on</b>, throttle <b>up</b>, and we're a <b>go</b>!\n]{-#launch2_psg1}\n\n[\nYour ship pierces through the sky...\n]{-#launch2_psg2}\n\n[\nThrough the atmosphere...\n]{-#launch2_psg3}\n\n[\n...And into the inky <a href=\"javascript:void(0)\" data-passage=\"3rd Planet interlude alt\">blackness</a>.\n]{-#launch2_psg4}\n\n<% if (2 < 1) { %>\n[[Into orbit->3rd Planet interlude alt]]\n<% } %>\n\n<%\n$(function () {\n$(\"#launch2_psg1\").fadeIn(4500);\n$(\"#launch2_psg2\").delay(2500).fadeIn(4000);\n$(\"#launch2_psg3\").delay(3500).fadeIn(4000);\n$(\"#launch2_psg4\").delay(4500).fadeIn(4000);\n});\n%>",
      "links": [
        {
          "text": "Into orbit",
          "destination": {
            "name": "3rd Planet interlude alt",
            "pid": 184
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "Cavern 2nd Planet",
      "text": "<h1><%= _.s.secondPlanet %></h1>\n\nYou duck behind a rocky outcropping, and peer around; there's a large lizard-like creature with armored scales and teeth dripping red!\n\nBut behind it, you see a large vein of crystals. Your navvisor confirms it: you're looking at a large deposit of pure lanamiate.\n\nUnfortunately the <a href='javascript:void(0)' id='scan_2c2'>lizard</a> is in the way. It sniffs the air, and you start backing away slowly, but it swivels at your movement, and <span class='red_text'>snarls</span> at you!\n\n[[Fight->Fight 2nd Planet]]\n\n<% if(_.s.inventory.fish > 0) { %>\n[[Trade->Trade 2nd Planet]] fish\n<% } %>\n<%\ndocument.global.scanListen('#scan_2c2');\n%>",
      "links": [
        {
          "text": "Fight",
          "destination": {
            "name": "Fight 2nd Planet",
            "pid": 15
          }
        },
        {
          "text": "Trade",
          "destination": {
            "name": "Trade 2nd Planet",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "Space Pirates",
      "text": "<% _.s.stats.credits.num = _.s.hunterMissiles.price; %>\n\nYou're half asleep, flipping idly through the galactic entertainment broadcasts, when a warning light starts blinking and beeping urgently. <% if(_.s.inventory.cat > 0) { %><b><%= _.s.catName %></b> hisses, and you pet it absent-mindedly while frowning at the screens.<% } %>\n\nThere's an unauthorized, unlicensed vessel on your radar, never a great sign.\n\nThen another blips shows up on your radar -- there's more than one, and they're both closing in fast. And there's another one. You grab the controls and switch to manual. This can't be good.\n\nYou look to get a visual confirmation on the ships. They almost have to be predatory, at the speed you're tracking them coming towards you at, and the way they're pincering you in, two in front, one behind.\n\nYou don't see them, but your ship picks up on their outlines on the display, confirming your worst suspicions. Cloaked in black - these must be space pirates, three of them, it looks like.\n\nYou have to decide what tactics to use against them, but what?\n\n[[Shoot them down with missiles!->Missiles at Pirates]]\n\n[[Use precision lasers!->Lasers at Pirates]]\n\n<!--[[Outmaneuvre them!->Evade Pirates]]-->\n\n<% if (_.s.hunterMissiles.bought < 1 && _.s.starbeamCannon.bought < 1) { %>\n[[Bribe them->Bribe Pirates]]\n<% } %>",
      "links": [
        {
          "text": "Shoot them down with missiles!",
          "destination": {
            "name": "Missiles at Pirates",
            "pid": 155
          }
        },
        {
          "text": "Use precision lasers!",
          "destination": {
            "name": "Lasers at Pirates",
            "pid": 156
          }
        },
        {
          "text": "Outmaneuvre them!",
          "destination": {
            "name": "Evade Pirates",
            "pid": 157
          }
        },
        {
          "text": "Bribe them",
          "destination": {
            "name": "Bribe Pirates",
            "pid": 158
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "Fight Pirates",
      "text": "They're small ships, you can see, designed for speed and covertness. That's good; they're intended to intercept and take down larger cargo ships, not ships like yours that can nearly match their acceleration and handling. \n\nYou'll have to rely on manually targeting them with your lasers; there's no way these types of ships don't have every type of missile and tracking weapon countermeasure that's out there, on board. \n\nYour engines are probably better, but they're still gaining. They don't have your cargo or equipment adding weight and sapping energy.\n\nBut your weapons are not slouch either.\n\nYou drop scramblers, and eject decoys you have to confuse them. You don't know what types of ship sensors they're equipped with, so you use them all.\n\nThe one you're taking on head on is firing now, and your fingers dance over the controls as you alternate thrusters and try to make your ship harder to hit.\n\nYou dodge their lasers, and you focus: you're going to out-discipline them. Steady, lined up shot, deep breath, and you squeeze the trigger.\n\nThe enemy ship explodes into fragments!\n\nYou dive down, then up, past the debris, and one of the ships chasing is dumb, and collides with something. You quickly turn your nose around, and fire at the remaining one, and they go down, too.\n\nJob well done, if you do say so yourself!\n\nYou continue on.\n\n> Next",
      "links": []
    },
    {
      "pid": 40,
      "name": "Feed Cat",
      "text": "You are almost back to your spaceship, when your navvisor picks something up.\n\nUnderneath the ship, behind the landing gears, there's a heat source, a small creature of some sort.\n\nYou approach wearily, blaster in hand, and circle around, trying to get a good view...\n\nAnd, curled under the landing gear, you spot it.\n\nA small four-legged creature, covered in grey and white-striped fur, with blue-white eyes with vertical slit pupils.  It has whiskers and a long tail. It looks up at you suspiciously.\n\n<a href=\"javascript:void(0)\" id='cat1'>Trade it food</a>\n[\n<% if(_.s.inventory.fish > 0) { %>\n<b>You offer it some fish, from the one caught on <b><%= _.s.secondPlanet %></b>.</b>\n<% } else  {%>\n<b>You offer it some food.</b>\n<% } %>\n\nYou put some on the ground, and back away a bit.\n\nIt approaches, cautiously, and sniffs, then looks back up at you, and takes a taste. \n\nThe creature seems to like the food you gave it, and munches down ravenously. Afterwards, it slinks up to you and rubs itself against your legs and purrs.\n\nYou seem to have made a friend! You decide to take it with you on your journey.\n\nYou decide to name it: <input type=\"text\" name=\"cat_name\" id='cat_name' value=\"<%= _.s.catName %>\" required>\n\n<a href=\"javascript:void(0)\" id='accept_cat_name' data-passage=\"Launch Gen Planet\">> Get back in your ship</a>\n]{-#cat_psg1}\n\n<a href=\"javascript:void(0)\" id='cat2'>Fight it</a>\n[\nYou take careful aim at it with your blaster.\n\nThe creature seems to sense your malice, though, scampering off to the other side of your ship and out of sight. You run around the back side, spotting it as it heads for some bushes.\n\nYou take a couple shots, but miss, as it disappears.\n\nOh well.\n\n<a href=\"javascript:void(0)\" data-passage=\"Launch Gen Planet\">> Get back in your ship</a>\n]{-#cat_psg2}\n\n<a href=\"javascript:void(0)\" id=\"cat3\">Ignore it</a>\n[\nAs long as it doesn't pose a danger, you have more important things to think about.\n\nYou shoo it away, so it doesn't get hurt in the take-off.\n\n<a href=\"javascript:void(0)\" data-passage=\"Launch Gen Planet\">Get back in your ship</a>\n]{-#cat_psg3}\n\n<% if (2 < 1) { %>\n[[Back to the Ship->Launch Gen Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.showNextPsg('#cat1', '#cat_psg1', true, function() {_.s.inventory.cat = 1; $('#cat2, #cat3').hide(); _.s.inventory.cat = 1;});\ndocument.global.showNextPsg('#cat2', '#cat_psg2', true, function() {$('#cat1, #cat3').hide();});\ndocument.global.showNextPsg('#cat3', '#cat_psg3', true, function() {$('#cat1, #cat2').hide();});\n$(\"#cat_name\").focus();\n\n$(\"#accept_cat_name\").on(\"click\", function () {\n\t\tif ($(\"#cat_name\").val().trim().length === 0) {\n\t\t\talert(\"The creature doesn't like that name!\");\n\t\t\t$(\"#cat_name\").val(_.s.catName);\n\t\t\treturn false;\n\t\t}\n\t\telse {\n\t\t\t_.s.catName = $(\"#cat_name\").val();\n\t\t}\n\t});\n});\n\n_.s.visitingHeatPlanet = false;\n%>\n",
      "links": [
        {
          "text": "Back to the Ship",
          "destination": {
            "name": "Launch Gen Planet",
            "pid": 129
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "Trade Hub Intro",
      "text": "You glide smoothly into the docking area, into an open spot, and step off your ship, into the private trade hub area.\n\n[[Sell Cargo->Sell Trade Hub]]\n\n[[Buy Items->Buy Trade Hub]]\n\n[[< Back to orbit->Orbiting]]",
      "links": [
        {
          "text": "Sell Cargo",
          "destination": {
            "name": "Sell Trade Hub",
            "pid": 159
          }
        },
        {
          "text": "Buy Items",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        },
        {
          "text": "< Back to orbit",
          "destination": {
            "name": "Orbiting",
            "pid": 131
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "Buy Trade Hub",
      "text": "<h1>Buy Items</h1>\n\n<% if (_.s.ship.fueled == false) { %>\nRefuel - $<%= _.s.fuel.price %> <% if (_.s.fuel.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.fuel.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseFuel]] <% } %>\n\n<% } else { %>\nYour ship's fuel level is <span class=\"green_text\">good</span>.\n\nAblative Heat Shields - $<%= _.s.heatShields.price %> <% if (_.s.heatShields.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.heatShields.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseHeatShields]] <% } %>\n\nHunter Missiles - $<%= _.s.hunterMissiles.price %> <% if (_.s.hunterMissiles.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.hunterMissiles.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseHunterMissiles]] <% } %>\n\nStarbeam Lasers - $<%= _.s.starbeamCannon.price %> <% if (_.s.starbeamCannon.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.starbeamCannon.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseStarbeamCannon]] <% } %>\n\nWarp Drive - $<%= _.s.warpDrive.price %> <% if (_.s.warpDrive.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.warpDrive.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseWarpDrive]] <% } %>\n\n<!--\nShip Thruster Upgrade - $<%= _.s.shipThrusters.price %> <% if (_.s.shipThrusters.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.shipThrusters.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseShipThrusters]] <% } %>\n\nSuit Energy Upgrade - $<%= _.s.suitEnergy.price %> <% if (_.s.suitEnergy.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.suitEnergy.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseSuitEnergy]] <% } %>\n\n<% if(_.s.inventory.cat == true) { %><%= _.s.catName %>\nFood for <%= _.s.catName %> - $23 - [[Purchase->purchaseCatFood]]<% } %>\n\nFood for yourself - $11 - [[Purchase->purchaseMeFood]]\n-->\n<% } //ENF OF ELSE (IF SHIP IS FUELED) %>\n\nYou have <span id='buyHubCreditDisplay'><%= _.s.stats.credits.num %></span> credits.\n\n[[Sell something?->Sell Trade Hub]]\n\n[[< Back to orbit->Orbiting]]",
      "links": [
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseFuel",
            "pid": 182
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseHeatShields",
            "pid": 144
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseHunterMissiles",
            "pid": 139
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseStarbeamCannon",
            "pid": 140
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseWarpDrive",
            "pid": 137
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseShipThrusters",
            "pid": 141
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseSuitEnergy",
            "pid": 138
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseCatFood",
            "pid": 142
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseMeFood",
            "pid": 143
          }
        },
        {
          "text": "Sell something?",
          "destination": {
            "name": "Sell Trade Hub",
            "pid": 159
          }
        },
        {
          "text": "< Back to orbit",
          "destination": {
            "name": "Orbiting",
            "pid": 131
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "Dreams of Youth",
      "text": "When you were younger, you'd wanted to grow up to be: \n\n<a href=\"javascript:void(0)\" id='dreams_1'>A scientist.</a>\n[\n<b>A scientist.</b>\n\nYou wanted to find a way to repair the atmosphere. You wanted to save your people. You pored over textbooks and lectures, and graduated with honors; you studied, you sweated, you sought. You went to conferences, gave speeches, spent sleepless nights.\n\nBut it was for naught. <b>Doranin</b>'s words tipped the scales. You couldn't save the planet, not while on it, at least.\n\nWith some regret, you'd looked skyward instead.\n\n<a href=\"javascript:void(0)\" data-passage=\"Next Planet\">> Next</a>\n]{-#dreams_psg1}\n\n<a href=\"javascript:void(0)\" id='dreams_2'>An explorer.</a>\n[\n<b>An explorer.</b>\n\nYou quickly realized that your planet was colonized, scanned, and disassembled. Every rock, every insect, every ocean floor.\n\nTo find new frontiers, you'd have to look skyward.\n\n<b>Doranin</b> gave you your final push off-world, and you've been exploring ever since, seeking the undiscovered, the unmapped.\n\n<a href=\"javascript:void(0)\" data-passage=\"Next Planet\">> Next</a>\n]{-#dreams_psg2}\n\n<a href=\"javascript:void(0)\" id='dreams_3'>A fighter pilot.</a>\n[\n<b>A fighter pilot.</b>\n\nYou loved planes, and flying, and space. You devoured books and movies on the topic, followed news reports on the space program religiously, dreamed of taking to the skies and beyond. You wanted to go out there: you wanted the thrill of adventure, you wanted to fight for your people. \n\nYou interviewed a famous space pilot for a school project once, and your most prized possession then was a model ship she'd signed for you. You look at it sitting now on the dashboard, in a pod filled with clear suspension fluid.\n\nIt took a while for you to come to terms with it: the galactic federation and the spacefarer's council made it clear that those role models had been fighting for a lost cause. Your allegiances were null if you wanted to fly for them.\n\nSo with <b>Doranin</b>'s words in your heart, you took to your ship, and found another cause.\n\n<a href=\"javascript:void(0)\" data-passage=\"Next Planet\">> Continue</a>\n]{-#dreams_psg3}\n\n<% if (2 < 1) { %>\n[[Next Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.showNextPsg('#dreams_1', '#dreams_psg1', true, function() {_.change(_.s.stats.science, 1); _.s.dreams_of_youth = 'scientist'; $('#dreams_2, #dreams_3').hide();});\n\ndocument.global.showNextPsg('#dreams_2', '#dreams_psg2', true, function() {_.change(_.s.stats.discovery, 1); _.s.dreams_of_youth = 'explorer'; $('#dreams_1, #dreams_3').hide();});\n\ndocument.global.showNextPsg('#dreams_3', '#dreams_psg3', true, (function() {_.change(_.s.stats.duty, 1); _.s.dreams_of_youth = 'pilot'; $('#dreams_1, #dreams_2').hide();}));\n});\n%>",
      "links": [
        {
          "text": "Next Planet",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "Crash On Planet",
      "text": "Slowly, your senses return to you.\n\nGroaning, you sit up, and look around.\n\nOh. Oh no.\n\nThere's your ship, or what remains of it, lying in a smoking morass of twisted metal.\n\nHow did you even [[survive->Inventory Final Planet]]?\n\n<%\n_.s.finDay = 1;\n_.s.finDark = false;\nif (_.s.inventory.cat == 1) {\n\t_.s.inventory.cat = -1; //-1 to mean you once had it\n}\n%>",
      "links": [
        {
          "text": "survive",
          "destination": {
            "name": "Inventory Final Planet",
            "pid": 45
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "Inventory Final Planet",
      "text": "Your suit! You check your suit, and yourself, looking for tears or visible damage in either. Okay, seems good.\n\nYour nav display is off; you turn it on. It <a href=\"javascript:void(0)\" id=\"link1_inv_finp\">flickers</a>...\n\n[\n(<a href=\"javascript:void(0)\" id=\"link2_inv_finp\">Come on</a>)...\n]{-#psg1_inv_finp}\n\n[\nAnd <a href=\"javascript:void(0)\" id=\"link3_inv_finp\">dies</a>.\n]{-#psg2_inv_finp}\n\n[\n<a href=\"javascript:void(0)\" id=\"link4_inv_finp\"><b>Shit</b></a>.\n]{-#psg3_inv_finp}\n\n[\nWell, the life support stuff's still going; you can hear it, and a glance down at the analog gauge on your wrist confirms that. No comp display, but you're not going to immediately suffocate. And without the display, the suit should use up energy a lot slower.\n\nOkay, first things first: you survey your surroundings. Blue-green grass, low hills, rocks and gravel. All is quiet; nothing hostile that you can see.\n\n<a href=\"javascript:void(0)\" id=\"link5_inv_finp\">Test your limbs.</a>\n]{-#psg4_inv_finp}\n\n[\n<b>You test your limbs.</b> Neck is stiff, <b>right leg</b> throbs a bit with pain. Your mind feels like cotton; You might have a concussion? But you can move. Maybe not run anywhere, but you can walk.\n\nYou get up unsteadily, and <a href=\"javascript:void(0)\" data-passage=\"Check Wreckage\">check</a> the wreckage.\n]{-#psg5_inv_finp}\n\n<% if (2 < 1) { %>\n[[check->Check Wreckage]] the wreckage.\n<% } %>\n<%\n$(function () {\ndocument.global.showNextPsg(\"#link1_inv_finp\", \"#psg1_inv_finp\", false);\ndocument.global.showNextPsg(\"#link2_inv_finp\", \"#psg2_inv_finp\", false);\ndocument.global.showNextPsg(\"#link3_inv_finp\", \"#psg3_inv_finp\", false);\ndocument.global.showNextPsg(\"#link4_inv_finp\", \"#psg4_inv_finp\", false);\ndocument.global.showNextPsg(\"#link5_inv_finp\", \"#psg5_inv_finp\");\n});\n%>",
      "links": [
        {
          "text": "check",
          "destination": {
            "name": "Check Wreckage",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "Check Wreckage",
      "text": "Pieces are everywhere, metal, glass, blackened with soot.\n\nOne of the wings has been completely shorn off; the other is twisted, dug into the dirt.\n\nYou can identify the main fuselage, crushed like an egg shell. Cables and insulation hang out.\n\nWell. You [[sift->Search Wreckage]] through the wreckage.",
      "links": [
        {
          "text": "sift",
          "destination": {
            "name": "Search Wreckage",
            "pid": 55
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "Star Routes",
      "text": "Your path through the galaxy is pre-set, predetermined. It's the same with every galactic spacefarer, to make sure there's no overlap, and probably you think, no conflict.\n\nYou're not sure at this point whether there's a computer that's calculating and assigning them or if there's an actual being doing it.\n\nYou've seen your routes change, before. You've had to stop and re-route mid-warp to a planet several times.\n\nThere's also some give: you're allowed to deviate, within a set of systems, and make autonomous decisions based on local conditions (asteroid fields, nebulae, radiation, pirates, etc) and ship conditions (fuel, damage, and so on). Maybe you think the planet's an UnMarked Inhabited, in which case you're supposed to ignore it.  But you're discouraged from backtracking whole systems; someone after you can pick up any stray planets you missed, you've been told.\n\nYou're the frontier, and your job is to keep on pressing forward, keep on discovering, keep on exploring along your route.\n\nAnd your destination is the center of the galaxy.\n\n> Continue->First Gen Planet",
      "links": []
    },
    {
      "pid": 48,
      "name": "Wreckage Final Planet",
      "text": "<% if (_.s.finDay == 1 && _.s.finWreckage !== false) { %>\nYou look around. \n\nIt's odd, viewing a planet surface again without the additive displays, without all the analytics, the warnings, the data; the comfort of <i>knowing</i>.\n\n<% if (_.s.dreams_of_youth == 'explorer') { %>\nYou can confirm your compass works, at least. This planet has a magnetic field: interesting.\n<% } else { %>\nYou can confirm the old relic of a compass you found works, at least. This planet seems like it has a magnetic field: interesting.\n<% } %>\n<% _.s.finWreckage = false;\n} else if (_.s.finDay == 2 && _.has(_.s.inventory.forestMeat) && _.has(_.s.inventory.water) && _.s.finDark !== true) { %>\nIt's getting dark again now.\n<% _.s.finDark = true;\n} %>\n\n<h1>Near Wreckage</h1>\n\nThe remnants of your ship are here, nestled between gently sloping hillsides covered with purple grass.\n\nThere is a path through some <b>rocks</b> to the [[north->Mountains Final Planet]].\n\nThere's also some <b>trees</b> and flora to the [[east->Trees Final Planet]].\n\nAnd to the [[south->River Final Planet]], there's a <b>river</b>.",
      "links": [
        {
          "text": "north",
          "destination": {
            "name": "Mountains Final Planet",
            "pid": 49
          }
        },
        {
          "text": "east",
          "destination": {
            "name": "Trees Final Planet",
            "pid": 50
          }
        },
        {
          "text": "south",
          "destination": {
            "name": "River Final Planet",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "Mountains Final Planet",
      "text": "<% if (_.s.finDay == 2 && _.s.finDay2Sky !== false) { %>\nOvercast weather today. Clouds gray out the caramel brown sky. Scarce winds.\n<% _.s.finDay2Sky = false;\n} %>\n\n<% if (_.s.finDay == 3 && _.s.finDay3Sky !== false) { %>\nThe sun is out today, the winds are cool. You shake your leg experimentally, and regard the surrounding rocks with more consideration.\n<% _.s.finDay3Sky = false;\n} %>\n\n<h1>Rocky Area</h1>\n\nThe terrain here is rocky and full of crags. <% if (_.s.finDay < 3) { %>Mountainsides rise above you on either side making it difficult to go any further north, at least on this leg.\n\nYou also see a small <b>cave</b> to the [[west->Cave Final Planet]].\n\nYour <b>wrecked ship</b> is back [[south->Wreckage Final Planet]].\n\n<% } else { %> \n\nIf you go through slowly, you think you're up to picking your way [[north->Rocky Path Final Planet]] over the flatter parts.\n<% } %>",
      "links": [
        {
          "text": "west",
          "destination": {
            "name": "Cave Final Planet",
            "pid": 53
          }
        },
        {
          "text": "south",
          "destination": {
            "name": "Wreckage Final Planet",
            "pid": 48
          }
        },
        {
          "text": "north",
          "destination": {
            "name": "Rocky Path Final Planet",
            "pid": 52
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "Trees Final Planet",
      "text": "<h1>Forest Edge</h1>\n\nThe soil here is damp and soft under your feet, with intermingling moss and low shrubs.\n\nThe trees gradually thicken to the [[northeast->Forest Final Planet]] into a full fledged <b>forest</b> of blue.\n\nYour <b>wrecked ship</b> is back [[west->Wreckage Final Planet]].",
      "links": [
        {
          "text": "northeast",
          "destination": {
            "name": "Forest Final Planet",
            "pid": 54
          }
        },
        {
          "text": "west",
          "destination": {
            "name": "Wreckage Final Planet",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "River Final Planet",
      "text": "<h1>River</h1>\n\nYou're near the bank of a torrential river with murky brown <% if (_.s.finDay2River !== false) { %> <a href=\"javascript:void(0)\" id=\"ex_river_finp\">water</a> <% } else { %> water <% } %> rushing past.\n\n[\nYou look closer at the water, but you can't make out anything in the frothy murk. You put your hand into the water experimentally, but you can't feel the bottom.\n]{-#exed_river_finp.green_text}\n\nSpread out all along the silty shore lay oddly-shaped conches and <% if (_.has(_.s.finGetBiggerShell)) { %><a href=\"javascript:void(0)\" id=\"get_bigger_shell_finp\">shells</a><% } else if (!_.has(_.s.inventory.shell)) { %><a href=\"javascript:void(0)\" id=\"get_shell_finp\">shells</a><% } else { %>shells<% } %>, from miniature ones to ones as large as your head <% if (_.s.finDay == 1) { %>, glowing in the dusklight.<% } else { %>.<% } %>\n\n[\nYou pick a smaller one up. It's smooth and cool to the touch, waxy almost. You take it with you.\n]{-#got_shell_finp.green_text}\n\n[\nYou pick out a larger shell, one that should be able to contain water well. It's shaped like a ridged cone, whorled from tip to bottom, with an opening at the side of the larger end.\n]{-#got_bigger_shell_finp.green_text}\n\n<% if (_.s.inventory.cat == -1 && _.s.finDay == 2) { %>\nYou spot at the water's edge, a furry animal. Creeping closer, you see that it's <b><%= _.s.catName %></b>! \n\n\"<b><%= _.s.catName %></b>!\" you call out, and it turns and meows happily at you, scampering up and trailing you with a tiny wriggling fish in its mouth.\n<% \n_.s.inventory.cat = 1;\n} %>\n\n<% if (_.s.finLake == true) { %>\nTo the [[southwest->Lake Final Planet]] is the <b>lake</b> you found.\n<% } else if (_.s.finDay > 1) { %>\n[[Southwest->Lake Final Planet]] follows the river <b>downstream</b>. The shore rocks are less treacherous in that direction.\n<% } else { %>\nYou consider exploring further down the river bank, but it's dark and slippery.\n<% } %>\n\nYour <b>wrecked ship</b> is to the [[north->Wreckage Final Planet]].\n\n<%\n$(function () {\ndocument.global.showNextPsg('#ex_river_finp', '#exed_river_finp', false, (function() { _.s.finDay2River = false; }));\ndocument.global.showNextPsg('#get_shell_finp', '#got_shell_finp', false, (function() { _.s.inventory.shell = true; }));\ndocument.global.showNextPsg(\"#get_bigger_shell_finp\", \"#got_bigger_shell_finp\", false, (function() { _.s.inventory.biggerShell = true; }));\n});\n%>",
      "links": [
        {
          "text": "southwest",
          "destination": {
            "name": "Lake Final Planet",
            "pid": 63
          }
        },
        {
          "text": "Southwest",
          "destination": {
            "name": "Lake Final Planet",
            "pid": 63
          }
        },
        {
          "text": "north",
          "destination": {
            "name": "Wreckage Final Planet",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "Rocky Path Final Planet",
      "text": "<h1>Rocks</h1>\n\nIt's slow going, as you clamor over the rocks and crags and outcroppings.\n\n<% if (_.has(_.s.inventory.cat)) { %>\n<b><%= _.s.catName %></b> leaps nimbly between rocks, while you lag behind jealously.\n<% } %>\n\nThe ground starts sloping downwards as you continue, more and more, and soon you find that you were at the top of a mountain, with a steep path heading [[down->Down Mountain Final Planet]] to the northeast.",
      "links": [
        {
          "text": "down",
          "destination": {
            "name": "Down Mountain Final Planet",
            "pid": 69
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "Cave Final Planet",
      "text": "<h1>Cave</h1>\n\nThe cave is fairly dry and doesn't go too far in. Just slightly bigger than your ship's cockpit. The walls are made of hard rock with discrete layers.\n\n<% if (_.s.finDay == 1 && _.s.finDay1Cave !== false) { %>\nThis cave could make a decent base, you think. It's cool, relatively dry; yeah, this could work.\n<% _.s.finDay1Cave = false;\n} %>\n\n<% if (_.s.finDay == 1 && _.has(_.s.inventory.branches) && !_.has(_.s.inventory.fire)) { %>\n[[Light a fire->Fire Final Planet]]\n<% } %>\n\n<% if (_.s.finDark == true && _.has(_.s.inventory.fire) && _.has(_.s.inventory.cat)) { %>\n<b><%= _.s.catName %></b> curls up beside the fire.\n<% } %>\n\n<% if (_.s.finDark == true && _.has(_.s.inventory.forestMeat) && _.has(_.s.inventory.water)) { %>\n[[Prepare and cook meat->Cook Meat Final Planet]]\n<% } %>\n\n<% if (_.s.finDark == true) { %>\n<a href=\"javascript:void(0)\" id=\"east_dark_cave_finp\">East</a> goes back outside.\n\n[\nIt's too dark outside to see now. You decide to stay in.\n]{-#east_too_dark_cave_finp.green_text}\n\n<% } else { %>\n[[East->Mountains Final Planet]] goes back outside.\n<% } %>\n\n<% if (_.s.finDark == true && _.s.finDay == 1 && _.has(_.s.inventory.fire)) { %>\n[[Sleep->Sleep Night 1 Final Planet]]\n<% } %>\n\n<% if (_.s.finDark == true && _.s.finDay == 2 && _.has(_.s.inventory.cookedMeat)) { %>\n[[Sleep->Sleep Night 2 Final Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.showNextPsg(\"#east_dark_cave_finp\", \"#east_too_dark_cave_finp\", false);\n});\n%>",
      "links": [
        {
          "text": "Light a fire",
          "destination": {
            "name": "Fire Final Planet",
            "pid": 67
          }
        },
        {
          "text": "Prepare and cook meat",
          "destination": {
            "name": "Cook Meat Final Planet",
            "pid": 68
          }
        },
        {
          "text": "East",
          "destination": {
            "name": "Mountains Final Planet",
            "pid": 49
          }
        },
        {
          "text": "Sleep",
          "destination": {
            "name": "Sleep Night 1 Final Planet",
            "pid": 57
          }
        },
        {
          "text": "Sleep",
          "destination": {
            "name": "Sleep Night 2 Final Planet",
            "pid": 66
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "Forest Final Planet",
      "text": "<h1>Forest</h1>\n\nThe trees here are tall and rigid with jagged black bark, their branches extending outwards supporting the leafy blue canopies that hide any hint of sky from your view.\n\n<% if (_.s.finDay == 1) {\nif (!_.has(_.s.inventory.mushrooms)) { %> <a href=\"javascript:void(0)\" id=\"ex_mushrooms_finp\">Spotted mushrooms</a> <% } else { %> Spotted mushrooms <% } %> and <% if (!_.has(_.s.inventory.mushrooms)) { %> <a href=\"javascript:void(0)\" id=\"ex_branches_finp\">branches</a> <% } else { %> branches <% } %> litter the ground.\n\nYou consider the deeper recesses of the forest, but it's getting dark; best to stick to more open areas, and not chance getting lost in the woods.\n<% } else if (_.s.finDay == 2 && !_.has(_.s.inventory.forestMeat)) { %>\n<b>Today</b>, you creep more quietly through the woods, careful not to make too much noise. \n\nIn some of the trees, you notice, there are hollows, which contain pockets of dried grass and leaves.\n\nThere are dissonant trilling noises emanating from the upper levels of the forest, but you can't locate what they're coming from.\n\nThe undergrowth thickens gradually. \n\nSuddenly, threre's a <b>rustling</b> in the bushes...\n\n[[Investigate the noise->Investigate Final Planet]]?\n<% } %>\n\nYour <b>wrecked ship</b> is back [[southwest->Trees Final Planet]].\n\n<%\n$(function () {\ndocument.global.clickReplace(\"#ex_mushrooms_finp\", \"Spotted mushrooms <span class='green_text'>(You smell one, touch it. But you can't tell if they're poisonous or not. You pick some up, worst comes to worst...)</span>\", (function () { _.s.inventory.mushrooms = 1; }));\ndocument.global.clickReplace(\"#ex_branches_finp\", \"branches <span class='green_text'>(they look and feel like they would make good firewood. You gather some up.)</span>\", (function () { _.s.inventory.branches = 1; }));\n});\n%>",
      "links": [
        {
          "text": "Investigate the noise",
          "destination": {
            "name": "Investigate Final Planet",
            "pid": 60
          }
        },
        {
          "text": "southwest",
          "destination": {
            "name": "Trees Final Planet",
            "pid": 50
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "Search Wreckage",
      "text": "You gingerly walk through the remains, <a href=\"javascript:void(0)\" id=\"link1_searchwreck_finp\">combing</a> through everything.\n\n[\nMany of the minerals, you see with some grim humor, have made it through intact. No use to you now.\n]{-#psg1_searchwreck_finp}\n\n[\nThree salavageable nutribars.\n]{-#psg2_searchwreck_finp}\n\n[\n<% if (_.s.dreams_of_youth == 'explorer') { %>\nA sextant.\n<% } else if (_.s.dreams_of_youth == 'scientist') { %>\nCharred remains of your science notes.\n<% } else if (_.s.dreams_of_youth == 'pilot') { %>\nA signed model ship.\n<% } else { %>\nA fork.\n<% } %>\n]{-#psg3_searchwreck_finp}\n\n[\nA small facecloth.\n]{-#psg4_searchwreck_finp}\n\n[\nYour teleport gun's dead.\n]{-#psg5_searchwreck_finp}\n\n[\n<% if (_.s.dreams_of_youth == 'explorer') { %>\nA <b>compass</b>\n<% } else { %>\nA <b>compass?!?</b>\n<% } %>\n]{-#psg6_searchwreck_finp}\n\n[\n<a href=\"javascript:void(0)\" id=\"link2_searchwreck_finp\">Not enough</a>.\n]{-#psg7_searchwreck_finp}\n\n[\n<a href=\"javascript:void(0)\" id=\"linkkeep_searchwreck_finp\">Keep searching</a>...\n]{-#psgkeep_searchwreck_finp}\n\n[\nJust not enough. How are you going to <a href=\"javascript:void(0)\" data-passage=\"Survive Final Planet\">survive</a> here?\n]{-#psg8_searchwreck_finp}\n\n<% if (2 < 1) { %>\n[[survive->Survive Final Planet]] the wreckage.\n<% } %>\n\n<% \n$(function () {\ndocument.global.showNextPsg(\"#link1_searchwreck_finp\", \"#psg1_searchwreck_finp\", false);\n_.s.inventory.compass = 1;\n_.s.inventory.bar = 3;\n_.s.inventory.fork = 1;\n});\n%>\n\n<%\n$(function () {\ndocument.global.showNextPsg(\"#link1_searchwreck_finp\", \"#psgkeep_searchwreck_finp\", false);\ndocument.global.showNextPsg(\"#link1_searchwreck_finp\", \"#psg1_searchwreck_finp\", false);\ndocument.global.showNextPsg(\"#link2_searchwreck_finp\", \"#psg8_searchwreck_finp\", false);\n\nvar search_ctr = 1;\n  $(\"#passage\").on(\"click\", \"#linkkeep_searchwreck_finp\", function() {\n  \tif (search_ctr == 1) {\n\t\t$(\"#psg2_searchwreck_finp\").fadeIn(500);\n\t}\n\telse if (search_ctr == 2) {\n\t\t$(\"#psg3_searchwreck_finp\").fadeIn(500);\n\t}\n\telse if (search_ctr == 3) {\n\t\t$(\"#psg4_searchwreck_finp\").fadeIn(500);\n\t}\n\telse if (search_ctr == 4) {\n\t\t$(\"#psg5_searchwreck_finp\").fadeIn(500);\n\t}\n\telse if (search_ctr == 5) {\n\t\t$(\"#psg6_searchwreck_finp\").fadeIn(500);\n\t}\n\telse if (search_ctr == 6) {\n\t\t$(\"#psg7_searchwreck_finp\").fadeIn(500);\n\t\t$(\"#linkkeep_searchwreck_finp\").hide();\n\t}\n\tsearch_ctr++;\n  });\n});\n%>",
      "links": [
        {
          "text": "survive",
          "destination": {
            "name": "Survive Final Planet",
            "pid": 56
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "Survive Final Planet",
      "text": "It's getting colder; the sun's setting.\n\nYou need to - what do you need? The basics, stick to survival basics for now.\n\n<a href=\"javascript:void(0)\" id=\"shelter_finp\">Shelter.</a>\n\n<a href=\"javascript:void(0)\" id=\"fire_finp\">Fire.</a>\n\n<a href=\"javascript:void(0)\" id=\"food_finp\">Food.</a>\n\nThen after that, you can think about more complicated tasks, like finding a way to get off this planet.\n\n[[Start looking around->Wreckage Final Planet]]\n\n<%\n$(function () {\ndocument.global.clickReplace(\"#shelter_finp\", \"<b>Shelter.</b> <span class='green_text'>Your suit's not going to be a long term dependency. You need to conserve its energy, use it only for oxygen recirculation. So you need some protection from the elements.</span>\");\ndocument.global.clickReplace(\"#fire_finp\", \"<b>Fire.</b> <span class='green_text'>You don't want to depend on the suit to keep you warm.</span>\");\ndocument.global.clickReplace(\"#food_finp\", \"<b>Food.</b> <span class='green_text'>And water. Those bars aren't going to last you long. But night is falling; you think the other two are more important.</span>\");\n});\n%>",
      "links": [
        {
          "text": "Start looking around",
          "destination": {
            "name": "Wreckage Final Planet",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "Sleep Night 1 Final Planet",
      "text": "You sleep fitfully, unused to the cold and damp and dark after so much time in a regulated ship environment.\n\nAt sun-up, as the dawn sky light enroaches inside the cave, you awaken blearily and get up, your body fighting you at every movement. Your leg and arm still ache, but your head's cleared up at least.\n\n<h1>Cave</h1>\n\n[[East->Mountains Final Planet]] goes back outside, into the too-bright sunlight.\n\nYour oxygen level is at around 60%.\n\n<% _.s.finDay = 2; \n_.s.inventory.fire = 0;\n_.s.finDark = false; %>",
      "links": [
        {
          "text": "East",
          "destination": {
            "name": "Mountains Final Planet",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "On Naming Planets",
      "text": "<%= _.s.firstPlanet %> is the planet name your ship assigned to this planet, based off of some impenetrable categorization rules the system uses.\n\nYou can assign your own name to it, but you prefer to do that after you've finished exploring.\n\n<",
      "links": []
    },
    {
      "pid": 59,
      "name": "Cut Naming FIrst Planet",
      "text": "<h3>Predactory insectoid</h3>\nname: Phasmadea\n<input type=\"text\" name=\"fp_creature1\" id='fp_creature1' value=\"<%= _.s.first_planet %>\" required><br>\ndefault\n\n<h3>Herd of creatures</h3>\nname: Tauren\n<input type=\"text\" name=\"fp_creature2\" id='fp_creature2' value=\"<%= _.s.first_planet %>\" required><br>\ndefault\n\n<h3>Dark spore trees</h3>\nname: Spourwood\n<input type=\"text\" name=\"fp_plant1\" id='fp_plant1' value=\"<%= _.s.first_planet%>\" required><br>\ndefault",
      "links": []
    },
    {
      "pid": 60,
      "name": "Investigate Final Planet",
      "text": "Ducking low behind the trunks of trees, you slowly sidle your way towards the rustling sound.\n\nAs you get closer, you can make out a creature: four-legged, covered in fur, horns on its head, stocky with a long tail. It trots away, further into the forest.\n\n[[Hunt for food->Hunt Final Planet]]\n\n<% _.s.finDay1Forest = false; %>",
      "links": [
        {
          "text": "Hunt for food",
          "destination": {
            "name": "Hunt Final Planet",
            "pid": 61
          }
        }
      ]
    },
    {
      "pid": 61,
      "name": "Hunt Final Planet",
      "text": "You're approaching it slowly, creeping along, trying not to spook it off. It stops several times, and nibbles at something at the ground, and you think you'll be able to get close enough to get a good shot off, but then it'll trot further away, again.\n\nYou're getting close again, when it suddenly looks up, and cranes its neck around, and it seems to stare directly at where you are. You freeze. It bolts! <a href=\"javascript:void(0)\" id=\"chase_hunt_finp\">After it</a>!\n\n[\nYou take off after it, slowly picking up speed, and your leg seems to hold up okay. You can barely make it out through the ever thickening brush, as you follow it.\n\nIts tougher going deeper in. The vegetation changes around you; it gets darker, gloomier. It's getting further and further away, and you lose sight of it at one point, but you keep going in that direction.\n\nSuddenly you see it! In front of you, it's stopped. It wheels around as you come up to it, glancing at you frightfully, and tries to run left. \n\nYou take careful aim with your blaster, and shoot it right in the flank, which drops it. Another two shots just in case, and the deed is done. You <a href=\"javascript:void(0)\" data-passage=\"Hunt Successful Final Planet\">check</a> its carcass.\n]{-#chased_hunt_finp}\n\n<% if (2 < 1) { %>\n[[check->Hunt Successful Final Planet]] it.\n<% } %>\n<%\n$(function () {\ndocument.global.showNextPsg(\"#chase_hunt_finp\", \"#chased_hunt_finp\", false);\n});\n%>",
      "links": [
        {
          "text": "check",
          "destination": {
            "name": "Hunt Successful Final Planet",
            "pid": 62
          }
        }
      ]
    },
    {
      "pid": 62,
      "name": "Hunt Successful Final Planet",
      "text": "Coming up to its carcass, you see what caused it to pause: the abrupt edge of a huge cliff.\n\nPeering over the side, you see a beautiful vista below you. Far, far, far, below you. Lakes and rivers, marshland, more forest; you keep scanning. And you see... is that - there's a <b>monolithic</b> <i>thing</i> out there, reaching up just above the trees; it's semi-camouflaged blue, but it looks too straight and angular to be natural.\n\nMaybe you're not as alone as you thought.\n\n[[Look->Investigate Monolith Final Planet]] for a way down.",
      "links": [
        {
          "text": "Look",
          "destination": {
            "name": "Investigate Monolith Final Planet",
            "pid": 64
          }
        }
      ]
    },
    {
      "pid": 63,
      "name": "Lake Final Planet",
      "text": "<h1>Lake</h1>\n<% if (_.s.finDay2Water !== false) { %>\nThe river follows down a valley surrounded by mountains, terminating at a small lake. The <a href=\"javascript:void(0)\" id=\"ex_lake_water_finp\">water</a> is clear and still.\n<% } else { %>\nYou're at a secluded lake. The water is clear and still.\n<% } %>\n\n[\nYou examine the water. It looks... clean enough, cleaner than the river at least.. But how do you transport it?\n\n<% if (_.has(_.s.inventory.shell) && _.s.finGetBiggerShell !== true) { %>\n<a href=\"javascript:void(0)\" id=\"shell_lake_finp\">Use the shell</a>\n<% } %>\n]{-#exed_lake_water_finp.green_text}\n\n[\n<span class='green_text'>\nYou scoop up the water with a shell. No particles, innocuous looking enough. Okay; you can transport some of this water back to the cave, and boil it. \n\nBut you'll need a bigger shell.\n</span>\n]{-#shelled_lake_finp}\n\n<% if (_.has(_.s.inventory.biggerShell) && !_.has(_.s.inventory.water)) { %>\n<a href=\"javascript:void(0)\" id=\"get_water_finp\">Fill the bigger shell</a>\n<% } %>\n\n[\nYou fill up the bigger shell with water. That should be enough for a bit.\n]{-#got_water_finp.green_text}\n\n[[Northeast->River Final Planet]] goes back to the <b>river</b>.\n\n<%\n$(function () {\ndocument.global.showNextPsg('#ex_lake_water_finp', '#exed_lake_water_finp', false);\ndocument.global.showNextPsg('#shell_lake_finp', '#shelled_lake_finp', true, (function() {_.s.finGetBiggerShell = true; _.s.finDay2Water = false;}));\ndocument.global.showNextPsg('#get_water_finp', '#got_water_finp', true, (function() {_.s.inventory.water = 1; _.s.finGetBiggerShell = false;}));\n});\n%>\n",
      "links": [
        {
          "text": "Northeast",
          "destination": {
            "name": "River Final Planet",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 64,
      "name": "Investigate Monolith Final Planet",
      "text": "You look for a way down... but it's a straight drop.\n\nYou'll have look for another route.\n\nOn the plus side, your leg feels good. It held up fine in the hunt. \n\nTomorrow, you think you can really test it out. You turn your attention back to the [[carcass->Prepare Final Planet]].",
      "links": [
        {
          "text": "carcass",
          "destination": {
            "name": "Prepare Final Planet",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 65,
      "name": "Prepare Final Planet",
      "text": "You take out your mining laser, set it to low, and start carving the carcass. It takes you longer than it should; the bones were tough. But you cut it into transportable pieces.\n\nBack [[west->No Oxygen Final Planet]] is the forest here.\n\n<% _.s.inventory.forestMeat = true %>",
      "links": [
        {
          "text": "west",
          "destination": {
            "name": "No Oxygen Final Planet",
            "pid": 135
          }
        }
      ]
    },
    {
      "pid": 66,
      "name": "Sleep Night 2 Final Planet",
      "text": "With a full stomach and your leg hurting less, you sleep better, and wake up feeling refreshed.\n\nOkay. You want a better look at that <b>monolith</b> you saw yesterday. You just need to find a way down.\n\n<h1>Cave</h1>\n\n[[East->Mountains Final Planet]] goes back outside. Not much sunlight this morning, it seems.\n\n<% _.s.finDay = 3; \n_.s.inventory.fire = 0;\n_.s.finDark = false; %>",
      "links": [
        {
          "text": "East",
          "destination": {
            "name": "Mountains Final Planet",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 67,
      "name": "Fire Final Planet",
      "text": "You drop the branches, and arrange them into a loose pile.\n\nThe manufacturers of your mining laser did have some foresight; you set it to incinerate mode, and fire a steady beam at the branches.\n\nThey catch. You add more branches, and soon it's burning quite merrily.\n\nYou eat one of the nutribars you salvaged before turning in. <b>Tomorrow, you'll need to find more food</b>, but for tonight, you have shelter and a decent fire going, in your cozy little [[cave->Cave Final Planet]].\n\n<%\n_.s.finDark = true; \n_.s.inventory.fire = 1; \n_.s.inventory.branches = 0;\n%>",
      "links": [
        {
          "text": "cave",
          "destination": {
            "name": "Cave Final Planet",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 68,
      "name": "Cook Meat Final Planet",
      "text": "You re-ignite the fire, and then over the flame, using a remnant of metal from your ship as a cooking surface, you roast the meat thoroughly, making sure the meat juices are sealed in.\n\nThe water you filter through the cloth you salvaged, then boil within the shell.\n\nThen you dig in. The meat is kind of bland and chewey, but also satisfying and filling. The water is invigorating.\n\n<% if (_.has(_.s.inventory.cat)) { %>\nYou offer some bite-sized pieces to <b><%= _.s.catName %></b>, and it mews happily as it chows down as well.\n<% } %>\n\nA not unpleasant smell of cooked smoky meat fills the [[cave->Cave Final Planet]].\n\n<%\n_.s.finDark = true; \n_.s.inventory.forestMeat = 0;\n_.s.inventory.cookedMeat = 1; \n_.s.inventory.fire = 1;\n%>",
      "links": [
        {
          "text": "cave",
          "destination": {
            "name": "Cave Final Planet",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 69,
      "name": "Down Mountain Final Planet",
      "text": "<h1>Down the mountain</h1>\n\nThe slope is steep, but it's also more gravel and less large jagged rock, so it's easier going.\n\nYou can see the <b>monolith</b> from here, just above the treeline. Maybe it's just a naturally ocurring crystallic structure? You want a closer look.\n\nAt the bottom of the slope, you're met with another huge forest. The trees here are different: older, you think, with broad trunks and needly leaves. The ground is muddy. The air smells cloyingly sweet.\n\nYou pass many colorful plants and flowers, and there's a part of you that really wishes you still had your navvisor to catalogue and scan them.\n\nYou must be closer to the [[monolith->Monolith Final Planet]] now.",
      "links": [
        {
          "text": "monolith",
          "destination": {
            "name": "Monolith Final Planet",
            "pid": 70
          }
        }
      ]
    },
    {
      "pid": 70,
      "name": "Monolith Final Planet",
      "text": "<% if (_.s.seeMonolithEvent !== false) { %>\nYou see glimpses of blue through the trees; you're almost there!\n\nEntering the clearing, you see the four-sided monolith towering above you, and above the trees as well.\n\n<h1>At the monolith</h1>\n\nYou feel a charge in the air, as you approach.\n\n<% _.s.seeMonolithEvent = false; %>\n<% } else { %>\n<h1>At the monolith</h1>\n\nYou're standing in front of the monolith, in the middle of a clearing in the forest.\n\n<% if (_.s.handOnCircle == true) { %>\nYou are reaching your hand up and touching a lit circle on the surface of the monolith.\n<% } %>\n<% } %>\n\n[[Examine->Examine Monolith Final Planet]]\n\n[[Touch->Touch Monolith Final Planet]]\n\n[[Knock->Knock Monolith Final Planet]]\n\n<% /*You're coming up to the monolith; even before you see it, you can hear a resonant hum coming from in front of you, and you use that to guide you.\n\nYou see a flash of blue through the trees, and you pick up the pace a bit.\n\nAnd there's something there already: a brown,smooth skinned creature with a bulbous head and long limbs, and standing on its hind legs!\n\nDucked behind a tree, you watch it. It's swaying in front of the monolith, seemingly mesmerized - and you realize that the humming sound is coming from the creature. \n\nThe monolith starts glowing, and then it starts emitting a string of low gutteral noises, then from the monolith emits some low gutteral noises back, and you realize you might be looking at an intelligent lifeform.\n\nDo you watch and wait or do you approach, either with gun drawn or peacefully?*/ %>",
      "links": [
        {
          "text": "Examine",
          "destination": {
            "name": "Examine Monolith Final Planet",
            "pid": 73
          }
        },
        {
          "text": "Touch",
          "destination": {
            "name": "Touch Monolith Final Planet",
            "pid": 74
          }
        },
        {
          "text": "Knock",
          "destination": {
            "name": "Knock Monolith Final Planet",
            "pid": 75
          }
        }
      ]
    },
    {
      "pid": 71,
      "name": "Approach Being Final Planet",
      "text": "You enter the clearing slowly, cautiously, hand hovering close to your holstered blaster just in case.\n\nThe being spots you; they take a step towards you, then one back, and then tries to activate the monolith again, then stops and growls something at you.\n\nYou stop.\n\n[[Say hello->Approach Being 2 Final Planet]]\n\n[[Say hello in galactic->Approach Being 2 Final Planet]]\n\n[[Put your hands up->Approach Being 2 Final Planet]]\n\n[[Point at me->Approach Being 2 Final Planet]]\n\n[[Point at them->Approach Being 2 Final Planet]]\n\n[[Point at the ground->Approach Being 2 Final Planet]]\n\n[[Point at the sky->Approach Being 2 Final Planet]]\n\n[[Nod head->Approach Being 2 Final Planet]]\n\n[[Shake head->Approach Being 2 Final Planet]]\n\n[[Wave->Approach Being 2 Final Planet]]\n\n[[Wait->Approach Being 2 Final Planet]]",
      "links": [
        {
          "text": "Say hello",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Say hello in galactic",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Put your hands up",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Point at me",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Point at them",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Point at the ground",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Point at the sky",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Nod head",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Shake head",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Wave",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        },
        {
          "text": "Wait",
          "destination": {
            "name": "Approach Being 2 Final Planet",
            "pid": 183
          }
        }
      ]
    },
    {
      "pid": 72,
      "name": "Gen Planet",
      "text": "<% \n_.s.visitedPlanetsOverall++;\n_.s.visitedPlanets++;\nvar genPlanetTurn = 0;\nvar survive = 100;\nvar deprecRate = 26;\nvar inCombat = false; justFought = false; hostileTurn = -1;\nvar currPlanet = _.s.Planets[_.s.genPlanetNum];\n%>\n<h1><%= currPlanet.name %></h1>\n\n[\n<i><%= currPlanet.desc %></i>\n]{#explore_gen_desc}\n\n[\n\n]{#fight_gen_desc}\n\n[\n\n]{-#scavenge_desc}\n\n[\n\n]{#trade_gen_desc}\n\n[\n\n]{#survive_gen_desc}\n\n<a href=\"javascript:void(0)\" id='explore_gen'>Explore</a>\n\n<a href=\"javascript:void(0)\" id='fight_gen'>Fight</a>\n\n<a href=\"javascript:void(0)\" id='trade_gen'>Trade</a>\n\n<a href=\"javascript:void(0)\" id='survive_gen'>Survive</a>\n\n[\n<% if (_.s.visitingHeatPlanet == true ) { %>\n<a href=\"javascript: void(0)\" data-passage=\"Feed Cat\">> Explore elsewhere</a>\n<% } else { %>\n<a href='javascript:void(0)' data-passage=\"Launch Gen Planet\">> Explore elsewhere</a>\n<% } %>\n]{-#launch_gen}\n\n<% if (2 < 1) { %>\n[[> Explore elsewhere->Launch Gen Planet]]\n[[> Head back to ship with heat shield->Feed Cat]]\n<% } %>\n<%\n$(function () {\n  var maxTurn = 7;\n  switch(currPlanet.type) {\n  \tcase 'icy':\n  \t\tmaxTurn = 6;\n\t\t//deprecRate = _.random(Math.floor(90/6), Math.ceil(100/5));\n\t\tdeprecRate = _.random(Math.floor(90/6), Math.ceil(100/6));\n  \t\tbreak; \n  \tcase 'barren':\n  \t\tmaxTurn = 7;\n\t\t//Too barren otherwise, so keeping out the random turn\n\t\t//deprecRate = _.random(Math.floor(90/7), Math.ceil(100/6));\n\t\tdeprecRate = Math.floor(90/7);\n  \t\tbreak;\n  \tdefault:\n  \t\tmaxTurn = 8;\n\t\t//deprecRate = _.random(Math.floor(90/8), Math.ceil(100/7));\n\t\tdeprecRate = _.random(Math.floor(90/8), Math.ceil(100/8));\n  }\n\n  function setMineralOutcome(outcomeArr, maxTurn, mineral) {\n  \tif (!_.isNull(mineral)) {\n\t  var turn = _.random(0, maxTurn);\n\t  if (_.isUndefined(outcomeArr[turn])) {\n\t\t  outcomeArr[turn] = mineral.desc;\n\t\t  //alert(mineral.desc + \" at turn \" + (turn + 1));\n\t\t  document.global.mineListen(\"#gp\" + _.s.genPlanetNum + \"_turn\" + turn + \" .mineable\", mineral);\n\t  }\n\t}\n  }\n  \n  function setPlantOutcome(outcomeArr, maxTurn, plant) {\n  \tif (_.isString(plant)) {\n\t  var turn = _.random(0, maxTurn);\n\t  if (_.isUndefined(outcomeArr[turn])) {\n\t\t  outcomeArr[turn] = plant;\n\t\t  document.global.scanListen(\"#gp\" + _.s.genPlanetNum + \"_turn\" + turn +\" .scannable_plant\");\n\t  }\n\t}\n  }\n\n  function setCreatureOutcome(outcomeArr, maxTurn, creature) {\n  \tif (_.isString(creature)) {\n\t  var turn = _.random(0, maxTurn);\n\t  if (_.isUndefined(outcomeArr[turn])) {\n\t\t  outcomeArr[turn] = creature;\n\t\t  document.global.scanListen(\"#gp\" + _.s.genPlanetNum + \"_turn\" + turn +\" .scannable_creature\");\n\t\t  //alert(\"#gp\" + _.s.genPlanetNum + \"_turn\" + turn + \".scannable_creature\");\n\t  }\n\t}\n  }\n  \n  function setHostileOutcome(outcomeArr, maxTurn, hostile) {\n    if (!_.isNull(hostile)) {\n\t  var turn = _.random(0, maxTurn);\n\t  if (_.isUndefined(outcomeArr[turn])) {\n\t\t  outcomeArr[turn] = hostile.desc;\n\t\t  document.global.scanListen(\"#gp\" + _.s.genPlanetNum + \"_turn\" + turn + \" .scannable_creature\");\n\t\t  $(\"#scavenge_desc\").append(\"<span id='gp\" + _.s.genPlanetNum + \"_scavenge_turn\" + turn + \"'>It's <a href='javascript:void(0);' class='scavengeable'>dead</a> now.</span>\");\n\t\t  document.global.scavengeListen(\"#gp\" + _.s.genPlanetNum + \"_scavenge_turn\" + turn + \" .scavengeable\", hostile.drop);\n\t\t  //alert (hostile.drop.name + \" \" + hostile.drop.num);\n\t\t  hostileTurn = turn;\n\t  }\n\t }\n  }\n  \n  var exploreOutcomes = Array();\n  if (Array.isArray(currPlanet.mineral)) {\n  \tcurrPlanet.mineral.forEach(function(elem) {\n    \tsetMineralOutcome(exploreOutcomes, maxTurn, elem);\n\t});\n  }\n  else {\n  \tsetMineralOutcome(exploreOutcomes, maxTurn, currPlanet.mineral);\n\t}\n  setHostileOutcome(exploreOutcomes, maxTurn, currPlanet.hostile);\n  setCreatureOutcome(exploreOutcomes, maxTurn, currPlanet.creature);\n  setPlantOutcome(exploreOutcomes, maxTurn, currPlanet.plant);\n  \n  //Set outcomes for each turn\n  for (turn = 0; turn < maxTurn; turn++) {\n  \tif(_.isUndefined(exploreOutcomes[turn]) || _.isNull(exploreOutcomes[turn])) {\n\t\tcreateTurnDesc(_.sampleSplice(currPlanet.explore_descs), turn);\n\t}\n\telse {\n\t\tcreateTurnDesc(exploreOutcomes[turn], turn);\n\t}\n  }\n\n//Create description for that turn, and hide it\nfunction createTurnDesc(desc, turn) {\n\t\n\tif (!_.isString(desc)) {\n\t\tdesc = \"You keep exploring.\";\n\t}\n\t\n\t$(\"#explore_gen_desc\").append(\"<p id='gp\" + _.s.genPlanetNum + \"_turn\" + turn + \"'>\" + desc + \"</p>\");\n\t$(\"#gp\" + _.s.genPlanetNum + \"_turn\" + turn).hide();\n}\n\n  $(\"#explore_gen\").click(function() {\n    //$(\"#passage\").hide().fadeIn(500);\n  \tjustFought = false;\n\t\n  \tif (inCombat !== true) {\n\t  survive -= deprecRate;\n\t  \n\t  //Return to the ship; survival rate too low!\n\t  if (survive <= 10) { \n\t    $(\"#gp\" + _.s.genPlanetNum + \"_turn\" + (genPlanetTurn - 1)).remove();\n\t\t$(\"#explore_gen_desc\").append(\"<p><span class='green_text'>Your suit is almost out of energy. You need to return to your ship.</span></p><p><strike>Explore</strike></p><p><strike>Fight</strike></p><p><strike>Trade</strike></p><p><strike>Survive</strike></p>\").fadeIn(400);\n\t\t$(\"#explore_gen\").hide();\n\t\t$(\"#fight_gen\").hide();\n\t\t$(\"#trade_gen\").hide();\n\t\t$(\"#survive_gen\").hide();\n\t\t$(\"#fight_gen_desc\").html(\"\");\n\t\t$(\"#trade_gen_desc\").html(\"\");\n\t\t$(\"#survive_gen_desc\").html(\"\");\n\t\t$(\"#scavenge_desc\").hide();\n\t\t$(\"#launch_gen\").fadeIn(400);\n\t  }\n\t  else {\n\t    $(\"#gp\" + _.s.genPlanetNum + \"_turn\" + (genPlanetTurn - 1)).remove();\n\t\t$(\"#gp\" + _.s.genPlanetNum + \"_turn\" + genPlanetTurn).fadeIn(400);\n\t\t$(\"#fight_gen_desc\").html(\"\");\n\t\t$(\"#trade_gen_desc\").html(\"\");\n\t\t$(\"#survive_gen_desc\").html(\"\");\n\t\t$(\"#gp\" + _.s.genPlanetNum + \"_scavenge_turn\" + (genPlanetTurn - 1)).remove();\n\t\tif (genPlanetTurn == hostileTurn) {\n\t\t\tinCombat = true;\n\t\t}\n\t\tgenPlanetTurn++;\n\t  }\n\t  \n\t}\n\telse {\n\t\t$(\"#fight_gen_desc\").html(\"You can't keep exploring; you're being attacked!\");\n\t}\n  });\n\n  $(\"#fight_gen\").click(function() {\n\tif (inCombat == true) {\n\t\t$(\"#fight_gen_desc\").html(_.sample([\"Your blaster makes short work of the creature.\", _.sample([\"Two\", \"Three\", \"Four\"]) + \" shots to its body, and it's dead.\", \"You narrowly dodge its attack, and fire your blaster at it before it recovers, defeating it.\", \"It's aggressive; you use its momentum against it to get a good flanking shot at it, and take it down.\", \"You use a rock as cover and take pot shots at it until it stops moving.\", \"This creature's a piece of cake; you easily take it down.\", \"It takes a prolonged fight before this creature expires.\", \"You take it down with surgical precision.\" ])).hide().fadeIn(100);\t\n\t\t$(\"#scavenge_desc\").fadeIn(600);\n\t\t//$(\"#scavenge_turn\" + (turn - 1)).hide();\n\t\t//$(\"#scavenge_turn\" + turn).show();\n\t\tinCombat = false;\n\t\tjustFought = true;\n\t}\n\telse if (justFought == true) {\n\t\t$(\"#fight_gen_desc\").html(\"No need to beat on a dead corpse.\");\t\n\t}\n\telse {\n\t  $(\"#fight_gen_desc\").html(\"There's nothing worth fighting here.\");\n\t}\n  });\n  \n  $(\"#trade_gen\").click(function() {\n\t  $(\"#trade_gen_desc\").html(\"There's no one to trade with.\");\n  });\n  \n  $(\"#survive_gen\").click(function() {\n\t  $(\"#survive_gen_desc\").html(\"Your suit energy is at \" +  survive + \"%.<br>You are equipped with a basic blaster.\");\n  });\n\n});\n%>",
      "links": [
        {
          "text": "> Explore elsewhere",
          "destination": {
            "name": "Launch Gen Planet",
            "pid": 129
          }
        },
        {
          "text": "> Head back to ship with heat shield",
          "destination": {
            "name": "Feed Cat",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 73,
      "name": "Examine Monolith Final Planet",
      "text": "<% if (_.s.knockedNormal == true) { %>\n\n<% if (_.s.handOnCircle == true) { %>\nThe monolith still looks the same, as does the circle your hand is resting on.\n\n<% } else if (_.s.handOnCircle == false) { %>\nThe monolith still looks the same, as does the faintly glowing circle.\n<% } else { %>\nYou re-examine the monolith, and a bit higher up above your head, you can now barely make out a faintly glowing circle on the surface!\n<% } %>\n\n[[Examine circle->Examine Circle Final Planet]]\n\n<% if (_.s.handOnCircle == true) { %>\n[[Remove your hand->Monolith Switch Final Planet]]\n<% } else { %>\n[[Touch circle->Touch Circle Final Planet]]\n<% } %>\n\n[[Knock on circle->Knock Circle Final Planet]]\n\n[[<->Monolith Final Planet]]\n\n<% } else { %>\nThe monolith slopes inwards a bit. Trom a distance the top looked flat, but you can't see it now. Its material looks faintly metallic, and the surface doesn't seem to be reflective.\n\nYou walk around it, but all sides look about the same.\n\n[[<->Monolith Final Planet]]\n<% } %>",
      "links": [
        {
          "text": "Examine circle",
          "destination": {
            "name": "Examine Circle Final Planet",
            "pid": 76
          }
        },
        {
          "text": "Remove your hand",
          "destination": {
            "name": "Monolith Switch Final Planet",
            "pid": 80
          }
        },
        {
          "text": "Touch circle",
          "destination": {
            "name": "Touch Circle Final Planet",
            "pid": 77
          }
        },
        {
          "text": "Knock on circle",
          "destination": {
            "name": "Knock Circle Final Planet",
            "pid": 78
          }
        }
      ]
    },
    {
      "pid": 74,
      "name": "Touch Monolith Final Planet",
      "text": "<% if (_.s.handOnCircle == true) { %>\nUsing your other hand, you touch the monolith again.\n<% } %>\n\nThe blue of its surface is vibrant and cool, polished smooth. Your hand seems to almost sink into the material.\n\n<% if (_.s.knockedNormal == true) { %>\nYou faintly feel the reverbations, and a faint hum above you.\n<% } %>\n\n[[<->Monolith Final Planet]]",
      "links": []
    },
    {
      "pid": 75,
      "name": "Knock Monolith Final Planet",
      "text": "<% if (_.s.handOnCircle == true) { %>\nThis time, when you knock, the monolith's surface seems to swallow the sound and then return it tenfold, reverberating the sound. The ground seems to shake alongside it; everything seems to be vibrating slightly.\n\nThen the whole monolith flashes several times, weakly, eratically. And then it stops, and returns to normal.\n\nYou wait a bit, but nothing else seems to happen.\n\nThen the monolith lights up again, suddenly, and it starts emitting a string of low gutteral sounds, sharp and quick. It sounds like some sort of language!\n\n[[\"Hello?\"->Speak Monolith Final Planet]]\n\n[[Speak Galactic->Speak Galactic Monolith Final Planet]]\n\n[[Leave->2nd Camp Final Planet]].\n\n<% } else { %>\nA dull muted thud. It sounds solid inside.\n\n[[<->Monolith Final Planet]]\n\n<% _.s.knockedNormal = true %>\n<% } %>",
      "links": [
        {
          "text": "\"Hello?\"",
          "destination": {
            "name": "Speak Monolith Final Planet",
            "pid": 81
          }
        },
        {
          "text": "Speak Galactic",
          "destination": {
            "name": "Speak Galactic Monolith Final Planet",
            "pid": 82
          }
        },
        {
          "text": "Leave",
          "destination": {
            "name": "2nd Camp Final Planet",
            "pid": 84
          }
        }
      ]
    },
    {
      "pid": 76,
      "name": "Examine Circle Final Planet",
      "text": "It's just within arm's reach; the circle is... almost floating, it looks like, glowing in a way that's a bit like light being shone through crystal.\n\n[[<->Examine Monolith Final Planet]]",
      "links": []
    },
    {
      "pid": 77,
      "name": "Touch Circle Final Planet",
      "text": "You reach up and touch your hand to the circle. It seems to grow a bit brighter. When you remove your hand the circle fades.\n\n[[Touch it again->Touch 2 Circle Final Planet]]\n\n[[<->Examine Monolith Final Planet]]",
      "links": [
        {
          "text": "Touch it again",
          "destination": {
            "name": "Touch 2 Circle Final Planet",
            "pid": 79
          }
        }
      ]
    },
    {
      "pid": 78,
      "name": "Knock Circle Final Planet",
      "text": "You knock on the circle and wait; a dull muted sound, and the circle brightens up a bit again, but nothing different from your prior knocking.\n\n[[<->Examine Monolith Final Planet]]",
      "links": []
    },
    {
      "pid": 79,
      "name": "Touch 2 Circle Final Planet",
      "text": "\nYou press your hand against it, firmer this time.\n\nThe circle is getting brighter. You hear an indistinct hum, you feel the monolith vibrating slightly underneath your hand.\n\nYou wait a bit longer, but nothing further seems to happen.\n\n[[Remove your hand->Monolith Final Planet]]\n\n[[Leave your hand there->Monolith Switch Final Planet]]\n",
      "links": [
        {
          "text": "Remove your hand",
          "destination": {
            "name": "Monolith Final Planet",
            "pid": 70
          }
        },
        {
          "text": "Leave your hand there",
          "destination": {
            "name": "Monolith Switch Final Planet",
            "pid": 80
          }
        }
      ]
    },
    {
      "pid": 80,
      "name": "Monolith Switch Final Planet",
      "text": "<% if (_.s.handOnCircle == true) { _.s.handOnCircle = false; %>\n<% } else { _.s.handOnCircle = true; } %>\n\n<% if (2 < 1) { %>\nthis is an error; you shouldn't see this :( I'm doing this just for the pretty arrow.\n[[Examine Monolith->Monolith Final Planet]]\n<% } %>\n\n<%= story.passage(\"Monolith Final Planet\").render() %>",
      "links": [
        {
          "text": "Examine Monolith",
          "destination": {
            "name": "Monolith Final Planet",
            "pid": 70
          }
        }
      ]
    },
    {
      "pid": 81,
      "name": "Speak Monolith Final Planet",
      "text": "\"Hello?\" you ask, hesitantly. \"I mean you no harm.\"\n\nAnother string of sharp sounds.\n\nHmm. You think there's a communication breakdown here.\n\n[[Try to communicate->Communicating Monolith Final Planet]]\n\n[[Set up camp nearby->2nd Camp Final Planet]]\n\n<% _.change(_.s.stats.home, 1); %>\n<% _.change(_.s.stats.diplomacy, 1); %>",
      "links": [
        {
          "text": "Try to communicate",
          "destination": {
            "name": "Communicating Monolith Final Planet",
            "pid": 83
          }
        },
        {
          "text": "Set up camp nearby",
          "destination": {
            "name": "2nd Camp Final Planet",
            "pid": 84
          }
        }
      ]
    },
    {
      "pid": 82,
      "name": "Speak Galactic Monolith Final Planet",
      "text": "\"(Diplomatic) Greeting. I mean no harm to you.\"\n\nA pause, then another emphatic string of sounds.\n\n\"(Querying) Where are you?\"\n\nPredictably, you don't understand their answer.\n\nYeah, this could take a bit.\n\n[[Try to communicate->Communicating Monolith Final Planet]]\n\n[[Set up camp nearby->2nd Camp Final Planet]]\n\n<% _.change(_.s.stats.galactic, 1); %>\n<% _.change(_.s.stats.diplomacy, 1); %>",
      "links": [
        {
          "text": "Try to communicate",
          "destination": {
            "name": "Communicating Monolith Final Planet",
            "pid": 83
          }
        },
        {
          "text": "Set up camp nearby",
          "destination": {
            "name": "2nd Camp Final Planet",
            "pid": 84
          }
        }
      ]
    },
    {
      "pid": 83,
      "name": "Communicating Monolith Final Planet",
      "text": "You keep at it, trying different languages roots, concentrating on conveying tones, and trying to get a handle on the basics of what you have to assume is a set language being growled back at you. \n\nAll throughout, you have to keep your hand raised up against the circle; you try taking it off, but that immediately just stops the monolith from broadcasting.\n\nSuddenly, you hear off in the distance, a humming noise.\n\nThe chattering from the monolith picks up in tone; you think they hear it too, but they're drowning out the noise, so you take your hand off and look around for the source.\n\n[[Try to locate the noise->Locate Hum Final Planet]]\n\n<% _.change(_.s.stats.diplomacy, 1); %>",
      "links": [
        {
          "text": "Try to locate the noise",
          "destination": {
            "name": "Locate Hum Final Planet",
            "pid": 86
          }
        }
      ]
    },
    {
      "pid": 84,
      "name": "2nd Camp Final Planet",
      "text": "You decide to leave the monolith for now, and you go into the forest to set up camp.\n\n<h1>Lower Forests</h1>\n\n<a href=\"javascript:void(0)\" id=\"link1_2camp_finp\">Find shelter</a>.\n\n[\nThe area's not rocky enough to have any caves you don't think, so you settle on a flat spot nestled between some trees, which should provide some wind cover.\n\n<a href=\"javascript:void(0)\" id=\"link2_2camp_finp\">Gather branches</a>.\n]{-#psg1_2camp_finp}\n\n[\nYou pick up some brittle branches and twigs from the ground; they smell somewhat of spice and walnut.\n\n<a href=\"javascript:void(0)\" id=\"link3_2camp_finp\">Hunt for food</a>.\n]{-#psg2_2camp_finp}\n\n[\nYou drop the branches, and go deeper into the forest to look for potential game animals like the one you got the day before.\n\nSuddenly, a low deep humming noise penetrates the air.\n\nListening closer, you think it doesn't sound very organic. It sounds mechanical.\n\n<a href=\"javascript:void(0)\" data-passage=\"Locate Hum Final Planet\">Try to locate the noise</a>.\n]{-#psg3_2camp_finp}\n\n<% if (2 < 1) { %>\n[[Try to locate the noise->Locate Hum Final Planet]].\n<% } %>\n\n<%\n$(function () {\ndocument.global.showNextPsg(\"#link1_2camp_finp\", \"#psg1_2camp_finp\", false);\ndocument.global.showNextPsg(\"#link2_2camp_finp\", \"#psg2_2camp_finp\", false);\ndocument.global.showNextPsg(\"#link3_2camp_finp\", \"#psg3_2camp_finp\", false);\ndocument.global.showNextPsg(\"#link4_2camp_finp\", \"#psg4_2camp_finp\", false);\ndocument.global.showNextPsg(\"#link5_2camp_finp\", \"#psg5_2camp_finp\");\n});\n%>",
      "links": [
        {
          "text": "Try to locate the noise",
          "destination": {
            "name": "Locate Hum Final Planet",
            "pid": 86
          }
        }
      ]
    },
    {
      "pid": 85,
      "name": "Start",
      "text": "[\n<h1>Transient Skies</h1>\n\n<h2><a href=\"javascript:void(0)\" data-passage=\"No Fuel\">Begin</a></h2>\n]{#title_text}\n\n<a href=\"javascript:void(0)\" id=\"debug_on\">Turn Debug On</a> (Adds javascript alerts, for testing, will be taken out)\n[\nDebug has been turned on!\n]{-#debug_on_psg}\n\n<% if (2 < 1) { %>\n[[>->No Fuel]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.showNextPsg('#debug_on', '#debug_on_psg', true, function() {s.debugOn = true;});\n\nstory.show('No Fuel');\n});\n%>",
      "links": [
        {
          "text": ">",
          "destination": {
            "name": "No Fuel",
            "pid": 2
          }
        }
      ]
    },
    {
      "pid": 86,
      "name": "Locate Hum Final Planet",
      "text": "The humming noise is growing louder. You think it's coming from the east, or southeast?\n\nYou walk in what you think is the right direction, as the sound moves to right where the monolith was, and cuts out.\n\nMaking your way to the clearing edge and peering carefully in, you see a being, unfolding itself from a large contraption of large leathery wings and metal spines.\n\nThe brown, smooth skinned being has a bulbous head and long limbs, and is draped in black-blue fabric. \n\nIt looks around, examining the clearing, and then starts heading into the forest.\n\n[[Hide->Hide Being Final Planet]]\n\n[[Approach->Approach Being Final Planet]]\n\n<% _.change(_.s.stats.discovery, 1); %>",
      "links": [
        {
          "text": "Hide",
          "destination": {
            "name": "Hide Being Final Planet",
            "pid": 87
          }
        },
        {
          "text": "Approach",
          "destination": {
            "name": "Approach Being Final Planet",
            "pid": 71
          }
        }
      ]
    },
    {
      "pid": 87,
      "name": "Hide Being Final Planet",
      "text": "You hunker down behind a tree, as it heads to your right out of the clearing. It has a limber stride, smooth and graceful.\n\n[[Examine its flying contraption]]\n\n[[Follow it->Follow Being Final Planet]]",
      "links": [
        {
          "text": "Examine its flying contraption",
          "destination": {
            "name": "Examine its flying contraption",
            "pid": 89
          }
        },
        {
          "text": "Follow it",
          "destination": {
            "name": "Follow Being Final Planet",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 88,
      "name": "Pirates Final Planet",
      "text": "Suddenly, you hear the distinct sound of a laser being fired. Looking over, you see two space pirates coming into the clearing, gibbering something in threatening tones at the two of you while waving their blasters.\n\nYou've never seen this species up close, but you've seen the briefings. They're [[<%= _.s.pirateSpecies %>->Pirates Description]].\n\nThe local being turns and tries to say something, but the smaller pirate fires their blaster again, and the being stops.\n\nThe taller one points a blaster at you. \n\n\"(Threatening) Where ship say!\" they say in fumbling galactic.\n\nThe local being takes a stride towards the monolith, and the shorter pirate shoots a small flowering plant in front of the being. It explodes in a shower of singed petals and plant parts. The being takes a step back, growling; you think they get now what they're dealing with.\n\n<a href=\"javascript:void(0)\" id=\"shoot_pirates_finp\">Shoot them!</a>\n\n[\nYou consider going for your blaster and having a shootout, but as good as you are, you're not that good, not with both of them training their weapons on you already. Too risky.\n]{-#shot_pirates_finp.green_text}\n\n[[Talk to them->Talk Pirates Final Planet]]\n\n<%\n$(function () {\ndocument.global.showNextPsg('#shoot_pirates_finp', '#shot_pirates_finp', true, (function() {_.change(_.s.stats.diplomacy, -2); $('#pir_exmark_fp').hide();}));\n});\n%>",
      "links": [
        {
          "text": "<%= _.s.pirateSpecies %>",
          "destination": {
            "name": "Pirates Description",
            "pid": 96
          }
        },
        {
          "text": "Talk to them",
          "destination": {
            "name": "Talk Pirates Final Planet",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 89,
      "name": "Examine its flying contraption",
      "text": "You get closer to the flying contraption. It's well constructed, impressive. Very angular, and impressively built, if both this and the monolith are indeed by this being.\n\nIt's large. You heft it, try to figure out how to use it.\n\nSuddenly, there's a rumbling shout behind you. You turn around; it's the being. They have a crystal that they're waving at you. \n\n[[Freeze!->Back to Clearing Final Planet]]\n\n[[Shoot them!->Shoot Being Final Planet]]",
      "links": [
        {
          "text": "Freeze!",
          "destination": {
            "name": "Back to Clearing Final Planet",
            "pid": 100
          }
        },
        {
          "text": "Shoot them!",
          "destination": {
            "name": "Shoot Being Final Planet",
            "pid": 97
          }
        }
      ]
    },
    {
      "pid": 90,
      "name": "Follow Being Final Planet",
      "text": "You follow the being, into the forests. But as it goes deeper in, its stride gets longer, and the vegetation gets harder to navigate, and you're getting tired.\n\nAnd you step on a branch, accidentally. A loud snapping noise; the being whirls around, and before you can think, it's charging back at you, and they have this crystallic stone in their hand, which is faintly glowing.\n\n[[Freeze!->Calm Being Final Planet]]\n\n[[Shoot them!->Shoot Being Final Planet]]",
      "links": [
        {
          "text": "Freeze!",
          "destination": {
            "name": "Calm Being Final Planet",
            "pid": 98
          }
        },
        {
          "text": "Shoot them!",
          "destination": {
            "name": "Shoot Being Final Planet",
            "pid": 97
          }
        }
      ]
    },
    {
      "pid": 91,
      "name": "Trade Space",
      "text": "Double-click this passage to edit it.",
      "links": []
    },
    {
      "pid": 92,
      "name": "Fight Space",
      "text": "There is nothing to fight here.\n\n[[<->Orbiting Space]]",
      "links": []
    },
    {
      "pid": 93,
      "name": "Survive Space",
      "text": "You take inventory of your ship.\n\nShip Status: <span class='green_text'>Good</span>.\n\n<% if (_.s.heatShields.bought > 0) { %>\nImproved Heat Shields installed.\n<% } %>\n\n<% if (_.s.warpDrive.bought > 0) { %>\nWarp Drive installed.\n<% } %>\n\n<% if (_.s.hunterMissiles.bought > 0) { %>\nHunter Missile system installed.\n<% } %>\n\n<% if (_.s.starbeamCannon.bought > 0) { %>\nStarbeam Cannon lasers installed.\n<% } %>\n\n<% if (_.s.shipThrusters.bought > 0) { %>\nImproved ship thrusters installed.\n<% } %>\n\n<% if (_.s.suitEnergy.bought > 0) { %>\nSuit Energy upgraded.\n<% } %>\n\n<% if (_.s.catFood.bought > 0) { %>\nYou have food for <% _.s.catName %>.\n<% } %>\n\n<% if (_.s.meFood.bought > 0) { %>\nYou have food for yourself.\n<% } %>\n\n[[<->Orbiting Space]]",
      "links": []
    },
    {
      "pid": 94,
      "name": "Talk Pirates Final Planet",
      "text": "\"(Explaining) My ship is dead. You destroyed my ship!\"\n\nThe pirates exchange angry words with each other, before turning back to you.\n\nTaller Pirate: \"(Null) Lying. Demonstrate location you contacted with planet.\"\n\n[[Be diplomatic->Dipl Pirates Final Planet]]\n\n[[Stall->Stall Pirates Final Planet]]",
      "links": [
        {
          "text": "Be diplomatic",
          "destination": {
            "name": "Dipl Pirates Final Planet",
            "pid": 101
          }
        },
        {
          "text": "Stall",
          "destination": {
            "name": "Stall Pirates Final Planet",
            "pid": 102
          }
        }
      ]
    },
    {
      "pid": 95,
      "name": "Agree Take Pirates Final Planet",
      "text": "You: (Agreeable) I lead.\n\nTaller pirate: (Null) Thanks.\n\nYou're about to leave, when the shorter pirate looks over at the local being and says something offhand.\n\nThe taller one shrugs, and the shorter one readies their blaster at the being.\n\n[[\"(Exclamation) Wait!\"->Wait Interrupt Pirates Final Planet]]\n\n[[Shoot the pirates!->Shoot Interrupt Pirates Final Planet]]\n\n[[Do nothing->Don't Interrupt Pirates Final Planet]]",
      "links": [
        {
          "text": "\"(Exclamation) Wait!\"",
          "destination": {
            "name": "Wait Interrupt Pirates Final Planet",
            "pid": 105
          }
        },
        {
          "text": "Shoot the pirates!",
          "destination": {
            "name": "Shoot Interrupt Pirates Final Planet",
            "pid": 106
          }
        },
        {
          "text": "Do nothing",
          "destination": {
            "name": "Don't Interrupt Pirates Final Planet",
            "pid": 107
          }
        }
      ]
    },
    {
      "pid": 96,
      "name": "Pirates Description",
      "text": "Squat and furry, bipedal with a long tail for balance, and they get around by hopping. They're actually quite quick. \n\nOther spacefarers have reported encounters with them, and you know there's some suspicion about how many more there are missing because of them. \n\nThey're classified as Avoid, Extremely Dangerous.\n\n[[<->Pirates Final Planet]]",
      "links": []
    },
    {
      "pid": 97,
      "name": "Shoot Being Final Planet",
      "text": "You unholster your blaster, while diving to your left.\n\nThe being shrieks, and a bolt of light hurtles from the crystal it's holding and hits you in the chest, but your blaster's in your hands, and you're flying through the air, and you squeeze the trigger a bunch of times, and your shot blasts through the being, and they drop, and you drop, hard.\n\n<a href=\"javascript:void(0)\" id=\"silence_being_finp\">Silence...</a>\n\n[\n<b>Silence</b>, except for your heavy panting, and groans of pain.\n\nYour side hurts like a bitch. The suit took most of it; thank goodness it can still do that at least. But even though the shot didn't penetrate, you still more than felt its impact. Your ribs might be broken.\n\nGetting up, grimacing, hobbling, you take the crystal and an odd little disk from the body of the being, and make your way back to your camp and collapse.\n\n<a href=\"javascript:void(0)\" data-passage=\"Sleep Camp 2 Final Planet\">Pain!</a>\n]{-#silenced_being_finp}\n\n<% if (2 < 1) { %>\n[[So much pain!->Sleep Camp 2 Final Planet]]\n<% } %>\n<%\n$(function () {\ndocument.global.showNextPsg('#silence_being_finp', '#silenced_being_finp', true);\n});\n%>",
      "links": [
        {
          "text": "So much pain!",
          "destination": {
            "name": "Sleep Camp 2 Final Planet",
            "pid": 99
          }
        }
      ]
    },
    {
      "pid": 98,
      "name": "Calm Being Final Planet",
      "text": "You make no sudden movements, as it comes up to you.\n\nIt pulls out a crystal, waving it at you, and step-marches you back to the [[clearing->Back to Clearing Final Planet]].",
      "links": [
        {
          "text": "clearing",
          "destination": {
            "name": "Back to Clearing Final Planet",
            "pid": 100
          }
        }
      ]
    },
    {
      "pid": 99,
      "name": "Sleep Camp 2 Final Planet",
      "text": "When you return to consciousness, it is pitch black.\n\n<% if (_.has(_.s.inventory.cat)) { %>\n<b><%= _.s.catName %></b> looks at you with concern.\n\n\"I'm okay,\" you tell them. You'll be okay.\n<% } %>\n\nYou take a drink from your raincatcher, which did its job, and fall back asleep.\n\nYou return to the monolith clearing after resting.\n\nThe flying contraption has blaster holes through it, which you examine with concern. Where did they come from?\n\nNothing else seems to have changed. You look at the [[monolith->Monolith 2 Final Planet]] again.\n\n",
      "links": [
        {
          "text": "monolith",
          "destination": {
            "name": "Monolith 2 Final Planet",
            "pid": 125
          }
        }
      ]
    },
    {
      "pid": 100,
      "name": "Back to Clearing Final Planet",
      "text": "The being carefully keeps you in their sights as they go up to the monolith. \n\n[[Watch and wait->Pirates Final Planet]]",
      "links": [
        {
          "text": "Watch and wait",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        }
      ]
    },
    {
      "pid": 101,
      "name": "Dipl Pirates Final Planet",
      "text": "<% _.change(_.s.stats.pirateLike, 1); %>\n\"You: (Diplomatic) If I lead you to my ship's location, will you free us?\" You gesture to the being.\n\nThey look at each other, and confer in their language.\n\nTaller pirate: \"(Null) Yes.\"\n\nYou: \"(Querying) Why do you want to know my ship's location? Do you want cargo resources? Maybe I can tell you resource origin planet.\"\n\nTaller pirate: \"(Null) Origin people us want technology to investigate. Galactic dirt you do not allow origin people us to explore. Lead to ship.\"\n\n[[Agree to take them->Agree Take Pirates Final Planet]]\n\n[[Refuse->Killed By Pirates Wreckage Final Planet 1]]\n\n[[Stall->Stall Pirates Final Planet]]",
      "links": [
        {
          "text": "Agree to take them",
          "destination": {
            "name": "Agree Take Pirates Final Planet",
            "pid": 95
          }
        },
        {
          "text": "Refuse",
          "destination": {
            "name": "Killed By Pirates Wreckage Final Planet 1",
            "pid": 178
          }
        },
        {
          "text": "Stall",
          "destination": {
            "name": "Stall Pirates Final Planet",
            "pid": 102
          }
        }
      ]
    },
    {
      "pid": 102,
      "name": "Stall Pirates Final Planet",
      "text": "<% _.change(_.s.stats.pirateLike, -1); %>\nYou: \"(Explaining) I believe you might kill us after we are at my ship location. (Query) How could you display more trustworthiness?\"\n\nTaller pirate: \"(Null) I have not killed you already.\"\n\nYou: \"(Neutral) You shot my ship while in outer space.\"\n\nTaller pirate: \"(Null) We had shot to disable. We do not shoot to murder. Galactic dirt you kills with no purpose. Origin people us do not kill with no purpose.\"\n\nYou: \"(Explaining) Galactic spacefarers do not kill with no purpose. Mission to explore.\"\n\nTaller pirate: \"(Null) Cease discussion. Go to ship now.\"\n\nYou: \"(Querying) Why do you want to know my ship location?\"\n\nThe shorter pirate says something sharp at the taller one, who replies dismissively.\n\nTaller pirate: \"(Null) Comrade has no time. Do at the moment, no additional queries.\"\n\nYou: \"(Querying) Do you have ships?\"\n\nTaller pirate: \"(Null) -\"\n\nThe shorter pirate interrupts angrily. \"(Null) Lead. Us follow.\"\n\nThey're getting distracted. You see the being slowly sidling its way behind them. They look at you, and you two make eye contact.\n\n[[Keep stalling->Stall 2 Pirates Final Planet]]\n\n[[Agree to take the pirates to your ship->Agree Take Pirates Final Planet]]\n",
      "links": [
        {
          "text": "Keep stalling",
          "destination": {
            "name": "Stall 2 Pirates Final Planet",
            "pid": 103
          }
        },
        {
          "text": "Agree to take the pirates to your ship",
          "destination": {
            "name": "Agree Take Pirates Final Planet",
            "pid": 95
          }
        }
      ]
    },
    {
      "pid": 103,
      "name": "Stall 2 Pirates Final Planet",
      "text": "You: \"(Explaining) Ship is far. Long distance walk to ship.\"\n\nTaller pirate: \"(Null) Us fast walking, not same as galactic dirt.\"\n\nThe being keeps making its way behind, and looks at you again. You nod. You don't know if that'll translate, but you nod, and it blinks.\n\nShorter pirate shouts again: \"(Null) Lead urgently.\"\n\nThe being has stopped. It slowly pulls out a crystal from its pocket. Your hand hovers over your blaster. Your eyes meet again, and they nod.\n\n[[Now!->Shoot Pirates Clearing Final Planet]]",
      "links": [
        {
          "text": "Now!",
          "destination": {
            "name": "Shoot Pirates Clearing Final Planet",
            "pid": 104
          }
        }
      ]
    },
    {
      "pid": 104,
      "name": "Shoot Pirates Clearing Final Planet",
      "text": "The being fires a bolt of light from his crystal at the taller one; they're thrown forward, but their suit absorbs most of it. Both pirates turn around.\n\nYou pull out your blaster while they're distracted, and fire at the shorter pirate, while moving towards the trees, which you're closer to. The native being is running towards the monolith, and makes it there quickly.\n\nThe pirates are caught in a crossfire, in open space; you can hear them jabbering angrily at each other. They stop firing at the being, and run while shooting at you instead. You're still not at tree cover yet.\n\nYou take a blaster shot in your non-dominant shoulder, sending shoots of pain through your entire arm. But you keep shooting, and a shot manages to penetrate the suit of the shorter pirate, and it's one down, one to go.\n\nYou slow down, you can't run anymore, you take a few more stray shots, you fall down, you twist around and keep shooting. \n\nThe being has moved up with the taller pirate's focus entirely on you, and the being lands a crystal blast direct on the taller pirate, and they're finally down as well.\n\nSo are you; you're [[down->Coop Shoot Pirates Final Planet]] as well.",
      "links": [
        {
          "text": "down",
          "destination": {
            "name": "Coop Shoot Pirates Final Planet",
            "pid": 108
          }
        }
      ]
    },
    {
      "pid": 105,
      "name": "Wait Interrupt Pirates Final Planet",
      "text": "<% _.change(_.s.stats.pirateLike, 1); %>\n\n<% /* if (s.pirates > 0) { */ %>\nThe pirates both stop and looks at you. The shorter one looks annoyed.\n\nYou: \"(Exclamation) I will not lead you if you end life.\"\n\nThe taller pirate hesitates.\n\nTaller Pirate: \"(Null) Fine.\"\n\nThe taller pirate waves the shorter one off, and soon you're leading a procession through the forest, with the taller pirate behind you with a blaster, and the shorter pirate watching the being.\n\n<% _.s.localIsAlive = true; %>\n\n[[Lead them back to your ship->Lead Pirates Wreckage Final Planet]]\n\n<% /* } else { %>\nThe taller pirate ignores you. You watch, horrified, as the local being is killed.\n\nThe shorter one pushes you forward. \"(Null) Lead,\" they say.\n\n[[Lead->Lead Pirates Wreckage Final Planet]]\n\n[[Kill them!->Refuse Pirates Wreckage Final Planet]]\n<% } */ %>\n",
      "links": [
        {
          "text": "Lead them back to your ship",
          "destination": {
            "name": "Lead Pirates Wreckage Final Planet",
            "pid": 118
          }
        },
        {
          "text": "Lead",
          "destination": {
            "name": "Lead Pirates Wreckage Final Planet",
            "pid": 118
          }
        },
        {
          "text": "Kill them!",
          "destination": {
            "name": "Refuse Pirates Wreckage Final Planet",
            "pid": 119
          }
        }
      ]
    },
    {
      "pid": 106,
      "name": "Shoot Interrupt Pirates Final Planet",
      "text": "You can't let them murder this innocent being! You reach for your blaster. The taller one sees you going for it, and shoots you <span class=\"bad_end_text\">dead</span>.\n\n<a href=\"javascript:void(0)\" data-passage=\"Agree Take Pirates Final Planet\" id=\"shoot_interrupt_pirates_reload\">< Reload last checkpoint?</a>",
      "links": []
    },
    {
      "pid": 107,
      "name": "Don't Interrupt Pirates Final Planet",
      "text": "Nothing you can do. You can't risk it.\n\nThe taller pirate kills the native being, and gestures for you to lead. You try not to look at the corpse as you [[pass by->Lead Pirates Wreckage Final Planet]].\n\n<% _.s.localIsAlive = false; %>",
      "links": [
        {
          "text": "pass by",
          "destination": {
            "name": "Lead Pirates Wreckage Final Planet",
            "pid": 118
          }
        }
      ]
    },
    {
      "pid": 108,
      "name": "Coop Shoot Pirates Final Planet",
      "text": "The being goes up to you, and checks on you. They gingerly feel your suit. You lie there and try to control your breathing.\n\nThe being goes to the monolith, and you can hear them talking.\n\nYou close your eyes, and [[rest->Recovery Final Planet]].",
      "links": [
        {
          "text": "rest",
          "destination": {
            "name": "Recovery Final Planet",
            "pid": 109
          }
        }
      ]
    },
    {
      "pid": 109,
      "name": "Recovery Final Planet",
      "text": "More beings come, and they take you back to their village of cylindrical and rectangular buildings chiseled out of smooth rock.\n\n<% if (_.has(_.s.inventory.cat)) { %>\n<b><%= _.s.catName %></b> is there too, at some point, licking your face, as you drift in and out of consciousness.\n<% } %>\n\nYou slowly recover, and various beings come to gawk and try to speak to you.\n\nThey give you food. The food is gloppy and bitter, but you manage. <% if (_.s.localIsAlive == true) { %>\nThe being from the monolith clearing, visits you often, paying close attention to what you seem to like, and soon your meals are meat from the horned creature you hunted, cut into chunks and roasted over fire. You are grateful; soon you are better acquainted and start calling this new friend <b><%= _.s.beingName %></b>, which is the closest you can come to pronouncing their name.\n<% } %>\n\nAnd you slowly learn to communicate through rudimentary sign language, pointing and gesturing and nodding, and you pick up some of their words as well, though you're incapable of pronouncing them, but they're delighted at your attempts.\n\nYou take them back to your ship, and they understand that you are from elsewhere in the sky, and that you were attacked by the two pirates who were also from the sky.\n\nYou learn how to use the flying contraptions, and on an excursion across the planet you find the two ships the pirates came down on, hidden well under a jungle canopy.\n\nYou [[talk->Exchange Final Planet]] with them more, and you slowly get to know them.",
      "links": [
        {
          "text": "talk",
          "destination": {
            "name": "Exchange Final Planet",
            "pid": 189
          }
        }
      ]
    },
    {
      "pid": 110,
      "name": "Study Monoliths Final Planet",
      "text": "You learn that the planet has several monoliths spread across the planet, and that they use them to communicate with each other, and have been experimenting with sending message to the stars as well. \n\nStudying them, you see that they are using a communication spectrum you are familiar with. Standard galactic comms don't use it anymore, but scientists still monitor them because they have to cover anything that any unknown species might try to use.\n\n[[Contact HQ->Contact Ending]]\n\n[[Don't contact HQ; stay->Stay End]]",
      "links": [
        {
          "text": "Contact HQ",
          "destination": {
            "name": "Contact Ending",
            "pid": 111
          }
        },
        {
          "text": "Don't contact HQ; stay",
          "destination": {
            "name": "Stay End",
            "pid": 112
          }
        }
      ]
    },
    {
      "pid": 111,
      "name": "Contact Ending",
      "text": "It takes time, but you work with the beings, to change frequencies and electrical pulses and pathways, and you get it working. You establish links back to galactic <%=_.s.centralPlanet %> headquarters, and you report in.\n\nThey find your reports on these beings with their technologies and on the pirates invaluable, and your officer decides to transport you a new suit and a replacement spacecraft without taking it out of your pay.\n\nIt will take some time, of course, your officer says, apologizing without sounding sorry. Your equipment will be transmitted to the trade hub, and you can fly there with one of the pirate's ships. They'll drop the automated defences, so you can get through. \n\nYou get the coordinates to the trade hub. And you get the coordinates to the center of the galaxy.\n\nAnd you look up at the sky again.\n\nYou could [[keep going->Center End]].\n\nOr you could [[head back->Home End]].",
      "links": [
        {
          "text": "keep going",
          "destination": {
            "name": "Center End",
            "pid": 29
          }
        },
        {
          "text": "head back",
          "destination": {
            "name": "Home End",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 112,
      "name": "Stay End",
      "text": "You decide not to contact HQ.\n\nYou decide to stay. At least for a little while.\n\n<% if (_.s.stats.home.num > 1) { %>\n[\nMaybe you can find a way to help your people, here on this planet. It bears further study, you think. What are the environmental and geographical factors that make this planet and your home planet survivable?\n\nYou want to stay and find out.\n]{#home_stay}\n<% } %>\n\n<% if (_.s.stats.duty.num > 1) { %>\n[\nYour mission, after all, is to explore. This planet and its people are more than worthy of greater study.\n\nSomeday perhaps you will find your way back to <%=_.s.centralPlanet %> and then give HQ a detailed report.\n]{#duty_stay}\n<% } %>\n\n<% if (_.s.stats.env.num > 0) { %>\n[\nThis beautiful planet holds promise. You can feel it. And you're tired; you want to learn to live more within your own means, instead of the whims of technological advance.\n]{#env_stay}\n<% } %>\n\n<% if (_.s.stats.diplomacy.num > 0) { %>\n[\nYou want to know more about these beings: their society, their culture, their way of life. \n]{#diplomacy_stay}\n<% } %>\n\n<%  if (_.s.stats.discovery.num > -1) { %>\n[\nYou think maybe it's time you stopped pushing forward so much and started to take a closer look at these places you've been skimming past. There is always more to these planets than mineral extractions and scan targets, but maybe you've lost sight of that. Maybe you need to re-orient your point of view, freed from the hard data of the navvisor and the constant push to keep moving onwards.\n]{#discovery_stay}\n<% } %>\n\nYou get to work: exploring, discovering, learning more about this planet and its inhabitants. And it is rewarding, and involving, and good.\n\n<% if (_.has(_.s.inventory.cat)) { %>\n<b><%= _.s.catName %></b> acclimates well over time to this planet, as do you.\n<% } %>\n\nOver time, you stop looking up at the [[sky->END]] so much.",
      "links": [
        {
          "text": "sky",
          "destination": {
            "name": "END",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 113,
      "name": "END",
      "text": "<h1>END.</h1>\n\n<span class='green_text'><b>Thank you</b> for playing!</span>\n\nBy dgtziea.\n\nWritten using Twine 2 and Snowman 1.3 (Thanks to Chris Klimas).\n\nThanks to mathbrush and J for testing.\n\nThe font used is Titillium Web.",
      "links": []
    },
    {
      "pid": 114,
      "name": "Help Pirates Wreckage Final Planet",
      "text": "The shorter pirate ignores you in favor of the wrecked electronics, but the taller pirate comes over, and starts talking before you say anything.\n\nTaller pirate: \"(Null) Galactic excrement is helpless and useless and stupid.\" They pause. \"(Query) Why do you cooperate with galactic?\"\n\nYou: \"(Query) Do you mean why have I joined the galactic spacefarers?\"\n\nTaller pirate: \"(Query) Galactic spacefarers is name? (Null) Galactic spacefarers disallow trade, disallow explore, invade origin space, incarcerate us joining. Us not desire joining. Us desire colonization of space rocks.\"\n\nYou: \"(Explanatory) Galactic spacefarers do not want to incarcerate, or force. Desire structure. Many space rocks, many planets, many origin systems. \"\n\nTaller pirate: \"(Null) I don't trust.\"\n\nYou: \"(Query) How did you learn galactic speech?\"\n\nTaller pirate: \"(Null) Us people get one galactic spacefarer space ship personnel. They talk. Space ship useful. Us disable galactic spacefarer space ships following.\"\n\nYou: \"(Query) dead?\"\n\nThe taller pirate pauses.\n\nTaller pirate: \"(Null) dead. I dissent. Leader overrule.\"\n\n<% if (_.s.localIsAlive == true)  { %>\nThe taller pirate looks over at the shorter one, who is further away, and walks over to the shorter one.\n\nThey talk briefly, and then leave. You try to follow them, but the taller one shakes their head.\n\nClimbing the nearby rocks, you see their ships as they blast off and disappear into the sky.\n\nEntering the clearing where they're ships took off, you see your blaster on the ground, and pick it up.\n\nThe local being approaches you, and lowers their head at you. Hesitantly, you lower your head back.\n\nThey say some words, and then, gesturing in a direction, they start walking that way.\n\n[[Follow it->Village Final Planet]]\n<% } else { %>\nThe taller pirate looks over at the shorter one, who is further away, and pulls something out of his space suit, and presses it into your hands.\n\nTaller pirate: \"(Null) Us intelligent. Us replicate many. Us desire freedom. Tell galactic spacefarers.\"\n\nYou look down at the [[device->Comm Device Final Planet]].\n<% } %>",
      "links": [
        {
          "text": "Follow it",
          "destination": {
            "name": "Village Final Planet",
            "pid": 150
          }
        },
        {
          "text": "device",
          "destination": {
            "name": "Comm Device Final Planet",
            "pid": 116
          }
        }
      ]
    },
    {
      "pid": 115,
      "name": "Killed By Pirates Wreckage Final Planet",
      "text": "The taller pirate goes over to the short one, and they squabble in low tones.\n\nThe shorter one gestures at you<% if (_.s.localIsAlive == true)  { %> and then the local being<% } %>, and then suddenly the shorter pirate raises their blaster and points it at you.\n\n<% if (_.s.stats.pirateLike.num > 0) { %>\n\"(Apologetic),\" The taller pirates says.\n<% } %>\n\nYou fumble for your own blaster, but it's too <span class=\"bad_end_text\">late</span>.\n\n<a href=\"javascript:void(0)\" data-passage=\"Lead Pirates Wreckage Final Planet\" id=\"killed_by_pirates_reload\">< Reload last checkpoint?</a>",
      "links": []
    },
    {
      "pid": 116,
      "name": "Comm Device Final Planet",
      "text": "It's a handheld comm device. Well, it's definitely not made to galactic standard; the metal is uneven and soft, and all the electronics are exposed. But all the parts are there.\n\nYou look up, and the taller pirate has walked over to the shorter one.\n\nWithout another word, they leave. You try to follow them, but the taller one shakes their head.\n\nClimbing the nearby rocks, you see their ships as they blast off and disappear into the sky.\n\nYou return to your [[cave->Comm Device Cave Final Planet]].\n",
      "links": [
        {
          "text": "cave",
          "destination": {
            "name": "Comm Device Cave Final Planet",
            "pid": 117
          }
        }
      ]
    },
    {
      "pid": 117,
      "name": "Comm Device Cave Final Planet",
      "text": "The comm device works. You contact galactic HQ. They're shocked to hear your voice, but they listen to your report.\n\nThey say it will take a while to reroute the nearest spacefarer to come pick you up.\n\nThey're quite excited to hear about your conversation with the space pirates. You plead their case, but you know the really important decisions aren't going to be made by the people you're talking to. The scientists love the new data, the new discoveries, but it's not them that will decide what to do with all of the information. \n\nYou go back to your cave, and you start a fire, and you go out hunting, and you return to your cave, and you prepare dinner,<% if (_.has(_.s.inventory.cat)) { %> and you feed <%= _.s.catName %>,\n<% } %> and you think about what comes next.\n\nYou could [[keep going->Center End]].\n\nOr you could [[head back->Home End]].",
      "links": [
        {
          "text": "keep going",
          "destination": {
            "name": "Center End",
            "pid": 29
          }
        },
        {
          "text": "head back",
          "destination": {
            "name": "Home End",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 118,
      "name": "Lead Pirates Wreckage Final Planet",
      "text": "You lead them back to your ship, the pirates grumbling to each other all the way. On the plus side, it seems they're unhappier with the planet, and life in general, not you specifically. On the way there, they strip you of your blaster. Curses!\n\nYou reach the clearing where your ship is.\n\n<% if (_.s.localIsAlive == true)  { %>\nThe local being is sat a distance away from you, with a warning wave of a blaster and a smack to the side of their head.\n<% } %>\n\nThe pirates pick through the wreckage, unhappily. The remnant cockpit's mess of electronic debris seems to particularly aggravate them.\n\n[[\"(Query) Can I give to you assistance?\"->Help Pirates Wreckage Final Planet]]\n\n[[Stay quiet->Killed By Pirates Wreckage Final Planet]].\n\n<% if (_.s.localIsAlive == true)  { %>\n[[Try to communicate a plan with the local being->Plan Ship Final Planet]]\n<% } %>",
      "links": [
        {
          "text": "\"(Query) Can I give to you assistance?\"",
          "destination": {
            "name": "Help Pirates Wreckage Final Planet",
            "pid": 114
          }
        },
        {
          "text": "Stay quiet",
          "destination": {
            "name": "Killed By Pirates Wreckage Final Planet",
            "pid": 115
          }
        },
        {
          "text": "Try to communicate a plan with the local being",
          "destination": {
            "name": "Plan Ship Final Planet",
            "pid": 147
          }
        }
      ]
    },
    {
      "pid": 119,
      "name": "Refuse Pirates Wreckage Final Planet",
      "text": "This pirates are remorseless murderers, and you know they'll kill you even if you do what they say. So you decide, if you're gonna go out, you'll go out fighting.\n\nYou roll to your left, suddenly, and pull out your blaster, and start firing. But they're already shooting at you. Shots pepper your suit, and penetrate, and your vision, the world, starts to fade. It's too much. \n\nYou curse the sky. Your journey's come to an <span class=\"bad_end_text\">end</span>.\n\n<a href=\"javascript:void(0)\" data-passage=\"Agree Take Pirates Final Planet\" id=\"refuse_pirates_reload\">< Reload last checkpoint?</a>\n<%\n$(function () {\n\t$(\"#passage\").on(\"click\", \"#refuse_pirates_reload\", function() {\n\t\t_.change(_.s.stats.pirateLike, -1);\n});\n});\n%>",
      "links": []
    },
    {
      "pid": 120,
      "name": "Ex Crystal Final Planet",
      "text": "The crystal... You recognize the crystal!\n\nThe crystal can amplify sound. It was used for an outdated type of comm device; if you put a certain electrical current through it, it resonates, in a way that can be controlled.\n\n[[<->Monolith 2 Final Planet]]\n\n<% _.s.exCrystal = true %>",
      "links": []
    },
    {
      "pid": 121,
      "name": "Ex Disk Final Planet",
      "text": "The disk is slightly curved outwards, and is made of some sort of oddly electrically charged material.\n\n[[<->Monolith 2 Final Planet]]",
      "links": []
    },
    {
      "pid": 122,
      "name": "Tap Monolith Final Planet",
      "text": "The circle on the monolith faintly glows.\n\n[[<->Monolith 2 Final Planet]]",
      "links": []
    },
    {
      "pid": 123,
      "name": "Put Disc Monolith Final Planet",
      "text": "The whole monolith suddenly lights up, then settles again. This time it seems more stable than before. The ground does not shake.\n\n[[<->Monolith 2 Final Planet]]\n\n<% _.s.diskMonolith = true; %>",
      "links": []
    },
    {
      "pid": 124,
      "name": "Put Crystal Monolith Final Planet",
      "text": "Nothing happens.\n\n[[<->Monolith 2 Final Planet]]",
      "links": []
    },
    {
      "pid": 125,
      "name": "Monolith 2 Final Planet",
      "text": "<h1>The monolith</h1>\n\n<% if (_.s.diskMonolith == true && _.s.exCrystal == true) { %>\nThe monolith is lit up expectantly.\n\n[[Knock->Knock Monolith 2 Final Planet]]\n<% } else {%>\n<% if (_.s.exCrystal !== true) { %>\n[[Examine the crystal->Ex Crystal Final Planet]].\n<% } else { %>\nExamine the crystal\n<% } %>\n\n[[Examine the disk->Ex Disk Final Planet]].\n\n<% if (_.s.diskMonolith !== true) { %>\n[[Tap the crystal against the monolith->Tap Monolith Final Planet]].\n<% } else { %>\nTap the crystal against the monolith.\n<% } %>\n\n[[Tap the disk against the monolith->Tap Monolith Final Planet]].\n\n[[Put the disc against the circle->Put Disc Monolith Final Planet]].\n\n[[Put the crystal against the circle->Put Crystal Monolith Final Planet]].\n<% } %>\n\n",
      "links": [
        {
          "text": "Knock",
          "destination": {
            "name": "Knock Monolith 2 Final Planet",
            "pid": 126
          }
        },
        {
          "text": "Examine the crystal",
          "destination": {
            "name": "Ex Crystal Final Planet",
            "pid": 120
          }
        },
        {
          "text": "Examine the disk",
          "destination": {
            "name": "Ex Disk Final Planet",
            "pid": 121
          }
        },
        {
          "text": "Tap the crystal against the monolith",
          "destination": {
            "name": "Tap Monolith Final Planet",
            "pid": 122
          }
        },
        {
          "text": "Tap the disk against the monolith",
          "destination": {
            "name": "Tap Monolith Final Planet",
            "pid": 122
          }
        },
        {
          "text": "Put the disc against the circle",
          "destination": {
            "name": "Put Disc Monolith Final Planet",
            "pid": 123
          }
        },
        {
          "text": "Put the crystal against the circle",
          "destination": {
            "name": "Put Crystal Monolith Final Planet",
            "pid": 124
          }
        }
      ]
    },
    {
      "pid": 126,
      "name": "Knock Monolith 2 Final Planet",
      "text": "The monolith lights up smoothly, unlike the erratic flashing from before; a low hum fill the air. Then a voice, one of the beings through the monolith, comes through, and you take off the circle quickly.\n\nYou understand this now.\n\nThese crystals, this monolith, they're both using a communication spectrum you are familiar with. Standard galactic comms don't use it anymore, but scientists still monitor them because they have to cover anything that any unknown species might try to use.\n\nThis disk sends current through it; if you tinker with it, you can find the right frequency, the ones galactic HQ is listening on, and you can send them a message.\n\nIt will take [[time->Fix Monolith 2 Final Planet]].",
      "links": [
        {
          "text": "time",
          "destination": {
            "name": "Fix Monolith 2 Final Planet",
            "pid": 127
          }
        }
      ]
    },
    {
      "pid": 127,
      "name": "Fix Monolith 2 Final Planet",
      "text": "You get to work.\n\nOther beings come, and you have to hide.\n\nThey've found their dead compatriot, you assume; they're searching quite determinedly. You have to keep moving.\n\n<% if (_.s.inventory.cat > 0) { %>\n<b><%= _.s.catName %></b> travels alongside you, and you are grateful for their companionship. They bring you fish, and you grill it for the both of you to share.\n<% } %>\n\nWhile evacuating their search area yet again, exploring the woods, you come across another monolith, and switch your efforts there.\n\nYou get it so that the monolith doesn't contact the beings anymore, when you're calling out, but you can't quite get it to connect to anything else.\n\nYou know the right frequency, though, and you keep working at it. \n\nLater, finally, you hear a burst of notes, familiar; the galactic welcome signal! You've made contact! \n\nThen you pause.\n\nWhat exactly do you want to do now?\n\n[[Contact HQ->Report Monolith 2 Final Planet]] and get a new ship.\n\n[[Don't contact HQ->Stay End]]; stay.",
      "links": [
        {
          "text": "Contact HQ",
          "destination": {
            "name": "Report Monolith 2 Final Planet",
            "pid": 128
          }
        },
        {
          "text": "Don't contact HQ",
          "destination": {
            "name": "Stay End",
            "pid": 112
          }
        }
      ]
    },
    {
      "pid": 128,
      "name": "Report Monolith 2 Final Planet",
      "text": "You can't transmit voice that far, but you can tap out notes, and you do, in the musical variant of galactic conlang.\n\nThey are extremely interested in this planet full of beings; intelligent life is so infinitesimally rare.\n\nThey will reroute the nearest spacefarer to come pick you up, they say, but it will take a while.\n\nYou'll have to wait. But you have time.\n\nAll the time, to reflect on what exactly you're going to do when they get there, and they drop you off at the nearest trade hub where a space ship (just like your old one) will be waiting.\n\nDo you want to [[keep going->Center End]]?\n\nOr do you want to [[head back->Home End]]?",
      "links": [
        {
          "text": "keep going",
          "destination": {
            "name": "Center End",
            "pid": 29
          }
        },
        {
          "text": "head back",
          "destination": {
            "name": "Home End",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 129,
      "name": "Launch Gen Planet",
      "text": "<% if (_.s.genPlanetNum % 2 == 0) { _.s.ship.fueled = false; _.s.fuel.isAvail = true; } %>\n\nYou get back into your ship...\n\n[\nEquipment check: <b>good</b>, engines <b>on</b>, throttle <b>up</b>, and we're a <b>go</b><% if (_.s.genPlanetNum > 8) { %>.<% } else { %>!<% } %>\n]{-#launch_psg1}\n\n[\nYour ship pierces through the sky...\n]{-#launch_psg2}\n\n[\nThrough the atmosphere...\n]{-#launch_psg3}\n\n[\n...And into the inky <a href=\"javascript:void(0)\" data-passage=\"Orbiting\">blackness</a>.\n]{-#launch_psg4}\n\n<% if (2 < 1) { %>\n[[Into orbit->Orbiting]]\n<% } %>\n<%\n$(function () {\n$(\"#launch_psg1\").fadeIn(4500);\n$(\"#launch_psg2\").delay(2500).fadeIn(4000);\n$(\"#launch_psg3\").delay(3500).fadeIn(4000);\n$(\"#launch_psg4\").delay(4500).fadeIn(4000);\n});\n%>",
      "links": [
        {
          "text": "Into orbit",
          "destination": {
            "name": "Orbiting",
            "pid": 131
          }
        }
      ]
    },
    {
      "pid": 130,
      "name": "Orbit Old",
      "text": "There are 6 planets in this planetary system.\n\nYou've visited <%= _.s.firstSystem.count() %> so far:\n<% foreach (_.s.firstSystem : planet) {\nprint planet;} %>\n\nAs for the rest: one is too close to the sun, and one is too far, and te other one is a gas planet, but your ship isn't equipped to handle gas extraction; you've made a note of it in your database, and perhaps someday an extractor ship that can will collect from that planet, and you'll get the finder's fee.\n\nExplore\n\nTrade\n\nFight\n\nSurvive",
      "links": []
    },
    {
      "pid": 131,
      "name": "Orbiting",
      "text": "<h1>In Orbit</h1>\n\nYour spaceship is in space, orbiting around planet <b><%= _.s.Planets[_.s.genPlanetNum].name %></b>.\n\n<% if (_.s.ship.fueled == false) { %>\n<strike>> Explore next planet</strike> <span class='red_text'>You need to refuel first at a trade hub!</span>\n<% } else { %>\n[[> Explore next planet->Explore Next Planet]] \n<% } %>\n\n[[Trade->Trade Gen Space]]\n\n<a href=\"javascript: void(0);\" id=\"fight_orbit\">Fight</a>\n\n[\n<span class=\"green_text\">There's nothing to fight here.</span>\n]{-#fought_orbit}\n\n[[Survive->Survive Gen Space]] \n\nYou are <span class='green_text'><%= document.global.travelDistance() %></span> away from the center of the galaxy.\n\n<% \n$(function () {\ndocument.global.showNextPsg('#fight_orbit', '#fought_orbit', false);\n});\n%>",
      "links": [
        {
          "text": "> Explore next planet",
          "destination": {
            "name": "Explore Next Planet",
            "pid": 136
          }
        },
        {
          "text": "Trade",
          "destination": {
            "name": "Trade Gen Space",
            "pid": 132
          }
        },
        {
          "text": "Survive",
          "destination": {
            "name": "Survive Gen Space",
            "pid": 134
          }
        }
      ]
    },
    {
      "pid": 132,
      "name": "Trade Gen Space",
      "text": "You connect to the galactic databases.\n\n<% var addedCredits = 0; %>\n<% if (_.s.visitedPlanets < 1 || !_.isNumber(_.s.visitedPlanets)) { %>\nYou have no visited planets to report.\n<% } else { %>\n\t<% if (_.s.visitedPlanets == 1) { %>\nYou report <%= _.s.visitedPlanets %> undiscovered planet to the galactic databases.\n\n\t<% } else { %>\nYou report <%= _.s.visitedPlanets %> undiscovered planets to the galactic database. \n\t<% } %>\n<% addedCredits += _.s.visitedPlanets * _.s.planetFee;\n_.s.visitedPlanets = 0;\n_.change(_.s.stats.credits, addedCredits); %>\n\n<span class='green_text'>You earn <%= addedCredits %> credits!</span>\n<% } %>\n\n<% if (_.s.scanned < 1 || !_.isNumber(_.s.scanned)) { %>\nYou have no scanned objects to upload.\n<% } else { %>\n  <% if (_.s.scanned == 1) { %>\n  You upload <%= _.s.scanned %> object to the galactic databases.\n  <% } else { %>\n  You upload <%= _.s.scanned %> objects to the galactic database.\n  <% } %>\n<% \naddedCredits = 0;\naddedCredits += _.s.scanned * _.s.scanFee;\n_.s.scanned = 0;\n_.change(_.s.stats.credits, addedCredits);\n%>\n\n<span class='green_text'>You earn <%= addedCredits %> credits!</span>\n<% } %>\n\nYou have <%= _.s.stats.credits.num %> credits.\n\n<% if (_.s.genPlanetNum % 2 !== 0) { %>\nYou are not within distance of a trade hub.\n<% } else { %>\n[[Travel to Trade Hub?->Trade Hub Intro]]\n<% } %>\n\n[[<->Orbiting]]",
      "links": [
        {
          "text": "Travel to Trade Hub?",
          "destination": {
            "name": "Trade Hub Intro",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 133,
      "name": "Fight Gen Space",
      "text": "There is nothing to fight here.\n\n[[<->Orbiting]]",
      "links": []
    },
    {
      "pid": 134,
      "name": "Survive Gen Space",
      "text": "Ship Status: <span class='green_text'>Good</span>.\n\nFuel: <% if (_.s.ship.fueled == true) { %><span class='green_text'>Good</span><% } else { %><span class='red_text'>LOW</span><% } %>.\n\nPlanets visited: <span class='green_text'><%= (_.s.priorVisitedPlanets + _.s.visitedPlanetsOverall) %></span>.\n\nItems scanned: <span class='green_text'><%= (_.s.priorScanned + _.s.scannedOverall) %></span>.\n\n<% if (_.s.heatShields.bought > 0) { %>\nAblative Heat Shields installed.\n<% } %>\n\n<% if (_.s.warpDrive.bought > 0) { %>\nImproved Warp Drive installed.\n<% } %>\n\n<% if (_.s.hunterMissiles.bought > 0) { %>\nHunter Missile system installed.\n<% } %>\n\n<% if (_.s.starbeamCannon.bought > 0) { %>\nStarbeam Laser Cannons installed.\n<% } %>\n\n<% if (_.s.shipThrusters.bought > 0) { %>\nImproved ship thrusters installed.\n<% } %>\n\n<% if (_.s.suitEnergy.bought > 0) { %>\nSuit Energy upgraded.\n<% } %>\n\n<% if (_.s.catFood.bought > 0) { %>\nYou have food for <% _.s.catName %>.\n<% } %>\n\n<% if (_.s.meFood.bought > 0) { %>\nYou have food for yourself.\n<% } %>\n\nCargo in hold:\n[\n\n]{#cargoResources}\n[\n\n]{#cargoDrops}\n\n<%\n$(function () {\n\n  if (_.isArray(_.s.resources) && _.s.resources.length > 0) {\n\t  for (i = 0; i < _.s.resources.length; i++) {\n\t  \n\t\t  $(\"#cargoResources\").append(\"<p><b>\" + (_.s.resources[i].name) + \"</b> x\" + _.s.resources[i].num + \"</p>\");\n\t  }\n  }\n  else {\n  \t $(\"#cargoResources\").append(\"<span class='red_text'>You have no resources in the hold.</span>\");\n  }\n\n\n  if (_.isArray(_.s.drops) && _.s.drops.length > 0) {\n\t  for (i = 0; i < _.s.drops.length; i++) {\n\t\t  $(\"#cargoDrops\").append(\"<p><b>\" + (_.s.drops[i].name) + \"</b> x\" + _.s.drops[i].num + \"</p>\");\n\t  }\n  }\n  else {\n  \t $(\"#cargoDrops\").append(\"<span class='red_text'>You have no scavenged parts in the hold.</span>\");\n  }\n});\n%>\n\n[[<->Orbiting]]",
      "links": []
    },
    {
      "pid": 135,
      "name": "No Oxygen Final Planet",
      "text": "There's an absence, something missing from the back of your mind, that suddenly hits you, and nags.\n\nYou look around for it, try to recall it, and then you remember, and you look down at your oxygen gauge, and it's at zero percent. The steady, comforting circulation of oxygen that's been background noise in all of your travels now, for so long now, it's gone. You're <b>out of oxygen</b>.\n\nYour mind constricts. Your feet give out, and you stumble backwards, back against a tree. You can't think. This is it; your journey ends here.\n\nYou close your eyes, and you take off your helmet, and you close your eyes and <a href=\"javascript:void(0)\" id=\"wait_oxygen_finp\">wait</a>...\n\n[\nStillness.\n\nAnd you open your eyes, and you take a breath.\n\nAnd another one.\n\nThis planet has oxygen on it! Not just oxygen, but a breathable composition!\n\nYou've been searching for a planet with a sustaining atmosphere for your kind for what feels like aeons now. The galactic federation had no records of one. All life on other planets survive on other elements. You'd given up.\n\nBut now, here you are --\n\nYou turn off air recirculation for your suit, and you put your helmet back on for now; it might not give you oxygen, but it's still protective in other ways.\n\n-- And you <a data-passage=\"Forest Final Planet\">continue</a>, back west.\n]{-#waited_oxygen_finp}\n\n<% if (2 < 1) { %>\n[[west->Forest Final Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.showNextPsg(\"#wait_oxygen_finp\", \"#waited_oxygen_finp\", false);\n});\n%>",
      "links": [
        {
          "text": "west",
          "destination": {
            "name": "Forest Final Planet",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 136,
      "name": "Explore Next Planet",
      "text": "<% _.s.genPlanetNum++;\nif (_.s.genPlanetNum == _.s.heatPlanetNum) { \n_.s.visitingHeatPlanet = true;\n} %>\n\nYou settle into your seat, as you head off into the deep expanse of space, towards the next planet on your journey.\n\n<% if (_.s.genPlanetNum == 1) { %>\n[[> Continue->Insignia]]\n<% } else if (_.s.genPlanetNum == 2) { %>\n[[> Continue->Food]]\n<% } else if (_.s.genPlanetNum == 3) { %>\n[[> Continue->Dreams of Youth]]\n<% } else if (_.s.genPlanetNum == 4) { %>\n[[> Continue->The Center of the Galaxy]]\n<% } else if (_.s.genPlanetNum == 5 && _.s.inventory.cat > 0) { %>\n[[> Continue->Cat]]\n<% } else if (_.s.genPlanetNum == 6) { %>\n[[> Continue->Space Pirates]]\n<% } else if (_.s.genPlanetNum == 7) { %>\n[[> Continue->Mission]]\n<% } else { %>\n[[> Continue->Interlude]]\n<% } %>",
      "links": [
        {
          "text": "> Continue",
          "destination": {
            "name": "Insignia",
            "pid": 11
          }
        },
        {
          "text": "> Continue",
          "destination": {
            "name": "Food",
            "pid": 23
          }
        },
        {
          "text": "> Continue",
          "destination": {
            "name": "Dreams of Youth",
            "pid": 43
          }
        },
        {
          "text": "> Continue",
          "destination": {
            "name": "The Center of the Galaxy",
            "pid": 27
          }
        },
        {
          "text": "> Continue",
          "destination": {
            "name": "Cat",
            "pid": 24
          }
        },
        {
          "text": "> Continue",
          "destination": {
            "name": "Space Pirates",
            "pid": 38
          }
        },
        {
          "text": "> Continue",
          "destination": {
            "name": "Mission",
            "pid": 179
          }
        },
        {
          "text": "> Continue",
          "destination": {
            "name": "Interlude",
            "pid": 145
          }
        }
      ]
    },
    {
      "pid": 137,
      "name": "purchaseWarpDrive",
      "text": "<%= _.s.warpDrive.desc %>\n\nPurchase Warp Drive for <b><%= _.s.warpDrive.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub\" id=\"<%= _.s.warpDrive.id %>\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.warpDrive.id, _.s.warpDrive);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 138,
      "name": "purchaseSuitEnergy",
      "text": "<%= _.s.suitEnergy.desc %>\n\nPurchase Suit Energy for <b><%= _.s.suitEnergy.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub\" id=\"<%= _.s.suitEnergy.id %>\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.suitEnergy.id, _.s.suitEnergy);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 139,
      "name": "purchaseHunterMissiles",
      "text": "<%= _.s.hunterMissiles.desc %>\n\nPurchase Hunter Missiles for <b><%= _.s.hunterMissiles.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub\" id=\"<%= _.s.hunterMissiles.id %>\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.hunterMissiles.id, _.s.hunterMissiles);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 140,
      "name": "purchaseStarbeamCannon",
      "text": "<%= _.s.starbeamCannon.desc %>\n\nPurchase Starbeam Lasers for <b><%= _.s.starbeamCannon.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub\" id=\"<%= _.s.starbeamCannon.id %>\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.starbeamCannon.id, _.s.starbeamCannon);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 141,
      "name": "purchaseShipThrusters",
      "text": "<%= _.s.shipThrusters.desc %>\n\nPurchase Ship Thrusters for <b><%= _.s.shipThrusters.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub\" id=\"<%= _.s.shipThrusters.id %>\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.shipThrusters.id, _.s.shipThrusters);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 142,
      "name": "purchaseCatFood",
      "text": "<%= _.s.catFood.desc %>\n\nPurchase Cat Food for <b><%= _.s.catFood.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub\" id=\"<%= _.s.catFood.id %>\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.catFood.id, _.s.catFood);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 143,
      "name": "purchaseMeFood",
      "text": "<%= _.s.meFood.desc %>\n\nPurchase Food for <b><%= _.s.meFood.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub\" id=\"<%= _.s.meFood.id %>\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.meFood.id, _.s.meFood);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 144,
      "name": "purchaseHeatShields",
      "text": "<%= _.s.heatShields.desc %>\n\nPurchase Heat Shields for <b><%= _.s.heatShields.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub\" id=\"<%= _.s.heatShields.id %>\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.heatShields.id, _.s.heatShields);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 145,
      "name": "Interlude",
      "text": "It is quiet.\n\n[[> Continue->Next Planet]]",
      "links": [
        {
          "text": "> Continue",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 146,
      "name": "Next Planet",
      "text": "<% document.global.travelToCenter() %>\n\nYour destination planet comes into view.\n\n<% if (_.s.visitingHeatPlanet == true) { %>\nYou make your slow approach towards <b><%= _.s.Planets[_.s.genPlanetNum].name %></b>.\n\nYour sensors detect that this is a planet whose atmosphere will require a <b>Heat Shield</b> to enter.\n\n<% if (_.s.heatShields.bought > 0) { %>\nLuckily, your ship is outfitted with a <b>Heat Shield</b>!\n\nYou touch down softly...\n\n[[> Leave your ship->Gen Planet]]\n<% } else { %>\n<% _.s.visitingHeatPlanet = false; %>\nYou do not have a heat shield...\n\nYou cannot visit this planet!\n\nYou are forced to [[head towards the next planet->Explore Next Planet]] instead.\n<% } %>\n<% } else if (_.s.genPlanetNum >= 8) { %>\nYou are making your slow approach towards <b><%= _.s.Planets[_.s.genPlanetNum].name %></b>, when your system starts <span class=\"red_text\">beeping</span>.\n\n[[Check the radar->Attacked Again]]\n<% } else { %>\nYou make your slow approach towards <b><%= _.s.Planets[_.s.genPlanetNum].name %></b>.\n\nYou touch down softly...\n\n[[> Leave your ship->Gen Planet]]\n<% } %>",
      "links": [
        {
          "text": "> Leave your ship",
          "destination": {
            "name": "Gen Planet",
            "pid": 72
          }
        },
        {
          "text": "head towards the next planet",
          "destination": {
            "name": "Explore Next Planet",
            "pid": 136
          }
        },
        {
          "text": "Check the radar",
          "destination": {
            "name": "Attacked Again",
            "pid": 154
          }
        }
      ]
    },
    {
      "pid": 147,
      "name": "Plan Ship Final Planet",
      "text": "While the pirates are looking elsewhere, you try to make eye contact with the being. It looks at you. It seems to be in pain.\n\nIt slowly pulls out a crystal from its pocket, and then looks at the pirates and looks back at you.\n\nHmm. You consider your options...\n\n[[Coordinate an attack!->Coordinate Shootout Ship Final Planet]]\n\n[[Try to talk it out with the pirates->Negotiate Ship Final Planet]]\n ",
      "links": [
        {
          "text": "Coordinate an attack!",
          "destination": {
            "name": "Coordinate Shootout Ship Final Planet",
            "pid": 148
          }
        },
        {
          "text": "Try to talk it out with the pirates",
          "destination": {
            "name": "Negotiate Ship Final Planet",
            "pid": 149
          }
        }
      ]
    },
    {
      "pid": 148,
      "name": "Coordinate Shootout Ship Final Planet",
      "text": "You nod at the being. The pirates are distracted, focused more on the wreckage. You've both been docile prisoners so far, so hopefully they let their guard down.\n\nYou call one of them over.\n\nThe shorter pirate ignores you in favor of their search, but the taller pirate comes over. You maneuvre yourself so that you're not in the line of fire between the being and the pirate, but the pirate can't see the being either.\n\n\"(Query) What do you want?\" you ask them. \"Can we help?\"\n\nTaller pirate: \"(Null) Galactic excrement is helpless and useless and stupid.\" They pause. \"(Query) Why do you cooperate with them?\"\n\nYou tap your pocket, and subtly glance oevr at the being.\n\nThey take the crystal back out, and there's a sudden blast of light which you have to shield your eyes from. When your vision clears, the taller pirate is on the ground, unmoving.\n\nYou dive at the lifeless body. The shorter pirate is yelling, and you can hear blaster shots, but you don't look up.\n\nYou pry the blaster from the corpse's dead hands. Dirt explodes around you; you roll to the side, and look up, at the shorter pirate, who is forced behind some wreckage by another crystal bolt.\n\nYou sprint towards the nearest piece of fuselage, while gesturing at the being to circle the around way around.\n\nThe shorter pirate tries to shoot at you, but another blast of light from behind you blinds them. They try to duck back behind cover again, howling, but you've got an angle on them now.\n\nYou take careful aim, and put the pirate down for good.\n\nPanting, you collapse down in the ground.\n\nThe local comes over you. You nod at each other, and it emits a reverberating wail. You smile back.\n\nThey say some words, and then, gesturing in a direction, they start walking that way.\n\n[[Follow it->Village Final Planet]].",
      "links": [
        {
          "text": "Follow it",
          "destination": {
            "name": "Village Final Planet",
            "pid": 150
          }
        }
      ]
    },
    {
      "pid": 149,
      "name": "Negotiate Ship Final Planet",
      "text": "You shake your head and wave the local off. They look at you with confusion, but that's fine; you change your focus to the pirates.\n\nYou wave the one of the pirates over. Maybe you can find out what they want and come to an agreement.\n\n[[\"(Query) What do you want? Can we help?\"->Help Pirates Wreckage Final Planet]]",
      "links": [
        {
          "text": "\"(Query) What do you want? Can we help?\"",
          "destination": {
            "name": "Help Pirates Wreckage Final Planet",
            "pid": 114
          }
        }
      ]
    },
    {
      "pid": 150,
      "name": "Village Final Planet",
      "text": "The local takes you back to their village, and you have to crane your neck upwards to take in the cylindrical and rectangular buildings chiseled out of smooth rock, towering above you and arranged in neat rows along the glowing black stone pathways.\n\nThey give you a room to stay in, in one of their communal buildings.\n\nYou manage to repurpose some of the decorative fabrics in the room and layer them onto a flat surface as makeshift covering to sleep on.\n\n<% if (_.has(_.s.inventory.cat)) { %>\nYou set up a likewise pile for <b><%= _.s.catName %></b> on the floor. \n<% } %>\n\nThey give you food. The food is gloppy and bitter, but you manage.\n\nYou slowly learn to communicate through rudimentary sign language, pointing and gesturing and nodding, and you pick up some of their words as well, though you're incapable of pronouncing them well, but they seem delighted at your attempts.\n\nThey teach you how to use the flying contraptions, and you fly about, often with other villagers, but sometimes on your own, exploring the planet. It has been a long while since you have been able to spend time and get to know a place.\n\nYou [[talk->Exchange Final Planet]] with them more, and you slowly get to know them.",
      "links": [
        {
          "text": "talk",
          "destination": {
            "name": "Exchange Final Planet",
            "pid": 189
          }
        }
      ]
    },
    {
      "pid": 151,
      "name": "2nd Planet interlude",
      "text": "You settle into your seat, and leave the trade hub, heading off into the deep expanse of space towards the next planet on your journey...\n\n[[> Continue->Thinking 2nd Planet Interlude]]",
      "links": [
        {
          "text": "> Continue",
          "destination": {
            "name": "Thinking 2nd Planet Interlude",
            "pid": 152
          }
        }
      ]
    },
    {
      "pid": 152,
      "name": "Thinking 2nd Planet Interlude",
      "text": "This is going well. \n\nYou're currently on the fifth planet of your trial run, with one more to explore before returning back to <b><%=_.s.centralPlanet %></b>.\n\nIf all proceeds accordingly, you should then be approved to continue onto the route you requested, the one that will take you to the center of the galaxy. \n\n(Hopefully.)\n\nOne more planet to go...\n\n<% /*\nIt's during this part of your mission, between destinations, when you have all the time in the world to reflect.\n\nIt is important though -- you remember your instructor's words -- to always keep your mind sharp. Keep it focused, don't let it wander too far astray. \n\nRemininsce, plan, project, but don't get pulled too deep, in the future or the past, in regret or fantasy. Always keep yourself grounded in the now.\n*/ %>\n[[> Continue->Landing 2nd Planet]]",
      "links": [
        {
          "text": "> Continue",
          "destination": {
            "name": "Landing 2nd Planet",
            "pid": 153
          }
        }
      ]
    },
    {
      "pid": 153,
      "name": "Landing 2nd Planet",
      "text": "Your destination planet, the last one on your trial run, comes into view.\n\nYou make your slow approach towards <b><%= _.s.secondPlanet %></b>.\n\nYou touch down softly...\n\n[[> Leave your ship->2nd Planet]]",
      "links": [
        {
          "text": "> Leave your ship",
          "destination": {
            "name": "2nd Planet",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 154,
      "name": "Attacked Again",
      "text": "Your radar is beeping. Pirates, again? Sure enough, there are two dots on your radar.\n\nYou don't see them, but your ship picks up on their outlines on the display as well, confirming your worst suspicions.\n\nThese ones are closing in fast, faster than your ship or any you've seen before. You're almost to the planet, but you don't think you'll make it in time before they get to you. And on atmospheric entry, you'd be a sitting duck; you wouldn't be able to evade.\n\nYou have to decide what tactics to use against them.\n\n[[Shoot them down with missiles->Missiles at Pirates 2]]\n\n[[Use precision lasers->Lasers at Pirates 2]]\n\n<% if (_.s.hunterMissiles.bought < 1 && _.s.starbeamCannon.bought < 1) { %>\n[[Bribe them->Bribe Pirates 2]]\n<% } %>\n",
      "links": [
        {
          "text": "Shoot them down with missiles",
          "destination": {
            "name": "Missiles at Pirates 2",
            "pid": 167
          }
        },
        {
          "text": "Use precision lasers",
          "destination": {
            "name": "Lasers at Pirates 2",
            "pid": 168
          }
        },
        {
          "text": "Bribe them",
          "destination": {
            "name": "Bribe Pirates 2",
            "pid": 169
          }
        }
      ]
    },
    {
      "pid": 155,
      "name": "Missiles at Pirates",
      "text": "<% if (_.s.hunterMissiles.bought > 0) { %>\nYou decide to shoot them down with missiles! You just have to find the right opportunity to get a good lock-on to one of them.\n\nYou focus on your sensors to track their movements chasing after you, throttling and flitting erratically to lure them into an advantageous spot.\n\nOne of the pirates is eager, speeding forward ahead of the others. There's your chance!\n\nYou spin your ship around, and quickly target the frontrunner. Surprised, they fire some lasers at you, but you deftly dodge, while keeping your sights on them. The other two pirates are almost caught up, you have to make this quick. Almost, almost... There! You acquire the lock on, and you fire your Hunter Missiles!\n\nYou turn your thrusters to the max and turn away, just as the remaining two pirates get into range. Their lasers hit nothing, and you watch as the missiles slam into your target! One down!\n\nYou wheel back; the other two pirates are way out of position, trying to save their compatriot. You lock onto both of them before they have time to get away, and fire! They both go down!\n\nPhew. You breathe out. Onto the next planet.\n\n[[> Continue ->Next Planet]]\n<% } else { %>\nYou decide to shoot them down with missiles! You just have to find the right opportunity to get a good lock-on to one of them.\n\nYou focus on your sensors to track their movements chasing after you, throttling and flitting erratically to lure them into an advantageous spot.\n\nOne of the pirates is eager, speeding forward ahead of the others. There's your chance!\n\nYou spin your ship around, and quickly target the frontrunner. Surprised, they fire some lasers at you, but you deftly dodge, while keeping your sights on them. The other two pirates are almost caught up, you have to make this quick. Almost, almost... \n\nA trailing pirate closes in and fires their lasers! You are forced to abandon your lock-on as you try to evade. But it clips the side of your ship, and damages one of your engines.\n\nThe other trailing pirate is there too, now. Your sensors beep urgently, as it detects a missile of theirs, locked onto your position. They fire. There is nothing you can do.\n\nThis is it. You close your eyes, and wait. Your journey's come to an <span class=\"bad_end_text\">end</span>.\n\n<a href=\"javascript:void(0)\" data-passage=\"Orbiting\" id=\"missile_reload\">< Reload last checkpoint?</a>\n<%\n$(function () {\n\t$(\"#passage\").on(\"click\", \"#missile_reload\", function() {\n\t\t//Have to decrease genPlanetNum that was changed in \"Explore Next Planet\"\n\t\tif (_.s.genPlanetNum > 0) {\n\t\t\t_.s.genPlanetNum--;\n\t\t}\n});\n});\n%>\n<% } %>",
      "links": [
        {
          "text": "> Continue ",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 156,
      "name": "Lasers at Pirates",
      "text": "<% if (_.s.starbeamCannon.bought > 0) { %>\nYou decide to shoot them down with your laser weapon! You just have to find the right opportunity to land a hit on them.\n\nYou focus on your sensors to track their movements chasing after you, throttling and flitting erratically to lure them into an advantageous spot.\n\nOne of the pirates is eager, speeding forward ahead of the others. There's your chance!\n\nYou spin your ship around, and start pumping salvos of lasers from your Starbeam Cannon at the pirate. Surprised, the pirate starts firing back, but their laser weapon has much less range and accuracy. You weave around to make yourself harder to hit, while continuing to fire upon them. You land a hit! The pirate goes down!\n\nYou turn your thrusters to the max and go hard at one of the remaining pirates; you now know that your lasers are much less powerful, so you decide to hit them before they can come up with a better strategy.\n\nYou concentrate fire on one of them, and start firing! They go down! The last one is easy pickings.\n\nPhew. You breathe out. Onto the next planet.\n\n[[> Continue ->Next Planet]]\n<% } else { %>\nYou decide to shoot them down with your laser weapon! You just have to find the right opportunity to land a hit on them.\n\nYou focus on your sensors to track their movements chasing after you, throttling and flitting erratically to lure them into an advantageous spot.\n\nOne of the pirates is eager, speeding forward ahead of the others. There's your chance!\n\nYou spin your ship around, and quickly target the frontrunner. Surprised, they fire some lasers at you, but you deftly dodge, while keeping your sights on them. The other two pirates are almost caught up, you have to make this quick. Almost, almost... \n\nA trailing pirate closes in and fires their lasers! You are forced to abandon your lock-on as you try to evade. But it hits the side of your ship, disabling one of your engines.\n\nThe other trailing pirate is there too, now. Your sensors beep urgently, as it detects a missile of theirs, locked onto your position. They fire. There is nothing you can do.\n\nThis is it. You close your eyes, and wait. Your journey's come to an <span class=\"bad_end_text\">end</span>.\n\n<a href=\"javascript:void(0)\" data-passage=\"Orbiting\" id=\"laser_reload\">< Reload last checkpoint?</a>\n<%\n$(function () {\n\t$(\"#passage\").on(\"click\", \"#laser_reload\", function() {\n\t\t//Have to decrease genPlanetNum that was changed in \"Explore Next Planet\"\n\t\tif (_.s.genPlanetNum > 0) {\n\t\t\t_.s.genPlanetNum--;\n\t\t}\n});\n});\n%>\n<% } %>",
      "links": [
        {
          "text": "> Continue ",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 157,
      "name": "Evade Pirates",
      "text": "<% if (_.s.shipThrusters.bought > 0) { %>\n\n<% } else { %>\n\n<% } %>",
      "links": []
    },
    {
      "pid": 158,
      "name": "Bribe Pirates",
      "text": "You are out-numbered, so you decide not to risk an open fight.\n\n<% if (_.s.stats.credits.num > 200) { %>\nYou contact them, and offer them half of your credits.\n\nThey accept your offer, and you make the transfer, with some regret. Will this make it harder to keep your ship ready to handle whatever comes at you in the future?\n\nYou lose <span class='red_text'><b><%= Math.floor(_.s.stats.credits.num / 2) %></b></span> credits... \n\n<% _.change(_.s.stats.credits, 0 - Math.floor(_.s.stats.credits.num/2)); %>\nYou now have <span class='red_text'><b><%= _.s.stats.credits.num %></b></span> credits!\n<% } else { %>\nYou contact them, and offer them all of your credits.\n\nThey accept your offer, and you make the transfer, with some regret. Will this make it harder to keep your ship ready to handle whatever comes at you in the future?\n\nYou lose <span class='red_text'><b>_.s.stats.credits.num</b></span> credits... \n\n<% _.change(_.s.stats.credits, 0 - _.s.stats.credits.num); %>\nYou now have <span class='red_text'><b>0</b></span> credits!\n<% } %>\n\n[[> Continue ->Next Planet]]",
      "links": [
        {
          "text": "> Continue ",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 159,
      "name": "Sell Trade Hub",
      "text": "<h1>Sell Cargo</h1>\n\n[\n\n]{#resourceMarket}\n\n\n[\n\n]{#dropMarket}\n\n[\n\n]{#sellHubCreditChange}\n\nYou have <span id='sellHubCreditDisplay'><%= _.s.stats.credits.num %></span> credits.\n\n[[Buy something?->Buy Trade Hub]]\n\n[[< Back to orbit->Orbiting]]\n<%\n$(function () {\n  \n  if (_.isArray(_.s.resources) && _.s.resources.length > 0) {\n  \t_.each( _.s.resources, function(value, key) {\n\t\t$(\"#resourceMarket\").append(\"<p><b>\" + (value.name) + \"</b> x\" + value.num + \" - \" + value.price  + \" credits each <a id='sell_resource\" + key + \"' href='javascript: void(0);'>Sell</a></p>\");\n\t  \n\t  \tdocument.global.sellResourceListen(\"#sell_resource\" + key, value, \"#resourceMarket\", \"#sellHubCreditChange\", \"#sellHubCreditDisplay\", _.s.resources);\n\t  \n\t});\n  }\n  else {\n  \t $(\"#resourceMarket\").append(\"<span class='red_text'>You have no resources to sell.</span>\");\n  }\n\n\n  if (_.isArray(_.s.drops) && _.s.drops.length > 0) {\n\t  _.each( _.s.drops, function(value, key) {\n\t\t  $(\"#dropMarket\").append(\"<p><b>\" + (value.name) + \"</b> x\" + value.num + \" - \" + value.price + \" credits each <a id='sell_drop\" + key + \"' href='javascript: void(0);'>Sell</a></p>\");\n\n\t\t  document.global.sellDropListen(\"#sell_drop\" + key, value, \"#dropMarket\", \"#sellHubCreditChange\", \"#sellHubCreditDisplay\", _.s.drops);\n\t  });\n  }\n  else {\n  \t $(\"#dropMarket\").append(\"<span class='red_text'>You have no scavenged parts to sell.</span>\");\n  }\n});\n%>",
      "links": [
        {
          "text": "Buy something?",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        },
        {
          "text": "< Back to orbit",
          "destination": {
            "name": "Orbiting",
            "pid": 131
          }
        }
      ]
    },
    {
      "pid": 160,
      "name": "Kaleidoscope",
      "text": "You are heading back to your ship, your navvisor blinking hard data at you as you look around -- mineral deposits, heat signatures, distant planets -- when you decide, for a moment, to turn it all off, and pause to look up instead at the glittering expanse of starry sky above. \n\nIt's disquieting, all of this: the surface, the stars, and the vast space between. As foreign as every planet you visit seems, and as much as they all also blur together, a kaleidoscope in your mind, you know that you are the aberration here.\n\nSolemnly, you head back to your ship->Launch Gen Planet]].",
      "links": []
    },
    {
      "pid": 161,
      "name": "Orbiting Space 2",
      "text": "<h1>In Orbit</h1>\n\nYour spaceship is in space, orbiting around planet <b><%= _.s.firstPlanet %></b>.\n\n[[> Explore next planet->3rd Planet interlude]] \n\n[[Trade->Trade Space 2]]\n\n[[Fight->Fight Space 2]]\n\n[[Survive->Survive Space 2]] ",
      "links": [
        {
          "text": "> Explore next planet",
          "destination": {
            "name": "3rd Planet interlude",
            "pid": 162
          }
        },
        {
          "text": "Trade",
          "destination": {
            "name": "Trade Space 2",
            "pid": 164
          }
        },
        {
          "text": "Fight",
          "destination": {
            "name": "Fight Space 2",
            "pid": 163
          }
        },
        {
          "text": "Survive",
          "destination": {
            "name": "Survive Space 2",
            "pid": 165
          }
        }
      ]
    },
    {
      "pid": 162,
      "name": "3rd Planet interlude",
      "text": "You settle into your seat, as you head off into the deep expanse of space, towards the next planet on your journey...\n\n> Continue->Star Routes",
      "links": []
    },
    {
      "pid": 163,
      "name": "Fight Space 2",
      "text": "There is nothing to fight here.\n\n[[<->Orbiting Space 2]]",
      "links": []
    },
    {
      "pid": 164,
      "name": "Trade Space 2",
      "text": "You connect to the galactic databases again.\n\n<% var addedCredits = 0; %>\n<% if (_.s.visitedPlanets < 1 || !_.isNumber(_.s.visitedPlanets)) { %>\nYou have no visited planets to report.\n<% } else { %>\n\t<% if (_.s.visitedPlanets == 1) { %>\nYou report <%= _.s.visitedPlanets %> undiscovered planet to the galactic databases.\n\n\t<% } else { %>\nYou report <%= _.s.visitedPlanets %> undiscovered planets to the galactic database. \n\t<% } %>\n<% addedCredits += _.s.visitedPlanets * _.s.planetFee;\n_.s.visitedPlanets = 0;\n_.change(_.s.stats.credits, addedCredits); %>\n\n<span class='green_text'>You earn <%= addedCredits %> credits!</span>\n<% } %>\n\n<% if (_.s.scanned < 1 || !_.isNumber(_.s.scanned)) { %>\nYou have no scanned objects to upload.\n<% } else { %>\n  <% if (_.s.scanned == 1) { %>\n  You upload <%= _.s.scanned %> object to the galactic databases.\n  <% } else { %>\n  You upload <%= _.s.scanned %> objects to the galactic database.\n  <% } %>\n<% \naddedCredits = 0;\naddedCredits += _.s.scanned * _.s.scanFee;\n_.s.scanned = 0;\n_.change(_.s.stats.credits, addedCredits);\n%>\n\n<span class='green_text'>You earn <%= addedCredits %> credits!</span>\n<% } %>\n\nYou have <%= _.s.stats.credits.num %> credits.\n\nYou are not within distance of a trade hub.\n\n[[<->Orbiting Space 2]]\n",
      "links": []
    },
    {
      "pid": 165,
      "name": "Survive Space 2",
      "text": "You take inventory of your ship.\n\nShip Status: <span class='green_text'>Good</span>.\n\nFuel: <span class='green_text'>Good</span>.\n\nPlanets visited: <span class='green_text'><%= (_.s.priorVisitedPlanets + _.s.visitedPlanetsOverall) %></span>.\n\nItems scanned: <span class='green_text'><%= (_.s.priorScanned + _.s.scannedOverall) %></span>.\n\n<% if (_.s.heatShields.bought > 0) { %>\nImproved Heat Shields installed.\n<% } %>\n\n<% if (_.s.warpDrive.bought > 0) { %>\nWarp Drive installed.\n<% } %>\n\n<% if (_.s.hunterMissiles.bought > 0) { %>\nHunter Missile system installed.\n<% } %>\n\n<% if (_.s.starbeamCannon.bought > 0) { %>\nStarbeam Cannon lasers installed.\n<% } %>\n\n<% if (_.s.shipThrusters.bought > 0) { %>\nImproved ship thrusters installed.\n<% } %>\n\n<% if (_.s.suitEnergy.bought > 0) { %>\nSuit Energy upgraded.\n<% } %>\n\n<% if (_.s.catFood.bought > 0) { %>\nYou have food for <% _.s.catName %>.\n<% } %>\n\n<% if (_.s.meFood.bought > 0) { %>\nYou have food for yourself.\n<% } %>\n\nCargo in hold:\n[\n\n]{#cargoResources}\n[\n\n]{#cargoDrops}\n\n<%\n$(function () {\n\n  if (_.isArray(_.s.resources) && _.s.resources.length > 0) {\n\t  for (i = 0; i < _.s.resources.length; i++) {\n\t  \n\t\t  $(\"#cargoResources\").append(\"<p><b>\" + (_.s.resources[i].name) + \"</b> x\" + _.s.resources[i].num + \"</p>\");\n\t  }\n  }\n  else {\n  \t $(\"#cargoResources\").append(\"You have no resources in the hold.\");\n  }\n\n\n  if (_.isArray(_.s.drops) && _.s.drops.length > 0) {\n\t  for (i = 0; i < _.s.drops.length; i++) {\n\t\t  $(\"#cargoDrops\").append(\"<p><b>\" + (_.s.drops[i].name) + \"</b> x\" + _.s.drops[i].num + \"</p>\");\n\t  }\n  }\n  else {\n  \t $(\"#cargoDrops\").append(\"You have no scavenged parts in the hold.\");\n  }\n});\n%>\n\n[[<->Orbiting Space 2]]",
      "links": []
    },
    {
      "pid": 166,
      "name": "First Gen Planet",
      "text": "Your destination planet comes into view.\n\nYou make your slow approach towards <b><%= _.s.Planets[_.s.genPlanetNum].name %></b>.\n\nYou touch down softly...\n\n[[> Leave your ship->Gen Planet]]",
      "links": [
        {
          "text": "> Leave your ship",
          "destination": {
            "name": "Gen Planet",
            "pid": 72
          }
        }
      ]
    },
    {
      "pid": 167,
      "name": "Missiles at Pirates 2",
      "text": "You decide to shoot them down with missiles.\n\nYou try to isolate one of them again, but they aren't biting.\n\nIn fact, they are coordinating very well, pincering you in. These pirates are much tougher than any you've encountered before.\n\nYou spin your ship around, and quickly target one of them. \n\nThe other pirate though closes in and fires their lasers, and you are forced to evade. There's a sudden heavy jolt -- your world is spinning, cartwheeling, you try to re-orient, but the ship isn't responding to controls. Focus, focus on the systems in front of you, a mass of jumbled text blinking angrily, they've disabled power to one of your engines, they've left a gaping hole in the side --\n\nThis is bad. You steer, try to, but you're on a collision course with the planet now. The gravitational pull's got you, and everything's still spinning, spinning, there's screaming in your ears at a distance, and your head feels so light, and wet, your eyes go fuzzy --\n\n[[> ->Crash On Planet]]",
      "links": [
        {
          "text": "> ",
          "destination": {
            "name": "Crash On Planet",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 168,
      "name": "Lasers at Pirates 2",
      "text": "You decide to shoot them down with your laser weapon.\n\nYou try to isolate one of them again, but they aren't biting.\n\nIn fact, they are coordinating very well, pincering you in. These pirates are much tougher than any you've encountered before.\n\nYou spin your ship around, and start firing salvos at them, trying to make them back off a bit.\n\nThe other pirate though closes in and fires their lasers, and you are forced to evade. There's a sudden heavy jolt -- your world is spinning, cartwheeling, you try to re-orient, but the ship isn't responding to controls. Focus, focus on the systems in front of you, a mass of jumbled text blinking angrily, they've disabled power to one of your engines, they've left a gaping hole in the side --\n\nThis is bad. You steer, try to, but you're on a collision course with the planet now. The gravitational pull's got you, and everything's still spinning, spinning, there's screaming in your ears at a distance, and your head feels so light, and wet, your eyes go fuzzy --\n\n[[> ->Crash On Planet]]",
      "links": [
        {
          "text": "> ",
          "destination": {
            "name": "Crash On Planet",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 169,
      "name": "Bribe Pirates 2",
      "text": "You are out-numbered, and these pirate ships seem much faster and tougher than any you've encountered before. you decide not to risk an open fight.\n\nYou contact them, and offer them your credits. <% if (_.s.stats.credits < 1) { %>But you don't even have any credits to offer them!<% } else { %>But they don't respond. At least not over comms. <% } %>\n\nThe other pirate though closes in and fires their lasers! You are forced to evade. There's a sudden heavy jolt, your world is spinning, cartwheeling, you try to re-orient, but the ship isn't responding to controls. Focus, focus on the systems in front of you, a mass of jumbled text blinking angrily, they've disabled power to one of your engines, they've left a gaping hole in the side --\n\nThis is bad. You steer, try to, but you're on a collision course with the planet now. The gravitational pull's got you, and everything's still spinning, spinning, there's screaming in your ears at a distance, and your head feels so light, and wet, your eyes go fuzzy --\n\n[[> ->Crash On Planet]]",
      "links": [
        {
          "text": "> ",
          "destination": {
            "name": "Crash On Planet",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 170,
      "name": "Trade Hub Intro 1",
      "text": "You glide smoothly into the docking area, into an open spot, and step off your ship into the private trade hub area.\n\nThe purpose of these bases are that they can emit powerful teleportation fields, much like the ones your teleport gun uses, but across vastly longer distances, and handling larger masses. But it correspondingly takes longer.\n\nSo not living creatures, not yet at least, but minerals and inanimate objects can be transported to a place much closer to the colonized systems, and safely fetched from there, and ship parts and food can be sent over for pick up at these hubs, if you send in orders in advance.\n\nSo <% if (_.s.timePref == \"cycles\") { %>several decacycles<% } else { %>several weeks<% } %> to do a preemptive analyical scan of any items you might want, but if you do order it then they can be sent and outfitted within <% if (_.s.timePref == \"cycles\") { %>a half-cycle<% } else { %>a day or so<% } %>.\n\nThere's a <b>console</b> in front of you, which is what you use to interact with the traders located back in central. There is no one else here outside of maintenance bots.\n\n[[Sit at the console->Sell Trade Hub Intro 1]]",
      "links": [
        {
          "text": "Sit at the console",
          "destination": {
            "name": "Sell Trade Hub Intro 1",
            "pid": 187
          }
        }
      ]
    },
    {
      "pid": 171,
      "name": "Sell Trade Hub 1",
      "text": "<h1>Sell Cargo</h1>\n\n[\n\n]{#firstResourceMarket}\n\n\n[\n\n]{#firstDropMarket}\n\n[\n\n]{#firstSellHubCreditChange}\n\nYou have <span id='firstSellHubCreditDisplay'><%= _.s.stats.credits.num %></span> credits.\n\n[[Buy something->Buy Trade Hub 1]]\n\n<%\n/*\n$(function () {\n\n  if (_.isArray(_.s.resources) && _.s.resources.length > 0) {\n\t  for (i = 0; i < _.s.resources.length; i++) {\n\t  \n\t\t  $(\"#firstResourceMarket\").append(\"<p><b>\" + (_.s.resources[i].name) + \"</b> x\" + _.s.resources[i].num + \" - <a id='sell_resource2-\" + i + \"' href='javascript: void(0);'>Sell</a></p>\");\n\t  \n\t  document.global.sellResourceListen(\"#sell_resource2-\" + i, i, \"#firstResourceMarket\", \"#firstSellHubCreditChange\", \"#firstSellHubCreditChange\", \"#firstSellHubCreditDisplay\");\n\t  \n\t  }\n  }\n  else {\n  \t $(\"#firstResourceMarket\").append(\"<span class='red_text'>You have no resources to sell.</span>\");\n  }\n\n\n  if (_.isArray(_.s.drops) && _.s.drops.length > 0) {\n\t  for (i = 0; i < _.s.drops.length; i++) {\n\t\t  $(\"#firstDropMarket\").append(\"<p><b>\" + (_.s.drops[i].name) + \"</b> x\" + _.s.drops[i].num + \" - <a id='sell_drop2-\" + i + \"' href='javascript: void(0);'>Sell</a></p>\");\n\n\t\t  document.global.sellDropListen(\"#sell_drop2-\" + i, i, \"#firstDropMarket\", \"#firstSellHubCreditChange\", \"#firstSellHubCreditDisplay\");\n\t  }\n  }\n  else {\n  \t $(\"#firstDropMarket\").append(\"<span class='red_text'>You have no scavenged parts to sell.</span>\");\n  }\n});*/\n%>\n\n\n<%\n$(function () {\n\n  if (_.isArray(_.s.resources) && _.s.resources.length > 0) {\n  \t_.each( _.s.resources, function(value, key) {\n\t\t$(\"#firstResourceMarket\").append(\"<p><b>\" + (value.name) + \"</b> x\" + value.num + \" - \" + value.price  + \" credits each <a id='sell_resource\" + key + \"' href='javascript: void(0);'>Sell</a></p>\");\n\t  \n\t  \tdocument.global.sellResourceListen(\"#sell_resource\" + key, value, \"#firstResourceMarket\", \"#firstSellHubCreditChange\", \"#firstSellHubCreditDisplay\");\n\t  \n\t});\n  }\n  else {\n  \t $(\"#firstResourceMarket\").append(\"<span class='red_text'>You have no resources to sell.</span>\");\n  }\n\n\n  if (_.isArray(_.s.drops) && _.s.drops.length > 0) {\n\t  _.each( _.s.drops, function(value, key) {\n\t\t  $(\"#firstDropMarket\").append(\"<p><b>\" + (value.name) + \"</b> x\" + value.num + \" - \" + value.price + \" credits each <a id='sell_drop\" + key + \"' href='javascript: void(0);'>Sell</a></p>\");\n\n\t\t  document.global.sellDropListen(\"#sell_drop\" + key, value, \"#firstDropMarket\", \"#firstSellHubCreditChange\", \"#firstSellHubCreditDisplay\");\n\t  });\n  }\n  else {\n  \t $(\"#firstDropMarket\").append(\"<span class='red_text'>You have no scavenged parts to sell.</span>\");\n  }\n});\n%>",
      "links": [
        {
          "text": "Buy something",
          "destination": {
            "name": "Buy Trade Hub 1",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 172,
      "name": "Buy Trade Hub 1",
      "text": "You take a look at the array of ship-compatible upgrades you've had pre-transported in advance. Which ones could help you out on your journey the most?\n\n<h1>Buy Items</h1>\n\nAblative Heat Shields - $<%= _.s.heatShields.price %> <% if (_.s.heatShields.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.heatShields.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseHeatShields1]] <% } %>\n\nHunter Missiles - $<%= _.s.hunterMissiles.price %> <% if (_.s.hunterMissiles.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.hunterMissiles.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseHunterMissiles1]] <% } %>\n\nStarbeam Lasers - $<%= _.s.starbeamCannon.price %> <% if (_.s.starbeamCannon.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.starbeamCannon.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseStarbeamCannon1]] <% } %>\n\nWarp Drive - $<%= _.s.warpDrive.price %> <% if (_.s.warpDrive.isAvail == false) { %> <span class='purchased_text'>(Purchased!)</span> <% } else if(_.s.stats.credits.num < _.s.warpDrive.price) { %>  <span class='broke_text'>(Not enough credits!)</span> <% } else { %> - [[Purchase->purchaseWarpDrive1]] <% } %>\n\nYou have <span id='buyHubCreditDisplay2'><%= _.s.stats.credits.num %></span> credits.\n\n[[> Head towards next planet->2nd Planet interlude]] ",
      "links": [
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseHeatShields1",
            "pid": 175
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseHunterMissiles1",
            "pid": 176
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseStarbeamCannon1",
            "pid": 174
          }
        },
        {
          "text": "Purchase",
          "destination": {
            "name": "purchaseWarpDrive1",
            "pid": 177
          }
        },
        {
          "text": "> Head towards next planet",
          "destination": {
            "name": "2nd Planet interlude",
            "pid": 151
          }
        }
      ]
    },
    {
      "pid": 173,
      "name": "Launch First Planet",
      "text": "You get back into your ship...\n\n[\nEquipment check: <b>good</b>, engines <b>on</b>, throttle <b>up</b>, and we're a <b>go</b>!\n]{-#launch1_psg1}\n\n[\nYour ship pierces through the sky...\n]{-#launch1_psg2}\n\n[\nThrough the atmosphere...\n]{-#launch1_psg3}\n\n[\n...And into the inky <a href=\"javascript:void(0)\" data-passage='Orbiting First Planet'>blackness</a>.\n]{-#launch1_psg4}\n\n<% if (2 < 1) { %>\n[[Orbiting First Planet]]\n<% } %>\n\n<%\n$(function () {\n$(\"#launch1_psg1\").fadeIn(4500);\n$(\"#launch1_psg2\").delay(2000).fadeIn(3000);\n$(\"#launch1_psg3\").delay(3000).fadeIn(3000);\n$(\"#launch1_psg4\").delay(4000).fadeIn(3000);\n});\n%>",
      "links": [
        {
          "text": "Orbiting First Planet",
          "destination": {
            "name": "Orbiting First Planet",
            "pid": 188
          }
        }
      ]
    },
    {
      "pid": 174,
      "name": "purchaseStarbeamCannon1",
      "text": "<%= _.s.starbeamCannon.desc %>\n\nPurchase Starbeam Laser Cannon for <b><%= _.s.starbeamCannon.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub 1\" id=\"<%= _.s.starbeamCannon.id %>2\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub 1]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.starbeamCannon.id + \"2\", _.s.starbeamCannon);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub 1",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 175,
      "name": "purchaseHeatShields1",
      "text": "<%= _.s.heatShields.desc %>\n\nPurchase Heat Shields for <b><%= _.s.heatShields.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub 1\" id=\"<%= _.s.heatShields.id %>2\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub 1]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.heatShields.id + \"2\", _.s.heatShields);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub 1",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 176,
      "name": "purchaseHunterMissiles1",
      "text": "<%= _.s.hunterMissiles.desc %>\n\nPurchase Hunter Missiles for <b><%= _.s.hunterMissiles.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub 1\" id=\"<%= _.s.hunterMissiles.id %>2\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub 1]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.hunterMissiles.id + \"2\", _.s.hunterMissiles);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub 1",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 177,
      "name": "purchaseWarpDrive1",
      "text": "<%= _.s.warpDrive.desc %>\n\nPurchase Warp Drive for <b><%= _.s.warpDrive.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub 1\" id=\"<%= _.s.warpDrive.id %>2\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub 1]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.warpDrive.id + \"2\", _.s.warpDrive);\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub 1",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 178,
      "name": "Killed By Pirates Wreckage Final Planet 1",
      "text": "The taller pirate goes over to the short one, and they squabble in low tones.\n\nThe shorter one gestures at you<% if (_.s.localIsAlive == true)  { %> and then the local being<% } %>, and then suddenly the shorter pirate raises their blaster and points it at you.\n\n<% if (_.s.stats.pirateLike.num > 0) { %>\n\"(Apologetic),\" The taller pirates says.\n<% } %>\n\nYou fumble for your own blaster, but it's too <span class=\"bad_end_text\">late</span>.\n\n<a href=\"javascript:void(0)\" data-passage=\"Talk Pirates Final Planet\" id=\"killed_by_pirates_wreckage_reload\">< Reload last checkpoint?</a>\n<%\n$(function () {\n\t$(\"#passage\").on(\"click\", \"#killed_by_pirates_wreckage_reload\", function() {\n\t\t_.change(_.s.stats.pirateLike, -1);\n});\n});\n%>",
      "links": []
    },
    {
      "pid": 179,
      "name": "Mission",
      "text": "Your official mission isn't to actually reach the center of the galaxy. \n\nThe spacefarer's council would love it of course, if you did; it's still one of their tertiary goals. Scientists back at <%=_.s.centralPlanet %> would be ecstatic.\n\nBut the council plans for it to be a more gradual process. Your foremost goal is to gather information on all these planets. They want to know the terrain, the resources, the threat levels of the local wildlife, the survivability of the atmospheres; that's what they're most interested in.\n\nOver time, the galactic federation will plan out the right path for colonization and expansion; yours was not the only species looking for a new home. But so far, there haven't been any planets found that have an atmosphere that could support your people.\n\nBut it will be a gradual expansion towards the center, planting outposts and growing their capital, their tech, their reach. Today they have the automated trade hubs, but they hope over time to upgrade and expand them, make them genuine space outposts as well. \n\nYou requested a straight shot route towards the center; few others do. Most are assigned more thorough, less taxing routes, ones that loop back, that have an estimated time frame. Rarely do pilots want ones like yours: a one way ticket with no plan for return. \n\nAs the years go by, the parts for your ship are being improved upon, such that at the current rate, there is a chance you can make it there in your lifetime. It's doable. The ship you originally started on though, it wouldn't have been.\n\nThe further and closer you get, the more trecherous it gets, based on prior starfarers; hostile lifeforms, predatory pirates, inhospitable environments. The ships get worn down, or the pilots do. And of the few that have tried this route before: one by one, one day, they've gone offline and ceased signals with HQ.\n\nTheir disappearance will get noted in the system. HQ tells us they'll send a ship to investigate, when they can. But spacefarers are so isolated, that unless they know you're still alive and where you are, they'll rarely re-route another pilot to do an active rescue mission.\n\nBut that's fine. You accepted the risks.\n\n[[> Continue ->Next Planet]]",
      "links": [
        {
          "text": "> Continue ",
          "destination": {
            "name": "Next Planet",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 180,
      "name": "Sentience",
      "text": "There are 9 known sentient life forms, 22 more that have gone extinct. Your species is now on the endangered list because of the state of your home planet coupled with the lack of any other known planets that would be able to support them.\n\nAdvanced lifeforms are rare enough in this galaxy, but their frequency seems to become nill nearer to the center of the galaxy; they're all clustered relatively close to <b><%=_.s.centralPlanet %></b>. Scientists aren't sure why.\n\nYou do have instructions in the case where you do locate an advanced lifeform: avoid them if you can. That isn't your mission, and more than one explorer has met their journey's end at the hands of an advanced hostile.\n\nYour ship does a preliminary scan of planets before you approach, and you were told it can generally pick up on signs of advanced lifeforms while in orbit. If it does, then it notifies both you and HQ, and you can move on, to another planet on your route. \n\nSo far, it has yet to find any that has an oxygen atmosphere that can support you outside of a suit though. No one has.\n\n> Continue ->Next Planet",
      "links": []
    },
    {
      "pid": 181,
      "name": "Starry Sky",
      "text": "<div>\n\n<div id='title_splash'><h1 id='title'>Transient Skies</h1>\n\n<a href=\"javascript:void(0)\" data-passage='No Fuel' id='start-link'>Begin</a>\n\n<a href=\"javascript:void(0)\" id=\"continue-link\" style='display: none'>Continue</a>\n\n<% /*\n<a href=\"javascript:void(0)\" id=\"remove-link\">Remove</a>\n*/ %>\n\n<% /*\n<a href=\"javascript:void(0)\" id=\"debug_on\">Turn Debug On</a> (Adds javascript alerts, for testing, will be taken out)\n[\nDebug has been turned on!\n]{-#debug_on_psg} */ %>\n</div>\n\n<div id=\"starfield\">An encompassing sky stretches above you.</div>\n\n\n</div>\n\n<% if (2 < 1) { %>\n[[No Fuel]]\n<% } %>\n<%\n$(function () {\n\n$(\"#title_splash\").hide().delay(2000).fadeIn(2000);\n\nvar string = \"\";\n\nfor (i = 0; i < $(document).width() * $(document).height(); i++) {\n  var spaces = Math.floor(Math.random() * (40 - 10) ) + 10; //50 20\n  i += spaces * 10;\n  for (j = 0; j < spaces; j++) {\n  \tstring += \"&nbsp;\"; \n  }\n    var font_size = Math.floor(Math.random() * (11 - 1) ) + 1;\n\ti += font_size;\n\tstring += \"<span style='font-size: \" + font_size + \"px'>*</span>\";\n}\n//alert($(document).height());\n$(\"#starfield\").html(string);\n\n});\n%>\n\n<%\n$(function () {\ndocument.global.showNextPsg('#debug_on', '#debug_on_psg', true, function() {s.debugOn = true;});\n\nif (localStorage.getItem('dgtzieatransientskies') !== null) {\n\t$(\"#start-link\").text('Restart');\n\t$(\"#continue-link\").show();\n}\n$(\"#continue-link\").click(function() {\nstory.restore(localStorage.getItem('dgtzieatransientskies'));\n_.s = story.state;\nstory.show(story.history[story.history.length - 1], true);\n});\n$(\"#remove-link\").click(function() {\t\n\tlocalStorage.removeItem('dgtzieatransientskies');\n});\n//in case there's an issue displaying this passage\n/*setTimeout(function(){\n    story.show(\"No Fuel\");\n}, 15000);*/\n});\n%>",
      "links": [
        {
          "text": "No Fuel",
          "destination": {
            "name": "No Fuel",
            "pid": 2
          }
        }
      ]
    },
    {
      "pid": 182,
      "name": "purchaseFuel",
      "text": "<%= _.s.fuel.desc %>\n\nRefuel for <b><%= _.s.fuel.price %></b>?\n\n<a href=\"javascript:void(0)\" data-passage=\"Buy Trade Hub\" id=\"<%= _.s.fuel.id %>\">Yes!</a>\n\n[[Perhaps not...->Buy Trade Hub]]\n\n<%\ndocument.global.purchaseListen(\"#\" + _.s.fuel.id, _.s.fuel, (function() {_.s.ship.fueled = true;}));\n%>",
      "links": [
        {
          "text": "Perhaps not...",
          "destination": {
            "name": "Buy Trade Hub",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 183,
      "name": "Approach Being 2 Final Planet",
      "text": "The being moves its head, waves its hand, and then gurgles something.\n\n[[Say hello->Pirates Final Planet]]\n\n[[Say hello in galactic->Pirates Final Planet]]\n\n[[Put your hands up->Pirates Final Planet]]\n\n[[Point at me->Pirates Final Planet]]\n\n[[Point at them->Pirates Final Planet]]\n\n[[Point at the ground->Pirates Final Planet]]\n\n[[Point at the sky->Pirates Final Planet]]\n\n[[Nod head->Pirates Final Planet]]\n\n[[Shake head->Pirates Final Planet]]\n\n[[Wave->Pirates Final Planet]]\n\n[[Wait->Pirates Final Planet]]",
      "links": [
        {
          "text": "Say hello",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Say hello in galactic",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Put your hands up",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Point at me",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Point at them",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Point at the ground",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Point at the sky",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Nod head",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Shake head",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Wave",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        },
        {
          "text": "Wait",
          "destination": {
            "name": "Pirates Final Planet",
            "pid": 88
          }
        }
      ]
    },
    {
      "pid": 184,
      "name": "3rd Planet interlude alt",
      "text": "Back at <b><%=_.s.centralPlanet %></b>, you await news on your next mission.\n\nThe bare oblong room you're in has a ceiling that curves above you like the inside of top half of an egg. The walls are a neutral grey; the lights are a bit too bright.\n\n<b>Fletke</b> enters the room. They are your superior, your liason to the galactic council, and perhaps your closest ally here. \"H-h-hal loa,\" they gurgle at you. \n\nYou nod. \"Hello, <b>Fletke</b>,\" you say carefully, before switching to Galactic Conlang. \"(Encouraging) improving.\"\n\n<b>Fletke</b> signs smoothly back in universal through its own mounted gear. \"(Receptive) I express gratitude to you and greet you as a respected equal.\n\nYou sign back: \"(Accepting) I greet you as well.\n\n<b>Fletke</b>: \"(Congratulatory) The galactic council accepts your proposed mission to the center of the galaxy.\"\n\nYou: \"(Accepting) I am happy to learn of this. (Query) Does the council continue to doubt my loyalty?\"\n\n<b>Fletke</b>: \"(Composed) They accept you are loyal to the mission of the galactic spacefarers, and not to your origin planet.\" \n\n<a href=\"javascript:void(0)\" id='quar_1'>(Refutation)</a>\n[\nYou: \"<b>(Refutation)</b> I still have care about my origin planet people, although I am completely loyal to the mission of the galactic spacefarers.\"\n]{-#quar_psg1}\n\n<a href=\"javascript:void(0)\" id='quar_2'>(Accepting)</a>\n[\nYou: \"<b>(Accepting)</b> Yes, I am loyal to all the stars in the sky.\"\n\n<b>Fletke</b>: \"(Confused) I do not understand. Rephrase?\"\n\nYou: (Apologetic). (Clarifying) I am loyal to the grander purpose of spacefaring.\"\n]{-#quar_psg2}\n\n[\n<b>Fletke</b>: \"(Composed) The council will be enthused to learn of your words. One is allowed to be loyal to one's planet, contingent on one not harming galactic federation goals, and so long as you do not break the Quarantine around your origin system.\"\n\nYou: \"(Acknowledging) Yes, I will not travel or contact anyone from within my origin system without notifying the Galactic Federation. (Query) There is no additional discussion about lifting the quarantine soon?\"\n\n<b>Fletke</b>: \"(Composed) I have no awareness of discussions about changes to the quarantine status. They still consider your origin systems people too factious for now. I shall keep trying to convince them that is false.\"\n\nYou: \"(Acknowledging).\n\n<b>Fletke</b>: (Parting) I depart for a meeting now. We will have time to discuss the mission details later. (Congratulatory) I have a suggestion that we partake in a celebratory social gathering tonight to commemorate.\"\n\nYou: \"(Parting) I think that is a great idea. I hope to meet you again soon.\"\n\n<a href=\"javascript:void(0)\" data-passage=\"3rd Planet intelude alt 2\">> Continue</a>\n]{-#quar_psg3}\n\n<% if (2 < 1) { %>\n[[3rd Planet intelude alt 2]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.showNextPsg('#quar_1', '#quar_psg1', true, function() {_.change(_.s.stats.home, 1); $('#quar_2').hide(); $('#quar_psg3').show(); });\n\ndocument.global.showNextPsg('#quar_2', '#quar_psg2', true, function() {_.change(_.s.stats.diplomacy, 1); _.change(_.s.stats.galactic, 1); $('#quar_1').hide(); $('#quar_psg3').show();});\n});\n%>\n\n<% /*\nFletke: \"(Explanatory) One's path has a generalized and predetermined route ensuring there is no overlap or conflict with other galactic spacefarers. The route will continue to be monitored and set as your ship collects data about further parts of your route which we do not have as much data on.\"\n\nYou: \"(Query) Do I continue to have autonomy about visiting planets based on local conditions?\"\n\nFletke: (Explanatory) You are allowed to deviate within the set of systems given to you, and make autonomous decisions based on local dangers such as asteroids, nebulae, radiation, pirates, and so on, and ship conditions  such as fuel, damage, energy, and so on. You are to avoid Unmarked Inhabited planets as you are not trained as an ambassador.\"\n\nYou: \"(Query) But is it correct that there should be very few UI on my route?\"\n\nFletke: \"(Explanatory) Especially as you move closer to the center of the galaxy. I acknowledge that you are excited but please go recuperate. You can ask questions relating to your missions at any time soon.\"\n\nYou: \"(Composed) I appreciate your concern.\"\n \n\nYou: \"(Composed) Maybe.\"\n*/ %>\n",
      "links": [
        {
          "text": "3rd Planet intelude alt 2",
          "destination": {
            "name": "3rd Planet intelude alt 2",
            "pid": 185
          }
        }
      ]
    },
    {
      "pid": 185,
      "name": "3rd Planet intelude alt 2",
      "text": "Your journey to the center of the galaxy has been an arduous one, but you have endeavored. \n\nYou are more than halfway there now, from where you started.\n\nYou have <span class='green_text'><%= document.global.travelDistance() %></span> to go.\n\n[[> Continue->First Gen Planet]]",
      "links": [
        {
          "text": "> Continue",
          "destination": {
            "name": "First Gen Planet",
            "pid": 166
          }
        }
      ]
    },
    {
      "pid": 186,
      "name": "Quarantine",
      "text": "The quarantine was put into place because the galactic federation considered your people to be overly expansionist and undiplomatic. \n\n[[< Back->3rd Planet interlude alt]]",
      "links": [
        {
          "text": "< Back",
          "destination": {
            "name": "3rd Planet interlude alt",
            "pid": 184
          }
        }
      ]
    },
    {
      "pid": 187,
      "name": "Sell Trade Hub Intro 1",
      "text": "You sit at a console. There's no voice or video on these, just text.\n\nThere's a bit of waiting involved. Not the connection, that's fairly instantaneous. But there's authentication, and the virtual inspection and scanning of your cargo and your ship systems, all monitored by a trade officer on the other end.\n\n\"(Deferential) Are we ready to proceed?\" you comm to the trade officer finally, using the galactic set of conlang symbols on the keyboard.\n\n\"(Formal) Affirmative.\" the officer agrees, stiffly. It's a good thing they can't see you, because you can tell from the grammatical subtleties of his symbol usage throughout the process that he's a <b>Grengarian</b>, and he'd shoot you on sight if he knew your system of origin.\n\n[[> Continue->Sell Trade Hub 1]]",
      "links": [
        {
          "text": "> Continue",
          "destination": {
            "name": "Sell Trade Hub 1",
            "pid": 171
          }
        }
      ]
    },
    {
      "pid": 188,
      "name": "Orbiting First Planet",
      "text": "<h1>In Orbit</h1>\n\nYour spaceship is now in space, orbiting around planet <b><%= _.s.firstPlanet %></b>.\n\n<strike>Explore</strike><p>\n\n<strike>Fight</strike><p>\n\n<strike>Survive</strike><p>\n\n<a href=\"javascript:void(0)\" data-passage=\"Trade First Planet\">Trade</a>\n\n<% if (2 < 1) { %>\n[[Trade->Trade First Planet]]\n<% } %>",
      "links": [
        {
          "text": "Trade",
          "destination": {
            "name": "Trade First Planet",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 189,
      "name": "Exchange Final Planet",
      "text": "They seem eager to learn more about anything you can tell them, just as eager as they are to also tell you about themselves.\n\nYou tell them about:\n\n<a href=\"javascript:void(0)\" id=\"central_exchange\"><%= _.s.centralPlanet %>.</a>\n\n<a href=\"javascript:void(0)\" id=\"origin_exchange\">Your origin planet.</a>\n\n<a href=\"javascript:void(0)\" id=\"journey_exchange\">Your journey.</a>\n\n<a href=\"javascript:void(0)\" id=\"lie_exchange\">\nYour background (lie).</a>\n\n[\n<a href=\"javascript:void(0)\" id='finish_exchange'>> That's what you share.</a>\n]{-#exchange_continue}\n\n[\nAnd they tell you about the many <a href=\"javascript:void(0)\" data-passage=\"Study Monoliths Final Planet\">monoliths</a> they've built on this planet.\n]{-#exchange_monoliths}\n\n<% if (2 < 1) { %>\n[[Study the monoliths the beings tell you about->Study Monoliths Final Planet]]\n<% } %>\n\n<%\n$(function () {\ndocument.global.clickReplace(\"#central_exchange\", \"<b>\" + _.s.centralPlanet + \".</b><br><span class='green_text'>You tell them a bit about <b>\" + _.s.centralPlanet + \"</b>'s floating city hierarchies and the spacefarer's council.</span>\", (function () { $(\"#exchange_continue\").show(); $(\"#lie_exchange\").hide(); }) );\n\ndocument.global.clickReplace(\"#origin_exchange\", \"<b>Your origin planet.</b><br><span class='green_text'>You tell them about your people, and it's a relief sharing their stories.</span>\", (function () { $(\"#exchange_continue\").show(); $(\"#lie_exchange\").hide(); }) );\n\ndocument.global.clickReplace(\"#journey_exchange\", \"<b>Your journey to the center of the galaxy.</b><br><span class='green_text'>You tell them about your journey so far, and your objective up there in the sky.</span>\", (function () { $(\"#exchange_continue\").show(); $(\"#lie_exchange\").hide(); }) );\n\ndocument.global.clickReplace(\"#lie_exchange\", \"<b>Your background (lie).</b><br><span class='green_text'>You don't want to betray your spacefarer's directive, and you don't want to interfere with the natural development of this species. You express admiration for their people and make up something about where you came from.</span>\", (function () { $(\"#exchange_continue\").show(); $(\"#central_exchange, #origin_exchange, #journey_exchange\").hide(); }) );\n\ndocument.global.showNextPsg(\"#finish_exchange\", \"#exchange_monoliths\", true, (function () { $(\"#central_exchange, #origin_exchange, #journey_exchange, lie_exchange\").hide(); }));\n});\n%>",
      "links": [
        {
          "text": "Study the monoliths the beings tell you about",
          "destination": {
            "name": "Study Monoliths Final Planet",
            "pid": 110
          }
        }
      ]
    },
    {
      "pid": 190,
      "name": "Center Galaxy Old",
      "text": "It's not quite like a gravitational pull, but there's a certain alignment, a structure, to how the stars and systems are all placed, and they've detected some invisible force, that points everything towards a specific point.\n\nYou've tried studying the science behind it, but it's all communicated in a constructed high-level academic language, and isn't translateable to the more straightorward galactic conlang.\n\nFrom what you understand, though? They don't know what's there, exactly. But they have their theories.",
      "links": []
    }
  ]
}