{
  "passages": [
    {
      "pid": 1,
      "name": "Arrival at Stagwood Manor",
      "text": "The day I arrived at Stagwood Manor, I became an Inspector at the London Metropolitan Police.  Or, rather, it was the other way around.  After a mere three hours in command of my new role, I was charged with investigating the murder of Sir Stanley Stagwood, Lord of Stagwood Manor.\n\nIt was a sunny English afternoon; the sort of afternoon that saw ladies picnicking on the lawn with parasols, their straw hats bedecked with feathers and other frippery.  As for myself I possessed neither a lady nor a picnic, though I secretly longed for both, having quite had enough of the bedsit in which I currently resided.  (A man can only stomach so many cheese sandwich suppers before the novelty wears off).\n\nCasting aside the romantic woolgathering of my preoccupied mind, I pulled the car to a stop outside Stagwood Manor:  a brown bricked Georgian of near perfect symmetry.  I crunched my way across the gravel driveway leading from the shiny black Daimler to the front door of the house, glancing at an elaborate concrete fountain as I passed it.\n\nA lowly constable by the name of Lewis met me at the entrance, his lean frame barely filling his tunic.\n'Good morning, Sir,' Lewis said, his beaklike nose protruding from beneath his helmet.\nI glanced downward, noticing that his belt buckle gleamed in the sunlight, having clearly spent the previous evening being polished within an inch of its life by the constable's mother.\n\n'Good morning, Constable,' I replied, relishing the note of deference in the constable's voice as he addressed me.\nClearly he was aware of my appointment to the role of Inspector, and was taking pains to show his respect.\n'Constable, have you been stationed outside this door all day?' I enquired of him, noting the eruption of white climbing roses surrounding each of the eight large windows at the front of the house.\n'Not all day, Sir,' came the artless reply.  'Only since the murder of Lord Stagwood.'\n'And what can you tell me about Lord Stagwood's murder?' I asked, moving on to the matter at hand.  'How was it that Lord Stagwood came to be murdered in his own home?'\n'Well, Sir,' the constable began, 'it's like this:  Lord Stagwood invited four guests to Stagwood Manor for luncheon.  It was something he was known to do, of an occasion.  Only, when his guests arrived, instead of finding plates of sausages and mash, they found Lord Stagwood dead as a doornail.'\n'The landed gentry do not bother themselves with sausage and mash,' I informed the constable, 'though the intelligence of your report is not lost on me.'\n'Sorry, Sir,' Lewis apologized sheepishly.\n\n'And who are these four guests?' I asked him, removing my notepad and pencil from the front pocket of my tunic.  'What are their names, and how are they acquainted with Lord Stagwood?'\n'Well, Sir, there's Miss Evelyn West,' the constable replied, the skin on his cheeks blossoming into the most ridiculous shade of pink.\n'I see,' I reply staidly.  'And who is Miss Evelyn West?'\n'I'm not exactly sure that I should say, Sir,' the constable squirmed, suddenly taking a deep interest in the toes of his boots.\n'I see,' I replied again, handing him the notepad and pencil.  'Perhaps it would be best if you would take notes on my behalf.  I have need of a scribe and it would seem that you are the next best thing.'\n'Yes, Sir,' the constable replied gratefully, taking the paper and pencil from my hand before licking the lead tip.\n\n'And Lord Stagwood's wife?' I enquired, pursing my lips in the face of his uncouth habit.\n'Lord Stagwood is unmarried, Sir,' the constable replied.  'At least, he was unmarried until...'\n'Make a note of it,' I instructed him.  'And reserve a fresh page for Miss West.  I have a feeling we may need the space.'\n'Yes, Sir,' the constable replied, scribbling the woman's name at the top of the paper.\n\n'Proceed,' I instructed him with a wave of my hand.\n'Well, Sir,' Lewis continued, 'there's Mr. Victor Cole.  He's Lord Stagwood's business partner.'\n'I believe I may have heard of the man in passing,' I replied.  'Stocky fellow with a taste for tweed.'\n'Yes, Sir, that's him,' the constable agreed.  'Has a great big mustache too.'\n'Set aside a page for Cole as well,' I instructed the constable before adding, 'the same goes for the other two.  Who are...?'\n'Mr. Henry Bray, Lord Stagwood's nephew, and Mrs. Mildred Hobbs, who appears to be some sort of rural type, Sir,' the constable said, completing his report.\n\n'Very good,' I answered him with a nod of my head.  'And I assume that these four guests have been detained somewhere within Stagwood manor?'\n'Yes, Sir,' the constable replied proudly.  'I told them they weren't to leave until you said so.  Much grumbling some of them did too, Sir.'\n'Very good,' I replied before setting forth into the spacious foyer decorated with buttery yellow walls and pendulous globe lights.  A woman's touch, I felt sure of it, though perhaps not a modern one.  Lord Stagwood's mother perhaps, though from a much earlier period when such a style of decorating was fashionable.\n\nThe first detail, however, that presented itself to me was the unseasonal chill to the room; the second was the tricolour English Foxhound.  I reached down to slap him about the ribs but my affection was promptly ignored.  The inquisitive beast, instead, seemed to take exception to the pocket within which I had stowed my gloves.  Snapping at the fabric of my tunic, he somehow managed to drag the pair from their hiding place and began what seemed to be a systematic disemboweling of the unfortunate article.\n\nRemoving the handkerchief from my other pocket, I wiped my hands clean as I allowed my eyes to roam the foyer in search of the way forward.\n\n[[Examine the body]]",
      "links": [
        {
          "text": "Examine the body",
          "destination": {
            "name": "Examine the body",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "Question Mildred Hobbs",
      "text": "The constable and I could hear the murmur of Mrs. Hobbs' voice even before we reached the door to the children's playroom.\n\n'Who do you suppose she's talking to, Sir?' the constable asked me as he scratched his nose with the butt of the pencil.  'One of the maids?'\n\nUnlike the constable I tried to avoid making assumptions of people and situations until I had gained a proper handle on them.  Therefore, after knocking twice on the white painted wooden door, I entered the room and found myself staring at the tweed-sheathed posterior of a woman I could only assume to be Mrs. Mildred Hobbs.\n\n'Mrs. Hobbs?' I enquired of the bottom, and at once the woman stood upright, turning to face me with the most extraordinary look of affront on her face.\n'And who might you be?' she asked rather coarsely for a woman of her advancing years.\n'I am Inspector Percival Pike of the Metropolitan Police,' I informed her, 'and this is Constable Lewis.'\n'I have met your constable thank you very much,' Mrs. Hobbs replied derisively, casting an indignant look at the young officer who, for his part, appeared to blanch under her gaze.\n'I see,' I replied as I cast my eye around the modest playroom, its buttery walls cracked and faded with neglect, its rust coloured carpet worn underfoot.\n\nI noticed a chill to the room too.  There was a small oak fireplace on the south wall, which seemed ill conceived being that it was the sunny side of the house.  It was not lit, nor did it appear to have been lit in the past decade.  At the center of the room sat a miniature wooden table - no larger than the wheel of the Daimler - and three small chairs, one of which was employed by a tired looking teddy bear.  The table was laid out with a pink and white floral tea set with four place settings, though I noticed that the saucer belonging to Mr. Bear was without a cup.\n\n'Shameful how the maids have kept this place in such ill repair,' Mrs. Hobbs grumbled as she replaced the missing teacup she had been polishing with the hem of her grey cardigan.  'It doesn't take much to pass a duster around a room once a week,' she added gruffly.\n\n'I'm afraid I wouldn't know, Mrs. Hobbs,' I replied, having gone from my mother's house to the police barracks to the bedsit all in a matter of years and never once so much as having considered a duster let alone used one.\n\n'No,' she replied, surprising me with her agreement.  'A man need not bother himself with the up-keep of a children's playroom.'\n\n'I understood that Lord Stagwood did not have any children of his own,' I suggested, nodding at the constable to take note of the woman's reaction.\n'Quite right,' Mrs. Hobbs agreed brusquely as she jabbed her fists into the sides of her fleshy waist.  'Though he fed and clothed for that dolt of a nephew as if he were his own.  Saw to the boys education and gave him a good start in the world, Lord Stagwood did.  Then what did he do but go straight out into the world and waste it all.'\n\n'I assume you are referring to young Henry Bray,' I suggested to the irate woman.\nShe scoffed and looked me straight in the eye.  'Henry Bray can no longer lay claim to youth, Inspector.  He is a grown man who should think more of his responsibility to uphold the family name than of his idle pursuits and jollying about.'\n'Indeed,' I said in the hope of placating the woman.\n\nI stepped towards the small window on the eastern wall, its drab brown curtains drooping from the wooden rail in several places.\n\n'I understand that you were Lord Stagwood's nanny when he was a boy,' I continued as I gazed down at the gravel path leading towards rear of the house.\n'That's right,' Mrs. Hobbs replied, all but elbowing me away from the window so that she could straighten the fabric of the curtains.  'Fifty years I was at Stagwood Manor, seeing to the raising of Lord Stagwood and his younger brother, God rest their souls, and then having a hand in the rearing of Master Bray as well.'\n'You must have been a beloved member of the household, Mrs. Hobbs,' I suggested.  'Tell me, where are you living now?'\n'That's none of your business now it is?' Mrs. Hobbs retorted, again stabbing her fists into her fleshy waist.  'Where I live and how I get by has nothing to do with Lord Stagwood's passing.'\n\n'It was more than a passing, Mrs. Hobbs,' I argued with her.  'The man was mercilessly stabbed through the heart.'\n'Well, that's as may be,' the woman retorted with less aggression than before.\n\n'I understand that you were promised a lifetime's employment and lodging at Stagwood Manor,' I continued on.\n'That's right,' Mrs. Hobbs agreed stiffly.\n'However, when Lord Stagwood's wife divorced him on account of his numerous indiscretions, leaving him without a single heir to his fortune, you were promptly put out.'\n'That's one way of putting it, Inspector,' Mrs. Hobbs replied huffily.  'Another is to say I was simply let go as a matter of course.'\n'Because Lord Stagwood no longer had any need of you,' I pressed her.\n'If you insist,' Mrs. Hobbs replied, crossing her arms over her chest in defiance.\n\n'I see that you have been out in the garden, Mrs. Hobbs,' I said, glancing down at a swipe of mud smeared against the hem of her tweed skirt.\n'So what if I have,' she replied stoutly.  'I don't believe it's a crime for a woman weed her allotment.'\n'Of course not,' I replied graciously.  'However, I must ask if you have visited Lord Stagwood's garden today?'\n'Why should I have?' Mrs. Hobbs demanded.\n'I very much hoped that you would tell me, Mrs. Hobbs,' I pressed.\n'Well, so what if I have,' she retorted.  'I'll have you know my late husband and I took great pride overseeing the gardens at Stagwood Manor.  Forty years my husband worked these grounds and for what?  So that Lord Stagwood would let it all go to ruin?  Not on my watch, Inspector.  I plan to set things right - starting with replanting the memory tree my husband's late great-grandfather planted in rose garden.  An oak it was.  One hundred and twenty-three years that tree had been in the ground.  And each and every one of the children who passed through these halls has dirtied their hands gathering its leaves.  Mark my words that tree was an important part of Stagwood Manor and I intend to see things set right if it's the last thing I ever do.'\n\n'Was it customary for Lord Stagwood to invite members of his former staff to join him for lunch?' I asked Mrs. Hobbs as I examined an old wooden train set that had seen better days.\n\nThe room was silent for so long that I had to glance back at Mrs. Hobbs to ensure she had heard my question.  Apparently she had, as her face had contorted into a mess of affront and wrinkles.\n\n'I will have you know that Lord Stagwood was a very generous man,' she replied bitterly.  'He knew how to treat those who had served him well.'\n'I see,' I replied dismissively.  'Do you own a pair of gumboots, Mrs. Hobbs?'\n'Of course I do,' she replied sharply.  'Down beside the back entrance they are,' she added, before seeming to falter.  'Well, now, if you would be so good as to leave me I would very much like to set this room to rights.'\n\n'Just one more question, Mrs. Hobbs,' I replied, casting a knowing look in the direction of the constable.  'How is it that none of the staff at Stagwood Manor noticed Lord Stagwood's corpse seated at the head of the dining table?  Surely they might have thought it odd to see him there, sitting stock still, while they went about their preparations for lunch.'\n\n'I don't see why they should,' Mrs. Hobbs contended.  'Lord Stagwood was a very particular man.  He liked his staff to conduct themselves with the highest level of formality.  If I know Lord Stagwood he might have very well specifically requested that the staff not address him directly, unless spoken to first, on paid of being sent away cap in hand.'\n'Just like yourself, Mrs. Hobbs,' I suggest rather meanly.\n\nThe woman bristled and pursed her lips in annoyance.\n'Lord Stagwood was a very particular man,' she continued stiffly.  'His staff was also very particular about following his orders.'\n\n[[Question Evelyn West]]\n[[Question Henry Bray]] \n[[Question Victor Cole]] \n[[Investigate the weapons]]",
      "links": [
        {
          "text": "Question Evelyn West",
          "destination": {
            "name": "Question Evelyn West",
            "pid": 3
          }
        },
        {
          "text": "Question Henry Bray",
          "destination": {
            "name": "Question Henry Bray",
            "pid": 4
          }
        },
        {
          "text": "Question Victor Cole",
          "destination": {
            "name": "Question Victor Cole",
            "pid": 5
          }
        },
        {
          "text": "Investigate the weapons",
          "destination": {
            "name": "Investigate the weapons",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "Question Evelyn West",
      "text": "The constable and I found Evelyn West reclining on a gold and white-canopied bed in the guest wing of Stagwood Manor.\n\nThe glossy waves of her chestnut hair were splayed across the white silk pillowcase at the head of the bed; her hand with its red fingernails lay across the yoke of her cafe au lait gown.  The whole scene looked like something out of some romantic film yet to be made.  I couldn't help but feel overawed by the spectacle.\n\nAt first glance I feared Miss West might have done away with herself, following the heartbreaking loss of her alleged 'friend', Lord Stagwood.  I noticed the bottle of pills lying on the circular bedside table: its lid detached and its contents spilled across the gilt surface.  The room was overly warm and the light was low, owing to the pair of enamel lamps at either side of the bed.\n\n'Miss West?' I said, venturing further into the room, my acolyte close at my heels.\n'Miss West?' I repeated, this time touching the embroidered shoulder of the woman's dress and shaking her lightly.\nAt once her eyelids fluttered open, her long black lashes dancing like a butterfly's wings upon a flower.\n\n'Inspector,' she exclaimed, lifting her head from the pillow and touching her hand to her near perfect hair.  'I must look a fright.'\n'Quite the opposite, Miss West,' I replied before I could catch myself.\n\nI stepped back from her bedside to allow her room to sit upright.  She touched her hand to her cheek in what I took to be a gesture of consideration before glancing at the door leading to the adjoining dressing room.\n'I must dash to the powder room for a moment,' she said, sliding her elegant frame towards the edge of the bed and slipping past me before I had the presence of mind to intercept.\n'Miss West,' I called after her, but she clearly had her mind set on evasion.\n\n'I shouldn't be surprised by her running off like that, Sir,' the constable advised me.  'Her type is known to have a flair for the dramatic.'\nBefore I could respond, I heard the clattering of what sounded like metal upon tile, followed by the opening and closing of several cupboard doors.  Moments later Evelyn West returned to the room looking equally as glamorous as before she went in.\n\n'I hope you will forgive a lady for wanting to look her best,' she said in honeyed tones as she sashayed across the room in front of me.  'It's not every day one is suspected of murdering a lord.'\nI could tell by the smile playing at her lips that she was toying with me so I chose not to respond.\n\n'Miss West, I understand that you were a friend of Lord Stagwood's.  Is that correct?'\nI glanced at the constable and nodded my head at the notebook and pencil in his hands.  He took the hint and scrawled something onto the paper.\n\n'You could put it like that, darling,' Miss West replied lightly before feigning dismay at her casual familiarity.  'Oh forgive me, Inspector.  Perhaps I shouldn't be so informal with one of Her Majesty's agents.  It is my way, you see, to be friendly with dashing gentlemen such as yourself.  I do hope you will forgive me for my little slip.'\n'Of course,' I replied more tightly than I had intended to.  'However let's turn our attention to the matter of Lord Stagwood's murder.  I should like to ask you a few questions if I may.'\n'Naturally,' Miss West replied, taking a seat at the gilt writing desk that sat opposite the bed.  I watched as she placed her hands elegantly across her lap before gazing up at me through innocent eyes.  'I am at your mercy, Inspector.  Ask me your questions.'\n\nI cleared my throat.\n'Was this room offered to you by Lord Stagwood as part of his invitation to lunch?' I asked her, noticing the small bandage wrapped around the index finger of her left hand.\n'This was my usual room,' Miss West replied casually, glancing over her shoulder towards the bed with its sumptuous gold coverlet and matching valance.  'Stanley didn't like me to go through the trouble of driving all the way back to the city after lunch without having the benefit of a full night's sleep.  You know how the wine tends to flow at these lunches, Inspector.'\n\nI pursed my lips before continuing.\n'Were you a frequent guest of Lord Stagwood?' I enquired, taking in the heavy gold curtains on the north-facing window and the dazzling crystal chandelier in the center of the ceiling.\n'Stanley and I were well acquainted,' Miss West replied, toying with the feathered point of an old-fashioned writer's quill on the desk beside her.  'And this Stagwood Manor's finest room, aside from the master suite of course,' the continued.\n\n'Of course,' I echoed rather embarrassingly.  'I see that you have injured your hand, Miss West,' I added with greater authority.\n'Oh yes,' she replied with what sounded like surprise, lifting her injured hand up for inspection.  'It's silly really.  I can't recall how it happened.  A disagreement with the curling tongs I should imagine.  You know us ladies; we'll do anything in the name of vanity.'\n\n'May I ask why you believe Lord Stagwood invited you to lunch today?' I enquired of her.  'I understand from the constable that you are rather a rag-tag group - not the sort of people who would normally engage on a social level.'\n'Well, I don't know what you mean,' Miss West replied with what I took to be genuine offense.  Mildred Hobbs is a beloved friend of Stanley's - of the entire Stagwood family as it happens.  And as for Henry Bray, he's an idle bounder, but he's a good sort really.  Wouldn't harm a fly, even if it beat him at cards.  As to Victor Cole, well I suppose I can't say why Stanley might have invited him to lunch, except to suggest that he may have felt some sort of professional obligation towards the man.  You know these sorts, always working even when they have a glass of scotch in one hand and a pipe in the other.  If you ask me, Victor was envious of Stanley and all the he had achieved.  Victor Cole is a living parody of the poor man reaching for success yet falling disastrously short.'\n\n'Miss West,' I continued, catching Lewis's eye and nodding my head in the direction of the woman's dressing room, 'how long had you known Lord Stagwood?  Intimately, I mean.'\n'Well, Inspector,' Miss West replied with mock affront, 'I'm afraid the intimation of your question has rather caught me off-guard.'\n'That is my job, Miss West,' I informed her.  'Catching people at a lie is my stock in trade.'\n'Oh, but I wouldn't dare lie to an Inspector of the Metropolitan Police,' she replied, a small smile playing at her crimson painted lips.\n\n'Then if you would be so kind as to answer my question...' I prompted her.\n'Stanley's wife was on the scene, if that's what you would like to know,' she replied curtly, rising from her chair and making her way towards the window.\n'I see,' I replied as the constable returned from his examination of the dressing room.\n\n'One last question, Miss West,' I said.  'Where were you at eleven AM this morning?'\n'In bed, I should think,' she replied smartly.  'At my home in Belgrave Square.  I have a maid; she will vouch for me.'\n\n'Thank you, Miss West,' I replied, bowing my head civilly before catching the Constable's eye and motioning for him to quit the room.\n\n'Anything of interest in the dressing room?' I enquired of the constable once we had returned to the passageway.\n'There was a set of curling tongs, like Miss West said,' the constable replied.\n'I fail to see how a set of curling tongs could have drawn blood,' I suggested, 'unless of course she meant to stab herself with great force.'\n'Interesting you say so, Sir,' the constable continued, 'because I found a linen napkin in the wastepaper basket in the lady's dressing room and it was soaked in blood.'\n'Now that is interesting,' I mused, pursing my lips in thought.\n\n'Miss West did mention how she liked to look her best, Sir,' the constable reminded me.\n'Vanity was the exact word that was used,' I informed him.  'She claimed that ladies would do anything in the name of vanity.'\n'Yes, Sir,' the constable replied, noting it down into the book.  'Miss West certainly fancies herself as a looker, Sir,' the constable added.\n'Perhaps,' I agreed, though there are other reasons for which vanity might be used as a weapon.  There is the vanity of one's pride, for instance.  Or of losing face amongst one's acquaintances.  Miss West is a wealthy society lady,' I reminded him.  'She has a great deal to lose should anything of a less than savoury nature be made public.'\n'You mean airing her dirty laundry, Sir?' the constable replied.\n'Yes, Lewis,' I replied solemnly.  'The preservation of Miss West's reputation could very well be motive enough to commit murder.'\n \n'And the clattering sound we heard earlier?' I enquired.  'Any luck locating the item in question?'\n'Well, Sir,' the constable answered, 'I believe it might have been this.'\nI watched as he removed a brass letter opener from the pocket of his trousers; its handle fashioned in the shape of a female nude.\n'Interesting,' I replied, taking the letter opener from his hand.  'What was Miss West doing with a letter opener in her dressing room?'\n'Do you think it's the one that was missing from downstairs, Sir?' the constable asked breathlessly.\n'I wonder,' I mused.\n\n[[Question Mildred Hobbs]]\n[[Question Henry Bray]] \n[[Question Victor Cole]] \n[[Investigate the weapons]]",
      "links": [
        {
          "text": "Question Mildred Hobbs",
          "destination": {
            "name": "Question Mildred Hobbs",
            "pid": 2
          }
        },
        {
          "text": "Question Henry Bray",
          "destination": {
            "name": "Question Henry Bray",
            "pid": 4
          }
        },
        {
          "text": "Question Victor Cole",
          "destination": {
            "name": "Question Victor Cole",
            "pid": 5
          }
        },
        {
          "text": "Investigate the weapons",
          "destination": {
            "name": "Investigate the weapons",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "Question Henry Bray",
      "text": "'Hard to believe the old fellow's gone,' Henry Bray said, almost jovially, after the constable and I had located him in the downstairs kitchen.  'And stabbed through the heart no less,' he added with a shake of his head that communicated a feeling more along the lines of amusement than regret.\n\nHenry Bray was a man of twenty-seven:  the only child of Stanley Stagwood's long deceased younger brother.  He seemed a colourful character - not in the sense of his dress - but in the way he spoke, the way he moved, and the way he seemed to find amusement in almost everything around him.\n\nThe constable and I had come across Lord Bray (as he was now to be known) deep in the bowels of Stagwood Manor, stuffing his face with cream cake and being watched by the rightfully judgmental cook.\n\n'Oh, Inspector!' he had exclaimed through flakes of pastry and puffs of powdered sugar.  'I wondered when you might track me down.  I couldn't resist a little visit to the kitchen while I waited on my interview.  No sense in pretending to mope about in my quarters after all.'\n\n'Pretending to mope?' I queried, surprised, after all I had seen and dealt with during my policing career, by the man's candor.\n'Well, there's no sense in getting down about it, is there?' He suggested wiping his mouth on a red silk handkerchief promptly produced from his breast pocket.  'It won't do a thing to bring the poor fellow back, will it?'\n\nHenry Bray seemed to have a fondness for phrasing all of his statements as questions.  I wondered if this was because he was unsure of himself, or simply if he was employing the method as a demonstration of his affability.  Either way it was a little disconcerting, though not entirely without effect.\n\n'Lord Bray,' I said, gesturing for the constable to take a seat beside the unlit fireplace.\n'Will you be needing anything else, Sir?' the cook interrupted in a tone of voice that suggested she would rather he said 'no'.\n'No thank you, Cook,' the young Lord replied, 'your cream cakes were quite something and I am certain that I will enjoy them for many years to come.'\n'Humph,' the cook murmured as she made herself scarce from the room.\n\n'I take you plan to take up residence at Stagwood Manor then,' I suggested to the young Lord.\n'Indeed I do,' Lord Bray replied gleefully, his green eyes shining with what could only be described as extreme delight.  The fact that he was also rubbing the palms of his hands together only added to the impression.\n\nAs he spoke, I felt the brush of something low and warm nudge against my trouser leg.  Glancing down I found it to be the same tricolour English Foxhound who had greeted me when I had first arrived at Stagwood Manor.\n\n'This is Bunty,' Lord Bray explained, scratching the hound behind the ears with good-natured affection.  'She is an excellent hunter,' he added, before suddenly frowning - a look that was not well suited to his fair and friendly complexion.  'Now what have we here?' he said quizzically, prying something from the hound's jaws as he did so.  'What do you make of this, Inspector?' he asked me, holding out what appeared to be some sort of tool.\n\nI accepted the object from him, all heavy cast-iron and coarse rope.  I noticed at once that the iron had dark smears of colour down its length.\n'I believe that's what's known as a garden line, Sir,' the constable offered.  'My mum has one.  For marking out her carrots and whatnot.'\n'I should say you're quite right, Dear Fellow,' Lord Bray interjected.  'Not that I am the sort to garden myself.  Too much messing about in dirt for not a lot of joy, wouldn't you say, Inspector?'\n\n'May I ask where you currently reside, Lord Bray?' I enquired, handing the weighty object to the constable for closer inspection.\n'I keep a place Mayfair,' Lord Bray replied flippantly as he continued to lavish affection upon the hound.  'Though I grew up here of course,' he added suddenly, 'if that's what you're asking.'\n\n'I understand you were under Lord Stagwood's charge until you came of age,' I ventured.\n'That's right,' he replied, with more serious a tone.  'My uncle was a sort of...well, \"uncle\" I suppose you could say.  That pretty much sums it up.  After my father died he took me under his wing, and under his roof, and made it his business to see that I grew up to become a pillar of the community, serving my country and all that.  Not that it ever came to that,' he added somewhat regretfully before brightening the mood with yet another beaming smile.  'I'm far too fond of the easy life, Inspector,' he said, his eyes twinkling with delight.\n\n'Was it common for your uncle to invite you to join him for lunch?' I enquired.\n'Not precisely,' Lord Henry replied.  'My dear uncle liked to keep tabs on me in the city.  He liked to make sure I wasn't getting up to too much mischief, bespoiling the family name and all that.'\n\nI glanced at the constable who was still toying with the garden line.\n'I'm afraid I don't quite follow you,' I continued, returning my attention to the young lord.\n'I mean to say,' Lord Bray continued helpfully, 'that we often met for lunch, but not at Stagwood Manor.  We would meet at my uncle's club in the city.'\n'A club whose membership you yourself will no doubt inherit,' I suggest.\n'Spot on!' the young lord replied cheerfully.  'And I intend to thoroughly enjoy it too.'\n\n'The soot on your leg...' I added, nodding my head in the direction of his trouser leg.\n'Oh that,' the young lord replied amiably.  'Yes, I suppose I might have become a little too well acquainted with the fireplace when I arrived,' he added a little bashfully.\n'Acquainted?' I ventured.\n'That thing is, Inspector, I all but fell into the jolly thing,' he replied with a blush of pink colouring his cheeks.  'Sadly I am not one of God's more graceful creatures.'\n'I see,' I replied, glancing suggestively in the direction of the constable.  'You do, however,' I continued, 'if you will permit me to say so, seem to be rather switched on, as it were.'\n\nLord Bray clearly received the comment as the compliment it was intended to be.\n'I should like to think I have a good handle on the world around me,' he replied graciously.\n'Then might I ask who you believe killed your uncle?' I asked him.\n\nI sensed from our conversation that the abruptness of my question would neither surprise nor offend him, and I was right.  He crinkled his brow in what appeared to be great thought before looking me directly in the eye.\n'They say hell hath no fury like a woman scorned,' he replied thoughtfully.  'It is not my place to point fingers at anyone,' he added prudently, 'but I should think Evelyn West had the most to gain from my uncle's death.'\n'I see,' I replied with a nod of my head, before glancing at the constable.\n'I have found, though not through personal experience thankfully, that a woman's pride is of great importance to her.  Much more than a fellow's, if you understand my meaning.  A fellow such as myself can bounce back from a little defamation, but a woman - once her reputation has been muddied - it is much harder for her to reclaim her place in society.  You understand what I am saying, I'm sure,' he added, glancing at me with what I took to be a measure of embarrassment.\n'I believe I understand quite well enough,' I assured him.\n\nI thanked the young lord for his time before ushering the constable back upstairs.\n'Lord Bray may not be fond of gardening,' I mused to the constable, 'though some might say he is rather too fond of smelling the roses.'\n'Yes, Sir,' the constable replied knowingly.\n'And the soot on his trousers...' I reminded him.\n'An unlikely story, Sir, if ever I heard one,' the constable replied.\n'I thought so too, Lewis,' I agreed.\n\n[[Question Mildred Hobbs]]\n[[Question Evelyn West]]\n[[Question Victor Cole]] \n[[Investigate the weapons]]",
      "links": [
        {
          "text": "Question Mildred Hobbs",
          "destination": {
            "name": "Question Mildred Hobbs",
            "pid": 2
          }
        },
        {
          "text": "Question Evelyn West",
          "destination": {
            "name": "Question Evelyn West",
            "pid": 3
          }
        },
        {
          "text": "Question Victor Cole",
          "destination": {
            "name": "Question Victor Cole",
            "pid": 5
          }
        },
        {
          "text": "Investigate the weapons",
          "destination": {
            "name": "Investigate the weapons",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "Question Victor Cole",
      "text": "Lord Stagwood's study was a glorious mix of dishevelment and masculinity.  Right away I could tell that the Lord of the manor had been a formidable figure in the world of business.  The very fact that is desk was piled high with papers and a congeries of other expensive items was evidence enough.\n\nStanding before the desk, with his broad back to us, was Victor Cole:  Lord Stagwood's partner in business.  He appeared unaware that the constable and I had entered the room behind him, so I chose to observe him in silence while he went about his work.\n\nHe was making himself at home with the pile of documents laid out on Lord Stagwood's broad oak desk.  He also appeared to be muttering to himself, though I was unable to discern what was being said, aside from the fact that it was of the unfavourable nature.\n\n'Damn it all to hell!' he said at last, slamming his fist down hard onto the top of the desk, rattling the two glass jars displayed on a low brass plate.\n\n'Mr. Cole?' I said, announcing our presence in the room and startling the man into a fit of coughing.\nI glanced reflexively at the side table, which boasted an immodest collection of whiskey decanters and crystal glasses.  Victor Cole strode purposefully towards the table, pouring himself a large measure of liquor before swallowing it down in one greedy slug.\n\n'Inspector...?'\n'Percival Pike,' I replied helpfully, nodding my head at him deferentially despite the fact that I had caught him at is worst.\n'Inspector Pike,' Victor replied deliberately, as if trying the words out for size and finding them unfit.\n\n'Are we interrupting you, Sir?' I asked, not because I was willing to defer our interview, but because I wanted to gauge his reaction.\n'For a man such as myself life is often found to be one interruption after another,' he replied with what appeared to be forced good-naturedness.\n\nVictor Cole was neither pleased to be interviewed nor detained.  He was a busy man and he wished me to know it.  The fact that his business partner and, presumably friend, had just been murdered seemed to merely be an inconvenience to him.\n\nI noticed at once the slurred tones of Victor Cole's voice.  That recent slug of whiskey had not been his first that day.  In fact, as I scanned the room I noticed a second glass lying discarded on a second table beside a worn leather armchair.  I also noticed a rifle propped casually against the built-in bookcase that took up the entire north wall.  I glanced again at the side table.\n\n'Can I offer you one?' Victor Cole said, striding determinedly back towards the gathering of whiskey bottles.\n'Thank you, no,' I replied firmly as I watched him pour a second measure of the dark elixir into the crystal glass before downing it in one.  'I understand that you were Lord Stagwood's business partner,' I continued, eager to draw the man's attention away from the liquor.\n\n'Had been since the war,' Victor Cole replied indifferently.  'We imported antiquities, among other things.  These young things can't get enough of their bronze statues and Greek vases.  Quite what they do with them, I couldn't say.'\n\nIt was almost as if Victor Cole had contempt for the very work that had clearly made him a very wealthy man.  This seemed strange to me.\n'That was Stanley's side of it at least,' he continued dismissively.  'I was more interested in real works of art, not old relics he'd paid an archeologist to dig up.'\n\nVictor Cole huffed in frustration, before taking a seat the worn leather armchair.  I noticed that his fingers were thick and rough, though his nails well kept.  He was a curious mix of gentleman and brute.\n\n'Now what is it you would like to know, Inspector?' he pressed, clearly annoyed by our interruption.  'If you want to know who I think killed the miserable bastard it was that Hobbs woman.'\n'How so?' I enquired, curiously.\n'Well she clearly had it out for Stanley,' Victor Cole continued, standing from his chair and pacing the room in long heavy strides.  'If I had to hear her talk about that bloody tree one last time I'd have stabbed myself through the heart.'\n\n'Perhaps you might have preferred that Mrs. Hobbs had been murdered,' I suggested, if only to rile the man up further.\n'I wouldn't have minded, no,' he said, agreeing with me.  'The world is better off without the likes of her and her husband.'\n'Late husband,' I suggested.\n'Is it?' Victor Cole replied distractedly, pouring himself a third measure of whiskey.\n\n'Might I suggest that Mrs. Hobbs held a grudge at being let go from her position at Stagwood Manor?' I ventured.\nAt this Victor Cole glanced up at me with something resembling surprise.  Setting down his still full glass of whiskey, he stuffed his large hands into the pockets of his well-pressed trousers.\n'What are you getting at, Inspector?' Victor Cole asked me, his eyes narrowing in suspicion.\n'That perhaps Mrs. Hobbs had reason to harbour resentment towards Lord Stagwood,' I replied evenly.\n\nVictor Cole gave an amused grunt and shook his head.\n'That is why you are the Inspector and I am the businessman,' he replied benevolently.\n\n'Mr. Cole,' I continued, 'might I ask what you have on the cuff of your jacket?'\nVictor Cole glanced down at his cuff, brushing away the white powder that had affixed itself to the fabric.\n'It's from that blasted bookshelf,' he grumbled, striding determinedly towards it and plucking his discarded glass from the shelf.  'Hasn't been dusted in weeks.'\n'I see,' I replied evenly.  'So you haven't been playing billiards?' I asked him.\n'Billiards?' he replied, his face reddening with something other than anger.  'Why on earth would you think that?'\n\n[[Question Mildred Hobbs]]\n[[Question Evelyn West]]\n[[Question Henry Bray]] \n[[Investigate the weapons]]",
      "links": [
        {
          "text": "Question Mildred Hobbs",
          "destination": {
            "name": "Question Mildred Hobbs",
            "pid": 2
          }
        },
        {
          "text": "Question Evelyn West",
          "destination": {
            "name": "Question Evelyn West",
            "pid": 3
          }
        },
        {
          "text": "Question Henry Bray",
          "destination": {
            "name": "Question Henry Bray",
            "pid": 4
          }
        },
        {
          "text": "Investigate the weapons",
          "destination": {
            "name": "Investigate the weapons",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "Examine the body",
      "text": "Stepping past the hound, I took a hard left, through a pair of wide open doors, into an expansive, wood-paneled dining room.\n\n'Constable!' I called in the direction of the front entrance, before stepping back into the room.\n'Yes, Sir,' came the prompt reply as the young officer dashed to my side, alarming the hound enough to elicit a warning yap.\n\n'Describe for me the situation as you found it,' I directed him as I cast my eyes around the dark room with its heavy brocade curtains the colour of cream and moss, and its single brass chandelier hanging above the center of the long oak table.\n\n'It's as you see it, Sir,' the constable replied, taking a moment to scribble in the notebook what I could only imagine was his interpretation of a dining table.\n\n'Here lies the scene of the crime,' I mused as I picked up one of the soupspoons laid out neatly beside several forks and a white linen napkin.\n'I believe so, Sir,' the constable replied, adding a misshapen stick figure to his illustration:  an unfortunate depiction of the late Lord Stagwood no doubt.\n\n'And the victim was found in this precise position?' I enquired of the constable, tipping my head inquisitively in the direction of the deceased.\n'Yes, Sir,' the constable replied proudly.  'According to the housekeeper, Lord Stagwood was found just as you see him now.'\n'Sitting bolt upright in his chair at the head of the dining table?'  I queried, suspiciously.\n'Yes, Sir,' the constable replied matter-of-factly.\n'Well then,' I mused, casually tapping the shoulder of the deceased's brown tweed jacket with the bowl of the soupspoon.\nAs I did, I saw a peppering of soil fall from the man's cuff.\n'Perhaps we should have Lord Stagwood removed from the scene now,' I instructed the constable.  'No need for the unfortunate fellow to remain in his chair.  I'm afraid his last dinner has been served.'\n\nI glanced around the room, noting several modest paintings of the pastoral nature, as well as a stone-cold fireplace without a stick of coal or wood within it.\n'Am I to assume that the luncheon was to take place in this room?' I asked the constable.\n'I understand so, Sir,' the constable replied, adding thirteen wooden dining chairs to his drawing.\n'And why has the fire not been lit?' I asked him.\n'I couldn't say, Sir,' the constable replied, glancing at the offending hearth.  'Should I ask the housekeeper, Mrs. Hapgood?'\n'No need for all that,' I told him with a wave of my hand.  'I can't see any need for me to question the household staff at this stage.  If they had wanted to do away with their master I am certain they would have sprinkled arsenic into the man's soup, rather than a stabbing him through the heart moments before a formal luncheon.' \n'Very good, Sir,' the constable agreed, printing the word 'Arsenic' into my notebook.\n\n'Tell me, Lewis,' I said, 'how is it that the table has been set, yet not one of Lord Stagwood's staff noticed him dead at the head of the table?'\n'Well, Sir,' the constable began, nervously, 'as I understand it Lord Stagwood was known to be a bit of a...'  He trailed off.\n'Yes?' I prompted him.\n'Well, Sir,' he began again, this time a small smile playing at his lips 'Lord Stagwood was known around the house as...'\n'He was a tyrant,' I said, saving the constable from himself and saving me from the need to reprimand him.\n'Yes, Sir,' he replied more than a little disappointed at not having the opportunity to slander a nobleman.\n\n'So his staff gave the man a wide berth, did they?' I mused.  'And none of them happened to notice the stab wound in the man's chest?  Not while they were laying the table nor arranging the flowers?  Nor did they find it unusual for their master to be seated at the table while they worked around him, neither saying a word nor moving a muscle?  Is that what I am to believe, Lewis?'\n'Yes, Sir,' the constable replied as he added a full stop to his furious scribbling.\n\n'You may be surprised to know, Lewis, that the crime did not in fact take place in this room.'\n'Sir?' the constable replied in puzzlement.\n'That was merely a ruse to throw us off the scent,' I continued.  'What our murderer failed to take into account, though, was my appointment to Inspector this very morning.'\n'Yes, Sir,' the constable agreed with what appeared to be a swelling of pride on my behalf.\n'Our killer made a grave mistake in choosing to carry out his attack on this particular day,' I concluded, laying the soupspoon back down onto the table.\n\n'Let us visit the other rooms,' I instructed the constable.  'If we are to uncover the reason for Lord Stagwood's death then we must first try to ascertain where the murder took place.'\n\n[[Search the parlour]] \n[[Search the potting shed]] \n[[Search the billiard room]] \n[[Search the drawing room]]",
      "links": [
        {
          "text": "Search the parlour",
          "destination": {
            "name": "Search the parlour",
            "pid": 12
          }
        },
        {
          "text": "Search the potting shed",
          "destination": {
            "name": "Search the potting shed",
            "pid": 13
          }
        },
        {
          "text": "Search the billiard room",
          "destination": {
            "name": "Search the billiard room",
            "pid": 14
          }
        },
        {
          "text": "Search the drawing room",
          "destination": {
            "name": "Search the drawing room",
            "pid": 15
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "Examine gun cabinet",
      "text": "'Could you tell me where Lord Stagwood kept his guns,' I enquired of a passing housemaid.\n'In the gun safe, Sir,' the maid replied nervously.  'Down the stairs.  Near the backdoor.'\n\nThe constable and I located the gun safe without too much trouble.  It was a modest cabinet and it was without a lock.\n'Not much of a safe is it, Constable?' I mused.\n'No, Sir,' my acolyte agreed.  'Not safe at all I shouldn't think.'\n\nOpening the cabinet door I found myself faced with four indentations, three of which held shotguns.  The fourth held something far more curious.\n\n'That's a pool cue isn't it, Sir?' the constable said, scratching his head with the butt of the pencil.\n'Correction, Lewis,' I replied.  'That is a broken pool cue.'\n'But what's it doing down here, Sir?' the constable asked.\n'I believe somebody wished to hide it,' I explained to him, taking hold of the broken cue and admiring its sleeve inlayed with mother of pearl.\n\n'No blood, Sir,' the constable commented with a sorry shake of his head.  'I thought we might have had it with this one.'\n'No blood,' I agreed, 'just a great deal of guilt.'\n'You know who did this, don't you, Sir,' the constable suggested keenly.\n'I do indeed, Lewis,' I replied.  'And I know precisely why it was left here too.'\n\n[[Examine fire poker]]\n[[Examine letter opener]]\n[[Examine garden line]]\n[[Make an arrest]] ",
      "links": [
        {
          "text": "Examine fire poker",
          "destination": {
            "name": "Examine fire poker",
            "pid": 8
          }
        },
        {
          "text": "Examine letter opener",
          "destination": {
            "name": "Examine letter opener",
            "pid": 9
          }
        },
        {
          "text": "Examine garden line",
          "destination": {
            "name": "Examine garden line",
            "pid": 10
          }
        },
        {
          "text": "Make an arrest",
          "destination": {
            "name": "Make an arrest",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "Examine fire poker",
      "text": "The fire poker had indeed been found stuffed down the back of Cook's range.\n\nI had dismissed the red-faced woman from the kitchen so that Lewis and I could examine the scene without interference.  Not and easy thing to do when I had been informed (in no uncertain terms) that the servant's dinner would spoil if it went unattended.  I had suggested that a plate of cold tongue and pickles might suffice, just this once, however my suggestion had been met with a scowl so deep I have yet to recall a harsher one.\n\nStill, with the cook successfully banished from her domain, the constable set about extracting the fire poker from its hiding place.\n'Very strange, Sir,' the constable commented as he held up the item in question.\n'Very strange indeed, Lewis,' I agreed.  'Why do you suppose someone would stuff a fire poker down the back of a range?'\n\nMy question went unanswered, as clearly the constable had been unable to draw any conclusions from the situation.  I did notice, however, that the fire poker was quite heavily coated in layers of soot and charring.  Not at all unexpected for a fire poker, I mused.\n\n'No blood, Sir,' the constable remarked as he turned the object over in his hands.\n'You are quite right, Lewis,' I agreed.\n\n'Oh!' I heard a voice say from the doorway.  'You found that then,' the voice continued.  'I suppose that means I must confess.  It's all rather embarrassing actually.'\n\nThe constable and I both turned our attention towards the doorway only to see young Henry Bray standing at its threshold.\n\n[[Examine gun cabinet]]\n[[Examine letter opener]]\n[[Examine garden line]]\n[[Make an arrest]] ",
      "links": [
        {
          "text": "Examine gun cabinet",
          "destination": {
            "name": "Examine gun cabinet",
            "pid": 7
          }
        },
        {
          "text": "Examine letter opener",
          "destination": {
            "name": "Examine letter opener",
            "pid": 9
          }
        },
        {
          "text": "Examine garden line",
          "destination": {
            "name": "Examine garden line",
            "pid": 10
          }
        },
        {
          "text": "Make an arrest",
          "destination": {
            "name": "Make an arrest",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "Examine letter opener",
      "text": "'Why do you suppose Evelyn West removed Lord Stagwood's letter opener from the drawing room?' I asked the constable.  'It seems unnecessary given that she had already made herself at home in the room, writing letters and whatever else.'\n\n'Maybe she had some more letters to write and she decided to do it up in her room,' the constable suggested.  'Maybe she wanted her privacy.'\n\n'Her privacy indeed,' I mused.  'But what could be so private that she felt compelled to relocate her pursuit from the writing desk to her bathroom?'\n'Maybe it was a love letter, Sir,' the constable suggested, glancing up at the ceiling with embarrassment as he said it.\n'Indeed,' I agreed with him, 'but a love letter from whom?'\n\n'Was the letter opener wet when you found it?' I asked the constable.\n'Wet, Sir?' he asked in confusion.  'Why should it be wet?'\n'Because it may have recently been washed,' I informed him.\n'Why would someone wash a letter opener?' the constable balked at me.\n'Because it had recently been used to stab someone through the heart,' I told him.\n'Then no, Sir,' the constable replied plainly.  'The letter opener I found in Evelyn West's bathroom was as dry as a bone.'\n\n[[Examine gun cabinet]]\n[[Examine fire poker]]\n[[Examine garden line]]\n[[Make an arrest]] ",
      "links": [
        {
          "text": "Examine gun cabinet",
          "destination": {
            "name": "Examine gun cabinet",
            "pid": 7
          }
        },
        {
          "text": "Examine fire poker",
          "destination": {
            "name": "Examine fire poker",
            "pid": 8
          }
        },
        {
          "text": "Examine garden line",
          "destination": {
            "name": "Examine garden line",
            "pid": 10
          }
        },
        {
          "text": "Make an arrest",
          "destination": {
            "name": "Make an arrest",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "Examine garden line",
      "text": "'Tell me about this garden line,' I prompted the constable.  'You say your mother uses one in her garden?'\n'Yes, Sir,' the constable replied eagerly.  'To keep her carrots in line.'\n'And how precisely does one use a garden line?' I enquired as I turned the heavy object over in my hand.\n'Well, Sir,' the constable continued, 'it's as simple as anything.  You just push one end into the soil, unspool the rope to however long you want it, and then stab the other end into the soil as well.'\n\n'Stab,' I mused.  'An excellent choice of word, Lewis.'\n\n[[Examine gun cabinet]]\n[[Examine fire poker]]\n[[Examine letter opener]]\n[[Make an arrest]] ",
      "links": [
        {
          "text": "Examine gun cabinet",
          "destination": {
            "name": "Examine gun cabinet",
            "pid": 7
          }
        },
        {
          "text": "Examine fire poker",
          "destination": {
            "name": "Examine fire poker",
            "pid": 8
          }
        },
        {
          "text": "Examine letter opener",
          "destination": {
            "name": "Examine letter opener",
            "pid": 9
          }
        },
        {
          "text": "Make an arrest",
          "destination": {
            "name": "Make an arrest",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "Interview the guests",
      "text": "'I believe I have seen enough of Stagwood Manor now,' I informed the constable.  'The location of Lord Stagwood's murder seems clear to me.  However now we must focus our attention on the interviewing of Lord Stagwood's guests.'\n\n'The suspects, Sir?' the constable offered with a gleeful grin.\n'To put it crudely,' I agreed.  'Though it would be advisable if we kept such judgments close to our chest for the time being.'\n\n'Yes, Sir,' the constable replied apologetically.\n\n[[Question Mildred Hobbs]]\n[[Question Evelyn West]]\n[[Question Henry Bray]] \n[[Question Victor Cole]]\n",
      "links": [
        {
          "text": "Question Mildred Hobbs",
          "destination": {
            "name": "Question Mildred Hobbs",
            "pid": 2
          }
        },
        {
          "text": "Question Evelyn West",
          "destination": {
            "name": "Question Evelyn West",
            "pid": 3
          }
        },
        {
          "text": "Question Henry Bray",
          "destination": {
            "name": "Question Henry Bray",
            "pid": 4
          }
        },
        {
          "text": "Question Victor Cole",
          "destination": {
            "name": "Question Victor Cole",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "Search the parlour",
      "text": "'I should like to visit the parlour,' I told the constable, nodding my head towards the door.\n\nThe constable took my cue and scurried off in the direction of the room in question, being careful to clutch tightly onto the notebook and pencil as he did so.\n\nThe parlour, as expected, was decorated in a similar style to that of the dining room:  dark wood paneling, with the same cream and moss coloured curtains.  The temperature of the room, however, was several degrees warmer, owing to a roaring wood fire dancing in the grate.\n\n'Someone has been in here,' I mentioned to the constable, who proceeded to write my remark into the notebook.  'The maids have lit the fire, and there is an impression left in one of the sofa cushions.'\nI gestured towards the mustard yellow velvet with a nod of my head, and the constable hurried towards the seat in order to give it his full attention.\n\nWhile he examined the seat, I ventured towards a small oak side table that was home to a collection of framed photographs.  I picked up the photograph closest to me and saw that it was a portrait of Lord Stagwood dressed in full military regalia.  Clearly the man had served his country in the war, though his role had no doubt been conducted from behind the safety of a desk.\n\nI was about to step away from the table when a second photograph caught my eye.  It was another portrait of the Lord, though this time a rather attractive young woman, dressed in the modern style, accompanied him.\n\n'Constable,' I said, holding the photograph out for him to examine.\n'Yes, Sir,' the constable replied knowingly, once again blushing a deep shade of pink.  'Miss Evelyn West.'\n'Indeed,' I replied, returning the photograph to the table before crossing the room.\n\nStanding before the grand Georgian window, I gazed out across the expansive back lawn that seemed to run a good mile into the distance.  A row of tall, thin hedges flanked a central path.  A second concrete fountain lay at the heart of the bricked patio right outside the window.  To my right lay a set of French doors, leading out onto the same wrap-around patio.\n\n'Constable,' I said, catching the young officer still gazing at the picture of Evelyn West.\n'Yes, Sir,' he replied, hurrying over to me.\n'Check the locks on each of the parlour's windows and doors,' I instructed him.  'We must be certain that the murderer did not gain access to the manor from the outside.'\n'You think the murderer might be an outsider, Sir?' the constable asked.\n'Highly unlikely, Lewis,' I replied.  'However we must make note of any such discrepancies.'\n\nWhile the constable went about his business of testing all the latches, I ventured towards the fireplace to examine the painting above it.  As I did so, I noticed the wrought iron fire set near my right boot.  By the soot marks on the rug, I could tell that it had recently been moved from its usual spot beside the fire.  And that, whoever had moved it, had not had the opportunity to clean up the telltale traces of soot it had left behind.\n\n'Constable,' I said again.  'I believe I may have found a clue.'\n'Sir?' the constable said, hurrying to my side.\n'See this fire set?' I asked him, gesturing at the object with a nod of my head.  'It has recently been employed in something other than the stoking of coals.'\n'How's that, Sir?' the constable asked me, his mouth agape in what appeared to be an expression of awe.\n'By my estimation there appears to be something missing from this fire set,' I told him, encouraging him to make a closer inspection of the object.\n'The fire poker, Sir,' he declared proudly, glancing back up at me with a broad grin on his face.\n'Quite right, Lewis,' I agreed.  'Best to write that into your notebook.'\n\n[[Search the potting shed]]\n[[Search the billiard room]]\n[[Search the drawing room]]\n[[Interview the guests]]",
      "links": [
        {
          "text": "Search the potting shed",
          "destination": {
            "name": "Search the potting shed",
            "pid": 13
          }
        },
        {
          "text": "Search the billiard room",
          "destination": {
            "name": "Search the billiard room",
            "pid": 14
          }
        },
        {
          "text": "Search the drawing room",
          "destination": {
            "name": "Search the drawing room",
            "pid": 15
          }
        },
        {
          "text": "Interview the guests",
          "destination": {
            "name": "Interview the guests",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "Search the potting shed",
      "text": "'Was Lord Stagwood known to be a keen gardener, Lewis?' I asked the constable as I recalled the dusting of soil that fell from the deceased jacket.\n'No, Sir,' the constable replied.  'Should I write that down in the notebook?'\n'No need, Lewis,' I told him.  'Just lead the way to the potting shed.  I should like to examine it for evidence of Lord Stagwood's presence there.'\n\nExiting the main house by way of an unremarkable backdoor at the rear of the hallway, the constable and I made our way towards the potting shed that was situated at the northwest corner of the house.  As we approached, I noticed several sets of muddy gumboot prints leading both to and from the potting shed's faded green door.  A collection of bacciferous shrubs had also been planted along the shed's front wall.\n\n'What do you make of these prints?' I asked the constable.\nHe appeared to chew on my question, while also chewing on my pencil, before answering, 'I'm not sure, Sir.  Could be anyone's I suppose.'\n'Not so,' I answered him.  'These prints are fresh.  They were made today.  And the wheel marks?'\n'Maybe one of the gardeners, Sir?' the constable suggested.\n'Perhaps,' I replied thoughtfully as I stepped around the boot prints to open the door to the shed.\nThe handle turned easily and the door swung open, without a sound, to reveal a modest whitewashed shed in surprisingly tidy order.\n\n'Someone took great care to ensure this potting shed was kept shipshape, wouldn't you say, Constable?'\n'Yes, Sir,' Lewis replied, noting it down in his book.  'I've never seen anything like it, Sir.'\n'Quite so, Lewis,' I agreed as I cast my eye across the worn green potting table with its neat rows of trays, hand forks, and trowels - all curiously soil-free.\n\n'How are you at sketching wheelbarrows?' I asked the constable, as I examined the wooden handcart leaned up against the north wall of the shed, its steel wheel grimy with dirt.  I also noticed a rail of steel hooks running the length of the west wall.  From each of its twelve hooks dangled a gardening apparatus, all besides the last peg.\n\n'What do you suppose is missing from this rail, Constable?' I enquired as he finished up a rather crude sketch of the barrow.\n'I couldn't say, Sir,' the constable replied.  'We don't have gardens in Whitechapel.'\n'Indeed,' I mused.  'Still, I should like to establish its whereabouts; whatever it may be.'\n\n[[Search the parlour]]\n[[Search the billiard room]]\n[[Search the drawing room]]\n[[Interview the guests]]",
      "links": [
        {
          "text": "Search the parlour",
          "destination": {
            "name": "Search the parlour",
            "pid": 12
          }
        },
        {
          "text": "Search the billiard room",
          "destination": {
            "name": "Search the billiard room",
            "pid": 14
          }
        },
        {
          "text": "Search the drawing room",
          "destination": {
            "name": "Search the drawing room",
            "pid": 15
          }
        },
        {
          "text": "Interview the guests",
          "destination": {
            "name": "Interview the guests",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "Search the billiard room",
      "text": "'Before we embark on anything else, I would like to examine the billiard room,' I informed Lewis, who held his notebook and pencil at attention before me.  'Am I right in assuming that Stagwood Manor boasts such a space?'\n'Yes, Sir,' the constable answered, using the pencil to direct my attention towards the exit.\n\nI stepped back into the hallway, trailed closely behind by Lewis, and made my way through the set of double doors leading into the billiard room.\n\nThe room was cool, owing to the fact that it was positioned on the northwest corner of the house.  The afternoon light filtered weakly through the pair of double-hung windows, their gold pencil-pleat curtains skimming the hardwood floors and reaching up to the ceiling.  From the window I was afforded an excellent view of the potting shed, its brick exterior and climbing roses mimicking the style of the main house.\n\n'Unusual to keep one's gardening implements so close to the house, wouldn't you say, Lewis?' I suggested to the constable who was by this time scratching his head with the butt of the pencil.\n'I understand there was a good reason for it, Sir,' the constable replied.  'According to the housekeeper, Mrs. Hapgood, the late Lady Stagwood was batty for roses.'\n'Lady Stagwood being Lord Stagwood's mother,' I deduced.\n'Yes, Sir,' the constable replied, noting the fact into his book.\n\nA fug of cigar smoke hung in the air, at once convincing me that it had been a long while since the windows in the billiard room of Stagwood Manor had been opened.\n\nAt the center of the room sat a billiard table, its turquoise baize surface the only bright note to the room.  I noticed a game had been set out, the wooden rack containing a triangle of coloured balls.  Across the table lay a one-piece maple wood cue, its sleeve inlayed with mother of pearl.  Beside it lay a leather box, long enough to hold a two-piece cue.  Undoing the latches, I flipped open the lid, revealing the case to be empty apart from three neat squares of chalk.\n\nI returned my attention to the room.  Aside from the negligible amount of natural light bleeding through the windows, the room boasted two enormous brass chandeliers; their candelabra design reminiscent of the 17th century Flemish style.  The north wall featured a modest built-in bookcase beside a fireplace, stacked with newspaper and kindling.\n'Why was this fire not lit, Lewis?' I asked the constable.\n'As I understood it, Sir, Mr. Cole was unable to find the housemaid who laid it,' he replied.\n'So Mr. Cole was in this room, was he?' I mused.  'And he was somehow unable to light the fire himself.'\n'That's right, Sir,' the constable replied.  'Seems Mr. Cole wasn't accustomed to getting his hands dirty.  Liked the old ways, he did.  Said he wasn't going to stoop to light any fires - especially not when he was a guest in another man's house.  Next thing they'd have him carrying his own dinner plate to the table, he said.  And then what would the world have come to?'\n'I see,' I replied judiciously, turning away from the fireplace.  'Yet it seems that Mr. Cole was about to embark on a game of billiards, is that correct?'\n'Yes, Sir, I believe so,' the constable replied.  'I found Mr. Cole in this very room when I arrived, Sir.  He was making a right fuss about it too.  Told me to scurry away and fetch his supper.  Said a man may have died, but that shouldn't have cause to mess with a gentleman's digestion.'\n\n'I see,' I said again, looking the constable in the eye to let him know he had said quite enough on the matter.  'What I do not see, however, is his opponent’s billiard cue.'\n'Well, Sir,' the constable ventured, 'I don't suppose he had one.  An opponent, I mean.'\n'No indeed,' I agreed, though it would be reasonable to expect the billiard room in an estate of Stagwood Manor's standing to have at least two cues at its disposal.  Do you not think so?'\n'Yes, Sir,' the constable replied, scribbling the word 'cue' into the notebook.\n'So precisely where is it?' I pondered.\n\n[[Search the parlour]]\n[[Search the potting shed]]\n[[Search the drawing room]]\n[[Interview the guests]]",
      "links": [
        {
          "text": "Search the parlour",
          "destination": {
            "name": "Search the parlour",
            "pid": 12
          }
        },
        {
          "text": "Search the potting shed",
          "destination": {
            "name": "Search the potting shed",
            "pid": 13
          }
        },
        {
          "text": "Search the drawing room",
          "destination": {
            "name": "Search the drawing room",
            "pid": 15
          }
        },
        {
          "text": "Interview the guests",
          "destination": {
            "name": "Interview the guests",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "Search the drawing room",
      "text": "'I take it the drawing room is situated across the hall from the dining room,' I inquired of the constable.\n\n'Yes, Sir,' he replied eagerly, following close behind me as I approached another set of double-doors:  a matching pair to that of the dining room.\n'This Georgian symmetry is rather pleasing,' I mused, pushing open the doors only to find myself standing face to face with the most enchanting woman I had ever laid eyes on.\n\n'Miss West, I take it?' I said, tipping my cap at her as if I were an elderly farmer.\n'Oh!  You startled me!' she cried, placing her hand upon the cafe au lait fabric of her full-length gown.\nI noticed that her fingernails were long and tapered at the ends, the half-moons on each nail left bare against the true red of her polish.\n\n'Forgive me,' I said, gazing at her black, feathered eyelashes and the glossy chestnut waves of her hair.\nI glanced down at her other hand, noticing a sheet of white paper clutched between her fingers.\n'What do you have there, Miss West?' I asked, and at once she looked startled, attempting to hide the paper behind her back before thinking better of it.\n\n'If you must know, I was writing a letter,' she replied forthrightly, her chin lifting a little as she made her pronouncement.\n'It is not a little presumptuous to be helping yourself to the deceased's stationary?' I asked her, reaching out my hand in an effort to remove the letter from her grasp.\n'No, I don't believe so,' she replied curtly, snatching the letter back out of my sight.  'Stanley and I were friends, after all.  Good friends,' she added with a coquettish smile.\n'I see,' I replied uncomfortably.  'And where are you off to now, might I ask?  Not to post your letter I hope.'\n'Certainly not,' she replied shortly.  'Your constable has made it quite clear that we are all under house arrest until Stanley's killer has been drawn and quartered.  Now, if you will excuse me, I must visit the powder room.'\n\nI stepped back from the door to allow the enchanting Miss West to pass, before glancing back at the constable.\n'Something of a dramatist,' I suggested to him.\n'Yes, Sir,' the constable agreed.  'She reminds me of that Katharine Hepburn.'\n\nPassing into the drawing room, I was surprised to find myself standing in a warm, well-lit living area garnished with vases of fresh flowers.  The walls were dark wood, and the curtains were cream and green to match those of the dining room.  However the floors boasted cream rugs and the furniture was equally as feminine.  Cream and blush coloured armchairs had been positioned in a half circle around an ornate fireplace festooned with yet more vases and ornaments.\n\nAt the far end of the room stood a carved oak writing desk, accompanied by an ivory silk Louis XV chair.  I noticed that the chair had been pulled away from the desk and that there were several sheets of writing paper strewn across the desk's surface.  Evelyn West, I thought to myself.  It seemed the woman did like to take liberties after all.\n\n'It's toasty in here, Sir,' the constable commented as I glanced at the well-stoked fire roaring in the hearth.\n'Indeed it is,' I replied absentmindedly.\n\nA hint of Evelyn West's perfume hung in the air, reminding me of her startled reaction to seeing me at the door to the room, and the way she had tried to obscure the letter from my view.  Who exactly had she been writing too, I wondered.  Had she merely been amusing herself while we carried out our investigations, or had there been certain urgency to her correspondence?\n\nGlancing back at the writing desk I took stock of Lord Stagwood's letter writing apparatus:  a fountain pen, red sealing wax and the Stagwood Manor seal, embossed white envelopes and writing paper.\n\n'Something is missing from this writing desk,' I informed the constable.\n'What's that, Sir?' he asked curiously, his pencil and notepad held at attention.\n'Lord Stagwood's letter opener,' I replied gravely.\n\n[[Search the parlour]] \n[[Search the potting shed]] \n[[Search the billiard room]] \n[[Interview the guests]]",
      "links": [
        {
          "text": "Search the parlour",
          "destination": {
            "name": "Search the parlour",
            "pid": 12
          }
        },
        {
          "text": "Search the potting shed",
          "destination": {
            "name": "Search the potting shed",
            "pid": 13
          }
        },
        {
          "text": "Search the billiard room",
          "destination": {
            "name": "Search the billiard room",
            "pid": 14
          }
        },
        {
          "text": "Interview the guests",
          "destination": {
            "name": "Interview the guests",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "Make an arrest",
      "text": "The constable and I made our way back towards the dining room.  By now I had gained a good handle on the who, the where, and the why of the situation surrounding Lord Stagwood's murder.  Now it was time for me to make my arrest.\n\nAs we passed into the room I glanced out the window at the muddy indents running along the path outside Stagwood Manor.  It was all the confirmation I needed that what I was about to do was right.\n\n'Ready your handcuffs, Lewis,' I told the constable.  'It is time for us to make our arrest.'\n'But who are we arresting, Sir?' the constable enquired of me.\n'I shall tell you,' I assured him, 'then I shall ask you to let the other three suspects return to their homes.  I do not wish to make a show out of the arrest.'\n\n[[Accuse Mildred Hobbs]]\n[[Accuse Henry Bray]]\n[[Accuse Evelyn West]]\n[[Accuse Victor Cole]]",
      "links": [
        {
          "text": "Accuse Mildred Hobbs",
          "destination": {
            "name": "Accuse Mildred Hobbs",
            "pid": 17
          }
        },
        {
          "text": "Accuse Henry Bray",
          "destination": {
            "name": "Accuse Henry Bray",
            "pid": 18
          }
        },
        {
          "text": "Accuse Evelyn West",
          "destination": {
            "name": "Accuse Evelyn West",
            "pid": 19
          }
        },
        {
          "text": "Accuse Victor Cole",
          "destination": {
            "name": "Accuse Victor Cole",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "Accuse Mildred Hobbs",
      "text": "We came upon Mildred Hobbs at the scene of the crime, her aged hand thrust deep into a bucket of potting soil.\n\n'Would you not prefer to wear gloves for such a task, Mrs. Hobbs?' I enquired of the elderly woman as I stood at the door of the potting shed.\n'I'm not afraid to get my hands dirty for a good cause, Inspector,' she replied brusquely.\n'Of that I am sure,' I told her.  'That is why I have come to arrest you for the murder of Sir Stanley Stagwood.'\n\n'Murder?' Mrs. Hobbs blanched.  'How do you come to that conclusion?'\n'The fact that you stabbed your former employer through the heart with a garden line rather gave it away,' I informed her, gesturing for the constable to prepare the handcuffs.\n\n'That's as may be,' the elderly woman replied boldly.\n'So you do not deny that you murdered Lord Stagwood?' I asked, a little surprised by the woman's willingness to confess so quickly.\n'I stabbed the brute,' Mrs. Hobbs retorted, 'but you could hardly call me a murderer.  I did Stagwood Manor a favour by ridding the place of a bad tenant.  Stanley Stagwood was a selfish swine who thought more of himself than anything else.'\n\n'He fired you from his employ,' I suggested to her.  'And you were, quite understandably, bitter about it.'\n'Bitter?' Mildred Hobbs exclaimed.  'I was hardly that.  Angry is the word you are grasping at, Inspector.'\n'All because Lord Stagwood had reneged on his promise of lifelong employment at Stagwood Manor,' I confirmed.\n\n'Lifelong employment does not concern me, Inspector,' Mrs. Hobbs huffed.  'It was the desecration of the memory tree that did for Stanley Stagwood.'\n'The memory tree?' I asked, perplexed by the woman's admission.\n'That's right, Inspector,' Mildred Hobbs replied bitterly.  'I plan to set things straight at Stagwood Manor - starting with replanting the memory tree planted by my husband's late great-grandfather.  Lord Stagwood didn't care about the gardens.  Still he should have known what that tree meant to my family.'\n\n'So you killed him for the sake of a tree?' I asked, dumfounded.\n'I did not raise Stanley Stagwood to become a degenerate,' she huffed.  I did not kill the man because he set me out on my ear.  No, I killed him because he let that oak go to ruin through to neglect and ignorance.  Yes, I stabbed him with that garden line,' she added.  'And I am glad that I did.'\n\nAs the constable secured Mildred Hobbs into the back of the police wagon he turned to me.\n'Thank you, Sir,' he said.  'I would say that this has been the high point of my career so far if it weren't in such bad taste.'\n'You did well, Lewis,' I told him.  'And, why don't you keep the notebook?' I added.  'I am certain that it will come in handy in your future endeavors.'\n'Yes, Sir,' the constable replied gratefully.  'I'll treasure it like it was my own.'\n\n'Sir,' he added, as I began to step towards the Daimler.\n'Yes, Lewis?' I replied.\n'How did you know it was Mildred Hobbs who killed Lord Stagwood?' he asked somewhat sheepishly.\n\n'Well, Lewis,' I informed him, 'it was the muddy wheelbarrow tracks that gave it away.'\n'The tracks, Sir?' Lewis asked with a confused frown in his face.\n'That's right,' I replied proudly.  'Stanley Stagwood was not murdered in the dining room.  Yet, I wondered, how could his killer have transported him there without breaking their back by doing so?  Lord Stagwood was a biggish man, after all.'\n\n'So Mildred Hobbs stabbed Lord Stagwood out in the garden shed?'  Lewis asked.\n'After he refused to show remorse over killing her beloved tree,' I added.  'Then, employing the barrow, she wheeled him into the dining room where is body came to be discovered by his arriving lunch guests.'\n\n'Quite a nasty woman in the end, wasn't she, Sir?' the constable suggested with a shiver.\n'No, Lewis,' I contended.  'Merely a keen gardener with a bit of a temper.'\n\n\nTHE END",
      "links": []
    },
    {
      "pid": 18,
      "name": "Accuse Henry Bray",
      "text": "We found Henry Bray lying on his back on the well-manicured lawn outside the front of Stagwood Manor.  As we approached the young man he turned his head so that he came to be staring directly at the toes of our boots.\n\n'Ah, Inspector Pike and Constable Lewis,' he announced, sitting up from his prone position.\nBunty the Foxhound chose to do the same, though with the hint of a growl, I noticed.\n'Lord Bray,' I addressed the young man, 'I'm afraid this is no time for general niceties.  I have some to arrest you for the murder of your uncle, Sir Stanley Stagwood.'\n\n'You have?' the young man enquired, standing to his feet and using his hands to brush down the backs of his trouser legs.  'Whatever for?'\n'For murder,' Constable Lewis repeated, assuming the young lord had not understood the accusation.\n'Oh, yes,' Henry Bray replied amiably.  'I quite got the point of your coming here.  What I failed to understand, though, was why me?'\n\nI turned to glance at Constable Lewis, who promptly fished the notebook and pencil out from the pocket of his tunic.\n'It was the fire poker that tipped us off, wasn't it, Sir?' the constable suggested.\n'Quite right, Lewis,' I agreed before returning my attention to Henry Bray.\n\n'Oh that,' the young lord replied with a chuckle.  'I can see why that may look suspicious to you.  You see I shouldn't even have used the thing in the first place.  It simply wasn't the right tool for the job, and I knew it even before I lost the blasted thing down the back of Cook's range.'\n\n'But it was the right tool for stabbing your uncle,' I suggested.\n'Oh, no,' Henry Bray replied with an amused shake of his head.  'Not that.  I meant that it wasn't the right tool for chasing Bunty's rat out from behind the range.'\n\n'Bunty's rat?' Constable Lewis exclaimed before I could stop him.\n'That's right,' Henry Bray replied, a little abashed.  'The dear girl was deadset on tearing it to bits.  She has rather a fondness for chewing on things,' he added.\nI could attest to that myself, having lost my gloves to the brute not moments after arriving at Stagwood Manor.\n\n'And the rat?' I prompted him.\n'Ah, yes,' he continued, 'the rat.  'I tried my darndest to scare the wretched thing out from behind Cook's range, but it simply wouldn't budge.  Then, much to my shame, I only went and dropped the fire poker down the back of it.\n'Hence the soot on the sleeve of your jacket,' I mused.\n'Sadly so,' Henry Bray replied.  'But wait on - if it wasn't me who did away with my dear old uncle, then who did?'\n\nI turned to face the constable who, I noticed, had gone as pale as a sheet.\n'I'm afraid to say we may have just attempted to arrest the wrong person,' I told him.\n'But, Sir...' the constable protested.\n'No, Lewis,' I interrupted him.  'I am afraid that I have made a very grave mistake in coming here.  Where is Mildred Hobbs?'\n'I let her go, Sir,' the constable replied, his face flushing red with what I took to be embarrassment.\n'Then I am sorry to say that we have just lost Sir Stagwood's real killer.  And on my first day at the job too.'\n\n\nTHE END",
      "links": []
    },
    {
      "pid": 19,
      "name": "Accuse Evelyn West",
      "text": "'We live in modern times, Lewis,' I told the constable as we made our way towards Evelyn West's bedroom.  'However, perhaps not so modern enough that a lady of Miss West's breeding need not worry about her reputation.'\n\nWe found Evelyn West sitting bolt upright on the edge of the bed.  It seemed that she had been expecting us, a fact she confirmed not a moment later.\n\n'I thought you might return,' she said with what sounded like regret.  'I cannot pretend that I am not disappointed.  In this day and age...'\n'You need not explain your position to me, Miss West,' I interrupted her.  'I am not so much a man of the world that I have become out of touch with society's expectations upon a lady such as yourself.'\n\n'Oh, but that's where you are wrong!' Evelyn West protested, standing up from the bed, stepping towards me and taking my hands in hers.\nI blushed at the improper show of affection.  We were not friends, after all, let alone sweethearts.\n\n'I shall ask you to step back, Miss West,' I instructed her as firmly as I could.  'My constable will need to see your wrists in order for him to attach the handcuffs.'\n\n'But I did not kill Stanley!' she protested, a look of alarm spreading across her face.  'I loved him!'\n'Of that I am well aware,' I assured her.  'However I also believe that you and Lord Stagwood had recently parted ways, as it were.'\n\n'But we were still friends,' Evelyn West protested.\n'A friend would not leave a lady such as yourself to face the music alone,' I suggested to her.  'Stanly Stagwood took your honour, then he let you go.'\n'My honour?' Evelyn West replied, her eyes widening with surprise.  'But Inspector, my honour remains intact.  As it happens, I am to be married next month to the most darling of men.'\n'Married?' I exclaimed.\n'Of course,' she replied keenly.  'Besides, what reason should I have to kill Stanley?'\n\n'And the cut on your hand?' I questioned her.\n'I lied to you,' she acquiesced, 'and I am sorry.  I cut myself while opening a letter from my fiancé.  It was Stanley's letter opener, you see.  Damn fool liked to keep it as sharp as a razor.  The thing is, I was embarrassed that I injured myself, but mostly because I did not wish for you to read Lord Benham's letter.  It is of a personal nature, I'm sure you understand.'\n\nI turned to face the constable who, I noticed, had gone as pale as a ghost.\n'I'm afraid to say we may have just attempted to arrest the wrong person,' I told him.\n'But, Sir...' the constable protested.\n'No, Lewis,' I interrupted him.  'I am afraid that I have made a very grave mistake in coming here.  Where is Mildred Hobbs?'\n'I let her go, Sir,' the constable replied, his face flushing red with what I took to be embarrassment.\n'Then I am afraid to say that we have just lost Sir Stagwood's real killer.'\n\n\nTHE END",
      "links": []
    },
    {
      "pid": 20,
      "name": "Accuse Victor Cole",
      "text": "'Victor Cole may have been Stanley Stagwood's business partner, but he was no match for the man on a personal level,' I told the constable.  'I also found his hostility regarding Lord Stagwood's business interests to be of great interest.  The fact was, Victor Cole very much wished for the business to take a different direction.  He was not satisfied with hawking old bowls and statues to the bright young things in London.  One could even say that he was embarrassed by it.'\n\n'And the thing Miss West said of him...' the constable prompted me.\n\n'Ah yes, you are correct to point that out, Lewis,' I agreed.  'Miss West referred to Victor Cole as a living parody of the poor man reaching for success but falling short.  I believe this sums up Victor Cole rather concisely.'\n\n'Should we arrest Victor Cole, Sir?' the constable asked me as I watched him stash my notebook and pen into the pocket of his tunic.\n'Lead the way, Lewis,' I replied, indicating towards the door.\n\n\nWe found Victor Cole sequestered in the billiard room.  Though he seemed to be expecting us, I was not surprised to see that he had taken an interest in Stanley Stagwood's billiard cues.\n'If you are looking for the broken cue it can be found in Lord Stagwood's gun safe,' I told him.  'However I believe you knew that already since it was you who placed it there.'\n'I did no such thing!' protested Victor Cole, his cheeks puffing up with indignation.  'I should have your badge for such a baseless accusation.'\n\n'There will be no need for that,' I replied hurriedly.\nIt was not my intention to find myself bailed up on the first day of a new job.\n'Then why have you come to bother me again?' Victor Cole demanded.  'I told you everything I knew about Stanley, now I should very much like to be on my way.  I am a very busy man, Inspector.'\n\n'I have no doubt that you are,' I assured him.  'However it is your murderous resentment towards your business partner which concerns me most.  Therefore, Victor Cole, I am arresting you on suspicion for the murder of Sir Stanley Stagwood.'\n\n'Hold on one second,' Victor Cole protested.  'I didn't kill Stanley.  In fact, his death will all but leave me in ruin.  Without his fortune and his society connections our business will fold.  Why would I murder the man?'\n\nI turned to face the constable who, I noticed, had gone as pale as a ghost.\n'I'm afraid to say we may have just attempted to arrest the wrong person,' I told him.\n'But, Sir...' the constable protested.\n'No, Lewis,' I interrupted him.  'I am afraid that I have made a very grave mistake in coming here.  Where is Mildred Hobbs?'\n'I let her go, Sir,' the constable replied, his face flushing red with what I took to be embarrassment.\n'Then I am afraid to say that we have just lost Sir Stagwood's real killer.'\n\n\nTHE END",
      "links": []
    },
    {
      "pid": 21,
      "name": "Investigate the weapons",
      "text": "'I believe I have learned everything I can from Lord Stagwood's lunch companions,' I informed the constable as we made our way back towards the dining room.\n\nBy now Lord Stagwood's body had been removed from its place at the head of the table and had been ferried back to the city in the undertaker's wagon.\n\n'You know who killed him then, Sir?' the constable asked, his eyes wide with what I could only imagine was fascination.\n'Yes, I believe I do, Lewis,' I replied, 'however now we must turn our attention to the murder weapon.'\n'Yes, Sir,' the constable agreed as he thumbed through the pages of the notebook with consideration.\n\n'As I see it we have three possible options,' I continued.  'First we could search Lord Stagwood's gun cabinet.  Secondly we have in our possession the letter opener that had been missing from Lord Stagwood's writing desk.  And thirdly we have in our possession, thanks to Lord Stagwood's hound, a curiously stained garden line.'\n\n'Pardon me, Inspector,' I heard a small voice say from the doorway.  'I don't mean to bother you, Sir, but...'\n\nI turned around to see a young housemaid looking up at me apologetically.\n'Yes?' I enquired, stepping towards the young girl.  'What is it?'\n'It might be nothing, Sir,' she began, glancing down at her modest brown shoes.  'It's just that Cook wanted me to tell you she found something that might be of interest to your investigation.'\n\n'And what was it?' I asked kindly, hoping to extract the information out of the girl before she lost her nerve.\n'It's a fire poker, Sir,' the maid replied, glancing up at me momentarily before returning her attention to the toe of her shoe.\n'A fire poker?' I repeated.\n'Yes, Sir,' the housemaid replied with absolute certainty.  'The thing is, Sir, Cook found it in the strangest of places.'\n'Yes?' I prompted her.\n'Well it was found stuffed down the back of her range, Sir,' the housemaid replied.\n\n'I believe we may have just uncovered a fourth possible murder weapon,' I informed the constable.\n'Yes, Sir,' he agreed, scribbling the note down into his book.  'That's very interesting indeed.'\n\n[[Examine gun cabinet]] \n[[Examine fire poker]] \n[[Examine letter opener]] \n[[Examine garden line]]",
      "links": [
        {
          "text": "Examine gun cabinet",
          "destination": {
            "name": "Examine gun cabinet",
            "pid": 7
          }
        },
        {
          "text": "Examine fire poker",
          "destination": {
            "name": "Examine fire poker",
            "pid": 8
          }
        },
        {
          "text": "Examine letter opener",
          "destination": {
            "name": "Examine letter opener",
            "pid": 9
          }
        },
        {
          "text": "Examine garden line",
          "destination": {
            "name": "Examine garden line",
            "pid": 10
          }
        }
      ]
    }
  ]
}