{
  "passages": [
    {
      "pid": 1,
      "name": "Starter Page",
      "text": "!Into the Lair\n!!by Kenna May\n\nThis is a simple story about death, blood, and revenge. Use your keyboard or click on the links to advance the story. There are no back buttons in this game; choose wisely, and remember to save your progress.\n\n1. <span id=\"oneAct\">[[Begin|Flashback]]</span>\n2. <span id=\"twoAct\">[[Skip Flashback|StoryStart]]</span>\n3. <span id=\"threeAct\">[[End Credits]]</span>",
      "links": [
        {
          "text": "Begin",
          "destination": {
            "name": "Flashback",
            "pid": 2
          }
        },
        {
          "text": "Skip Flashback",
          "destination": {
            "name": "StoryStart",
            "pid": 3
          }
        },
        {
          "text": "End Credits",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "Flashback",
      "text": "The first thing you remember is waking up on the stone cold floor with the taste of blood on your lips. A woman crouched over you, and as hard as you tried you couldn't remember who she was, or where you were, or why you felt so insatiably thirsty.\n\nYou remember your head spinning and your body feeling like it weighed a thousand pounds. The woman took your hand and prepared to pull you to your feet, and before she could you asked her, in a voice that did not sound like your own:\n\n1. <span id=\"oneAct\">[[\"\\\"Am I dead?\\\"\"|Vampire]]</span>\n2. <span id=\"twoAct\">[[\"\\\"Am I alive?\\\"\"|Vampire]]</span>\n3. <span id=\"threeAct\">[[\"\\\"Am I me again?\\\"\"|Vampire]]</span>",
      "links": [
        {
          "text": "\"\\\"Am I dead?\\\"\"",
          "destination": {
            "name": "Vampire",
            "pid": 4
          }
        },
        {
          "text": "\"\\\"Am I alive?\\\"\"",
          "destination": {
            "name": "Vampire",
            "pid": 4
          }
        },
        {
          "text": "\"\\\"Am I me again?\\\"\"",
          "destination": {
            "name": "Vampire",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "StoryStart",
      "text": "Now you're standing in the silent church graveyard, by the entrance to the crypt, watching the sky grow lighter and lighter. Before long it'll be too bright for you to stand outside. You're dreading, and anticipating, going inside.\n\nWil told you this was where she pulled you out of the catacombs, so this is where you'll have to venture back in. She also asked you not to come back here, but you're pretty sure she knew that was pointless. Repaying Viscardi for the curse he put you through has been the only thing on your mind for weeks. You'll sleep easier after this day is done - or you'll be dead, and it won't matter.\n\nThe crypt reeks of death the moment you step inside. You find the door to the catacombs with no problem, winding stairs leading deep under the earth, and review what you remember of Viscardi. He should be asleep as the sun rises, his coffin far across town under the Marquis family crypt. Nearby will be his amulet of false life, which he'll use to walk out in the sunlight and out of your grasp if you don't get him before noon. And between here and there, at least five more thralls under Viscardi's control - unless he's gotten more since you were freed.\n\nYou've been dreaming of this day for weeks, and there's one thing you need to do above all else:\n\n1. <span id=\"oneAct\">[[Kill Viscardi|Objective][$goal to \"kill\"]]</span>\n2. <span id=\"twoAct\">[[Free the thralls under Viscardi's control|Objective][$goal to \"free\"]]</span>\n3. <span id=\"threeAct\">[[Steal that amulet  of false life for yourself|Objective][$goal to \"steal\"]]</span>",
      "links": [
        {
          "text": "Kill Viscardi",
          "destination": {
            "name": "Objective",
            "pid": 5
          }
        },
        {
          "text": "Free the thralls under Viscardi's control",
          "destination": {
            "name": "Objective",
            "pid": 5
          }
        },
        {
          "text": "Steal that amulet  of false life for yourself",
          "destination": {
            "name": "Objective",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "Vampire",
      "text": "\"That's debatable,\" she said, and she pulled you up. You stood with less trouble than anticipated. In fact, you remember that in moments your body felt stronger than it had ever felt before. You could also smell the blood spilt in the room.\n\nThe woman introduced herself as Wil, and with the same breath that she explained she freed you, she also apologized for it. \"There's only two ways to free a thrall,\" she said, \"kill you, or turn you. Neither is reversible.\"\n\nYou remember wanting to ask what she meant by 'turn you' but that you didn't, because you already knew. Instead you lifted a hand and felt the two new fangs that had formed among your teeth. Then you asked:\n\n1. <span id=\"oneAct\">[[\"\\\"What happened to me?\\\"\"|RevengeFree]]</span>\n2. <span id=\"twoAct\">[[\"\\\"Who is Viscardi?\\\"\"|RevengeKill]]</span>\n3. <span id=\"threeAct\">[[\"\\\"What do I do now?\\\"\"|RevengeSteal]]</span>",
      "links": [
        {
          "text": "\"\\\"What happened to me?\\\"\"",
          "destination": {
            "name": "RevengeFree",
            "pid": 6
          }
        },
        {
          "text": "\"\\\"Who is Viscardi?\\\"\"",
          "destination": {
            "name": "RevengeKill",
            "pid": 7
          }
        },
        {
          "text": "\"\\\"What do I do now?\\\"\"",
          "destination": {
            "name": "RevengeSteal",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "Objective",
      "text": "<<if $goal is \"kill\">>Wil warned you many times about how dangerous Viscardi is. The most dangerous vampire she ever heard of, she always used to say. Too dangerous to live, is what you think. And if, in the meantime, you get your revenge on him for what he did to you, well, all the better.\n\nYou've packed everything you could get your hands on that you think will help you kill Viscardi, primarily a silver blade, one of the few weapons known to kill a vampire. You even made some old fashioned stakes in your downtime, and snagged a box of matches to burn this whole place down if it comes to it.\n\nViscardi's coffin is on the other side of these catacombs. If you could have broken into the Marquis' house directly that would have been better, but it's too heavily guarded by those Viscardi //hasn't// yet turned into slaves. Ideally you should attack him while he's still sleeping - you honestly don't know if you could take him in single combat. But if it comes down to it, you're certainly willing to try.\n\n<<elseif $goal is \"free\">>As the poison cleared out of your system you started to remember more about your time as Viscardi's thrall, and none of it was pleasant. Wil freed you because you were the first one she could find, but there are some thralls down here who've been under Viscardi's control for years longer than you had. They deserved to be freed.\n\nWhile you were one of them, you worked with the other thralls to carry out Viscardi's orders, cutting new tunnels of the catacombs or guarding prisoners in the dungeon... or supplying him with fresh blood from your own body. Now you don't have any blood to spare, and you're taking his stores away from him.\n\nWil gave you a silver blade, one of the few weapons that can kill a vampire, before you left. It's now strapped to your hip. She also explained how to turn a thrall into a vampire, like she did to you. It's a mix of knowledge you're not yet sure what to do with.\n\n<<elseif $goal is \"steal\">>It's never been Viscardi who was powerful: it's that amulet. You remembered it, when your memories started trickling back to you. He wore it every day, kept it protected near his coffin when he slept, relied on it. If you can take it away from him, he'll be nobody - and you'll finally be able to feel the sunlight again.\n\nYou weren't allowed in Viscardi's personal crypt much as a thrall, but you saw it once or twice. Near the coffin is the box he keeps that amulet in. While he's asleep its only guard is whichever thrall is stationed there for the day, and with this new life Wil gave you, you're much more powerful than any thrall.\n\nYou never told Wil your plan because she seemed wary of the amount of interest you had in that amulet. She certainly wouldn't approve. She let you keep the silver blade she was training you with but warned you not to let your new life turn you into the same kind of monster as Viscardi. You know that's not going to happen.\n\n<</if>>Your foot touches the bottom stair of the crypt and finally, you:\n\n1. <span id=\"oneAct\">[[Enter the catacombs|MazeStart][$wait to 0]]</span>",
      "links": [
        {
          "text": "Enter the catacombs",
          "destination": {
            "name": "MazeStart",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "RevengeFree",
      "text": "\"Viscardi made you his thrall,\" Wil told you. You remember that even then, when you couldn't remember who he was, that name sent chills down your spine. \"He's the most dangerous vampire I've ever heard of. The effects of his poison will take a few days to wear off, but then... well. You're not a thrall anymore.\"\n\nWhat had been an instinctual ball of fear in your gut was slowly desolving into something much angrier. \"And when you say 'thrall',\" you said, \"you mean-?\"\n\n\"A slave,\" Wil confirmed. \"Body and mind. Viscardi uses the vampire poison without shame. You're not the first,\" she added, \"and you're far from the last. He's got at least five more hidden away in his catacombs right now. I could only get you out for now.\"\n\nYou remember that poisonous effect clouding your mind sloughing off faster than even Wil expected it. You remember clearly, because there's been only one thought on your mind ever since:\n\n1. <span id=\"oneAct\">[[Revenge|StoryStart]]</span>",
      "links": [
        {
          "text": "Revenge",
          "destination": {
            "name": "StoryStart",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "RevengeKill",
      "text": "Somehow through the blur that was your thralldom, that name had stuck. Even Wil was surprised in that moment to hear it come from you. All you knew was that name filled you with hate.\n\n\"He's the vampire that poisoned and enslaved you,\" Wil said, \"and he's the most dangerous vampire I've ever heard of. I've been trying to fight him for years, but he has an amulet that lets him walk around in daylight, and thralls who guard his catacombs. I haven't been able to get close to him.\"\n\n\"So you free the thralls instead,\" you remember saying, and you remember thinking that was noble of her, but misguided. Wil nodded, said it was the least she could do, but your mind was already far away. It took days for the effects of the poison to slough off your mind, but in that time you only thought about one thing:\n\n1. <span id=\"oneAct\">[[Revenge|StoryStart]]</span>",
      "links": [
        {
          "text": "Revenge",
          "destination": {
            "name": "StoryStart",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "RevengeSteal",
      "text": "\"Before you do anything,\" Wil said, \"you should wait for your mind to clear. It'll take a few days for the effects of Viscardi's poison to wear off.\"\n\nThat name didn't mean anything to you, and yet the moment Wil said it you remember feeling a spark of something like anger inside of you. \"Viscardi?\" you asked her.\n\n\"He's the one who enthralled you,\" she tried to explain. \"A powerful vampire - he has an amulet that lets him walk in daylight, and a horde of thralls protecting his catacombs so even //I// can't get close. I try to save as many as I can, to help.\"\n\nYou remember barely hearing that last part because you were so struck by what Wil had said before. It hadn't occured to you until just then that being 'turned' didn't only mean getting pointy new teeth. And that spark wasn't anger, you realized; it was closer to sadness, or jealousy.\n\nWil was right that it took the poison a few days to wear off, but you didn't spend that time doing nothing. For weeks, the only thing you thought about was:\n\n1. <span id=\"oneAct\">[[Revenge|StoryStart]]</span>",
      "links": [
        {
          "text": "Revenge",
          "destination": {
            "name": "StoryStart",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "MazeStart",
      "text": "The catacombs look to be hand-cut into the earth below the church graveyard and town; the ground is uneven, and roots poke through the ceiling. The walls themselves are lined with human skulls. Someone dove a bit deep into the 'death' aesthetic down here.\n\nYou venture down the main walkway of the catacombs. Little nooks set into the walls are labelled with the names of the various people entombed within. There are several smaller hallways that branch out, <<if $thrallCrypt is \"dead\">>where you don't hear anything<<else>>and you can hear a small scratching sound coming from one<</if>>. At one end of the main hallway you see the carefully carved steps leading back into the crypt above. At the other end, the hallway twists into darkness.\n\nYou decide to:\n\n1. <span id=\"oneAct\">[[Go Back|ChurchStairs]]</span>\n2. <span id=\"twoAct\">[[Move down the Main Hall|CryptMain]]</span>\n3. <span id=\"threeAct\">[[Move into the Side Hall|CryptSide]]</span>",
      "links": [
        {
          "text": "Go Back",
          "destination": {
            "name": "ChurchStairs",
            "pid": 45
          }
        },
        {
          "text": "Move down the Main Hall",
          "destination": {
            "name": "CryptMain",
            "pid": 10
          }
        },
        {
          "text": "Move into the Side Hall",
          "destination": {
            "name": "CryptSide",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "CryptMain",
      "text": "The main hallway through the catacombs is about six feet wide, the ceiling a good foot above your head. There are human skulls embedded in the walls, and smaller hallways branching out to each side every few feet. You see some of these hallways end abruptly just a few feet in, while others twist away into darkness.\n\nYou can feel the floor sloping lower and lower into the earth the further you move from the entrance to the catacombs. You can see on one end of the hallway the muted light from the crypt doors. On the other end, the hallway comes to a stop. A rusted pickaxe lies discarded on an empty section of wall; someone must have given up excavating the tunnel here.\n\nYou decide to:\n\n1. <span id=\"oneAct\">[[Move into the Side Hall|CryptSide]]</span>\n2. <span id=\"twoAct\">[[Head back to the entrance|MazeStart]]</span>",
      "links": [
        {
          "text": "Move into the Side Hall",
          "destination": {
            "name": "CryptSide",
            "pid": 11
          }
        },
        {
          "text": "Head back to the entrance",
          "destination": {
            "name": "MazeStart",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "CryptSide",
      "text": "<<if $thrallCrypt is \"alert\">>You navigate into the tight hallways at the back of the catacombs. After five more minutes of exploring, it becomes obvious that there's nowhere else to go down here. You have to find Viscardi's lair. That woman was almost definitely set to guard the entrance to it.\n\nYou:\n\n1. <span id=\"oneAct\">[[Sneak back to the strange room|CryptThrall]]</span>\n2. <span id=\"twoAct\">[[Head up to the Main Hall|CryptMain]]</span>\n3. <span id=\"threeAct\">[[Head back to the catacomb entrance|MazeStart]]</span>\n\n<<else>>The walls squeeze tight in the side passages of the catacombs, forcing you to move slowly. They also twist and turn in an illogical fashion; a normal person would immediately become lost down here, among the images of death. Luckily the scent of death is easy enough for you to follow.\n\nSome of these smaller tunnels branch back directly to the entrance of the catacombs, while a few other twists connect the side tunnels to the main catacomb hall. You can even follow the tunnels deeper into the earth. Eventually, you make your way:\n\n1. <span id=\"oneAct\">[[Move down the Main Hall|CryptMain]]</span>\n2. <<if $thrallCrypt is \"docile\">><span id=\"twoAct\">[[Enter side tunnel|CryptThrall]]</span><<else>><span id=\"twoAct\">[[Enter side tunnel|CryptAlter]]</span><</if>>\n3. <span id=\"threeAct\">[[Head back to the entrance|MazeStart]]</span><</if>>",
      "links": [
        {
          "text": "Sneak back to the strange room",
          "destination": {
            "name": "CryptThrall",
            "pid": 13
          }
        },
        {
          "text": "Head up to the Main Hall",
          "destination": {
            "name": "CryptMain",
            "pid": 10
          }
        },
        {
          "text": "Head back to the catacomb entrance",
          "destination": {
            "name": "MazeStart",
            "pid": 9
          }
        },
        {
          "text": "Move down the Main Hall",
          "destination": {
            "name": "CryptMain",
            "pid": 10
          }
        },
        {
          "text": "Enter side tunnel",
          "destination": {
            "name": "CryptThrall",
            "pid": 13
          }
        },
        {
          "text": "Enter side tunnel",
          "destination": {
            "name": "CryptAlter",
            "pid": 12
          }
        },
        {
          "text": "Head back to the entrance",
          "destination": {
            "name": "MazeStart",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "CryptAlter",
      "text": "The walls in this room are carved smoother than the areas you've been, and lack the macabre decorations of the rest of the catacombs. In fact beyond the dull altar against one of the walls, the only bit of decor is an equally-dull tapestry hanging against the opposite wall. <<if $thrallCrypt is \"dead\">>And the body of the woman lying at the altar's feet now, if that counts<<else>>And the unconscious woman you freed from Viscardi's control, if she counts<</if>>.\n\n<<if $tapestry is 1>>Beneath the tapestry lies the tunnel connecting the catacombs to the rest of Viscardi's lair.<<else>>You spend approximately one minute looking at that tapestry before you see that it covers another side tunnel off of the crypts. It's not very well hidden at all.<<set $tapestry to 1>><</if>> You can go either through this tunnel, or back through the hallway into the rest of the catacombs.\n\nYou:\n\n1. <span id=\"oneAct\">[[Head through the tapestry|SecretHallway][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Head into the catacombs|CryptSide][$direction to \"out\"]]</span>",
      "links": [
        {
          "text": "Head through the tapestry",
          "destination": {
            "name": "SecretHallway",
            "pid": 14
          }
        },
        {
          "text": "Head into the catacombs",
          "destination": {
            "name": "CryptSide",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "CryptThrall",
      "text": "<<if $thrallCrypt is \"docile\">>You slip quietly into what appears to be a chamber, tucked away beneath the catacombs where no natural light can trickle in. Against one wall sits a large statue, an altar to someone you don't recognize. Beneath the altar huddles a person.\n\nYou can tell she's a woman, and that she's breathing, but you can't see much else about her in this dim light. She could be a villager, or a thrall guard that Viscardi left here. Either way, she doesn't even know you're here yet. You could probably sneak up on her with no problem.\n\nYou consider a moment, and then you:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Sneak up on her\">><<replace \"#levelOne\">>1. Sneak up on her\n\nYou creep forward into the room, slowly enough that you don't make a sound. You can hear the woman's ragged breathing better as you get closer - the breathing of a person who hasn't been living well in a while. Like you, when you were under Viscardi's thrall.\n\nYou get within a few feet of her before she even begins to stir. Quickly, you:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Snap her neck\">><<replace \"#levelTwo\">>1. Snap her neck\n\nIt only takes a second. The woman has enough time to get in a deep breath, to begin a scream, before your hands are on her neck and the dim light of life is gone from her eyes. You let her drop unceremoniously to the floor.<<set $dead += 1>><<set $thrallCrypt to \"dead\">><<set $thirst += 1>>\n\nYou can smell blood start to leave her body, slowly, from where her head hit the edge of the altar. You still don't know if this was a thrall of Viscardi or just some unfortunate villager, but it really doesn't matter anymore.  She's dead now, and she didn't have time to raise an alarm, so you're still in the clear.\n\nYou:\n\n1. <span id=\"oneAct\">[[Turn to the rest of this room|CryptAlter]]</span>\n\\<</replace>><</link>>/* link replace choice Snap her neck */\n\\</span>/* oneAct, within LevelTwo */\n2. <span id=\"twoAct\"><<link \"Gag her\">><<replace \"#levelTwo\">>2. Gag her\n\nYour hand clamps against the woman's mouth, muffling a shout of surprise before she can make it. She tries to jerk away from you but your grip is too strong. She also definitely hasn't been living well; she's frail, dirty, and weak. You let her struggle for a moment, before you:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Bite into her neck\">><<replace \"#levelThree\">>1. Bite into her neck\n\nYou feel your vampire fangs sink into the skin over the woman's artery before you've even given it a thought. Wil let you feed while you were training with her... but never on a fresh body. The blood is warmer than you anticipated, and the sensation of it flooding your body...\n\nIt's intoxicating. You forget your surroundings for a moment while you drink. Within moments the woman's body goes limp in your grasp, and you realize you have just moments to:\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Drain her completely\">><<replace \"#levelFour\">>1. Drain her completely\n\nYou taste the blood run out before realize its happened. It happened a lot faster than you anticipated. One moment this body was warm and alive, and the next... it lies dead in your arms. You drop it without ceremony.<<set $dead += 1>><<set $thrallCrypt to \"dead\">><<set $firstBite to \"yes\">>\n\nYou never figured out if that was even a thrall, or just a random villager, but it's probably a safe guess that was a thrall. Any random villager down here for long probably becomes a thrall of Viscardi anyways. Better dead than under Viscardi's control.\n\nThere's stray blood dripping own your chin, and you wipe it away before:\n\n1. <span id=\"oneAct\">[[Turning away|CryptAlter]]</span>/* oneAct */\n\\<</replace>><</link>>/* link replace Drain her completely */\n\\</span>/* oneAct */\n2. <span id=\"twoAct\"><<link \"Stop\">><<replace \"#levelFour\">>2. Stop\n\nYou jerk your head back and twin lines of blood spill out and onto your chin. The woman slumps back and you catch her before she can fall to the floor, lowering her down gently. She's still breathing, but only just.\n\nThere's no time to waste. With renewed strength, you draw the dagger from your side and cut a line into your own palm, raising it to the woman's lips just like Wil showed you. If this woman is indeed a common villager, your blood will do nothing to revive her.<<set $freed += 1>><<set $thrallCrypt to \"freed\">><<set $firstBite to \"yes\">>\n\nInstead, her breathing grows steady. Her body slowly gets colder but she does not die, not any more than you did. You let out a breath in relief. She's too weak to wake up now but eventually she will, and she'll be free, just like you are. You feel a strange sort of elation that you did not expect. One down, you think. Just a few more to go.\n\nYou:\n\n1. <span id=\"oneAct\">[[Look at the rest of this room|CryptAlter]]</span>/* oneAct */\n\\<</replace>><</link>>/* link replace Stop */\n\\</span>/* twoAct */\n\\</span>/* levelFour */\n\\<</replace>><</link>>/* link replace Bite into her neck */\n\\</span>/* oneAct */\n2. <span id=\"twoAct\"><<link \"Free her\">><<replace \"#levelThree\">>2. Free her\n\nYou have no idea if this will work, but it's worth a shot. You follow the example Wil gave you and draw the dagger from you side, making a quick motion to uncover the woman's mouth, draw your own blood from your palm, and clamp your hand down again. It takes all of a second, and the woman barely has time to let out a grunt before your blood touches her lips. <<set $freed += 1>><<set $thrallCrypt to \"freed\">>\n\nIf she was a normal human, this would have no effect. Instead, within moments her body grows limp. You slide her down gently to the floor, and watch as her ragged breathing grows shallow and steady. Her body grows cold but she does not die, and for now she's even too weak to wake up.\n\nYour first freed thrall. You stand back up and resheath your dagger. You feel a sort of happiness, a sort of elation you did not quite expect. One down, you think. Just a handful more to go.\n\nYou:\n\n1. <span id=\"oneAct\">[[Look at the rest of this room|CryptAlter]]</span>/* oneAct */\n\\<</replace>><</link>>/* link replace Free her */\n\\</span>/* twoAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>>/* link replace choice Gag her */\n\\</span>/* twoAct, within levelTwo */\n\\</span> /* level Two doesnt have a close span tag so I'm adding this in as an experiment */\n\\<</replace>><</link>>/* link replace Sneak up on her */\n\\</span>/* oneAct, within levelOne */\n2. <span id=\"twoAct\"><<link \"Call out, \\\"Hello\\\"\">><<replace \"#levelOne\">>2. Call out, “Hello”\n\nThe woman looks up with a jolt when you call out. \"Who goes there?\" she calls back. Her voice is weak and hoarse, but louder than you were expecting. \"What are you doing here? Get out!\"\n\nThe tunnels in this crypt echo pretty badly; if she continues to shout, she's definitely going to draw attention from something. That's probably why she's here, you think.\n\n\"I'm nobody,\" you say in what you hope is a calming voice. \"Just a stranger passing by.\"\n\n\"You have no business here. You can't be down here!\" she says back. Now her voice is growing shrill, it grates on your ears. You say:\n\n<span id=\"levelTwo\">1.<span id=\"oneAct\"><<link \"\\\"Why not?\\\"\">><<replace \"#levelTwo\">>1. \"Why not?\"\n\nThe woman stands to her full height, or at least the full height she can achieve in the condition she's in. She's still a good foot shorter than you. It looks physically painful, and she grips a part of the wall nearby for support.\n\nAt least, that's what you thought she was doing, until she starts banging a piece of metal in her fist against the rock. \"Intruder!\" she rasps out. The sound is grating to your ears, and there's no talking sense into her now. You:<<set $thrallTunnel to \"alert\">>\n\n1. <span id=\"oneAct\">[[Leave|CryptSide][$thrallCrypt to \"alert\"]]\n\\</span>/* oneAct */\n\\<</replace>><</link>>/* link replace for Speak reasonably */\n\\</span>/* oneAct, in levelTwo through choice Second */\n2. <span id=\"twoAct\">[[\"\\\"Sorry, I'll go\\\"\"|CryptSide][$thrallCrypt to \"alert\"]]\n\\</span>/* twoAct */\n\\</span>/* levelTwo */\n\\<</replace>><</link>>/* link replace Call out, Hello */\n\\</span>/* twoAct, within levelOne */\n\\</span>/* levelOne */\n<<else>>You try to sneak back into this hidden altar room, moving as quietly as you can, but now the woman is waiting for you. She has her eyes trained on the sole entrance. She stands up when she sees you.\n\n\"You're back,\" she says. \"I told you to go away. I told you to stay away!\"\n\nYou have no energy to argue this point. The sun is in the sky and there's nowhere to go but further down. If you want to deal with Viscardi, you're going to have to deal with this woman first.\n\n\"If you don't leave now,\" she starts to say, but you're already formulating your plan. You:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Gag her\">><<replace \"#levelTwo\">>1. Gag her\n\nYou dart across the room before she can finish her sentence, and practically before her face can even register surprise. You hand clamps down against the woman's mouth as she begins to shout a warning. She tries to jerk away from you but your grip is too strong. She also definitely hasn't been living well; she's frail, dirty, and weak. You let her struggle for a moment, before you:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Bite into her neck\">><<replace \"#levelThree\">>1. Bite into her neck\n\nYou feel your vampire fangs sink into the skin over the woman's artery before you've even given it a thought. Wil let you feed while you were training with her... but never on a fresh body. The blood is warmer than you anticipated, and the sensation of it flooding your body...\n\nIt's intoxicating. You forget your surroundings for a moment while you drink. Within moments the woman's body goes limp in your grasp, and you realize you have just moments to:\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Drain her completely\">><<replace \"#levelFour\">>1. Drain her completely\n\nYou taste the blood run out before realize its happened. It happened a lot faster than you anticipated. One moment this body was warm and alive, and the next... it lies dead in your arms. You drop it without ceremony.<<set $dead += 1>><<set $thrallCrypt to \"dead\">><<set $firstBite to \"yes\">>\n\nYou never figured out if that was even a thrall, or just a random villager, but it's probably a safe guess that was a thrall. Any random villager down here for long probably becomes a thrall of Viscardi anyways. Better dead than under Viscardi's control.\n\nThere's stray blood dripping down your chin, and you wipe it away before:\n\n1. <span id=\"oneAct\">[[Turning away|CryptAlter]]</span>/* oneAct */\n\\<</replace>><</link>>/* link replace Drain her completely */\n\\</span>/* oneAct */\n2. <span id=\"twoAct\"><<link \"Stop yourself\">><<replace \"#levelFour\">>2. Stop yourself\n\nYou jerk your head back and twin lines of blood spill out and onto your chin. The woman slumps back and you catch her before she can fall to the floor, lowering her down gently. She's still breathing, but only just.\n\nThere's no time to waste. With renewed strength, you draw the dagger from your side and cut a line into your own palm, raising it to the woman's lips just like Wil showed you. If this woman is indeed a common villager, your blood will do nothing to revive her.<<set $freed += 1>><<set $thrallCrypt to \"freed\">><<set $firstBite to \"yes\">>\n\nInstead, her breathing grows steady. Her body slowly gets colder but she does not die, not any more than you did. You let out a breath in relief. She's too weak to wake up now but eventually she will, and she'll be free, just like you are. You feel a strange sort of elation that you did not expect. One down, you think. Just a few more to go.\n\nYou:\n\n1. <span id=\"oneAct\">[[Look at the rest of this room|CryptAlter]]</span>/* oneAct */\n\\<</replace>><</link>>/* link replace Stop */\n\\</span>/* twoAct */\n\\</span>/* levelFour */\n\\<</replace>><</link>>/* link replace Bite into her neck */\n\\</span>/* oneAct */\n2. <span id=\"twoAct\"><<link \"Free her\">><<replace \"#levelThree\">>2. Free her\n\nYou have no idea if this will work, but it's worth a shot. You follow the example Wil gave you and draw the dagger from you side, making a quick motion to uncover the woman's mouth, draw your own blood from your palm, and clamp your hand down again. It takes all of a second, and the woman barely has time to let out a grunt before your blood touches her lips. <<set $freed += 1>><<set $thrallCrypt to \"freed\">>\n\nIf she was a normal human, this would have no effect. Instead, within moments her body grows limp. You slide her down gently to the floor, and watch as her ragged breathing grows shallow and steady. Her body grows cold but she does not die, and for now she's even too weak to wake up.\n\nYour first freed thrall. You stand back up and resheath your dagger. You feel a sort of happiness, a sort of elation you did not quite expect. One down, you think. Just a handful more to go.\n\nYou:\n\n1. <span id=\"oneAct\">[[Look at the rest of this room|CryptAlter]]</span>/* oneAct */\n\\<</replace>><</link>>/* link replace Free her */\n\\</span>/* twoAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>>/* link replace choice Gag her */\n\\</span>/* twoAct, within levelTwo */\n2. <span id=\"twoAct\"><<link \"Kill her\">><<replace \"#levelTwo\">>2. Kill her\n\nYou dart across the room before the woman can finish her sentence. Her face barely as time to register surprise before your hands are on her neck. She lets out a hoarse, pained shout, and then you silence her forever. It takes only a second for the dim light of life to leave her eyes. You let her drop unceremoniously to the floor.<<set $dead += 1>><<set $thrallCrypt to \"dead\">>\n\nYou can smell blood start to leave her body, slowly, from where her head hit the edge of the altar. You still don't know if this was a thrall of Viscardi or just some unfortunate villager, but it really doesn't matter anymore.  She's dead now.<<set $thirst += 1>>\n\nYou:\n\n1. <span id=\"oneAct\">[[Turn to the rest of this room|CryptAlter]]</span>\n\\<</replace>><</link>>/* link replace choice Snap her neck */\n\\</span>/* oneAct, within LevelTwo */\n\\</span> /* level Two doesnt have a close span tag so I'm adding this in as an experiment */\n<</if>> /* closing if */",
      "links": [
        {
          "text": "Turn to the rest of this room",
          "destination": {
            "name": "CryptAlter",
            "pid": 12
          }
        },
        {
          "text": "Turning away",
          "destination": {
            "name": "CryptAlter",
            "pid": 12
          }
        },
        {
          "text": "Look at the rest of this room",
          "destination": {
            "name": "CryptAlter",
            "pid": 12
          }
        },
        {
          "text": "Leave",
          "destination": {
            "name": "CryptSide",
            "pid": 11
          }
        },
        {
          "text": "\"\\\"Sorry, I'll go\\\"\"",
          "destination": {
            "name": "CryptSide",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "SecretHallway",
      "text": "<<if $direction is \"in\">>The tunnel behind the tapestry stretches out in front of you, so dim even you can hardly see the bracers set against the wall and roof every few feet. You step forward cautiously, but there's nothing to see. The tunnel just goes on... and on... and on....\n\nAfter a few minutes, you finally see a side tunnel that branches off. In fact, there's several of them - and they don't look finished. It looks like someone has been working - slowly - to expand the tunnels down here. Some of them are only a few feet deep, with loose rocks cluttering the bottom.\n\n<<if $thrallTunnel is \"docile\">>You can hear faint noises coming from somewhere nearby, in one of the unfinished tunnels. \n<<else>>One of the unfinished tunnels is deeper than the rest, and you can't see what lies at the end. \n<</if>>The main tunnel also turns sharply in a different direction, towards where you know Viscardi's mansion is. \n<<else>>There's a cluster of half-dug tunnels in this section of the underground complex<<if $thrallTunnel isnot \"docile\">>, down one of which lies the body of what used to be one of Viscardi's thralls<</if>>. The two main tunnels here lead either back out to the church catacombs, and out of the underground complex, or deeper into it.\n<</if>>\nYou:\n\n1. <span id=\"oneAct\">[[Go deeper into the tunnels|Crossroads][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Check out the unfinished tunnels|UnfinishedHallway]]</span>\n3. <span id=\"threeAct\">[[Head towards the church catacombs|CryptAlter][$direction to \"out\"]]</span>",
      "links": [
        {
          "text": "Go deeper into the tunnels",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "Check out the unfinished tunnels",
          "destination": {
            "name": "UnfinishedHallway",
            "pid": 15
          }
        },
        {
          "text": "Head towards the church catacombs",
          "destination": {
            "name": "CryptAlter",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "UnfinishedHallway",
      "text": "<<if $thrallTunnel is \"docile\" or $thrallTunnel is \"alert\">>You poke your head into the first of the unfinished tunnels. There's nothing noteworthy here, besides a rusted old pickaxe that's probably useless now. You move onto the next unfinished tunnel, and see the shadowy outline of a man. <<if $thrallTunnel is \"alert\">>He's staring at you.<</if>>\n\nYou take a quick step back in shock<<if $thrallTunnel is \"docile\">>, but he doesn't seem to have noticed you. This is definitely a thrall, you think to yourself, weak and malnourished in Viscardi's care. You:<<else>>. His eyes follow you, but he makes no attempt to move or to call out. He looks weak, weaker than the woman before did. Definitely one of Viscardi's thralls.\n\nYou:<</if>>\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Gag him\">><<replace \"#levelOne\">>1. Gag him\n\nYou take two quick steps forward<<if $thrallTunnel is \"alert\">>, faster than the thrall can blink,<</if>> and clamp your hand down across his mouth, stopping him from making any noise. The thrall struggles weakly against you, but you hardly notice it.\n\nAt this point, it's a simple matter to:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Free him\">><<replace \"#levelTwo\">>1. Free him\n\nYou draw a knife across one of your fingers, letting your vampiric blood drip into the thrall's mouth. You can see him staring at you for a moment in pure fear. Then the effect starts, and his eyes go dull, and the man's body goes limp.\n\nYou set him, slowly, onto the floor. <<if $freed is 0>>Your first freed thrall. He's unconscious, now, but in an hour or so he'll wake up with his own mind again. The feeling is exhilarating.\n\n<</if>>There's nothing else to do here now. You spare the new man one last look, and then:<<set $freed += 1>><<set $thrallTunnel to \"freed\">>\n\n1. <span id=\"oneAct\">[[Head deeper into Viscardi's lair|Crossroads][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Head back to the altar room|CryptAlter][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free him, in levelTwo */\n\\</span> /* oneAct in Gag him */\n2. <span id=\"twoAct\"><<link \"Bite him\">><<replace \"#levelTwo\">>2. Bite him\n\nYou sink your fangs into the man's neck, and instantly he stops struggling. Viscardi has his thralls well trained, after all. The thought would disgust you, if the taste of fresh blood wasn't so intoxicating.\n\n<<if $firstBite is \"no\">>Wil never let you drink from living specimens, and now you can understand why. A vampire could get used to this. The sensation overwhelms you, and you almost lose track of what you're doing. You only have moments to:<<else>>The sensation of blood flowing into you is just as overwhelming as it was the first time. How Wil manages to be such a pacifist, you'll never understand - you love this. Having a ready stock of submissive thralls must be wonderful.\n\nThe moment you have that thought, you:<</if>>\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Drain him dry\">><<replace \"#levelThree\">>1. Drain him dry\n\n<<if $firstBite is \"yes\">>It doesn't take you as long as you expected at all. One moment, his blood is draining away, filling you with warmth - and the next, his body is cold and lifeless. You let it fall unceremoniously to the floor.<<else>>It doesn't take very long for his blood to drain entirely. When his body is empty, you let it fall away from you.<</if>> Then you wipe the spilt blood off of your chin.<<$set $firstBite to \"yes\">><<set $dead =+ 1>><<set $thrallTunnel to \"dead\">>\n\nThere's nothing else you can get here. You turn away without a second thought, and head:\n\n1. <span id=\"oneAct\">[[Deeper into Viscardi's lair|Crossroads][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Back to the altar room|CryptAlter][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Drain him */\n\\</span> /* oneAct in Bite him */\n2. <span id=\"twoAct\"><<link \"Stop yourself\">><<replace \"#levelThree\">>2. Stop yourself\n\nYou pull yourself back with a jerk. You can see fresh wound on the thrall's neck, one among others, still bleeding, and you feel disgusted with yourself.<<set $firstBite to \"yes\">>\n\nThe man's hardly managing to stand now. You swipe a knife against your skin to draw your own blood, and drip it into his gaping mouth before he realizes the feeding is over. You can't even tell when he drops to unconsciousness. You just lower him slowly to the floor.<<if $freed is 0>>\n\nYour first freed thrall. It feels right, and good. You should try to focus on that feeling more often.<</if>><<set $freed += 1>><<set $thrallTunnel to \"freed\">> After a moment, you turn away, and:\n\n1. <span id=\"oneAct\">[[Go deeper into Viscardi's lair|Crossroads][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Head back to the altar room|CryptAlter][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Stop */\n\\</span> /* twoAct in Bite him */\n\\</span> /* levelThree, in Bite him */\n\\<</replace>><</link>> /* link replace Bite him, in levelTwo */\n\\</span> /* twoAct in Gag him */\n\\</span> /* levelTwo, after Gag him */\n\\<</replace>><</link>> /* Link replace Gag him */\n\\</span> /* oneAct in levelOne */\n2. <span id=\"twoAct\"><<link \"Kill him\">><<replace \"#levelOne\">>2. Kill him\n\nThere's no point in hesitating. <<if $thrall is \"alert\">>In the brief moment it takes you to draw your blade and run it through this man's gut, his only reaction is to widen his eyes, and begin to open his mouth.<<else>>The man doesn't even know you're there as you draw your blade, and bury it in his gut.<</if>> In a second, he's dead.<<set $dead += 1>><<set $thrallTunnel to \"dead\">><<set $thirst += 1>>\n\nYou let the thrall's body fall limply. Your blade is now covered in blood, which you clean off while contemplating what to do next. Eventually, you decide to:\n\n1. <span id=\"oneAct\">[[Head deeper into the lair|Crossroads][$direction to \"in\"]]</span> /* oneAct in Kill him */\n2. <span id=\"twoAct\">[[Head back to the altar room|CryptAlter][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* Link replace Kill him */\n\\</span> /* twoAct in levelOne */\n<<if $thrallTunnel is \"docile\">><<else>>3. <span id=\"threeAct\">[[Ignore him and move on|Crossroads]]</span> /* threeAct in levelOne */\n<</if>>\n</span> /* levelOne */\n<<else>>A series of partially-dug tunnels start in this corner of the lair, each abandoned after several feet of work. In one, you see <<if $thrallTunnel is \"dead\">>the cold body of the man who used to be Viscardi's thrall, lifeless on the ground.<<else>>the unconscious man you freed from Viscardi's control earlier, lying on the floor. He's still, but for a slight rise and fall of his chest as he breathes.<</if>> There's nothing else of note.\n\nYou go:\n\n1. <span id=\"oneAct\">[[Deeper into Viscardi's lair|Crossroads][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Back to the church catacombs|CryptAlter][$direction to \"out\"]]</span>\n<</if>>",
      "links": [
        {
          "text": "Head deeper into Viscardi's lair",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "Head back to the altar room",
          "destination": {
            "name": "CryptAlter",
            "pid": 12
          }
        },
        {
          "text": "Deeper into Viscardi's lair",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "Back to the altar room",
          "destination": {
            "name": "CryptAlter",
            "pid": 12
          }
        },
        {
          "text": "Go deeper into Viscardi's lair",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "Head deeper into the lair",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "Ignore him and move on",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "Back to the church catacombs",
          "destination": {
            "name": "CryptAlter",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "Crossroads",
      "text": "After a short while travelling through the tunnels of this lair, you reach a four-way intersection.\n\nThe south tunnel leads back to the catacombs underneath the church crypt. <<if $crossroadsFirst is 1>>\\\n<<if $quarters is 1>>The west tunnel leads to the thrall quarters. <<else>>The west tunnel leads somewhere boring, probably. <</if>>\\\n<<if $maze is 1>>The north tunnel leads to Viscardi's crypt. <<else>>The north tunnel seems to lead somewhere darker. <</if>>\\\n<<if $dungeon is 1>>The east tunnel leads to the lair dungeon. <<else>>The east tunnel leads to somewhere bad-smelling. <</if>>\\\n<<else>><<set $crossroadsFirst to 1>>The other three tunnels look almost entirely identical. You can see hints of light coming from the east and west tunnels, but no indication of where any of these might lead. You take a moment to sniff the air. The east tunnel smells the worst, and the west tunnel smells the least of death. You try to taste the air, but you're not a snake.<</if>>\n\nYou shrug, and:\n\n1. <span id=\"oneAct\">[[Go west|QuartersTunnel][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Go north|BossMaze][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go east|DungeonTunnel][$direction to \"in\"]]</span>\n4. <span id=\"fourAct\">[[Go south|SecretHallway][$direction to \"out\"]]</span>\n<<if $thrallBoss is \"freed\" and $freed > 4>><<set $win to \"yes\">><<set $winFree to \"yes\">><</if>><<set $springTrap to 0>>",
      "links": [
        {
          "text": "Go west",
          "destination": {
            "name": "QuartersTunnel",
            "pid": 17
          }
        },
        {
          "text": "Go north",
          "destination": {
            "name": "BossMaze",
            "pid": 19
          }
        },
        {
          "text": "Go east",
          "destination": {
            "name": "DungeonTunnel",
            "pid": 18
          }
        },
        {
          "text": "Go south",
          "destination": {
            "name": "SecretHallway",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "QuartersTunnel",
      "text": "The tunnel here is well-maintained and orderly - almost clean. You can see the faint tracks of hundreds of footprints along the floor. The thralls probably use this section of the lair quite frequently.\n\nThis hallway leads into three different direction. One is the path you just came from. <<if $direction is \"out\">>Another leads to the central crossroad of Viscardi's lair. The third is a small side tunnel.<<else>>You're not sure where the other two lead, though one seems to be a small side tunnel.<</if>>\n\nYou go down:\n<<if $direction is \"in\">>\n1. <span id=\"oneAct\">[[The tunnel in front of you|QuartersCrossroads]]</span>\n2. <span id=\"twoAct\">[[The small side tunnel|QuartersDeadEnd]]</span>\n3. <span id=\"threeAct\">[[The tunnel behind you|Crossroads]]</span>\n<<else>>\n1. <span id=\"oneAct\">[[The tunnel in front of you|Crossroads]]</span>\n2. <span id=\"twoAct\">[[The small side tunnel|QuartersDeadEnd]]</span>\n3. <span id=\"threeAct\">[[The tunnel behind you|QuartersCrossroads][$direction to \"in\"]]</span><</if>>",
      "links": [
        {
          "text": "The tunnel in front of you",
          "destination": {
            "name": "QuartersCrossroads",
            "pid": 21
          }
        },
        {
          "text": "The small side tunnel",
          "destination": {
            "name": "QuartersDeadEnd",
            "pid": 20
          }
        },
        {
          "text": "The tunnel behind you",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "The tunnel in front of you",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "The tunnel behind you",
          "destination": {
            "name": "QuartersCrossroads",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "DungeonTunnel",
      "text": "<<if $direction is \"in\">>You head down the east tunnel and the foul smell grows stronger and stronger. <<if $dungeon is 0>>You can't identify it exactly, but something about the smell is uncomfortably familiar. This whole place is uncomfortably familiar - you don't let that deter you.\n\nAfter a couple of minutes of walking, you notice an imperfection in the side of the tunnel wall. It looks like a small crack at first, but as you get closer you realize its a disguised doorway. A piece of cloth has been dyed and textured to drape over a slim opening in the wall, covering it from view.<<elseif $dungeon is 1>> You recognize it now as human waste and decay, mixed with a scent of tainted blood and terror. The dungeons. You might remember your original time there, if you didn't force yourself to think about something else every time the memory began to surface. At least now, you come in a position of power.\n\nAfter a couple of minutes of walking, you reach the hidden side tunnel.<</if>> You:\n\n1. <span id=\"oneAct\">[[Continue down the main tunnel|DungeonTrap][$springTrap to 1]]</span>\n2. <span id=\"twoAct\">[[Check out this hidden tunnel|DungeonTrap]]</span>\n3. <span id=\"threeAct\">[[Head back|Crossroads]]</span>\n<<elseif $direction is \"out\">><<if $springTrap is 1>><<if $dungeonTrap is 1>>You continue down the main tunnel, watching for the subtle mark that indicates the beginning of the false floor. Once you reach it you pause, and take a short running leap to clear the trap. It's not much further before you reach:\n\n1. <span id=\"oneAct\">[[The main lair intersection|Crossroads]]</span><<elseif $dungeonTrap is 0>>You continue down the main tunnel, waiting for the stench of death to leave your nostrils. It lingers in this tunnel, in this whole lair really. There's probably no avoiding it, with a master like Viscardi running the-\n\nYour footing slips, and you fall.<<set $dungeonTrap to 1>><<set $wound += 1>>\n\nYou feel your body slip forward and down and it's so sudden, you actually don't have any time to react to it. You try reaching for the rocky ground but it slips away beneath you, dropping you into a ten foot pit. There's a sharp pain in one leg. You hear a mechanical squeak, and then the floor snaps back into place, above you, trapping you here.\n\nIt's so dark that even with your enhanced sight, you have to reach around you understand where you are, and the first thing your hand touches is a bone. And then another. Human bones littering the ground beneath you. Some of them still have bits of flesh clinging on. You have to pull a snapped bone out of your leg, where it had lodged itself as you fell onto the pile.\n\nIt takes you about a half hour to find the mechanism that releases the false floor, and to pry it open so you can climb out. Vampire blood is dripping out of your wounded leg, and you tear off a strip of your coat to tie a bandage. You can see now a slight seam in the floor, between true stone and the well disguised mimic. You make note of it, before you stand back up, and go:\n\n1. <span id=\"oneAct\">[[As far away from the dungeon as you can|Crossroads]]</span>\n<</if>><<else $springTrap is 0>>You duck into the secret path off of the main tunnel. The walls tighten around you but you're able to traverse the path with no issue, until it finally dumps you back out into the main tunnel, so you can:\n\n1. <span id=\"oneAct\">[[Explore the lair further|Crossroads]]</span>\n\\<</if>>\n\\<</if>>",
      "links": [
        {
          "text": "Continue down the main tunnel",
          "destination": {
            "name": "DungeonTrap",
            "pid": 25
          }
        },
        {
          "text": "Check out this hidden tunnel",
          "destination": {
            "name": "DungeonTrap",
            "pid": 25
          }
        },
        {
          "text": "Head back",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "The main lair intersection",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "As far away from the dungeon as you can",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        },
        {
          "text": "Explore the lair further",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "BossMaze",
      "text": "<<if $direction is \"in\">><<if $this is 1>>The first few twists and turns of the maze are fairly easy to navigate, but the lair changes noticeably when it officially turns into a maze. <<else>><<set $this to 1>>The tunnel leads directly north for a while, then takes a sharp turn, and then another, and then another. It splits off into two tunnels, but one you quickly realize is a dead end. Then the full tunnel splits off again, and again.\n\nIt's a maze, you quickly realize.\n\nA normal human might already be lost but you can still sense which direction is north. North to Viscardi's mansion, and presumably the family crypt where he sleeps underneath.\n\n<</if>>You reach another four-way intersection. The rest of the lair behind you is to the south. North<<if $mazeTrap1 is 1>> takes you to the falling rock trap, which has already been set off but you might not want to visit it again<<else>>, presumably, is where you want to go, unless this maze is designed to take you there indirectly<</if>>. You can't tell where east or west take you - they smell and look the same. \n\\<<elseif $direction is \"out\">>You finally reach the last four-way intersection, the one that marks the entrance of the maze. Ahead of you, to the south, is the tunnel that takes you to the other areas of Viscardi's lair. Behind you, the tunnels go deeper into the maze.\n\n<</if>>You go:\n\n1. <span id=\"oneAct\">[[North|FirstTrap][$springTrap to 1]]</span>\n2. <span id=\"twoAct\">[[East|RedHerring][$redHerring to 1]]</span>\n3. <span id=\"threeAct\">[[West|SideTunnel][$direction is \"in\"]]</span>\n4. <span id=\"fourAct\">[[South|Crossroads]]</span>",
      "links": [
        {
          "text": "North",
          "destination": {
            "name": "FirstTrap",
            "pid": 35
          }
        },
        {
          "text": "East",
          "destination": {
            "name": "RedHerring",
            "pid": 41
          }
        },
        {
          "text": "West",
          "destination": {
            "name": "SideTunnel",
            "pid": 39
          }
        },
        {
          "text": "South",
          "destination": {
            "name": "Crossroads",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "QuartersDeadEnd",
      "text": "You check the small side tunnel for any signs of life. No thralls here.\n\nYou do see some food waste, however. An apple core that has started to rot, and a small cloth stained with oil. Someone, probably a thrall, was hanging out here at one point, but you can't fathom why. It doesn't look like there are plans to dig this tunnel further.\n\n<<if $thrallQuarters is \"docile\">>You stop for a moment to listen, and realize you can hear a sound nearby. It's faint, but it's coming from further down the main tunnel. <</if>>You turn around, and:\n\n1. <span id=\"oneAct\">[[Head back to the main tunnel|QuartersTunnel]]</span>",
      "links": [
        {
          "text": "Head back to the main tunnel",
          "destination": {
            "name": "QuartersTunnel",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "QuartersCrossroads",
      "text": "<<if $direction is \"in\">>You continue down the main tunnel, and before long reach what you can only think of as a large underground room. The ceiling is almost ten feet above you, there's a door set in the opposite wall, and throughout this room are scattered pieces of run down furniture.\n\nYou vaguely recall this as the thrall living area, and the memory of it leaves a bad taste in your mouth. Scarcely better than living in cages - and Viscardi made sure you knew what that was like, too.\n\n<<if $thrallQuartersLocation is \"alert\">>The <<if $thrallQuarters is \"dead\">>body of the thrall you met here still lies in a heap on the floor, dead.<<else>>woman you freed from Viscardi's control still lies unconscious on the floor. <</if>><<else>>On the other side of that door is the quarters proper, where the thralls sleep and eat when not set on watch. <<if $thrallQuarters is \"docile\">>There's a faint sound coming from behind the door, like someone moving around.<</if>> Viscardi probably has a thrall or two watching this area even now. There's another tunnel to your right which is new; you have no idea where it leads, but it smells awful. <</if>>You:\n\n<<if $thrallQuarters is \"docile\">>1. <span id=\"oneAct\">[[Go through the door|QuartersThrall]]</span><<else>>1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters]]</span><</if>>\n2. <span id=\"twoAct\">[[Go down the side tunnel|QuartersDeadend2]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n<<else>>You're back out in the front room of the living area. Across from you the main tunnel connects this area to the rest of the lair. To the left of that is a side tunnel, which smells of human refuse. <<if $thrallQuartersLocation is \"alert\">>The <<if $thrallQuarters is \"dead\">>body of the thrall you met here still lies in a heap on the floor, dead.<<else>>woman you freed from Viscardi's control still lies unconscious on the floor.<</if>> Every few feet sits another random piece of furniture; a  half broken table, an empty bedframe, the shattered remains of an oil lantern. Viscardi hasn't bothered to order anyone to clean up recently, you guess.<</if>>\n\nYou shake your head, and:\n\n1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters]]</span>\n2. <span id=\"twoAct\">[[Go down the side tunnel|QuartersDeadend2]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n<</if>>",
      "links": [
        {
          "text": "Go through the door",
          "destination": {
            "name": "QuartersThrall",
            "pid": 24
          }
        },
        {
          "text": "Go through the door",
          "destination": {
            "name": "ThrallQuarters",
            "pid": 23
          }
        },
        {
          "text": "Go down the side tunnel",
          "destination": {
            "name": "QuartersDeadend2",
            "pid": 22
          }
        },
        {
          "text": "Go back down the main tunnel",
          "destination": {
            "name": "QuartersTunnel",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "QuartersDeadend2",
      "text": "You head up the north passage, but after a sharp turn to the left the tunnel becomes a dead end. There's nothing up here but human waste. The stink of it hits you way before you could tell what you're looking at.\n\nEven if there was anything else to see up here, you wouldn't want to stick around for long. You cover your nose, and:<<if $thrallQuarters is \"docile\">><<set $thrallQuarters to \"alert\">>\n\n1. <span id=\"oneAct\">[[Go back|QuartersAlert]]</span><<else>>\n\n1. <span id=\"oneAct\">[[Go back|QuartersCrossroads][$direction to \"out\"]]</span><</if>>",
      "links": [
        {
          "text": "Go back",
          "destination": {
            "name": "QuartersAlert",
            "pid": 49
          }
        },
        {
          "text": "Go back",
          "destination": {
            "name": "QuartersCrossroads",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "ThrallQuarters",
      "text": "<<set $quarters to 1>><<if $thrallQuarters is \"docile\">>The room you've walked into should be large, but the ceiling is barely two feet above your head, and the space is cluttered with cots, cooking supplies, various makeshift storage containers, and excavation equipment. There's hardly space to walk among everything.\n\nIf you try to go anywhere further into the room, however, you'll definitely catch the attention of the women by the cookie supplies. Your only real option in this case is to:\n\n1. <span id=\"oneAct\">[[Deal with her|QuartersThrall][$comeOn to 1]]</span>\n\n<<else>>The room you walked into is cramped, for being as large as it is. There are a few rows of cots, seven to be exact, and the most meager looking cooking space you've ever seen. Until recently, a thrall had been cleaning off a collection of bowls and eating utensils. Now that thrall lies <<if $thrallQuartersLocation is \"alert\">>in the room outside<<else>>on the floor just a few feet away<</if>>. Though <<if $thrallQuarters is \"dead\">>of course she's dead<<elseif $thrallQuarters is \"freed\">>she's no longer a thrall anymore<</if>>.\n\nYou could try rifling through the thrall's few personal possessions, but just being in this room leaves a bad taste in your mouth. Besides, there's be nothing useful there. Viscardi doesn't let his thralls keep useful things, and you have a different mission anyways. You glance around one last time, and:\n\n1. <span id=\"oneAct\">[[Back out|QuartersCrossroads][$direction to \"out\"]]</span>\n<</if>>\n",
      "links": [
        {
          "text": "Deal with her",
          "destination": {
            "name": "QuartersThrall",
            "pid": 24
          }
        },
        {
          "text": "Back out",
          "destination": {
            "name": "QuartersCrossroads",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "QuartersThrall",
      "text": "<<if $comeOn is 1>>The woman hasn't noticed you yet. She finishes whichever dish she was working on and adds it to a stack, and picks up the next dirty dish in the pile to clean. You:<<else>>You open the door as quietly as you can, which turns out to have been a good move, because a woman stands not five feet away from you, her back to the door. You freeze for an instant, but it doesn't seem like she's noticed you. You:<</if>>\n\n<span id=\"levelOne\">1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]\n\\</span> /* oneAct in levelOne */\n2. <span id=\"twoAct\"><<link \"Sneak up behind her\">><<replace \"#levelOne\">>2. Sneak up behind her\n\nWalking as quietly as you can, which is pretty much silent, you move closer to the woman. She's standing by a deep basin full of water, and scrubbing grime out of a stack of bowls. Another one of Viscardi's thralls. Every so often she grunts, almost like humming. Timing your movements so the thrall's grunting will mask any noise you make, you reach forward, and:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Bite her\">><<replace \"#levelTwo\">>1. Bite her<<set $thirst to 0>>\n\nYour fangs sink into the thrall's flesh without any resistance. It's not just that her muscles are soft either; the thrall flinches the barest amount at contact with your teeth, and then she doesn't move at all. It's almost like your touch paralyzed her, but your experience with Viscardi tells you that's probably not the case. He likes to keep his thrall's pliant and submissive.\n\n<<if $firstBite is \"no\">>You don't have much time to think of that, however, because then the taste of the thrall's blood hits you and it's nothing if not overwhelming. Wil let you drink blood of course, she wasn't a monster, but it was always donated or scavenged off a new dead body. Living blood from a living host... it's intoxicating. This is what your vampire body was truly made to consume. You drink without thinking about it, until there are just moments left to:<<else>>Being on this end of things now is an unpleasant thought, but you drink deep anyways. The blood will sustain you until you can deal with Viscardi, at least. You drink deeply, and:<</if>>\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Drain her blood\">><<replace \"#levelThree\">>1. Drain her blood\n\n<<if $firstBite is \"no\">>It doesn't take as long as you would expect. One moment the woman is letting you drink her blood, letting you kill her, and the next... you've done it. You've killed her. She collapses in a heap on the floor. You step back away from her, and then you clean the smeared blood off of your face.<<else>>It doesn't take long until you've drunken the very strength out of this thrall, and she collapses to the floor beneath you. You don't think of yourself as a messy eater, but there's blood smeared across your face somehow anyways. You clean yourself up as best you can.<</if>><<set $thrallQuarters to \"dead\">><<set $dead += 1>><<set $firstBite to \"yes\">>\n\nThe room looks empty besides her, but just to make sure you:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n\\<</replace>><</link>> /* link replace Drain her blood\n\\</span> /* oneAct in levelThree */\n2. <span id=\"twoAct\"><<link \"Stop yourself from killing her\">><<replace \"#levelThree\">>2. Stop yourself from killing her\n\nYou pull yourself back but just barely. The thrall is still alive for now, but you realize you probably took too much. She won't survive for long, At least not the way she is now.\n\nYou draw out your blade and cut a painful stripe across a hand, the way Wil showed you, to get draw your own blood. Before the woozy thrall can faint you cover her mouth with your bloody palm. The blood doesn't take long to act. As soon as it hits her system she falls unconscious, into your waiting arm, and you lower her down to the floor. You just need her breathing to even out, her heart rate to slow to a steady pulse, and... there. She won't wake up alive, but she will wake up.<<set $thrallQuarters to \"freed\">><<set $freed += 1>><<set $firstBite to \"yes\">>\n\nYou leave her unconscious body on the ground by her workstation. She can try to figure out what to do with herself when she wakes up. For now, you:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n\\<</replace>><</link>> /* link replace Stop yourself from killing her */\n\\</span> /* twoAct in levelThree */\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Bite her */\n\\</span> /* oneAct in levelTwo */\n2. <span id=\"twoAct\"><<link \"Feed her your blood\">><<replace \"#levelTwo\">>2. Feed her your blood\n\nYou draw your blade from your side and cut a painful stripe down the palm of one hand. Wil showed you all you needed to do to free a vampire's thrall weeks ago, and the wound it leaves you will heal in just a few minutes anyway.\n\nThe thrall reacts as your arm snakes around her head to clamp over her mouth, but she doesn't react fast enough. She pushes at your arm, at your chest, trying fruitlessly to struggle free from your grasp. You don't have to hold her for very long either; the blood hits her system within seconds, and before the minute is up she's lost consciousness.\n\nYou lower her gently to the floor while listening to her breathing and heart rate. They both slow, way down, but neither stop. She's still breathing. She'll live, in an undead sense of the word.<<set $thrallQuarters to \"freed\">><<set $freed += 1>>\n\nYou leave her body lying on the ground where it was, and stand up. Your hand already feels a bit better. You replace your blade back in its sheath, and:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n\\<</replace>><</link>> /* link replace Feed her your blood */\n\\</span> /* twoAct in levelTwo */\n3. <span id=\"threeAct\"><<link \"Kill her\">><<replace \"#levelTwo\">>3. Kill her\n\nYou miss the timing by a second, so the sound of your blade scraping against the metal of its sheath is actually audible. The thrall freezes, and begins to turn to see who's behind her. Your only choice is to act fast and jam your blade into her spinal cord.\n\nYou can't actually tell if she dies instantly, but it's close enough. She crumples lifeless to the ground, almost anticlimactically, spilling her lifeblood uselessly out on the floor. It's such a waste, you think as you sheath your blade again. But at least that's one less thrall under Viscardi's command. You wonder if he can feel their lives leaving him, while he sleeps.<<set $thrallQuarters to \"dead\">><<set $dead += 1>><<set $thirst += 1>>\n\nYou're pretty sure she was the only one here, but just in case, you:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n\\<</replace>><</link>> /* link replace Kill her */\n\\</span> /* threeAct in levelTwo */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Sneak up behind her */\n\\</span> /* twoAct in levelOne */\n\\</span> /* levelOne */",
      "links": [
        {
          "text": "Examine the room",
          "destination": {
            "name": "ThrallQuarters",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "DungeonTrap",
      "text": "<<if $direction is \"in\">>\n\\<<if $springTrap is 1>>\n\\<<if $dungeonTrap is 1>>You continue down the main path towards the dungeon, smelling as the tunnel grows more and more rank as you go. You watch for the subtle mark that indicates the beginning of the false floor. When you reach it, you take a brief pause, and then a short running leap over the trap to the other side. From there, it's a quick walk to:\n\n1. <span id=\"oneAct\">[[The lair dungeon|Dungeon]]</span><<elseif $dungeonTrap is 0>>You continue down the main tunnel, smelling the stench of despair grow as you walk. It lingers on these tunnel walls, and in this whole lair really. There's probably no avoiding it, with a master like Viscardi running the-\n\nYour footing slips, and you fall.<<set $dungeonTrap to 1>><<set $wound += 1>>\n\nYou feel your body slip forward and down and it's so sudden, you actually don't have any time to react to it. You try reaching for the rocky ground but it slips away beneath you, dropping you into a ten foot pit. There's a sharp pain in one leg. You hear a mechanical squeak, and then the floor snaps back into place, above you, trapping you here.\n\nIt's so dark that even with your enhanced sight, you have to reach around you understand where you are, and the first thing your hand touches is a bone. And then another. Human bones littering the ground beneath you. Some of them still have bits of flesh clinging on. You have to pull a snapped bone out of your leg, where it had lodged itself as you fell onto the pile.\n\nIt takes you about a half hour to find the mechanism that releases the false floor, and to pry it open so you can climb out. Vampire blood is dripping out of your wounded leg, and you tear off a strip of your coat to tie a bandage. You can see now a slight seam in the floor, between true stone and the well disguised mimic. You make note of it, before you stand back up, and continue:\n\n1. <<if $dungeon is 1>><span id=\"oneAct>[[Deeper into Viscardi's lair|Dungeon]]</span>\n<<else>><span id=\"oneAct\">[[Deeper into Viscardi's lair|DungeonThrall]]</span><</if>><</if>><<elseif $springTrap is 0>>This side tunnel is much smaller than the main tunnel was; you can reach out to both sides and touch the walls as you walk. But it's wide enough to walk, at least, and so you continue down.\n\nAfter a few minutes, it spills back into a main tunnel. It looks like the same tunnel you were in moments ago, you think. You:\n\n<<if $dungeon is 1>>1. <span id=\"oneAct\">[[Continue heading forward|Dungeon]]</span>\n<<else>>1. <span id=\"oneAct\">[[Continue heading forward|DungeonThrall]]</span><</if>><</if>><<elseif $direction is \"out\">><<if $dungeonTrap is 1>>On your way out of the dungeons, you see the spot where the hidden side tunnel connects, giving the thralls who know these tunnels a way around the trapped floor. You could probably avoid the trap now that you know how it works, though the side tunnel might be easier either way. You consider it a moment, then decide to:\n\n1. <span id=\"oneAct\">[[Use the main tunnel|DungeonTunnel][$springTrap to 1]]</span>\n2. <span id=\"twoAct\">[[Use the side tunnel|DungeonTunnel]]</span>\n<<elseif $dungeonTrap is 0>>On your way our of the dungeons, you see the spot where the hidden side tunnel connects to the main route. You never figured out what it was there for, but it worked well enough for you the first time. You consider it for a moment, then decide to:\n\n1. <span id=\"oneAct\">[[Continue down the main tunnel|DungeonTunnel][$springTrap to 1]]</span>\n2. <span id=\"twoAct\">[[Go through the side tunnel|DungeonTunnel]]</span><</if>><</if>>",
      "links": [
        {
          "text": "The lair dungeon",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        },
        {
          "text": "Deeper into Viscardi's lair",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        },
        {
          "text": "Deeper into Viscardi's lair",
          "destination": {
            "name": "DungeonThrall",
            "pid": 27
          }
        },
        {
          "text": "Continue heading forward",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        },
        {
          "text": "Continue heading forward",
          "destination": {
            "name": "DungeonThrall",
            "pid": 27
          }
        },
        {
          "text": "Use the main tunnel",
          "destination": {
            "name": "DungeonTunnel",
            "pid": 18
          }
        },
        {
          "text": "Use the side tunnel",
          "destination": {
            "name": "DungeonTunnel",
            "pid": 18
          }
        },
        {
          "text": "Continue down the main tunnel",
          "destination": {
            "name": "DungeonTunnel",
            "pid": 18
          }
        },
        {
          "text": "Go through the side tunnel",
          "destination": {
            "name": "DungeonTunnel",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "Dungeon",
      "text": "<<set $dungeon to 1>>The dungeon in Viscardi's lair is a large room, larger than<<if $quarters is 1>> the thrall living quarters<<else>> anything else you've seen down here<</if>>. There's two exits, a row of prisoner cages, and various implements of torture scattered around the room.\n\nNext to the main door, where you first entered, is a brazier with coals. Hanging on the wall behind it are a series of fire pokers and branding tools. Not the best sight.\n\nFurther down the room a series of chains hang limply from the wall. There are a lot of them, and you'll have to get closer to inspect them better.\n\nThere's the other exit, <<if $prisoners is \"trusting\">>the one the prisoners said led out into the forest, where they were dragged in from.<<else>>which you'll have to check out to see where it leads.<</if>> That door is smaller, but there's a keyhole right above the handle.\n\nAnd then there are the prisoner cages. <<if $prisonersLocation is \"cage\">><<if $prisoners is \"afraid\">>The two prisoners still huddle inside, watching you with frightened eyes. You've already moved on from them. You:\n\n1. <span id=\"oneAct\">[[Go out the smaller door|ForestDoor][$prisonersLocation to \"trap\"]]</span>\n2. <span id=\"twoAct\">[[Check out the chains|DungeonChains]]</span>\n3. <span id=\"threeAct\">[[Go back out the main door|DungeonTrap][$prisonersLocation to \"forest\"]]</span>\n<<else>>The two prisoners are huddled together in whispered conversation just outside the cages, sticking close and not venturing far. They glance at the body that used to be Viscardi's thrall from time to time, but haven't bothered to inspect it. <<if $thrallForest isnot \"docile\">>You:\n\n1. <span id=\"oneAct\">[[Talk to the prisoners|DungeonPrisoners]]</span>\n2. <span id=\"twoAct\">[[Go back through Viscardi's lair|DungeonTrap][$direction to \"out\"]]</span>\n3. <span id=\"threeAct\">[[Go back to the forest exit|ForestDoor][$direction to \"in\"]]</span>\n<<else>>You're glad for that.\n\nYou can't really do anything for them right now, so you just:\n\n1. <span id=\"oneAct\">[[Go out the smaller door|ForestDoor][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Check out the chains|DungeonChains]]</span>\n3. <span id=\"threeAct\">[[Go back out the main door|DungeonTrap][$direction to \"out\"]]</span><</if>><</if>><<elseif $prisonersLocation is \"oneDead\">>The woman is crying silently, staring at the body of the man in the next cage over. You almost want to go get rid of her, just to ease her misery, but you've got too much to do before this day is over.\n\nYou:\n\n1. <span id=\"oneAct\">[[Go out the smaller door|ForestDoor][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Check out the chains|DungeonChains]]</span>\n3. <span id=\"threeAct\">[[Go back out the main door|DungeonTrap][$direction to \"out\"]]</span><<elseif $prisonersLocation is \"twoDead\">>If they were outside, the bodies would have attracted some sort of animals by now, or at least insects. You wonder, once you've taken care of Viscardi, how well preserved these bodies will keep down here.\n\nIt's not enough of a thought to distract you for long. You:\n\n1. <span id=\"oneAct\">[[Go out the smaller door|ForestDoor][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Check out the chains|DungeonChains]]</span>\n3. <span id=\"threeAct\">[[Go back out the main door|DungeonTrap][$direction to \"out\"]]</span><<else>>The cage doors swing open, the locking mechanisms completely busted through. At least they got out of there, you think to yourself. That was the one thing you didn't plan for when you crawled into this hellhole initially.\n\nYou:\n\n1. <span id=\"oneAct\">[[Go out the smaller door|ForestDoor][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Check out the chains|DungeonChains]]</span>\n3. <span id=\"threeAct\">[[Go back out the main door|DungeonTrap][$direction to \"out\"]]</span><</if>>",
      "links": [
        {
          "text": "Go out the smaller door",
          "destination": {
            "name": "ForestDoor",
            "pid": 30
          }
        },
        {
          "text": "Check out the chains",
          "destination": {
            "name": "DungeonChains",
            "pid": 29
          }
        },
        {
          "text": "Go back out the main door",
          "destination": {
            "name": "DungeonTrap",
            "pid": 25
          }
        },
        {
          "text": "Talk to the prisoners",
          "destination": {
            "name": "DungeonPrisoners",
            "pid": 28
          }
        },
        {
          "text": "Go back through Viscardi's lair",
          "destination": {
            "name": "DungeonTrap",
            "pid": 25
          }
        },
        {
          "text": "Go back to the forest exit",
          "destination": {
            "name": "ForestDoor",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "DungeonThrall",
      "text": "At the end of the tunnel, you reach a door. It looks almost unremarkable, forcibly set into the stone, made of wood with crossing metal bracers, and the sight of it sets your heart racing. You'd forgotten about this room. You'd made yourself forget about this room.\n\nViscardi's dungeon. The place where he takes his captives before he turns them into thralls. If you don't remember your time here it's because even now you've buried the memory too deep to find.\n\nYou calm your nerves before opening the door. It squeaks horribly - the hinges have probably never been greased - and the smell of it hits you in a wave. Human waste and rot; burned wood and skin; blood, above all else, blood. You cover your nose with a hand, and squint, because the firelight also makes this room brighter than anything else you've seen down here.\n\nThe first thing to catch your eye are the cages. There's four of them, rusty and old and not large enough for a person to stand in. There's someone huddling at the bottom of two of them. It's an odd first thing to notice, considering the second thing you notice is a man standing in the center of the room, carrying what looks like a fire poker. The tip of it glows.\n\nHe stares at you as you stand in the doorway. \"You're not someone I recognize,\" he says, in that slightly disjointed way thralls have of speaking. He looks confused, and then he raises the poker at you. \"You're not supposed to be down here. But I can fix that.\"\n\nBefore you can try to answer him, he charges. You quickly:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Dodge the strike\">><<replace \"#levelOne\">>1. Dodge the strike\n\nYou jump to the side to dodge the strike, just inside this dungeon doorway, but as you do so your foot hits something you didn't expect to be there. A tall brazier filled with glowing coals - one of the sources of dim light in this room - crashes down on top of you. Most of the coals hit your clothes, but more than a few fall directly onto your skin. You roar in pain.<<set $wound += 1>>\n\nThe thrall seems a bit taken aback by this as well. He missed with him jab, but instead of striking at you again immediately, he looks at you in confusion first. That does nothing to calm your anger. In a fit of pure rage you:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Kill him\">><<replace \"#levelTwo\">>1. Kill him\n\nYou whip your blade out in a second and before the thrall can overcome his confusion, stab it directly into his chest. His confusion turns to shock, and your anger burns with satisfaction.<<set $thrallDungeon to \"dead\">><<set $dead += 1>><<set $prisoners to \"trusting\">>\n\nThe thrall's body falls off your blade onto a crumple in the ground, blood pooling out around him.<<set $thirst += 1>> He doesn't die immediately, but you can see the life leaving him as his blood does. You look away.\n\nAcross the room in the cages, the two prisoners stare out at you. They just watched you kill their guard, but you can't read the expressions on their gaunt faces. You:\n\n1. <span id=\"oneAct\">[[Walk over to them|DungeonPrisoners]]</span>\n\\<</replace>><</link>> /* link replace Kill him.1 */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Throw him into the ground\">><<replace \"#levelTwo\">>2. Throw him into the ground\n\nYou grab the thrall by the rags hanging from his neck, and toss him across the room from you. His expression goes from confusion to fear. He lands with a sickening crack just a few feet away from the cages, and as you stalk over to he groans, rolling over to cradle his head. He doesn't see you coming over, until you:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Feed on him\">><<replace \"#levelThree\">>1. Feed on him\n\nYou crouch over his body and sink your fangs into his neck, not bothering with being careful to hit the artery exactly right. Some of the blood ooze out and drips onto the floor, and from the cages several feet away you hear and audible gasp. You don't care.<<set $prisoners to \"afraid\">>\n\n<<if $firstBite is \"no\">>The sensation of drinking fresh blood for the first time in your life... it's like nothing you could have imagined. Wil only ever let you drink dead or donated blood. Compared to that, this... it's intoxicating. It's overwhelming. You forget all about the coal burns, about the ache in your muscles from crawling around the hellhole however long it's been. Your senses narrow to the taste of warm blood, until all that is left to do is:<<else>>The warm blood flooding into you is all you needed to forget the sting of the hot coals. It feels as if your skin is starting to heal already. The thrall prison guard stills, as you expected, and you allow yourself to feel a moment of pride in your own power before you:<</if>>\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Drain him\">><<replace \"#levelFour\">>1. Drain him\n\n<<if $firstBite is \"no\">>It happens a lot faster than you expected. One moment he was letting you drink from him, not even bothering to fight you off, and the next there was nothing left to fight. You pull your head back to look at him, and there is no life left in his eyes. He's dead.<<else>>It only takes a few moments before you suck the life completely out of his body. When there's nothing left to suck, you pull back, and clean the spilled blood off the sides of your face.<</if>><<set $thrallDungeon to \"dead\">><<set $dead += 1>><<set $firstBite to \"yes\">>\n\nNearby someone is sobbing. You look up, and see the two prisoners in their cages, huddled in the furthest back corners, watching you with fear. When you stand, they flinch back. You:\n\n1. <span id=\"oneAct\">[[Go look at them|DungeonPrisoners]]</span>\n\\<</replace>><</link>> /* link replace Drain him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Control yourself\">><<replace \"#levelFour\">>2. Control yourself\n\n<<if $firstBite is \"no\">>You jerk your head away in a sudden panic, and blood is getting everywhere it seems, but he's still alive. For now, the thrall is still alive.\n\nYou rip off a piece of his own rags to stop the bleeding, and while you hold it in place you cut your arm to get some of your own blood, as well. You feed it to him just like Wil showed you.<<else>>You don't actually want this thrall to die, though, so when you feel like you've had enough you pull back. The ragged wound on his neck still bleeds more than is safe, so you rip off a piece of his own rags to stop it with. When you're satisfied he's safe, you cut your arm to get some of your own blood, and feed it to him just like Wil showed you.<</if>> Well, maybe not exactly like she showed you.<<set $thrallDungeon to \"freed\">><<set $freed += 1>><<set $prisoners to \"trusting\">><<set $firstBite to \"yes\">>\n\nAfter a few moments his heart rate begins to even out again, and you notice an unfamiliar sound coming from nearby. It's one of the prisoners, several feet away from you, sobbing loudly. You look up and realize that they've been watching you this whole time, staring at you in fear. You stand, and:\n\n1. <span id=\"oneAct\">[[Go over to them|DungeonPrisoners]]</span>\n\\<</replace>><</link>> /* link replace Control yourself */\n\\</span> /* twoAct */\n\\</span> /* levelFour.1 */\n\\<</replace>><</link>> /* link replace Bite him */\n\\</span> /* oneAct Bite him */\n2. <span id=\"twoAct\"><<link \"Feed him your blood\">><<replace \"#levelThree\">>2. Feed him your blood\n\nWhile he still lies there groaning, you draw blood off of your arm and force it down his mouth. He fights it, unsurprisingly, but in moments the power of it has overtaken him. His eyelids droop, and you can hear his heart rate slowing down. In moments, Viscardi's control is gone, and this man is unconscious.<<set $thrallDungeon to \"freed\">><<set $freed += 1>><<set $prisoners to \"trusting\">>\n\nThe prisoners in the cages nearby are watching you intently. You meet their eyes and they flinch back in fear, but they also glance down at the body by your feet, and seem... hopeful. You think you can understand that hope. You stand up, and:\n\n1. <span id=\"oneAct\">[[Walk over to them|DungeonPrisoners]]</span>\n\\<</replace>><</link>> /* link replace Free him */\n\\</span> /* twoAct Free him */\n\\</span> /* levelThree.1 */\n\\<</replace>><</link>> /* link replace Throw him into the ground */\n\\</span> /* twoAct */\n\\</span> /* levelTwo.1 */\n\\<</replace>><</link>> /* link replace Dodge the strike */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Draw your blade\">><<replace \"#levelOne\">>2. Draw your blade<<set $prisoners to \"trusting\">>\n\nWith lightening speed you draw your blade and knock the poker out of the way. The thrall loses his step, and the poker drives into the stone wall to your side. You step into the room, closer to him before he can react, and:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Kill him\">><<replace \"#levelTwo\">>1. Kill him\n\nYou bury the blade in the thrall's chest. He takes a gasping breath, and spits blood onto your front. You can see when the light of life leaves his eyes, and he crumples to the floor at your feet.<<set $thrallDungeon to \"dead\">><<set $dead += 1>>\n\nThe poker clatters to the floor beside you, and you pull your blade free from the body. That wasn't very hard, you think. For a moment there you'd actually been worried. Must just be this place, getting to you.\n\nYou wipe the blood off your blade and resheath it at your side. Across the room, you an see the humans in their cages staring at you with wide eyes. They both cling to the bars of their cages, and you:\n\n1. <span id=\"oneAct\">[[Walk over to them|DungeonPrisoners]]</span>\n\\<</replace>><</link>> /* link replace Kill him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Pin him to the ground\">><<replace \"#levelTwo\">>2. Pin him to the ground\n\nThis thrall seems younger and more agile that what you faced before, but you still have the vampire strength on your side. You throw your weight onto him and manage to pin him, weaponless, to the stone ground. He struggles fruitlessly against you. He's also yelling, and you don't want him to raise too much fuss, so you quickly:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Feed him your blood\">><<replace \"#levelThree\">>1. Feed him your blood\n\nYou draw your blade across your own skin<<if $freed > 2>> again<</if>>, and let the blood drip out of you and into the thrall's mouth. <<if $freed > 2>>You're starting to wish you'd created a bottle of your own blood before taking this mission - cutting yourself repeatedly is getting tiring, and painful.<<else>>Wil showed you how to draw your own blood to free a thrall, but you're starting to wonder if this isn't going to scar before long.<</if>> Luckily it doesn't take too much blood before the thrall's eyes close, and he stops struggling. You climb off of him as his breathing grows shallow and steady. His heart rate, you know, must also be slowing down. Viscardi's control is gone.<<set $thrallDungeon to \"freed\">><<set $freed += 1>>\n\nAcross the room, you can see the two prisoners in their cages squinting at you. They probably couldn't see what you were doing, their vision obscured by the awkward lighting and placement of torture tools in this room. You stand up from the now free thrall, and:\n\n1. <span id=\"oneAct\">[[Go over to the prisoners|DungeonPrisoners]]</span>\n\\<</replace>><</link>> /* link replace Free him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Bite him\">><<replace \"#levelThree\">>2. Bite him\n\nYour teeth sink into the thrall's neck, right over the artery. The skin tears as the thrall continues to struggle for a moment, but then he goes still. Viscardi trained all his thralls not to resist a feeding. That training was done here, in fact.\n\n<<if $firstBite is \"no\">>That memory resurfacing should send you into a panic, but the surge of blood entering your body is dizzying enough to distract you. Wil never let you drink from a fresh body like this, and the sensation is so different from drinking from blood packs. It's intoxicating, is what it is. You don't even realize where you are, until you:<<else>>That memory resurfacing should send you into a panic, but the fresh blood manages to calm you down. You don't know how Wil ever managed to live without this. You certainly don't think you could. Your body starts to fill with the thrall blood, until you:<</if>>\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Drain him completely\">><<replace \"#levelFour\">>1. Drain him completely\n\n<<if $firstBite is \"no\">>It happens a lot quicker than you anticipated. One moment the body was alive and pumping blood, and the next... there was none left to pump. You sit up and catch your breath. Already the body is starting to cool beneath you. When you stand up it's like coming out of a daze.<<set $firstBite to \"yes\">><<else>>You can actually feel the body growing cold beneath you, and you know the life is gone from it. You stand up in a content, blood-filled daze, and finally try to take stock of the room around you.<</if>><<set $thrallDungeon to \"dead\">><<set $dead += 1>>\n\nAcross the room from you the two prisoners are clinging to their cage bars, squinting at you. They don't seem anymore frightened than when you walked in, which means they probably didn't see what you did to their guard. That's probably good. You:\n\n1. <span id=\"oneAct\">[[Go over to them|DungeonPrisoners]]</span>\n\\<</replace>><</link>> /* link replace Drain him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Pull yourself back\">><<replace \"#levelFour\">>2. Pull yourself back\n\n<<if $firstBite is \"no\">>As soon as you realize what you're doing you pull yourself back. Blood continues to pump from the wound for a moment, but it slows, and the thrall is still breathing, so you assume you caught yourself before you accidentally killed him. What a relief.<<set $firstBite to \"yes\">><<else>>When you think he's probably had enough, you pull back. The wound still bleeds for a moment more but it begins to slow. You check to make sure he's still breathing, then prepare to save his life for real, the way Wil taught you.<</if>>\n\nIt doesn't take long to draw your own blood and feed it into his mouth. The effect takes a moment, but you can tell when he falls unconscious for real, and when his heart rate starts to slow, the vampire blood taking over. You stand up while it happens. <<if $freed > 2>>Another one freed. It feels good.<<else>>Knowing this guy is free, that he'll get another chance in at least a half of a life... it feels good.<</if>><<set $thrallDungeon to \"freed\">><<set $freed += 1>>\n\nAcross the room you can see the prisoners in their cages, clinging to the bars and squinting at you. In the awkward lighting they probably couldn't see what you were doing very well, just that you took care of their guard. You:\n\n1. <span id=\"oneAct\">[[Go over to them|DungeonPrisoners]]</span>\n\\<</replace>><</link>> /* link replace Pull yourself back */\n\\</span> /* twoAct */\n\\</span> /* levelFour.2 */\n\\<</replace>><</link>> /* link replace Bite him */\n\\</span> /* twoAct */\n\\</span> /* levelThree.2 */\n\\<</replace>><</link>> /* link replace Chain him back */\n\\</span> /* twoAct */\n\\</span> /* levelTwo.2 */\n\\<</replace>><</link>> /* link replace Strike first */\n\\</span> /* twoAct */\n\\</span> /* levelOne */",
      "links": [
        {
          "text": "Walk over to them",
          "destination": {
            "name": "DungeonPrisoners",
            "pid": 28
          }
        },
        {
          "text": "Go look at them",
          "destination": {
            "name": "DungeonPrisoners",
            "pid": 28
          }
        },
        {
          "text": "Go over to them",
          "destination": {
            "name": "DungeonPrisoners",
            "pid": 28
          }
        },
        {
          "text": "Go over to the prisoners",
          "destination": {
            "name": "DungeonPrisoners",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "DungeonPrisoners",
      "text": "<<if $thrallForest is not \"docile\">>\"Hey,\" you call over to them. They look like frightened wild animals when they pause their whispering to look up at you.\n\nYou jerk a thumb towards the exit door. \"I took care of the last guard for you,\" you say. \"You should get out of here before any more show up.\"\n\nThe man nods vigorously and starts to leave, but the woman approaches you first. She takes your hand in a surprisingly strong grip. \"Thank you,\" she says, staring into your eyes. It's unsettling. You're happy they're alive but you have other things you wanted to do here. \"For saving us. Thank you. Thank you.\"\n\nYou gently pull your hand out of her grip. \"You're welcome,\" you say, \"but you should hurry.\"\n\nThe man touches the woman on the shoulder, and then both prisoners hurry away from you, through the door and out of sight. Free.<<set $prisonersLocation to \"forest\">>You watch them go, and then you:\n\n1. <span id=\"oneAct\">[[Head deeper into Viscardi's lair|DungeonTrap][$direction to \"out\"]]</span>\n2. <span id=\"twoAct\">[[Follow them to the exit|ForestDoor][$direction to \"in\"]]</span>\n<<else>><<if $prisoners is \"afraid\">>As you approach the first cage the prisoner inside it actually begins to whimper. You can see them both better now. This first cage holds a young man, but he looks young enough he could still be a boy. In the second cage is a woman; she looks old enough to be his mother.\n\nThey both stare up at you in horror. You:<<elseif $prisoners is \"trusting\">>You can see the two prisoners better as you approach. The first is a young man, practically still a boy, and the second a woman who looks old enough to be his mother. Their faces are pressed to the bars but they pull back as you get closer, flinching, and smiling.\n\n\"Did you come here to rescue us?\" the woman asks. \"Those monsters... we've been down here for weeks. I thought they would kill us and drink our blood until we turned into one of them. Are we free?\"\n\nYou:<</if>>\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Open the first cage\">><<replace \"#levelOne\">>1. Open the first cage\n\n<<if $prisoners is \"afraid\">>The cages are locked but you don't have time to bother looking for the key; you break the lock open with your bare hands. At the sound of this the two prisoners reach for each other between their respective cage bars, but the distance is just too far. The woman has tears running down her face, and the man is choking on his own sobs. It's not a pleasant sight. You:<<elseif $prisoners is \"trusting\">>You don't have a key, but these padlocks are rusty and old anyway. As quietly as you can, you twist the metal until it's broken, and it falls apart, and the cage door swings open.\n\n\"Oh, bless you,\" the woman says. \"Bless you. Those monsters dragged us down here, had one guarding us at all times. I kept looking for an opening but I thought we'd never escape.\"\n\n\"The same guard?\" you ask before doing anything else.\n\nIt's the man who speaks this time. His voice is raw. \"No,\" he says, \"they change every day or so. We probably have a few hours before the new one comes - unless their boss shows up.\"\n\nViscardi should be sleeping now, you think to yourself, so that won't be a worry. You pause to take in the exhausted, beaten, starving man on the cage floor at your feet, and then you:<</if>>\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Open the second cage\">><<replace \"#levelTwo\">>1. Open the second cage\n\n<<if $prisoners is \"afraid\">>\"Come on,\" you say, and you go to the second cage and break that lock. \"I'm not here to hurt you - I'm getting you out of here.\"\n\nNeither prisoner moves nor speaks. You even hold your hands up slightly, in a show of good faith, but they don't care. \"You're free,\" you say, and they just blink at you. Their expressions are still filled with fear, and now suspicion, and you get the idea that no matter what you do, they probably still won't trust you. Ultimately your only option is to:\n\n1. <span id=\"oneAct\">[[Leave them and search the room|Dungeon]]</span>\n<<elseif $prisoners is \"trusting\">>The second cage opens as easily as the first, and then the captive prisoners are hugging each other, tears everywhere. \"Thank you,\" the woman says, over and over. The man is babbling something about the forest, and their home, and from the bits you catch you guess they have been working on an escape plan this entire time.\n\nWhen they finally pull apart the woman is wiping her face. \"They dragged us through the forest,\" she tells you. She nods across the room at a door you hadn't noticed before. \"There wasn't a guard there when we came through, so we were planning to run that way again, if we ever could.\"\n\n\"I see,\" you say, and you tell them to:\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Wait here while you clear the way\">><<replace \"#levelFour\">>1. Wait here while you clear the way\n\n\"But I should probably still check it out before you do,\" you say. \"Viscardi might have set guards afterwards.\"\n\n\"Viscardi,\" the man says slowly. \"That was their bosses name.\"\n\n\"Yeah. He's bad news,\" you tell them. \"Listen, stay here,\" you add as you take a step away. \"Viscardi has his minions crawling over this place. When I tell you it's safe, run out that door, but not before then, OK?\"\n\nThe two prisoners nod furiously. \"We won't go anywhere until it's clear,\" the woman says, and with a smile, you:\n\n1. <span id=\"oneAct\">[[Look around the room|Dungeon]]</span>\n\\<</replace>><</link>> /* link replace Wait here */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Escape out the forest door\">><<replace \"#levelFour\">>2. Escape out the forest door\n\n\"You should probably start running now,\" you say, and you point to the door they indicated. \"I'm hunting Viscardi down, but you should get to freedom before anyone else shows up.\"\n\n\"Viscardi,\" the man says slowly. \"That was their bosses name.\"\n\n\"Yeah,\" you say. \"He's bad news, but I'm going to stop him. Don't wait around to see it happen.\"\n\nThey both stand up, weakly. \"We won't,\" the woman promises, and she leads the pair of them out the mystery door. You watch them go, and then you:<<set $prisonersLocation to \"forest\">><<set $thrallForest to \"alert\">>\n\n1. <span id=\"oneAct\">[[Check out the rest of this room|Dungeon]]</span>\n\\<</replace>><</link>> /* link replace Escape */\n\\</span> /* twoAct */\n3. <span id=\"threeAct\"><<link \"Go down the main tunnel\">><<replace \"#levelFour\">>3. Go down the main tunnel\n\nYou point towards the door where you entered. \"Listen, I dealt with all of Viscardi's minions on my way here,\" you say. \"If you run that way, you could get out without being stopped.\n\nThey look at the door, and then at you with some fear. \"Where does that tunnel lead?\"\n\n\"A bunch of different places,\" you say, \"but the church catacombs is one of them. Just take a left at every intersection, and you'll find it.<<if $dungeonTrap is 1>> Oh, and watch out for the trapped floor. There's a side tunnel to get around it.<</if>>\"\n\nBoth the prisoners nod. \"Got it,\" the woman says, and she starts to lead the man towards the door you came from. \"Good luck down here. I hope you kill that bastard.\"\n\n\"I will,\" you say, and then they're gone. Alone again, you:<<set $prisonersLocation to \"trap\">>\n\n1. <span id=\"oneAct\">[[Check out the rest of this room|Dungeon]]</span>\n\\<</replace>><</link>> /* link replace Trapped tunnel */\n\\</span> /* threeAct */\n\\</span> /* levelFour */\n\\<</if>>\n\\<</replace>><</link>> /* link replace open the second cage */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Taste his blood\">><<replace \"#levelTwo\">>2. Taste his blood<<set $firstBite to \"yes\">>\n\n<<if $prisoners is \"afraid\">>You take a single step into this cage, crouching down so you can even fit, and immediately the man begins to babble. \"P-please, please, I don't, don't kill me, please don't-\"\n\nHis hands actually snake up to cover his neck so you know he knows what's coming. He shrinks back as you crouch over him, and you pull his hands away, exposing the skin - and a scab from a previous bite. It makes you sick to look at, but you do your best to ignore it.\n\nWhen you're done, he lies in a heap on the cage floor, eyes rolling. The woman behind you is openly sobbing, and you turn to look at her. She's still watching you. You:<<elseif $prisoners is \"trusting\">>You crouch down and the man doesn't react, until your fangs are in his neck. He tries to pull away but that just makes the wound worse, gives you more to drink, and you pin him to the floor so he doesn't spill it all.\n\n\"What are you doing!\" the woman cries out shrilly. Her cage shakes but she's trapped there, so you don't bother to watch her. There was another bite mark on this man's neck, and it bothers you to think that Viscardi was here first, but at least now no matter what happens he won't be here again.\n\n\"Stop it!\" the woman is screaming, \"stop it! Stop it!\" She's probably loud enough to echo all throughout the lair, but screams from a dungeon aren't an uncommon things. When you're done with this body you look over at her, and her screams halt as she stares back at you in shock. You:<</if>>\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Taste her blood as well\">><<replace \"#levelThree\">>1. Taste her blood as well\n\nYou don't bother wiping the excess blood off your face as you exit the first cage, and move over to the second one. The woman draws a deep breath as you break her lock, and she babbles, saying \"You don't have to do this, please don't do this I won't tell anyone, I swear, I-\"\n\nAs you duck down to enter her cage, the woman surprises you by given a feeble attempt at a headbutt. You grab her head to block it, and then she's pinwheeling her arms, trying to drive you back. It's more annoying than anything else. You end up having to wrestle her into the bars before you can get your fangs into her, and she keeps fighting even then.\n\nYou don't stop drinking until her fighting stops. Then you let her body slump to the ground.\n\nYou stretch your back out after you exit the cages, and finally clean your face up. Finally, you can:<<set $prisonersLocation to \"twoDead\">>\n\n1. <span id=\"oneAct\">[[Look around the room|Dungeon]]</span>\n\\<</replace>><</link>> /* link replace Taste her blood as well\n\\</span> /* oneAct*/\n2. <span id=\"twoAct\"><<link \"Ignore her and move on\">><<replace \"#levelThree\">>2. Ignore her and move on\n\nYou wipe the excess blood off your face and stare the woman in the other cage in the eye. The intensity of your look takes her aback. As you crawl out of the cage and stretch your back out, you hear her sobbing wordlessly, and you ignore it. You:<<set $prisonersLocation to \"oneDead\">>\n\n1. <span id=\"oneAct\">[[Look around the room|Dungeon]]</span>\n\\<</replace>><</link>> /* link replace Ignore her and move on */\n\\</span> /* twoAct*/\n\\</span> /* levelthree*/\n\\<</replace>><</link>> /* link replace Taste his blood */\n\\</span> /* twoAct */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Open the first cage */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\">[[Ignore them|Dungeon][$prisoners to \"afraid\"]]</span>\n\\</span> /* levelOne */\n\\<</if>>",
      "links": [
        {
          "text": "Head deeper into Viscardi's lair",
          "destination": {
            "name": "DungeonTrap",
            "pid": 25
          }
        },
        {
          "text": "Follow them to the exit",
          "destination": {
            "name": "ForestDoor",
            "pid": 30
          }
        },
        {
          "text": "Leave them and search the room",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        },
        {
          "text": "Look around the room",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        },
        {
          "text": "Check out the rest of this room",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        },
        {
          "text": "Ignore them",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "DungeonChains",
      "text": "A line of chains are bolted into the stonework along one wall of the dungeon. They dangle uselessly, but you can see flecks of dried blood along the metal, and stains on the floor beneath them. On a rack nearby hangs a series of fire pokers and brands.\n\nSeeing them makes you feel sick to your stomach. You don't remember what it was like the first time you were in this room, and you're not trying to remember.\n\nAt the very least, it looks like these haven't been used in a while. You avert your gaze, and:\n\n1. <span id=\"oneAct\">[[Check out the smaller door|ForestDoor]]</span>\n2. <span id=\"twoAct\">[[Head back through the main door|DungeonTrap]]</span>",
      "links": [
        {
          "text": "Check out the smaller door",
          "destination": {
            "name": "ForestDoor",
            "pid": 30
          }
        },
        {
          "text": "Head back through the main door",
          "destination": {
            "name": "DungeonTrap",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "ForestDoor",
      "text": "<<if $door is 1>>The door is still propped open on the loose rock you found earlier. A slight - very slight - breeze blows into the room. You probably wouldn't have noticed if your senses weren't so attuned. You:\n\n1. <span id=\"oneAct\">[[Go through the maze|ForestMaze][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Stay in the dungeon|Dungeon][$direction to \"out\"]]</span>\n<<else>><<set $door to 1>>This almost looks like the door to a storage room, or a small service tunnel, but as you close enough to inspect it you realize you can feel the slight hint of moving air through the cracks between the wood and stone. This definitely leads outside.\n\nThere's a lock on this door, but it hasn't been set. The way the hinges are weighted, when someone leaves the door open it swings itself shut. You find a loose rock nearby and set it in front of the door to stop that from happening.\n\nThere's not much else to see here. You just:\n\n1. <span id=\"oneAct\">[[Move forward|ForestMaze][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Stay in the dungeon|Dungeon][$direction to \"out\"]]</span><</if>>",
      "links": [
        {
          "text": "Go through the maze",
          "destination": {
            "name": "ForestMaze",
            "pid": 31
          }
        },
        {
          "text": "Stay in the dungeon",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        },
        {
          "text": "Move forward",
          "destination": {
            "name": "ForestMaze",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "ForestMaze",
      "text": "<<if $direction is \"in\">><<if $forestMaze is 1>>These tunnels are still confusing but now that you've made it through the maze already, you're getting a better sense of where everything is. It takes you half as long to navigate as it did before. You:\n\n1. <span id=\"oneAct\">[[Head towards the exit|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back to the dungeon|Dungeon][$direction to \"out\"]]</span>\n\\<<else>>These tunnels, you quickly realize, are designed to be a maze. There's no main wide tunnel which everything else branches off from, and even with your enhanced sense of direction you stumble into a dead end multiple times.\n\nThe air is smelling fresher, though, and you follow that scent to find your way through. <<if $prisonersLocation is \"forest\">>There's also a smell of blood, fresh blood you think, which puts some speed into your step. You haven't seen the two prisoners you freed yet.<</if>>Up ahead you finally catch a glimpse of light from around another corner, and you:<<set $forestMaze to 1>>\n\n1. <span id=\"oneAct\">[[Continue forward|ForestThrall]]</span><</if>>\n<<elseif $direction is \"out\">>The maze is just as confusing in the reverse, which is no surprise. Viscardi probably designed it to keep prisoners in just as much as to keep strangers out.\n\nYou're starting to remember some of these paths though, so you manage to navigate the place without it taking as long as it did the first time. You head:\n\n1. <span id=\"oneAct\">[[Back to the lair dungeon|Dungeon]]</span>\n<</if>>",
      "links": [
        {
          "text": "Head towards the exit",
          "destination": {
            "name": "ForestEntrance",
            "pid": 32
          }
        },
        {
          "text": "Head back to the dungeon",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        },
        {
          "text": "Continue forward",
          "destination": {
            "name": "ForestThrall",
            "pid": 33
          }
        },
        {
          "text": "Back to the lair dungeon",
          "destination": {
            "name": "Dungeon",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "ForestEntrance",
      "text": "<<if $thrallBoss is \"freed\" and $freed > 4>><<set $win to \"yes\">><<set $winFree to \"yes\">><</if>><<if $prisonersLocation is \"forest\">>The two prisoners here are definitely dead. That thrall left them in pieces, and the pool of blood has spread out so far it's almost impossible to avoid. This is not how you were hoping this would play out - at the very least, you should have been able to navigate that maze faster than these two. But there's no changing the past. You step around them.\n\n<</if>>The floor slopes up until the trapdoor is in easy reach. There's even a rope ladder that leads up through it, to make entering and exiting the lair as easy as possible for Viscardi's thralls. The light that filters through isn't direct sunlight; the forest above must be thick enough to protect from that.\n\n<<if $win is \"yes\">><<if $winAll is \"yes\">>You touch the amulet now hanging around you neck. You've done all there is to do here. Viscardi is dead, you and everyone else are free, and even if the forest wasn't enough to protect you from the sunlight you'd be able to walk outside right now. Nothing can hurt you now, not the sun or your old vampire captor. You feel powerful. You feel practically alive.\n\nWith a deep breath, you lower the rope ladder, and:\n\n1. <span id=\"oneAct\">[[Leave|End Credits]]</span>\n<<elseif $winFree is \"yes\">><<if $winKill is \"yes\">>You could leave, you realize. Viscardi is dead, the thralls are free... there's no reason to stick around any longer. You could hide in the forest until the sun sets and not have to breath in this underground air any longer.\n\nMaybe when you get back to Wil, you'll come back for the newly born vampires down here. She could help them better than you could. She might even be impressed with what you've done.\n\nYou take a deep breath of the grimy underground air, and:\n<<elseif $winSteal is \"yes\">>You touch the amulet now hanging around your neck. You're free, you realize, just like all the thralls down here you freed. Not just from Viscardi but from the vampire curse as well. You could go outside right now, and even if the trees weren't protecting you from the sun you'd be safe.\n\nYou feel giddy thinking about the sensation of sunlight on your skin. Viscardi might still be alive but he's trapped down here, a monster crawling in his own filth, without the power of this amulet. That's almost a better revenge than his life.\n\nYou stare up at the trapdoor, your door to freedom, and:\n<<else>>It'll be enough to hide you, if you decide to leave now. The thralls are freed from Viscardi's control<<if $goal is \"free\">>, which is all you wanted anyway<</if>>. Viscardi may still be alive, but you don't even know if you have the power to kill him at this point. Perhaps Wil was right. Perhaps you need to train more.\n\nYou stare up at the muted light coming from the trap door, and:\n<</if>>\n1. <span id=\"oneAct\">[[Lower the rope ladder|End Credits]]</span>\n2. <span id=\"twoAct\">[[Go back into the lair|ForestMaze][$direction to \"out\"]]</span>\n<<elseif $winKill is \"yes\">><<if $winSteal is \"yes\">>You touch the amulet hanging from your neck. You're free, you realize. From Viscardi and from the vampire curse. Sure, you still have the fangs and a thirst for blood, but it's daylight out there, and you can still go outside.\n\nYou feel giddy just thinking about the sensation of sunlight on your skin. Viscardi never deserved this. Knowing his dead body is lying broken on a dirty floor far behind you is just icing on the cake. You're free.\n\nYou stare up at the muted daylight coming from the trap door, and:\n<<else>>Looking up at that trap door, you suddenly feel giddy. You're free. Viscardi is dead, and he won't be able to hurt anyone ever again. You could leave this hellhole right now; the forest will protect you until the sun goes down. You'll never have to come back here.\n\nYou wonder if Wil will believe you managed to kill him. You wonder what you will do, now that you have. You take a deep breath, and:\n<</if>>\n1. <span id=\"oneAct\">[[Lower the rope ladder|End Credits]]</span>\n2. <span id=\"twoAct\">[[Go back into the lair|ForestMaze][$direction to \"out\"]]</span>\n<<elseif $winSteal is \"yes\">>You touch the amulet hanging from your neck. You could leave now, you think, and walk out into the sun with no problem. Viscardi will be trapped down here like the monster he is, rotting in his own filth. That's almost a better revenge than taking his life. And with the amulet, you'll never be trapped again.\n\nYou stare up at the muted daylight filtering from the trap door, and you feel giddy. You imagine the sensation of warm sunlight on your skin again, and you:\n\n1. <span id=\"oneAct\">[[Lower the rope ladder|End Credits]]</span>\n2. <span id=\"twoAct\">[[Go back into the lair|ForestMaze][$direction to \"out\"]]</span>\n<</if>><<else>>You can't leave, though. Your breath gets a little tight just thinking about it. It's like you haven't accomplished anything down here. Part of you wants to leave; you could hide in the forest until the sun sets, and run back to Wil empty handed. But you came here with a mission. At the very least you can attempt it.\n\nYou turn around, and:\n\n1. <span id=\"oneAct\">[[Go back|ForestMaze][$direction to \"out\"]]</span>\n<</if>>",
      "links": [
        {
          "text": "Leave",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Lower the rope ladder",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Go back into the lair",
          "destination": {
            "name": "ForestMaze",
            "pid": 31
          }
        },
        {
          "text": "Go back",
          "destination": {
            "name": "ForestMaze",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "ForestThrall",
      "text": "<<if $thrallForest is \"docile\">>You still as you turn the corner because up ahead is a figure, leaning against the wall. It looks like a man, and he's facing away from you. You can't see any details because there's a light coming from ahead of him. It's dim, but it's natural light.\n\nYou sneak forward to get a better look, and the man doesn't notice you at all. He's probably one of Viscardi's thralls, based on the grimy clothes he's wearing. He looks like he's trying to fall asleep standing up. \n\nUp ahead the tunnel tapers up, and now you can see where the light is coming from. There's a trap door in the ceiling of the tunnel. Light is filtering down through the cracks. And this thrall was set here to watch that door.\n\nYou manage to get within a few feet of him without him noticing, and then you:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Free him\">><<replace \"#levelOne\">>1. Free him\n\n<<if $freed > 2>>Freeing the man from Viscardi's control only takes a moment, with all the practice you've gotten. He barely has time to react to the sudden blood hitting his lips before it knocks him unconscious. You lower him slowly to the ground.<<else>>You manage to draw a blade and cut your skin without making a sound. The man doesn't even notice as you reach around him, silently, and cover his mouth with a bloody palm. He struggles for a bit, and then the influence of your blood washes over him, and he falls unconscious. Viscardi's hold overpowered.<</if>><<set $thrallForest to \"freed\">><<set $freed += 1>>\n\nThat should take care of all of the thralls in this part of the lair. You:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Kill him\">><<replace \"#levelOne\">>2. Kill him\n\nYou manage to draw your blade without making a sound, and <<if $dead > 2>>this time <</if>>stab it into the thrall's neck, severing vascular and nervous systems all at once. He doesn't have time to make a sound. He just falls dead to the floor.<<set $thrallForest to \"dead\">><<set $dead =+ 1>>\n\nYou clean up your blade and resheath it, and:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Kill him */\n\\</span> /* twoAct */\n3. <span id=\"threeAct\"><<link \"Bite him\">><<replace \"#levelOne\">>3. Bite him\n\nWith his back still turned to you, you sink your fangs into the thrall's neck. He flinches at contact. You reach up to hold him still, to give yourself better access, but that flinch is the only movement the thrall makes.<<if $firstBite is \"no\">> For some reason he doesn't try to fight you off at all. Probably Viscardi's training, you think. He must think you're him. That's....\n\nThat should be disgusting, but blood you're drinking is overpowering any sort of sense you should be feeling. It's the first fresh blood you've ever had - Wil never let you feed on living victims. It's intoxicating, it's so strong. How does a vampire like Wil live without this?\n\nYou barely notice the time passing, until the thrall begins to lose strength, and your only options are to:<<elseif $firstBite is \"yes\">> Viscardi really did waste no effort on his training. This thrall thinks you're him, thinks this is a regular feeding scenario. The thought of that should make you sick... but you're actually pretty happy to have an easy meal.\n\nYou shake the disgust off, and:<</if>>\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Drain him\">><<replace \"#levelTwo\">>1. Drain him\n\n<<if $firstBite is \"no\">>You wouldn't stop yourself if you could. The thrall slumps down lower against the tunnel wall and you keep drinking, drinking, until there's nothing left to drink. There's no life left in this body.\n\nIt took a lot less time than you anticipated.<<set $firstBite to \"yes\">><<else>>The thrall just lets you kill him. His body slumps against the tunnel wall and slides down to the floor and you just follow him down, sucking him dry, while he does nothing to fight back. You can feel the moment all warmth has left this body, and it's dead.<</if>> You pull back, clean yourself off, and stand up again. Alone in the tunnel.<<set $thirst to 0>><<set $thrallForest to \"dead\">><<set $dead += 1>> You:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Drain him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Free him\">><<replace \"#levelTwo\">>2. Free him\n\n<<if $firstBite is \"no\">>You have to wrench yourself away from this thrall's bloodstream and it takes all of your willpower. Some blood continues to spill out of the would and you cover it with a hand, just so the sight of it doesn't draw you back in.\n\n<<set $firstBite to \"yes\">><<else>>You pull away, satisfied with your meal of his blood, and set to work giving him a meal of yours. <</if>><<if $freed > 2>>Freeing this thrall from Viscardi is a familiar set of motions by now. <</if>>You cut a small line on your arm and feed the blood that spills into his mouth, and he loses consciousness after a few moments. You can hear his breathing go steady, and his heartbeat slow, but it doesn't stop. Viscardi's control is gone.<<set $thirst to 0>><<set $thrallForest to \"freed\">><<set $freed += 1>> Satisfied, you stand up, and:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free him */\n\\</span> /* twoAct */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Bite him */\n\\</span> /* threeAct */\n\\</span> /* levelOne  */\n<<elseif $thrallForest is \"alert\">>You see three people as you turn the corner and reach the end of this maze of tunnels. Two lie in a heap on the floor. One, a man you don't recognize, holding a sword, stands above them.\n\nHe looks up at you, but you can't see his features very clearly because a dim, natural light is coming from the end of the hall. Briefly you can see a trapdoor leading up, with light filtering down through the cracks. And then the man - the thrall - is running at you. You:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Dodge out of the way\">><<replace \"#levelOne\">>1. Dodge out of the way\n\nYou're a vampire, and you'll always be faster than these starved and beaten thralls. You let him get close enough, then dodge to the side. He swings with the sword and misses wildly, but reacts faster to the move than you anticipated, swinging back towards you. You draw your own blade lightning quick, and have half a second to:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Knock the sword away\">><<replace \"#levelTwo\">>2. Knock the sword away\n\nYou blade comes flashing up and the two clash with a loud sound. Luckily no one is around to hear it. You swing again, and this time manage to knock the sword out of his hand. It goes flying off down the hallway. The thrall, now weaponless, is pinned against the wall at the point of your blade. He watches you with wide eyes. You:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Bite him\">><<replace \"#levelThree\">>1. Bite him\n\nYou close the gap between you in one step, and sink your fangs into the artery in his neck. He flinches back, and tries to push you away, but there isn't any strength in the effort. After a moment he stops, and lets it happen.\n\n<<if $firstBite is \"no\">>Part of you is curious about why that is, but the rest of you is overwhelmed. Wil never let you drink from a fresh body before, and the blood is so much warmer, so much... more alive. It's intoxicating. You don't understand how she manages to survive without this, how you survived so long without it as well. You hardly even notice the time passing, and suddenly you realize you have to decide whether to:<<else>>Viscardi's training. You take advantage of it and drink up. It doesn't take long, and you don't really have to think about whether you want to:<</if>>\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Drain him\">><<replace \"#levelFour\">>1. Drain him\n\n<<if $firstBite is \"no\">><<set $firstBite to \"yes\">>It takes less time that you would have thought. One moment he's alive, letting you kill him, and the next... he's dead. You killed him.\n\n<<else>>The new blood filling your body is rejuvenating. You're used to it now, sure, but you don't think it'll ever stop being so satisfying. You drink until there's nothing left, and then you pull away just in time to watch the life leaving the thrall's eyes. <</if>>The body drops gracelessly to the floor. You clean yourself up a bit, and sheath your blade back at your side, and then:<<set $thirst to 0>><<set $thrallForest to \"dead\">><<set $dead += 1>>\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Drain him */\n\\</span>, or /* oneAct */\n2. <span id=\"twoAct\"><<link \"Free him\">><<replace \"#levelFour\">>2. Free him\n\n<<if $firstBite is \"no\">><<set $firstBite to \"yes\">>You manage to tear yourself away, but only just. The thrall's eyes are swinging wildly and you have just enough time to draw your own blood, and feed it into his mouth, before you think he would have fallen unconscious either way. Once he's out he's heavy, so you set him down gently to the floor. <<else>>Once you've had enough you pull yourself away, and start the ritual to release Viscardi's control. Hopefully this guy doesn't mind that the cost of freedom is his own humanity. You sure didn't. <</if>><<set $thrallForest to \"freed\">><<set $freed += 1>>\n\nHis heartbeat slows down but doesn't stop, and then you know it's worked. You stand up, look around, and:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free him */\n\\</span> /* twoAct */\n\\</span> /* levelFour */\n\\<</replace>><</link>> /* link replace Bite him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Free him\">><<replace \"#levelThree\">>2. Free him\n\nWith your blade still raised in the thrall's direction, you cut your free hand against the sharp edge, and the close the gap between you in a single step. He fights as you cover his mouth with your bloody palm, but the fight doesn't last for long. In moments the vampire blood overpowers him, and he falls unconscious.\n\nYou lower him gently to the ground. His breathing is steady, and his heart rate slows down dramatically, but he's alive. He's free.<<set $thrallForest to \"freed\">><<set $freed += 1>>\n\nYou resheath your blade, and:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free him */\n\\</span> /* twoAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Pin him to the wall */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Kill him\">><<replace \"#levelTwo\">>2. Kill him\n\nYou duck under the second sword swing and stab your blade up, into the thrall's stomach. He cries out in shock, but you're far away from anyone else who might hear, so you let him.<<set $thrallForest to \"dead\">><<set $dead =+ 1>>\n\nHe doesn't die right away. He falls to his knees when you remove your blade, and scrabbles around on the floor while you clean and resheath it. He isn't even watching you, just crawling nowhere. This is going to take a minute, you think. And you don't really want to watch it all play out. You:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Kill him */\n\\</span> /* twoAct */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Dodge */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Strike first\">><<replace \"#levelOne\">>2. Strike first\n\nHe's fast, but you still manage to duck out of the way of the swing, and slice your blade upward into the thralls arm. He maintains his grip on the sword<<if $wound > 2>>, <<set $wound += 1>>and manages to get you with a pretty ugly slash across your shoulder,<</if>> but you stun him with a pommel strike to his skull. The thrall reels, and you:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Kill him\">><<replace \"#levelTwo\">>1. Kill him\n\nYou flip your blade back around, and stab down into his chest. He doesn't even have time to react to it, to try to stop it. He stares down at it in shock, and you see blood gurgle out of his mouth, and then you pull back and yank out your blade. He falls dead in a heap.<<set $thrallForest to \"dead\">><<set $dead += 1>>\n\nYou take a moment to clean off your blade before you:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Kill him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Free him\">><<replace \"#levelTwo\">>2. Free him\n\nWhile he's stunned you prepare your own blood on your hand, and then feed it to him before he's able to recover. He tries to pull back but you're stronger than him, and in moments the vampire blood is taking effect. He falls unconscious. You grab him, and lower him gently to the floor. <<if $freed > 1>>Another one saved<<else>>You feel a bit elated, knowing you're cutting Viscardi's control out of more lives.<</if>><<set $thrallForest to \"freed\">><<set $freed += 1>>\n\nYou stand back up and dust yourself off. The only thing to do now is:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free him */\n\\</span> /* twoAct */\n3. <span id=\"threeAct\"><<link \"Bite him\">><<replace \"#levelTwo\">>3. Bite him\n\nIt's hard to aim directly for the artery when the thrall is moving around like he is, but you do well enough. He struggles and tries to pull back but you're way too strong. Especially now that you have fresh blood flowing into you.\n\n<<if $firstBite is \"no\">>Wil let you drink from dead bodies, or blood bags, so drinking from a fresh body for the first time... is intoxicating. It's almost too much. You don't seem to notice anything around you anymore, just the blood and the way in which your body feels like it's floating. It feels like you only have a moment to decide to:<<else>>After a few moments the thrall stops fighting it. He even moves his neck to give you better access. It's so considerate - or it would be, if it wasn't a trained response Viscardi beat into his thralls. You try to ignore that thought as you:<</if>>\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Drain him\">><<replace \"#levelThree\">>1. Drain him\n\n<<if $firstBite is \"no\">>It happens a lot faster than you expected. In fact, the body actually falls away from you before you realize it's happened. One moment he's alive, standing in this death-filled hallway, and the next he's another heap on the floor. He probably cracked his head on the stone, but there's no blood to spill out.<<else>>You grab the thrall's body before it can actually fall away from you, as the life leaves it. You can feel, through it's skin, the moment it happens. When you've had all that you can get, you let it go, and the body slumps to the floor like garbage. Drained garbage.<</if>><<set $thrallForest to \"dead\">><<set $dead += 1>>\n\nA little bit spilled on your chin. You wipe it off, as you:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Drain him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Stop yourself\">><<replace \"#levelThree\">>2. Stop yourself\n\n<<if $firstBite is \"no\">>You barely have time to pull yourself away, to stop yourself from killing this man, and when you do so you realize  he's almost dead already. You lower him gently to the floor so you can recreate the ritual Wil taught you all those weeks ago. A little bit of blood, from a true vampire, into the thrall's mouth, and in moments his eyes flutter shut. His heartbeat decreases, and evens out. He's alive, if undead.<<else>>When you've had all you need you lay the thrall onto the floor, and give him some of your blood. The ritual goes just how Wil taught you all those weeks ago. His heart rate slows  and evens out, and his breathing becomes shallow, and he's alive, if undead at the same time.<</if>><<set $thrallForest to \"freed\">><<set $freed += 1>>\n\nYou stand up, and look around. The only real thing to do now is:\n\n1. <span id=\"oneAct\">[[Check out the trap door|ForestEntrance]]</span>\n2. <span id=\"twoAct\">[[Head back|ForestMaze][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Stop yourself */\n\\</span> /* twoAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Bite him */\n\\</span> /* threeAct */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Strike first */\n\\</span> /* twoAct */\n\\</span> /* levelOne */\n\\<</if>>",
      "links": [
        {
          "text": "Check out the trap door",
          "destination": {
            "name": "ForestEntrance",
            "pid": 32
          }
        },
        {
          "text": "Head back",
          "destination": {
            "name": "ForestMaze",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "ViscardiCrypt",
      "text": "<<if $thrallBoss is \"freed\" and $freed > 4>><<set $win to \"yes\">><<set $winFree to \"yes\">><</if>><<set $maze to 1>><<if $win is \"yes\">><<if $winAll is \"yes\">>It finally hits you as you step out into the main crypt of the Viscardi mansion, surrounded by all the dead bodies of ancient Viscardi ancestors. This family line is gone. You killed their last descendant.\n\nYou touch the amulet around your neck. Not only did you free all the vampire's thralls, but you freed yourself as well. From his influence and control, and from the curse of your own existence, or at least close enough. You're a little light-headed just thinking about it. You can go outside, you think, eyeing the staircase up into the mansion above. For the first time in weeks, you could feel sunlight on your skin again.\n\nYou pass by the unconscious body of the thrall you hid nearby. Maybe you'll come back for her, for all of them, you think, as you:\n\n1. <span id=\"oneAct\">[[Go outside|End Credits]]</span>\n<<elseif $winFree is \"yes\">><<if $winKill is \"yes\">>You spot the body of the unconscious woman you hid as you enter the main Viscardi crypt again. She'll probably wake up soon, you think, completely free from Viscardi's control. They all will. There's no Viscardi left to control them.\n\nThe thought makes you a little light-headed. You knew this was what you wanted, but to finally be here after all this time... it's a weight that's been taken off your chest. You feel like you can breath fresh air again.\n\nYou take a deep breath, and:\n<<elseif $winSteal is \"yes\">>You spot the body of the unconscious woman you hid as you enter the main Viscardi crypt again. She'll probably wake up soon, you think, completely free from Viscardi's control like you were. So will all of them. You can't guide them to freedom like Wil did for you, but you could at least offer them this chance.\n\nAnd you have the amulet now. You touch it, hanging around your neck. <<if $goal is \"steal\">>This is really all you wanted, after all. <</if>>You could go now, outside into the daylight, for the first time in weeks. You're a little giddy just at the thought. You take a moment to consider your options, and then:\n<<else>>You spot the body of the unconscious woman you hid as you enter the main Viscardi crypt again. She'll probably wake up soon, you think, completely free from Viscardi's control like you were. So will all of them. You can't guide them to freedom like Wil did for you, but you could at least offer them this chance.\n\nThere's more you could do here, if you wanted to risk sticking around, but <<if $goal is \"free\">>you accomplished your goal<<else>>you accomplished something for sure<</if>>. You consider your options for a moment, and then:\n<</if>>\n1. <span id=\"oneAct\">[[Leave the lair|End Credits]]</span>\n2. <span id=\"twoAct\">[[Go to Viscardi's sleeping quarters|CoffinRoom]]</span>\n3. <span id=\"threeAct\">[[Go back to the maze|SecondTrap][$direction to \"out\"]]</span>\n<<elseif $winKill is \"yes\">><<if $winSteal is \"yes\">>It finally hits you as you step out into the main crypt of the Viscardi mansion, surrounded by all the dead bodies of ancient Viscardi ancestors. This family line is gone. You killed their last descendant.\n\nYou touch the amulet around your neck. Not only are you freed from Viscardi, but it's like you're freed from your vampirism curse too, at least almost. You could go outside. Out into the daylight, right now. You eye the stairs that lead up into Viscardi's mansion with envy. There's a few more things you could do down here, but right now you just want to leave. You consider it for a moment, and then:\n\n1. <span id=\"oneAct\">[[Leave the lair|End Credits]]</span>\n2. <span id=\"twoAct\">[[Go to Viscardi's sleeping quarters|CoffinRoom]]</span>\n3. <span id=\"threeAct\">[[Go back to the maze|SecondTrap][$direction to \"out\"]]</span>\n<<else>>It finally hits you as you step out into the main crypt of the Viscardi mansion, surrounded by all the dead bodies of ancient Viscardi ancestors. This family line is gone. You killed their last descendant.\n\nThe thought makes you feel giddy. <<if $goal is \"kill\">>This has been all you wanted for weeks, and now you finally have it. <</if>>You start to wonder what you're going to do with yourself now that he's gone. It's an incredible feeling.\n\nYou look around the room, and finally decide to:\n\n1. <span id=\"oneAct\">[[Leave the lair|End Credits]]</span>\n2. <span id=\"twoAct\">[[Go to Viscardi's sleeping quarters|CoffinRoom]]</span>\n3. <span id=\"threeAct\">[[Go back to the maze|SecondTrap][$direction to \"out\"]]</span>\n<</if>><<elseif $winSteal is \"yes\">>The amulet hangs heavy around your neck as you step out into the main Viscardi family crypt. It's like a solid metal key to your own freedom. You could go outside, you think, as you eye the stairs that lead up into the mansion. It's daylight right now, and if you wanted you could step out into the sun. You feel exhilarated.\n\nThere's more to do down here in the lair but frankly you're not sure if you care anymore. You consider your options for just a moment, and then:\n\n1. <span id=\"oneAct\">[[Leave the lair|End Credits]]</span>\n2. <span id=\"twoAct\">[[Go to Viscardi's sleeping quarters|CoffinRoom]]</span>\n3. <span id=\"threeAct\">[[Go back to the maze|SecondTrap][$direction to \"out\"]]</span>\n\\<</if>><<else>><<if $direction is \"in\">><<if $roundabout is 1>><<set $roundabout to 0>>This path takes you straight to the crypt door, as you thought. No detours or traps or anything. Huh, you think to yourself.\n\n<</if>>You open the door as silently as you can - which is fairly silent, this door at least appears to be well oiled - and are greeted with a massive hall.\n\nPillars hold the ceiling up every ten feet or so, and beneath them you see rows and rows of what you can only describe as stone sarcophagi. The one nearest you is etched with a name, and the year the body inside was born and died. They go on, and on, and on like this. All of Viscardi's ancestors. You've made it, you realize, to the crypt beneath Viscardi's mansion.\n\nYou creep between the supports to explore the room a bit more. <<if $thrallBoss is \"alert\">>There doesn't seem to be anyone down here, but you stay on guard just in case. At one end of the hall is a staircase leading up into the mansion proper. At the other end is a set of ornate double doors, carved with images of the sun and moon. You sneak closer. This must be Viscardi's personal sleeping quarters, you think to yourself. He'll keep his personal coffin hidden in here.\n\nYou glance around one more time, to make sure you're alone, and then:\n\n1. <span id=\"oneAct\">[[Open the door to the next room|BossThrall]]</span>\n\\<<elseif $thrallBoss is \"docile\">>There's a living woman in full guard's armor patrolling the place - one of Viscardi's most trusted thralls, you presume - but it's not hard to stay out of her line of sight. At one end of the hall is a staircase that leads up into the mansion proper. And at the other end a set of double doors, ornate and carved with images of the sun and moon. The thrall keeps glancing over from time to time. These must be the doors to Viscardi's personal sleeping quarters, you think.\n\nIt's not difficult to sneak closer, and closer, and:\n\n1. <span id=\"oneAct\">[[Sneak up on the thrall|BossThrall]]</span>\n<<else>>The atmosphere in this room is heavy and oppressive. It might be all the dead bodies entombed in here, or the fact that Viscardi's own personal sleeping quarters lie at the end of the hall. The doors are impressive. And there's nowhere else to go.\n\nYou:\n\n1. <span id=\"oneAct\">[[Open the door to the next room|CoffinRoom]]</span><</if>><<elseif $direction is \"out\">>The atmosphere in this room is heavy and oppressive. It might be all the dead bodies entombed in here, or the <<if $thrallBoss is \"dead\">>dead<<elseif $thrallBoss is \"freed\">>unconscious<</if>> body of Viscardi's most trusted thrall you know is lying between them. Or the fact that the doors to Viscardi's own personal coffin are just a few feet away. It's one of those.\n\nYou don't have time to sit around looking at tomb plaques. With determination, you:\n\n1. <span id=\"oneAct\">[[Go through the door to Viscardi's quarters|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Head back through the maze|SecondTrap][$direction to \"out\"]]</span><</if>>\n<</if>>",
      "links": [
        {
          "text": "Go outside",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Leave the lair",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Go to Viscardi's sleeping quarters",
          "destination": {
            "name": "CoffinRoom",
            "pid": 43
          }
        },
        {
          "text": "Go back to the maze",
          "destination": {
            "name": "SecondTrap",
            "pid": 36
          }
        },
        {
          "text": "Open the door to the next room",
          "destination": {
            "name": "BossThrall",
            "pid": 42
          }
        },
        {
          "text": "Sneak up on the thrall",
          "destination": {
            "name": "BossThrall",
            "pid": 42
          }
        },
        {
          "text": "Open the door to the next room",
          "destination": {
            "name": "CoffinRoom",
            "pid": 43
          }
        },
        {
          "text": "Go through the door to Viscardi's quarters",
          "destination": {
            "name": "CoffinRoom",
            "pid": 43
          }
        },
        {
          "text": "Head back through the maze",
          "destination": {
            "name": "SecondTrap",
            "pid": 36
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "FirstTrap",
      "text": "<<if $mazeTrap1 is 1>>You don't have to go very far down this before before you reach the huge mound of fallen rubble. Muted sunlight streams down over the top  of the pile, and there's enough room to crawl over... but you can't imagine how difficult this must be to clean up whenever this trap goes off.\n\nYou make your way over the rocks and boulders, and:\n\n1. <span id=\"oneAct\">[[Continue through the maze|SideTunnel]]</span><<else>><<set $mazeTrap1 to 1>>You go north, which seems as good a path as any. There's less branching off here - in fact, this section of the maze just seems to travel on straight for a good while. You can see a T-intersection up ahead but before you reach it...\n\nYour foot snags on something.<<set $thrallShop to \"alert\">>\n\nThere is a slight creaking, and the sound of a rope once held taunt whipping, and you instinctively brace yourself against the side of the tunnel. Above you the ceiling seems to collapse. A stretch of fabric loosens and a shower of rocks and boulders rain down into the tunnel with a massive crash.\n\nBraced against the wall you manage to avoid the worst of it, but you still get the wind knocked out of you. <<set $wound += 1>>If you hadn't reacted so quickly you would be dead. Or, as close as you can be while undead. Viscardi obviously isn't taking chances.\n\nYou:\n\n1. <span id=\"oneAct\">[[Continue through the maze|SideTunnel]]</span>\n<</if>>\n<<set $springTrap to 0>>",
      "links": [
        {
          "text": "Continue through the maze",
          "destination": {
            "name": "SideTunnel",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "SecondTrap",
      "text": "<<if $direction is \"in\">><<if $maze is 1>>Reaching the end of the maze again is a physical relief. The air here smells fresher, and there's enough ambient light you can finally, with your heightened senses, see clearly.<<else>><<set $secondTrap to 1>>This part of the maze smells... different. Like there's a source of fresh air nearby. You follow your nose down some false paths until you reach another four-way intersection. Viscardi seems to love building those into his lair designs.<</if>>\n\nStraight ahead of you the path lightens up, and you see the rugged stone of the underground lair shift into brickstone, and far ahead of you a crypt door. <<if $dungeonTrap is 1 or $mazeTrap1 is 1>>The hallway looks a little suspicious though - a little too straightforward. You've seen some of Viscardi's traps, and this looks like prime trap real estate.<</if>> To your left and your right the maze continues to curl around; the left path you can tell deadends pretty quick, so there's no point checking it out, whereas the right path might curl back towards the crypt door as well.\n\nYou consider your options, and:\n\n1. <span id=\"oneAct\">[[Take the path straight ahead|SecondTrapSpring]]</span>\n2. <span id=\"twoAct\">[[Take the path to the right|ViscardiCrypt][$roundabout to 1]]</span>\n3. <span id=\"threeAct\">[[Go back through the maze|DeepRoad][$direction to \"out\"]]</span>\n<<else>>The maze here already smells more rank than Viscardi's crypt did. There's a perfectly good mansion above that you're missing out on, you think to yourself, as you:\n\n1. <span id=\"oneAct\">[[Make your way through the maze|DeepRoad]]</span>\n2. <span id=\"twoAct\">[[Turn back to the crypt|ViscardiCrypt]]</span>\n<</if>>",
      "links": [
        {
          "text": "Take the path straight ahead",
          "destination": {
            "name": "SecondTrapSpring",
            "pid": 52
          }
        },
        {
          "text": "Take the path to the right",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        },
        {
          "text": "Go back through the maze",
          "destination": {
            "name": "DeepRoad",
            "pid": 40
          }
        },
        {
          "text": "Make your way through the maze",
          "destination": {
            "name": "DeepRoad",
            "pid": 40
          }
        },
        {
          "text": "Turn back to the crypt",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "MagicShop",
      "text": "<<if $magicShop is 1>>You step into the alchemy lab, the rows of potions and ingredients laid out exactly how you left them. The door swings shut on its own behind you.<<else>><<set $magicShop to 1>>The smell is the first thing that hits you has you step inside what turns out to be a small workroom. It smells like life, which is the last thing you expected down in this vampire's lair.\n\nOn a rack above the work table are rows and rows of dried herbs. A living, albeit sickly, plant sits in a large pot in the corner. There is a bookshelf along the wall, but each shelf is covered in bottles and vials and other glass containers. Some carry tinted liquids, while others are stuffed full with powders. It's an alchemy lab.\n\nThe door swings shut on its own behind you.\n\nOn the work table are a variety of tools, only some of which you recognize; a mortal and pestle, a small oil burner, a distiller. The rest are beyond you. What isn't beyond you, not entirely, is the blood-red liquid in bottle sitting at the end of the work table. You tap the glass with a finger, watch the liquid move, and it looks exactly like thinned-out blood.\n\nYou could spend an entire day in this alchemy lab, just trying to figure out what everything does, but you have a job to accomplish. <</if>>You:\n\n<span id=\"levelOne\"><<if $thrallShop is \"docile\">>1. <span id=\"oneAct\">[[Head outside|ShopThrall]]</span>\n\\<<else>>1. <span id=\"twoAct\">[[Head outside|ShopDoor][$anotherOne to 1]]</span><</if>>\n<<if $potion is not 1>>2. <span id=\"twoAct\"><<link \"Drink the potion\">><<replace \"#levelOne\">>2. Drink the potion\n\nIt's just sitting there. You can't see any reason not to.<<set $potion to 1>>\n\nThis bottle has a cork top to it, and you pry it open with ease. There isn't a strong smell coming from the liquid, which is strange to you, but when you bring it to your lips <<if $firstBite is \"no\">>it doesn't taste like the blood you've drunken before, from the blood bags Wil prepared for you. It almost tastes like wine, or honey mead. It's intoxicating, and you feel your stiff muscles relax, and your sore limbs regain their strength.<<else>>there's a strong taste, just not the one you were expecting. It's a little like blood, but sweeter, and you can instantly feel the muscles in your body relaxing, rejuvenating. It's a similar feeling to drinking fresh blood, but the effect is more immediate, more pronounced.<</if>> You feel, physically, stronger.\n\nYou only planned to take a sip but you down the whole bottle. There's nothing on the bookshelf that looks similar - in fact, you're pretty sure some of those are poisons - so you don't bother taste-testing anything else. You put the bottle back on the table, and:\n\n<<if $thrallShop is \"docile\">>1. <span id=\"oneAct\">[[Head outside|ShopThrall]]</span>\n\\<<else>>1. <span id=\"twoAct\">[[Head outside|ShopDoor][$anotherOne to 1]]</span><</if>><</replace>><</link>></span><</if>></span>",
      "links": [
        {
          "text": "Head outside",
          "destination": {
            "name": "ShopThrall",
            "pid": 38
          }
        },
        {
          "text": "Head outside",
          "destination": {
            "name": "ShopDoor",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "ShopThrall",
      "text": "<<if $thrallShop is \"alert\">><<if $surprised is \"yes\">>You set your hand on the doorknob and are about the pull it open when a crossbow bolt buries itself in the metal of the door, just above your hand. You flinch back, and turn to see a man in the hallway - the alcove, really - across from the door. He's quickly reloading the huge crossbow in his hands, and cursing under his breath.\n\n<<else>>You poke your head cautiously around the corner, just to check, and immediately pull your head back as a crossbow bolt is fired off. It buries itself deeply into the stone wall behind you.\n\nA man stands in that hallway - it's more of an alcove, really - carrying a large crossbow. You can hear him swearing and he huries to reload it. <</if>>\n\\<<elseif $thrallShop is \"docile\">><<if $magicShop is 1>>The door is on some sort of spring, and wants to stay closed, but you're able to pry it open again and exit the room. You get halfway out the doorway before you finally notice the man standing across the hall from you, in the alcove you'd previously mistaken for another pathway. He's holding a huge crossbow aimed right at your chest. \n\nYou duck to the side as he fires the bolt, and it buries itself into the metal door where you'd stood milliseconds ago. <<else>>You poke your head cautiously around the corner, just to check, and see two things. First, this hallway is really more of an alcove, with just enough room for a person to stand if they were, say, lying in wait to watch this door. Second, there's a man standing there. He's got a crossbow at least a quarter of the size of himself leaning against the wall by his feet. And he locked eyes with you.\n\n<</if>><</if>>You:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Attack\">><<replace \"#levelOne\">>1. Attack\n\nWithout even thinking about it, you reach for your blade and spring forward. The thrall steps back in shock, fumbling with the crossbow bolt he was trying to load, and lifts the crossbow itself up to block your blow. The weapon is slow and clunky, and you're pretty sure you damaged it well enough he won't ever be able to get it to work. He holds it tightly between you though, fear in his eyes.\n\nYou:\n\n<span id=\"levelTwo\"> 1. <span id=\"oneAct\"><<link \"Kill him\">><<replace \"#levelTwo\">>1. Kill him\n\nA well aimed thrust with your blade buries it into the thrall's stomach. He stares at you as his blood starts to drain out. It smells lovely but it's such a waste, you think.<<set $thirst += 1>>\n\nBefore he dies the thrall drops the broken crossbow. He tries to grab at your blade too, but he doesn't have the strength to push it out of his body. You do that for him. Then he slumps, dead, to the floor.<<set $thrallShop to \"dead\">><<set $dead += 1>>\n\nThat was quick, you think, cleaning the blood off your blade. For a moment there you were really panicked. Good thing Viscardi's thralls are so slow on the draw. You resheath your blade, and:\n\n1. <span id=\"oneAct\">[[Go through the metal door|MagicShop]]</span>\n2. <span id=\"twoAct\">[[Head forward through the maze|SecondTrap]]</span>\n3. <span id=\"threeAct\">[[Head back to the entrance of the maze|DeepRoad][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Kill */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Feed him your blood\">><<replace \"#levelTwo\">>2. Feed him your blood\n\nWith your blade still cutting into the limb of the crossbow, you raise your other hand up and cut it on the sharp point. The thrall pushes back on the crossbow, trying to get you off him eyes wide with fear. He sees the bloody display and actually begins to shake his head. He's almost blubbering, you realize.\n\nThat makes it easy to reach over with your bloody palm and force the blood into his mouth. He tries to fight you but it only lasts a few seconds. Then the blood takes effect and his eyelids droop. His strength leaves him.\n\nYou sheath your blade in time to catch the thrall before he falls face-first into the stone floor. You lower him down gently, setting him against the maze wall while you listen to his heart slow, slow... and keep beating. The ritual worked. He's still alive, in a sense, and Viscardi's control is gone.<<set $thrallShop to \"freed\">><<set $freed += 1>>\n\nYou stand up and clean yourself off. Just a bit more to go, you think, and you:\n\n1. <span id=\"oneAct\">[[Go through the metal door|MagicShop]]</span>\n2. <span id=\"twoAct\">[[Head forward through the maze|SecondTrap]]</span>\n3. <span id=\"threeAct\">[[Head back to the entrance of the maze|DeepRoad][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free */\n\\</span> /* twoAct */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Attack */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Duck behind the wall\">><<replace \"#levelOne\">>2. Duck behind the wall\n\n<<if $magicShop is 1>>You all but leap to the side, ducking behind the maze wall so there's a barrier between you and the thrall. You can hear him cursing, trying to fit a new bolt into his crossbow while he moves closer to your side of the wall. This cover isn't going to do you much good; you have to decide something fast.<<else>>You quickly duck back behind the wall,  putting that barrier between you as <<if $thrallShop is \"docile\">>the thrall curses and prepares another crossbow bolt<<else>>the thrall finishes preparing his next bolt<</if>>. You can hear as he moves, getting closer to the wall so he can reach around and shoot again. This cover isn't going to last long; you'll have to act fast.<</if>> You:\n\n<span id=\"levelTwo\"> 1. <span id=\"oneAct\"><<link \"Swing your blade around the corner\">><<replace \"#levelTwo\">>1. Swing your blade around the corner\n\nYou can't see, but you can hear that the thrall is within reach. You draw your blade quickly from your side and without looking, swing it wildly towards the sound of the thrall around the corner.\n\nHe gasps in pain, and you can hear the crossbow hit the ground. A bolt fires uselessly into the stone.<<set $thirst += 1>>\n\nYou step around the corner and see your blade digging into the thrall's arm. It's deep - blood is pouring out of the wound at an alarming rate. The thrall is staring down at his own blood in shock, almost ignoring you. You:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Finish him off\">><<replace \"#levelThree\">>1. Finish him off\n\nYou pull your blade back, and with better aim bury it into the thrall's chest. He shifts his gaze from his own blood to you, and stares at you in shock while the life leaves his eyes. You grip your blade tight as he falls off of it, into a heap on the ground. He's dead in moments.<<set $thrallShop to $dead>><<set $dead += 1>>\n\nYou try your best to clean the blood off your blade, and replace it at your side. That could have gone so much worse, you think. You take a deep breath, let it out, and then:\n\n1. <span id=\"oneAct\">[[Go through the metal door|MagicShop]]</span>\n2. <span id=\"twoAct\">[[Head forward through the maze|SecondTrap]]</span>\n3. <span id=\"threeAct\">[[Head back to the entrance of the maze|DeepRoad][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Finish him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Save him\">><<replace \"#levelThree\">>2. Save him\n\nThere's no way you can stop that blood-flow. But you can make it not matter.\n\nYou take your blade back and cut it against your own skin, letting the vampire blood in you flow for a second. Then you take the blood that's gathered, and force it into the man's mouth. He doesn't fight you much; he's losing strength too quickly.\n\nHe falls unconscious within seconds<<if $freed > 2>>, a lot faster than the others did<</if>>. As you lower his body gently to the floor, the blood spilling out of him slows, too. You can his heartbeat, seconds ago quick and frantic, already starting to slow. But it doesn't stop. The turning ritual is already taking effect.<<set $thrallShop to \"freed\">><<set $freed += 1>>\n\nYou stand up, and try to wipe as much of the blood off your arms as you can. He won't be in the best shape when he wakes up, but he will wake up, and that'll have to do. You:\n\n1. <span id=\"oneAct\">[[Go through the metal door|MagicShop]]</span>\n2. <span id=\"twoAct\">[[Head forward through the maze|SecondTrap]]</span>\n3. <span id=\"threeAct\">[[Head back to the entrance of the maze|DeepRoad][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Save him */\n\\</span> /* twoAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Swing Blade */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Grab the thrall when he appears\">><<replace \"#levelTwo\">>2. Grab the thrall when he appears\n\nYou wait, tense, counting the milliseconds before the thrall will whip around the corner again, crossbow in hand, to try to shoot you. You'll have an instant to react, and just one try to get him.\n\nYou hear his boots against the stone as he goes to move, and you spring forward first. Your hand, practically a claw, knocks the crossbow to the side and grips around his throat. He stumbled back in shock and then you have him pinned against the opposite wall, unable to swing his crossbow back into position. You wrench it out of his grip, just for good measure, and then:\n/* LEVEL THREE */\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Taste his blood\">><<replace \"#levelThree\">>1. Taste his blood\n\nYou lean forward and bite down into the thrall's neck, right below where you're holding him up with your hand. He's trying to pry your hand away, trying to get free, but after your fangs sink into his artery he goes still<<if $firstBite is \"yes\">>. Viscardi's control taking over again. This close to Viscardi's own crypt - you assume - and you would have thought he'd have taught his thralls to only respond that way to his own bite. Maybe he didn't expect another vampire coming after him this directly. Maybe that will be his undoing.\n\nYou drink perhaps more of this thrall than you strictly need to, and then you decide to:<<else>>, like he doesn't want to fight you.\n\nYou barely even notice. The taste of fresh blood... it's your first time. Wil never let you drink anything fresher than a recently discovered corpse. You had no idea blood could be this intoxicating. You also have no idea how you managed to go without it for this long. You drink deep, barely even aware of how much time is passing, until you:<</if>>\n/* LEVEL FOUR */\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Drain him\">><<replace \"#levelFour\">>1. Drain him\n\n<<if $firstBite is \"no\">>It happens a lot quicker than you had been expecting. One moment he was alive, letting you kill him, and then the next... you killed him. You drop the body and it hits the floor like a sack of rocks. You have blood spilled all down your front, and you try to clean it up as best you can. It's not a perfect clean-up job, but it'll have to do.<<set $firstBite to \"yes\">>\n\nYou look around, remembering where you are, and what's going on. The maze. The out-of-place metal door. The crypt Viscardi sleeps in. You:<<else>>No point in leaving any more of Viscardi's thralls available to him if you have the option to take them off the table. The thrall doesn't even try to stop you as you drain the life out of him. You can feel his hands, still loosely gripped at yours, lose all their strength, then fall to his sides. When you let go, all the useful blood gone, the body drops like a sack of rocks. You feel contentedly full.\n\nYou wipe some of the spilled blood off your face, lick your fingers, and then:<</if>><<set $thrallShop to \"dead\">><<set $dead += 1>><<set $thirst to 0>>\n\n1. <span id=\"oneAct\">[[Go through the metal door|MagicShop]]</span>\n2. <span id=\"twoAct\">[[Head forward through the maze|SecondTrap]]</span>\n3. <span id=\"threeAct\">[[Head back to the entrance of the maze|DeepRoad][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Bite Kill */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Pull yourself back\">><<replace \"#levelFour\">>2. Pull yourself back\n\n<<if $firstBite is \"no\">><<set $firstBite to \"yes\">>You didn't mean to kill this thrall, but it's physically difficult to stop yourself from doing so. You pull back, and some of the blood follows you, but he's still bleeding which means, for now, he's still alive.\n\n<<else>>You pull back once you've taken all you want, leaving enough left so he won't die immediately. \n<</if>>He's still not bothering to fight you, so you lower him to the floor gently and prepare a bit of your own blood. He doesn't quite accept it, but he doesn't fight it either. In a minute, he's unconscious. His heart rate is slowing, but it doesn't stop. Wil's ritual is working.<<set $thrallShop to \"freed\">><<set $freed += 1>>\n\nYou stand up, and clean yourself off as best you can. There's still the rest of this maze to navigate, and Viscardi's crypt to find. You glance around you, at the metal door tucked into the wall nearby, and the path that leads further into the maze, and you:\n\n1. <span id=\"oneAct\">[[Go through the metal door|MagicShop]]</span>\n2. <span id=\"twoAct\">[[Head forward through the maze|SecondTrap]]</span>\n3. <span id=\"threeAct\">[[Head back to the entrance of the maze|DeepRoad][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Bite Free */\n\\</span> /* twoAct */\n\\</span> /* levelFour */\n/* LEVEL FOUR */\n\\<</replace>><</link>> /* link replace Bite him */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Feed him your blood\">><<replace \"#levelThree\">>2. Feed him your blood\n\nHe's gasping in your grasp, trying to pry your hand away, which makes it easy to force-feed him a handful of your own blood. He coughs when you let go of his throat, trying to catch his breath and spit the blood out at the same time, but the blood has already taken effect. His eyelids droop, and he fights it. He gives you a scared look. And then his body loses consciousness.<<set $thrallShop to \"freed\">><<set $freed += 1>>\n\nYou listen as his heart rate slows down to a slow, steady, thrum. His breathing evens out as well. He'll be confused when he wakes up, but he won't have Viscardi's control weighing on his mind anymore.\n\nYou:\n\n1. <span id=\"oneAct\">[[Go through the metal door|MagicShop]]</span>\n2. <span id=\"twoAct\">[[Head forward through the maze|SecondTrap]]</span>\n3. <span id=\"threeAct\">[[Head back to the entrance of the maze|DeepRoad][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free him */\n\\</span> /* twoAct */\n\\</span> /* levelThree */\n/* LEVEL THREE */\n\\<</replace>><</link>> /* link replace Grab Thrall */\n\\</span> /* twoAct */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Duck */\n\\</span> /* twoAct */\n\\</span> /* levelOne*/",
      "links": [
        {
          "text": "Go through the metal door",
          "destination": {
            "name": "MagicShop",
            "pid": 37
          }
        },
        {
          "text": "Head forward through the maze",
          "destination": {
            "name": "SecondTrap",
            "pid": 36
          }
        },
        {
          "text": "Head back to the entrance of the maze",
          "destination": {
            "name": "DeepRoad",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "SideTunnel",
      "text": "<<if $direction is \"in\">>The tunnel zigs and zags a bit, going all over the place there's a few break-offs, including a tunnel that you're pretty sure doubles back to the entrance of this maze, but overall you're making progress.\n\nEventually you reach a spot where the tunnel splits into too, and you can't immediately tell if either is a dead end. In fact, down one tunnel you see a hint of light. You:\n\n1. <span id=\"oneAct\">[[Take the path with the light|RedHerring][$redHerring to 2]]</span>\n2. <span id=\"twoAct\">[[Take the other path|DeepRoad][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back to the maze entrance|BossMaze][$direction to \"out\"]]</span>\n<<else>>The tunnel winds and winds back to the entrance to this maze, dead ends and connecting side tunnel, enough to confuse a normal human. You reach a familiar split in the path; a light comes down the tunnel from one direction, and the other leads out into the rest of Viscardi's lair. You:\n\n1. <span id=\"oneAct\">[[Take the path with the light|RedHerring][$redHerring to 2]]</span>\n2. <span id=\"twoAct\">[[Take the other path|DeepRoad][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back to the maze entrance|BossMaze][$direction to \"out\"]]</span><</if>>\n",
      "links": [
        {
          "text": "Take the path with the light",
          "destination": {
            "name": "RedHerring",
            "pid": 41
          }
        },
        {
          "text": "Take the other path",
          "destination": {
            "name": "DeepRoad",
            "pid": 40
          }
        },
        {
          "text": "Go back to the maze entrance",
          "destination": {
            "name": "BossMaze",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "DeepRoad",
      "text": "<<if $direction is \"in\">>This path doesn't take you anywhere interesting, but it also doesn't dead-end. You follow it down for another ten minuted, backtracking when you take a wrong turn but mostly anticipating the twists and turns, and you think about what you want to do to Viscardi when you finally get to the end of this maze.\n\n<<if $goal is \"kill\">>Hopefully he's still asleep, so you can kill him easily. If he's awake you'll probably still be able to get him, you'll just have to be fast about it. Just as long as at the end of the day, Viscardi is dead. That's all that really matters.\n\\<<elseif $goal is \"free\">>There's probably at least one more thrall still being controlled by Viscardi, who he set to guard his crypt. <<if $freed > 4>>If you can find them, and free them too, maybe you'll avoid having to deal with Viscardi at all. Or you could kill him anyway, so the newly freed vampires won't have him breathing down their necks.<<elseif $freed < 2>>Maybe you'll get around to dealing with it. <<if $dungeon is 0 and $quarters is 0>>Maybe after you deal with Viscardi, you'll go back and free the thralls, to save them from the torment of a dead master. The way Wil made it sound, that would be a mercy.<</if>><<else>>You're not really sure what you'll do about it, if you see it. Saving thralls from their fate, the fate you were saved from, is important - but maybe just taking Viscardi out of the picture is more important.<</if>>\n\\<<elseif $goal is \"steal\">>Hopefully he's still asleep, so snatching that amulet will be a breeze. He doesn't sleep with it on him, which is like asking to get it stolen, you think. If he's awake, you'll probably have to kill him first - and be fast about it, too. You're pretty strong now, you think, but you cross your fingers hoping it's strong enough.<</if>>\n\nYou:\n\n1. <span id=\"oneAct\">[[Continue through the maze|ShopDoor]]</span>\n2. <span id=\"twoAct\">[[Turn back|SideTunnel][$direction to \"out\"]]</span><<else>>You've mostly figured this maze out by now, so it's easy picking your way back towards the beginning of it. Or perhaps Viscardi would consider his mansion the beginning of the maze, and the rest of the lair the end? You wonder what he was more worried about when he had this place dug out - visitors to the mansion creeping into the lair hidden below it, or his own expendable thralls sneaking up into the mansion?\n\nIt's so quiet down here, your mind is wandering. You shake yourself out of your thoughts, and:\n\n1. <span id=\"oneAct\">[[Continue to the beginning of the maze|BossMaze]]</span>\n2. <span id=\"twoAct\">[[Turn back|ShopDoor][$direction to \"in\"]]</span><</if>>",
      "links": [
        {
          "text": "Continue through the maze",
          "destination": {
            "name": "ShopDoor",
            "pid": 51
          }
        },
        {
          "text": "Turn back",
          "destination": {
            "name": "SideTunnel",
            "pid": 39
          }
        },
        {
          "text": "Continue to the beginning of the maze",
          "destination": {
            "name": "BossMaze",
            "pid": 19
          }
        },
        {
          "text": "Turn back",
          "destination": {
            "name": "ShopDoor",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "RedHerring",
      "text": "<<if $redHerring is 1>>You travel down the east tunnel for a while, backtracking at dead ends and false ends. It's slow going, but it's going, and you think you might finally be getting somewhere in this maze.\n\nUntil you hit the last dead end, and realize you've walked down every tunnel in this section of the maze. There's nowhere to go.\n\nWith a heavy sigh, you:<<set $soClose to 1>>\n\n1. <span id=\"oneAct\">[[Go back|BossMaze]]</span>\n\\<<elseif $redHerring is 2>>The tunnel gets minutely brighter as you follow it down. It takes you about five minutes to reach the end... which happens to be another dead end. A small shaft of daylight falls through a hole in the ceiling. You can't get close enough to tell if it was created intentionally, or if this section of the maze is just caving in.\n\nWith a heavy sigh, you:\n\n1. <span id=\"oneAct\">[[Go back|SideTunnel]]</span>\n<</if>>",
      "links": [
        {
          "text": "Go back",
          "destination": {
            "name": "BossMaze",
            "pid": 19
          }
        },
        {
          "text": "Go back",
          "destination": {
            "name": "SideTunnel",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "BossThrall",
      "text": "<<if $thrallBoss is \"docile\">>You sneak up behind the woman, silently, until you're just a few footsteps behind her. She looks a bit more intelligent than the other thralls you faced. Somehow more aware of herself. But she's still just a thrall, after all, so it takes you completely by surprise when she draws the sword at her side and swings madly behind her.\n\nYou barely dodge it, and begin to reach for your own blade, but the thrall is unfazed. She swings again, and you:<<elseif $thrallBoss is \"alert\">>Your hand rests on the handle of the door but you pause, just long enough to hear a heavy boot on stone behind you. You duck: a sword slashes through the air millimeters above you.\n\nStanding behind you is a woman in full guard's armor, but you barely have a moment to take the sight of her in. She swings again at you and you manage to dodge to the side; she's faster than the other thralls you faced. More aware of her surroundings, too. You reach for her own blade, and when she swings again you just manage to:<</if>>\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Dodge again\">><<replace \"#levelOne\">>1. Dodge again\n\nYou try to sidestep, to get closer to one of the room supports  so you can put that between you. Anything to hold her off for a moment longer. But for once, you misjudge the speed Viscardi's thralls can work at. She anticipates your movement and matches your footwork, and you come away from it with a huge gash in your arm and shoulder.<<set $wound += 1>>\n\nThe thrall is actually smiling. At least you're pretty confident she's a thrall - she's not as glassy-eyed as the others, but there's still some gloss there - but there's definitely something different about her. You'll have to end this encounter quickly, if you want to come out of it with most of your <<if $firstBite is \"yes\">>newly acquired <</if>>blood in tact.\n\nThe obvious thing to do is:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Bite her\">><<replace \"#levelTwo\">>1. Bite her\n\nYou bar your fangs and lunge forward. The thrall stumbles back in surprise - she's definitely noticed your teeth, and is putting two and two together<<if $firstBite is \"yes\">>, but if your experience with the other thralls tells you anything, she shouldn't fight you much once your teeth are in her neck. None of the others did.<</if>> You manage to grip her sword arm, to keep that blade away from you while you drink, and then you sink your fangs into the unwitting thrall's neck.\n\nShe immediately pushes you off. <<if $wound > 5>>With a surprising amount of strength, you could add. She manages to get her sword arm free of you as well, and pulls the blade up to your throat while covering her own wound with her other hand. Just looking at this sword again makes your shoulder throb.\n\n\"What are you?\" she asks, her voice rough from disuse. You're actually about to answer - I mean, shouldn't it be obvious? - when she says \"No matter,\" and plunges her sword into your neck.\n\nIt... doesn't feel great. But you're a vampire, you think. A normal sword won't be able to kill you that easily. You try to open your mouth to speak, but all that comes out is blood. The thrall wrenches her sword free, and for a moment you wait for your skin to stitch closed. It doesn't happen.\n\n\"Silver will kill you just the same,\" the thrall finishes saying. You feel your strength leave you. You begin to fall, and as you put your arms out to catch yourself... they don't move... as fast as you expect...\n\n1. [[Get back... up|End Credits]]<<else>>She's got more strength in her than you were expecting. She covers the wound with her free hand, and tries to swing at you with her sword, but you easily bat it away.<<set $thirst += 1>>\n\n\"What are you?\" she asks, her voice rough with disuse. It sounds like such a nonsense question, at this point. Isn't it obvious? You're tempted to actually answer her, but while she's confused and distracted it's probably easier to just:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Draw your blade\">><<replace \"#levelThree\">>1. Draw your blade\n\nYou draw your blade and the thrall gasps. She takes a step back away from you, but then her back hits one of the support pillars in the room and her head swivels around, realizing she's cornered.\n\n\"Please don't make this more difficult than it needs to be,\" you tell her, then you swing your blade towards he neck.\n\nShe manages to parry the blow, but only just. She opens her mouth, takes a breath as if she's about to scream - as if she's about to yell for her master in the next room over, and you can't have that. You bury your blade instead in that open mouth.<<set $thrallBoss to \"dead\">><<set $dead += 1>>\n\nWhen you pull the blade loose the thrall crumbled dead to the floor at your feet, blood now pooling around her. It's such a waste, you think as you clean your blade off, but you're not going to drink off the floor like a dog. Besides, you have more important things to do now. You sheathe your blade, and:\n\n1. <span id=\"oneAct\">[[Head through the double doors|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Get out of here|ViscardiCrypt]]</span>\n\\<</replace>><</link>> /* link replace Draw your blade */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Free her\">><<replace \"#levelThree\">>2. Free her\n\nYou wipe your free hand over the blood this thrall managed to graw from you, and in her moment of hesitant confusion you lunge forward to force it into her mouth.\n\nShe tries to draw away from you but her back hits one of the support pillars and you feel her lips under your palm. You manage to avoid a wild sword swing, and then she uses the hilt to physically push you off her. Her face is smeared with blood and you know<<if $freed > 0>> from experience<</if>> what managed to hit her tongue will be all that it takes.\n\n\"What did you do to me?\" she asks, but her eyelids are already drooping. She glares at you. She tries to regain her composure. She's loosing that fight quickly.<<set $thrallBoss to \"freed\">><<set $freed += 1>>\n\nYou catch her before she falls head-first until the stone ground. You're in direct view of the double doors, so you reach for the now unconscious woman's shoulders and drag her behind one of the sarcophagi. In the off chance <<if $goal is not \"free\">>you fail in your mission, and<</if>> Viscardi storms out seeking revenge before the young vampire fledgling can make her escape, you don't want her undead corpse to be the first thing he sees. When she's safely hidden away, you stand up, dust yourself off, and:\n\n1. <span id=\"oneAct\">[[Head through the double doors|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Get out of here|ViscardiCrypt][$direction to \"out\"]]</span>\n\\<</replace>><</link>>  /* link replace Free her */\n\\</span> /* twoAct */\n\\</span> /* levelThree.1 */\n\\<</if>>\n\\<</replace>><</link>> /* link replace Bite */\n\\</span> /* oneAct */\n<<if $thirst < 4>>2. <span id=\"twoAct\"><<link \"Force feed her\">><<replace \"#levelTwo\">>2. Force feed her\n\nYou wipe your free hand over the blood this thrall just drew from you, and then you lunge at her. She doesn't seem to expect that move - she tries to block your advance with her blade, but you push it out of the way. <<if $wound > 4>>If you can just get this blood into her mouth, then thrall or not the effect of it will overcome her. You just have to be fast. You just have to-\n\nYou feel the thrall's sword cut into your side. It's a dull cut - she didn't have the leverage to cause much damage - but the pain of it actually stuns you. She uses the brief pause to pull back, and then plunge her sword into your chest.\n\nIt... hurts. Which shouldn't be a surprise. You can feel pain, as a vampire. But no one's ever gotten this close to killing you before.\n\nYou grin, and it's supposed to be a triumphant smile but blood inexplicably pools around your tongue, ruining the effect. \"You can't kill me that easily,\" you say. You force yourself not to cough.\n\n\"It seems like I already have,\" the thrall says dispassionately. \"It doesn't matter what kind of creature you are - human or beast, silver kills them all the same.\"\n\nYou look down in confusion. Silver, you think. Wil said something about that once. You don't... quite remember....\n\n1. [[What it was...|End Credits]]<<else>>The pain in your shoulder actually throbs but you push past it, reach up, and smother the thrall's hand with your own bloody palm.\n\nShe wrenches away and gives you a look of disgust. \"What was-\" she starts to say, her voice rough from disuse, but then she stops. The blood has hit her tongue. She wipes it off her mouth and tries to spit it out, but already it's being absorbed into her body. You can see she's trying to fight it. You can see the moment she realizes she no longer can.\n\nThe thrall collapses in front of you without much more than a grunt. You catch her, to keep her from impaling herself. You wonder how much of a fight Wil had to put up from you when you went through this. This thrall won't remember it any better than you did, when she wakes up. But her brain will be her own.<<set $thrallBoss to \"freed\">><<set $freed += 1>>\n\nYou set her gently on the ground, out of sight of the double doors. In the off chance <<if $goal is not \"free\">>you fail in your mission, and<</if>> Viscardi storms out seeking revenge before the young vampire fledgling can make her escape, you don't want her undead corpse to be the first thing he sees.<<if $freed > 4>><<set $win to \"yes\">><<set $winFree to \"yes\">><</if>>\n\nWhen she's tucked away safely between the sarcophagi, you stand up, and:\n\n1. <span id=\"oneAct\">[[Head through the double doors|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Get out of here|ViscardiCrypt][$direction to \"out\"]]</span><</if>>\n\\<</replace>><</link>> /* link replace Force feed */\n\\</span><</if>> /* twoAct */\n\\</span> /* levelTwo.1 */\n\\<</replace>><</link>> /* link replace Dodge */\n\\</span> /* oneAct levelOne */\n2. <span id=\"twoAct\"><<link \"Parry\">><<replace \"#levelOne\">>2. Parry\n\nYou pull your blade the rest of the way out of its sheath and manage to block her swing just before it hits you. The back of your blade almost cuts into your shoulder, she's that strong. Still not stronger than you, but a lot stronger than you expected from a simple thrall.\n\nYou push back to force her off you. \"What are you doing here?\" she asks, in a voice rough from disuse. \"You've definitely not been invited by the master.\"\n\n\"Yeah, no duh,\" you spit back. With a quick twist of your wrist, you:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Disarm her\">><<replace \"#levelTwo\">>1. Disarm her\n\nShe matches your movement, and keeps hold of her sword. This is beginning to get frustrating.\n\nThe thrall also seems to notice your frustration, and the ghost of a smile forms on her lips. \"Then he won't mind if I kill you,\" she says. She matches it with a few swipes of her sword that you dodge easily - the longer the fight goes on, the more you get a sense of her movements - but one does manage to nick your skin. Your blood starts to trickle out<<if $thirst < 4>> and suddenly it's the only thing you can think about. Blood, and the taste of it, and how long it's been since you had any. You look up at the thrall in front of you, and you:<<else>>, slowly for a moment before the wound closes itself up. You look up at the thrall and she seems surprised to see it. You take advantage of her momentary shock to:<</if>>\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Bite her\">><<replace \"#levelThree\">>1. Bite her\n\nYou lunge forward, aiming for the thrall's neck. She stumbles back away from you so that you miss entirely, your fangs clashing against the rest of your teeth painfully.\n\n\"What - what are you?\" she asks in shock, but you're too frustrated now. The promise of fresh blood had been so close, and to be denied this easily just makes you angry. You resolve to:<<set $thirst += 1>>\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Free her\">><<replace \"#levelFour\">>1. Free her\n\nYour wound may no longer be bleeding, but there's still some of your own blood drying on your skin. You wipe it up with your free hand, then use your blade to knock the thrall's sword away again as you lunge forward once more - this time aiming your blood-covered palm for the thrall's mouth.\n\nIt's not there for long, you have to dodge away from her sword before she can cause any more damage, but you feel some of it pass between her lips, and that's all it'll take. \"What did you,\" she starts to say, but within moments she's having difficulty lifting her sword. The vampire blood is hitting her now.<<set $thrallBoss to \"freed\">><<set $freed += 1>>\n\nYou catch her before she can fall face-first into the stone floor. Then you drag her behind one of the stone sarcophagi, so she's not directly in sight of the doors to Viscardi's sleeping quarters. Just in case. When she's hidden you stand up, and clean yourself off. Just one thing to do now:\n\n1. <span id=\"oneAct\">[[Head through the double doors|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Get out of here|ViscardiCrypt][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free her (bite) */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Kill her\">><<replace \"#levelFour\">>2. Kill her\n\nYou blade is still out in your hand. You lift it up for the thrall to see.\n\n\"It doesn't matter anymore,\" you answer her. \"You'll be dead soon.\"\n\nIt takes you half a minute longer than you'd hoped for, which is frankly embarrassing, but when you ram the blade through this thrall's ribcage all the way up to the hilt, there's a satisfyingly stunned look on her face, and a gurgle of blood as she tries to speak, and then she's dead.\n\nShe doesn't fall off your blade easily and you get a bit of blood on you as you push her off. It's easy to lick yourself clean. The spilt blood pooling on the floor though... you may be thirsty, but not that thirsty.<<set $thrallBoss to \"dead\">><<set $dead += 1>>\n\nYou look around yourself once more, to make sure that thrall was the only one you had to deal with down here, and then you:\n\n1. <span id=\"oneAct\">[[Head through the double doors|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Get out of here|ViscardiCrypt][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Kill her */\n\\</span> /* twoAct */\n\\</span> /* levelFour.1 */\n\\<</replace>><</link>> /* link replace Bite her */\n\\</span> /* oneAct */\n<<if $thirst < 4>>2. <span id=\"twoAct\"><<link \"Force feed her your blood\">><<replace \"#levelThree\">>2. Force feed her your blood\n\nYour wounds may heal quickly, but there's still some of your own blood dripping on your skin. You wipe it up with your free hand, then use your blade to knock the thrall's sword away again as you lunge forward once more - this time aiming your blood-covered palm for the thrall's mouth.\n\nIt's not there for long, you have to dodge away from her sword before she can cause any more damage, but you feel some of it pass between her lips, and that's all it'll take. \"What did you,\" she starts to say, but within moments she's having difficulty lifting her sword. The vampire blood is hitting her now.<<set $thrallBoss to \"freed\">><<set $freed += 1>>\n\nYou catch her before she can fall face-first into the stone floor. Then you drag her behind one of the stone sarcophagi, so she's not directly in sight of the doors to Viscardi's sleeping quarters. Just in case. When she's hidden you stand up, and clean yourself off. Just one thing to do now:\n\n1. <span id=\"oneAct\">[[Head through the double doors|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Get out of here|ViscardiCrypt][$direction to \"out\"]]</span>\n\n\\<</replace>><</link>> /* link replace Free her */\n\\</span> /* twoAct */\n\\<</if>>\n\\</span> /* levelThree.2 */\n\\<</replace>><</link>> /* link replace Disarm her */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Slice off her arm\">><<replace \"#levelTwo\">>2. Slice off her arm\n\nShe dodges the blow with ease, knocking the tip of your blade away. This is starting to get frustrating. \"Why won't you just die?\" you grunt angrily.\n\nYou press the attack and she continues to defend herself, even managing a small cut on your shoulder, but only just. You're almost equally matched. That shouldn't happen when a vampire fights a lowly vampire's thrall. You maneuver her towards one of the support columns, until her back is pressed against it and she's rightfully cornered. Fear is finally starting to show in her eyes, and you feel much better about the whole thing. Without a thought, you:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Bite her\">><<replace \"#levelThree\">>1. Bite her\n\nYou lunge forward, aiming for the thrall's neck. She stumbles back away from you so that you miss entirely, your fangs clashing against the rest of your teeth painfully.\n\n\"What - what are you?\" she asks in shock, but you're too frustrated now. The promise of fresh blood had been so close, and to be denied this easily just makes you angry. You resolve to:<<set $thirst += 1>>\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Kill her\">><<replace \"#levelFour\">>1. Kill her\n\nYou blade is still out in your hand. You lift it up for the thrall to see.\n\n\"It doesn't matter anymore,\" you answer her. \"You'll be dead soon.\"\n\nIt takes you half a minute longer than you'd hoped for, which is frankly embarrassing, but when you ram the blade through this thrall's ribcage all the way up to the hilt, there's a satisfyingly stunned look on her face, and a gurgle of blood as she tries to speak, and then she's dead.\n\nShe doesn't fall off your blade easily and you get a bit of blood on you as you push her off. It's easy to lick yourself clean. The spilt blood pooling on the floor though... you may be thirsty, but not that thirsty.<<set $thrallBoss to \"dead\">><<set $dead += 1>>\n\nYou look around yourself once more, to make sure that thrall was the only one you had to deal with down here, and then you:\n\n1. <span id=\"oneAct\">[[Head through the double doors|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Get out of here|ViscardiCrypt][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Kill her */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Free her\">><<replace \"#levelFour\">>2. Free her\n\nYour wound may no longer be bleeding, but there's still some of your own blood drying on your skin. You wipe it up with your free hand, then use your blade to knock the thrall's sword away again as you lunge forward once more - this time aiming your blood-covered palm for the thrall's mouth.\n\nIt's not there for long, you have to dodge away from her sword before she can cause any more damage, but you feel some of it pass between her lips, and that's all it'll take. \"What did you,\" she starts to say, but within moments she's having difficulty lifting her sword. The vampire blood is hitting her now.<<set $thrallBoss to \"freed\">><<set $freed += 1>>\n\nYou catch her before she can fall face-first into the stone floor. Then you drag her behind one of the stone sarcophagi, so she's not directly in sight of the doors to Viscardi's sleeping quarters. Just in case. When she's hidden you stand up, and clean yourself off. Just one thing to do now:\n\n1. <span id=\"oneAct\">[[Head through the double doors|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Get out of here|ViscardiCrypt][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Free her */\n\\</span> /* twoAct */\n\\</span> /* levelFour */\n\\<</replace>><</link>> /* link replace Bite her */\n\\</span> /* oneAct */\n<<if $thirst < 4>>2. <span id=\"twoAct\"><<link \"Stab her in the gut\">><<replace \"#levelThree\">>2. Stab her in the gut\n\nIt takes you half a minute longer than you'd hoped for, which is frankly embarrassing, but when you ram the blade through this thrall's ribcage all the way up to the hilt, there's a satisfyingly stunned look on her face, and a gurgle of blood as she tries to speak, and then she's dead.\n\nShe doesn't fall off your blade easily and you get a bit of blood on you as you push her off. It's easy to lick yourself clean. The spilt blood pooling on the floor though... you may be thirsty, but not that thirsty.<<set $thrallBoss to \"dead\">><<set $dead += 1>>\n\nYou look around yourself once more, to make sure that thrall was the only one you had to deal with down here, and then you:\n\n1. <span id=\"oneAct\">[[Head through the double doors|CoffinRoom]]</span>\n2. <span id=\"twoAct\">[[Get out of here|ViscardiCrypt][$direction to \"out\"]]\\</span>\n\\<</replace>><</link>> /* link replace Kill her */\n\\</span> /* twoAct */\n\\<</if>>\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Wound her */\n\\</span> /* twoAct */\n\\</span> /* levelTwo.2 */\n\\<</replace>><</link>> /* link replaceParry */\n\\</span> /* oneAct levelOne */\n\\</span> /* levelOne */",
      "links": [
        {
          "text": "Get back... up",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Head through the double doors",
          "destination": {
            "name": "CoffinRoom",
            "pid": 43
          }
        },
        {
          "text": "Get out of here",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        },
        {
          "text": "What it was...",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "CoffinRoom",
      "text": "<<if $viscardi is \"dead\">>The room reeks of vampire blood. In the center of this circular chamber is Viscardi's gold-trimmed wooden coffin, raised on a dais. A few feet away, dead on the floor, is the man Viscardi himself. His open eyes stare lifelessly up at the rafters.\n\nThe jewelry box still sits on its pedestal by the coffin. You:\n\n1. <span id=\"oneAct\">[[Check out the jewelry box|ViscardiAmulet]]</span>\n2. <span id=\"twoAct\">[[Leave this room|ViscardiCrypt][$direction to \"out\"]]</span>\n<<else>>You nudge the door open the bare minimum needed to slip through it, and click it closed behind you, and you're in.\n\nYou find yourself in a circular chamber that smells heavily of blood. The walls are covered in tapestries, or hooks for clothes to hang from, or shelves lined with trinkets. In the center of the room, on a dais with steps leading up to the brim, is a singular coffin. It's wooden, plain-looking except for the gold trim around the edges and the gold-leafed handles along the sides.\n\nViscardi's coffin.\n\nBy the head of it is a small pedestal, on which sits a small wooden box. It matches the coffin actually, but it's obviously a sort of jewelry box. A jewelry box that isn't locked, either.\n\nAs far as you can see, you're alone in this room. You're also filling with emotion but you swallow it back, and:\n\n1. <span id=\"oneAct\">[[Go up to the coffin|ViscardiCoffin]]</span>\n2. <span id=\"twoAct\">[[Check out the jewelry box|ViscardiAmulet]]</span>\n3. <span id=\"threeAct\">[[Leave quickly|ViscardiCrypt][$direction to \"out\"]]</span><</if>>\n<<if $freed > 4 or $dead > 4>><<set $viscardi to \"alert\">><</if>>",
      "links": [
        {
          "text": "Check out the jewelry box",
          "destination": {
            "name": "ViscardiAmulet",
            "pid": 53
          }
        },
        {
          "text": "Leave this room",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        },
        {
          "text": "Go up to the coffin",
          "destination": {
            "name": "ViscardiCoffin",
            "pid": 54
          }
        },
        {
          "text": "Leave quickly",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "ViscardiFight",
      "text": "<<if $viscardi is \"other\">>You turn and take one step when you hear a voice coming from somewhere behind you. \"Leaving so soon?\" he says. \"But you just got here.\"\n\nYou reach for your blade as you turn to look, but the room around you is empty. Above you, among the rafters, you hear a chuckle, and then Viscardi himself descends to the ground.<<elseif $viscardi is \"amulet\">>You lift the amulet up from the velvet it rests on, and hear a sound behind you. You grab your blade and whirl around to defend yourself but no one is there. From somewhere up above you, you hear a growl.\n\n\"If I were you I'd //put that back//,\" he says. From his hidden spot among the rafters of the room, Viscardi himself descends to the ground.<<elseif $viscardi is \"coffin\">>Your blade cuts easily through the wood of the coffin lid, but when you start to pull it away you hear a deep, slow laugh.\n\n\"You didn't think I'd make it that easy, did you?\" he asks. His voice doesn't come from the coffin. It comes from somewhere else in the room.\n\nYou pull your blade free and spin around, holding it up to defend yourself as the vampire Viscardi himself descends from his hidden spot among the rafters. Damnit, you think.<</if>> He holds his own silver blade ready at his side, but when he lands he doesn't immediately attack you with it. Instead, he gives you an assessing look.\n\n\"I recognize you,\" he says with a frown. That voice is almost enough to send you into a panic. There was a time when anything he would say you would do, without a thought or even a mind of your own. Your first instinct right now is to run, but you can't, and you came here with a mission after all.\n\nHe's still talking. \"You used to be one of mine,\" he says, which sends a chill down your spine. You can't think of a witty retort in time. \"That's a neat trick. I thought you'd just died.\"\n\n<<if $thirst > 4>>He smells of blood. You smelt blood in this room when you entered but now that he's standing right in front of you the smell is overwhelming. You haven't eaten in years, it feels like. Days maybe? Hours? You can't even remember. What would vampire blood even taste like?\n\nThe thought repulses you and yet as soon as you have it, you can think of nothing else. You can't stop yourself. You:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Bite Viscardi\">><<replace \"#levelOne\">>1. Bite Viscardi\n\nYou lung forward, dropping your blade on the stoen floor without regard, and aim your barred fangs for Viscardi's throat. He didn't seem to have expected that.\n\nYou manage to get within inches of his skin - the scent of blood so strong - before he gets a hand on your throat to pull you away. He holds you in a vice grip. \"What's this? Have you been starving without your master?\"\n\nYou wrench out of his grip. Your blade's nearby but your mind is still hazy with bloodlust. Maybe if you stab him you could drink from the wound, you think. You grab the sword in a loose grip, sizing up your opponent.\n\n\"If you calm down,\" Viscardi says with a cocky grin, \"I could consider giving you a pet to eat.\"\n\nYou don't bother deliberating anymore. With another lunge, you:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Aim for his heart\">><<replace \"#levelTwo\">>1. Aim for his heart\n\nViscardi knocks the blade out of your grip without a thought. It goes skittering across the floor halfway across the room, and Viscardi's own blade presses against your rib cage. Your breathing, you realize, is ragged.\n\n\"It's impressive you managed to get all the way down here,\" he says, \"especially considering the daylight outside. I don't know what your plan was, but it obviously wasn't good enough.\"\n\nHe's too far out of your reach to be able to attack bare-handed, or bare-fanged. If you even try to draw blood now, it better be with a killing blow; if his blood hits the air while you're still under whatever effect this is,  you'll probably just go into a frenzy. You're struggling not to go into a frenzy, and throw yourself onto Viscardi's blade, as it is.\n\n\"OK,\" you say instead. It comes out shakey. You lift your palms in a placating gesture. \"I'm calm.\" You hate this, but it seems like your only option is to:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Surrender\">><<replace \"#levelThree\">>1. Surrender\n\nViscardi, the monster who kidnapped and tortured you and, for all intents and purposes, stole your life, stares at you with a frown. \"Well,\" he says. \"That's disappointing.\"\n\nYou feel the pain a few seconds after the blade slices into your chest. The scent of your own blood fills the air now, and it doesn't drive you into a frenzy. It just makes you feel...\n\n1. <span id=\"oneAct\">[[light-headed...|PlayerDeath]]</span>\n\\<</replace>><</link>> /* link replace Player death */\n\\</span> /* oneAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Bite again\n\\</span> /* oneAct */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Bite viscardi */\n\\</span> /* oneAct */\n\\</span> /* levelOne */\n\n<<elseif $wound > 4>>You try to lift your blade up, to put it between yourself and Viscardi, but you realize your hand is shaking. He notices it too, and grins, and you:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Duck behind his coffin\">><<replace \"#levelOne\">>1. Duck behind his coffin\n\nYou're a little ashamed of your action, but you're also terrified and can't help yourself. All the wounds you sustained in this hellhole over the past few hours are throbbing. It's like Viscardi designed this entire lair just to kill you.\n\nYou duck behind the coffin so now both it and your blade separate you from your old vampire master. He sighs warily like this is a game, and stalks closer. \"I probably should have killed you before you had a chance to run away,\" he says. You shuffled around the coffin, keeping it between you. \"If this is how you planned to come back and take your revenge.\"\n\nHe stops, and with a daunting vertical leap jumps onto the coffin. The wood groans beneath his weight, and now he towers over you, his silver blade poised, grinning. Just the sight of that silver is making your new scars ache. You:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Back up\">><<replace \"#levelTwo\">>1. Back up\n\nThere's nowhere else to go, nothing else to do. Why did you think this was a good idea? You should have listened to Wil, you think to yourself.\n\nYour back hits the rounded wall of this chamber, and even though Viscardi is still several feet away from you, balanced on an awkward wooden platform, you know you're cornered. You try to speak but instead you just sputter. Viscardi jumps again, and he lands in front of you. He rests the point of his silver blade against your rib cage.\n\n\"You haven't changed much,\" he says. \"Did you come back just so your old master could kill you properly?\"\n\nIn terror, you:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Surrender\">><<replace \"#levelThree\">>1. Surrender\n\nYou raise the palms of your hands up slowly. \"P-please,\" you manage, regretting everything.\n\n\"Oh don't worry,\" he says. \"I will.\"\n\nYou feel the pain a few seconds after the blade slices into your chest. It takes you a moment to process it, after all the other wounds you've sustained today. You suddenly... start to feel...\n\n1. <span id=\"oneAct\">[[light-headed...|PlayerDeath]]</span>\n\\<</replace>><</link>> /* link replace Player death */\n\\</span> /* oneAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Dodge */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Attack him\">><<replace \"#levelTwo\">>1. Attack him\n\nIn a frantic move, you slash your blade at the now eye-level legs. Viscardi hops over your blade with ease.\n\n\"You'll have to be quicker than that,\" he says, and he jumps down, landing on top of you.\n\nYour head hits the stone ground with a loud crack. Under normal circumstances that might hurt, but you'd heal. Now Viscardi's knees dig into your gut, your head is throbbing, and the cuts on your arms you'd thought already healed are threatening to reopen. You struggle, but you can feel the silder metal already digging into your rib cage. The only thing you can do is:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Plead for your life\">><<replace \"#levelThree\">>1. Plead for your life\n\n\"Wait,\" you cough. Your blade was knocked out of your grasp and you try reaching around aimlessly for it, but you can't find it. \"You don't have to-\"\n\nViscardi digs his knees into your diaphragm, and you lose the ability to speak. \"You were never very useful anyways,\" he says.\n\nYou feel the pain a few seconds after the blade slices into your chest. It takes you a moment to process it, after all the other wounds you've sustained today. You suddenly... start to feel...\n\n1. <span id=\"oneAct\">[[light-headed...|PlayerDeath]]</span>\n\\<</replace>><</link>> /* link replace Player death */\n\\</span> /* oneAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Attack */\n\\</span> /* twoAct */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Hide */\n\\</span> /* oneAct */\n\\</span> /* levelOne */\n<<else>>You ready your blade, putting it between you and him. \"No,\" you say, with all the fake confidence you can muster. \"That's your job.\" He smiles, and you:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Lunge forward and attack\">><<replace \"#levelOne\">>1. Lunge forward and attack\n\nViscardi parries your strike with ease, but you didn't think this would be an easy kill. You practiced your techniques for weeks to perfect your skill, and it seems to have paid off. You match Viscardi footstep for footstep, parrying his own blows and striking your own around the central dais of the coffin room.\n\n\"You've been busy since you disappeared,\" he says as your blades clash. He pushes you back, and you twist around until your back is to the coffin. \"You're not as easy to kill as you used to be. That's good.\"\n\nYou force a smile. \"You're just as easy to kill,\" you say, and you slip away from his next blow. \"Only now I have the skills to do so.\"\n\n\"We'll see,\" he says, and surprises you with a quick strike aimed at your neck. You:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Duck away\">><<replace \"#levelTwo\">>1. Duck away\n\nYou take two quick steps back to avoid the blow, and it slashes the air harmlessly in front of you. You continue backing up as Viscardi follows.\n\n\"Just stand still so I can kill you and get this over with,\" he says. You almost laugh at that.\n\n\"I'm not so easy to control anymore,\" you say, and you bare your teeth at him. Gripping your sword tighter, you:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Duck behind his coffin\">><<replace \"#levelThree\">>1. Duck behind his coffin\n\nYou put the coffin between you two. Viscardi glares at you from across its wooden surface.\n\n\"Yes, I noticed,\" he says. \"I assume you think that because you have sharp teeth and an allergy to sunlight now you're better than me?\"\n\n\"That's not why,\" you say. You're furtively glancing around the room now, trying to find the best way to kill Viscardi. Trying to match him in armed combat doesn't seem to be working, but there are no conveniently placed wooden stakes around here.\n\nViscardi chuckles, and you're not sure if he thinks what you said was funny, or if he's noticed your frantic looks. \"You're weak,\" he says. \"You were always weak. Your teeth may be overgrown but you haven't changed.\"\n\nHe leaps, a move you were not expecting, and clears the wooden coffin in a second. In a panic you back away but your sword clatters to the ground. You also don't notice the silver blade jammed into your own ribcage until a couple seconds later. You look down in shock to see it, as Viscardi says, \"You were a fool to think you could take me.\"\n\nYou reach for the handle of his blade so you can try to...\n\n1. <span id=\"oneAct\">[[pull it out...|PlayerDeath]]</span>\n\\<</replace>><</link>> /* link replace Cautious21 */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Aim for his heart\">><<replace \"#levelThree\">>2. Aim for his heart\n\nYou all but leap forward, aiming to stab for Viscardi's ribcage. You parries you away, of course, but he seems surprised by your surge of energy.\n\n\"I noticed,\" he says. \"I wonder who did that to you. They should have gotten my permission first.\"\n\n\"I don't belong to you,\" you say. You're pushing Viscardi back now; he's just a few feet away from the wall of this room. You wonder how long you'll be able to keep this up. \"I never belonged to you. She freed me from you, and now I'm freeing everyone else.\"\n\nViscardi lifts an eyebrow, but you can see the muscles in his neck straining as he tries to fend you off. \"'She'?\" he says. He gives a curt nod. \"I think I know who you're talking about. Well, //she// didn't give you anything.\"\n\n\"Yes she did,\" you say.\n\n\"No - if it wasn't for me, you would have been stuck in your hovel for the rest of your life. //I// gave you your powers.\"\n\n\"I didn't //ask// for these powers,\" you say. You pause in your assault, to try to assess what he's saying to you right now.\n\n\"Maybe not,\" he says, \"but isn't it so much better now?\" He actually drops his blade a bit, drops his guard for the slightest moment, as he's honestly trying to get you to side with him? So of course, you:\n\n1. <span id=\"oneAct\">[[Stab him|ViscardiDeath]]</span>\n\\<</replace>><</link>> /* link replace Reckless21 */\n\\</span> /* twoAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Cautious1 */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Knock the blade away\">><<replace \"#levelTwo\">>2. Knock the blade away\n\nYou twist your blade up sharply and knock his off aim. It glances harmlessly off your blade. Viscardi huffs in annoyance and takes a step back, and another, as you push him forward.\n\n\"That's not the only reason I'm hard to kill now,\" you say with a grin, flashing your teeth.\n\nHe has the guts to roll his eyes at you. \"Yes,\" he says, \"I noticed. I'm not an idiot.\"\n\nYou glare and continue to press your attack, but suddenly it feels like he's just letting you. Like he's toying with you. In anger, you:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Back away\">><<replace \"#levelThree\">>1. Back away\n\nYou take a couple steps back, careful not to show Viscardi your back, keeping your blade raised and pointed at him. He watches you go without pursuing, until you're both standing several feet away. You didn't notice your breath had grown so labored; you take a moment to slow it down.\n\n\"You don't want this,\" Viscardi says as he watches you.\n\n\"I really do,\" you say.\n\nHe shakes his head. \"You wouldn't have your abilities now if it wasn't for me.\"\n\n\"I didn't //ask// for these powers,\" you say. Your breath is under control again, so you take a step forward. Viscardi doesn't move.\n\n\"Maybe not,\" he says, \"but isn't it so much better now?\" He actually drops his blade a bit, drops his guard for the slightest moment, as he's honestly trying to get you to side with him? So of course, you:\n\n1. <span id=\"oneAct\">[[Stab him|ViscardiDeath]]</span>\n\\<</replace>><</link>> /* link replace Cautious22 */\n\\</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Raise your blade and aim for his heart\">><<replace \"#levelThree\">>2. Raise your blade and aim for his heart\n\nYou draw your arm back slightly and prepare to stab, to drive your blade as deeply as you can into his ribcage and end his miserable un-life. You don't even notice the twitch of a smile before you thrust, as Viscardi neatly sidesteps out of the way.\n\nYou also don't notice the silver blade jammed into your own ribcage until a couple seconds later. You look down in shock to see it, as Viscardi says, \"But you do seem to be. An idiot, that is.\"\n\nYou reach for the handle of his blade so you can try to...\n\n1. <span id=\"oneAct\">[[pull it out...|PlayerDeath]]</span>\n\\<</replace>><</link>> /* link replace Reckless22 */\n\\</span> /* twoAct */\n\\</span> /* levelThree */\n\\<</replace>><</link>> /* link replace Reckless1  */\n\\</span> /* twoAct */\n\\</span> /* levelTwo */\n\\<</replace>><</link>> /* link replace Attack */\n\\</span> /* oneAct */\n\\</span> /* levelOne */\n\\<</if>>",
      "links": [
        {
          "text": "light-headed...",
          "destination": {
            "name": "PlayerDeath",
            "pid": 56
          }
        },
        {
          "text": "pull it out...",
          "destination": {
            "name": "PlayerDeath",
            "pid": 56
          }
        },
        {
          "text": "Stab him",
          "destination": {
            "name": "ViscardiDeath",
            "pid": 55
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "ChurchStairs",
      "text": "<<if $win is \"yes\">> Your breathing becomes easier as you climb up the catacomb stairs into the building above. \\\n<<if $winAll is \"yes\">>You did it. Not only is Viscardi dead, but you freed the thralls - all of them - and the amulet is yours. You're free to leave whenever you want.\n\nYou can see the midday sunlight filtering in through the crypt doors above you, and you smile, knowing that it will not effect you. The amulet rests heavy over your chest. Behind you, sprawled throughout the caves below, lie seven newly awoken vampires. Perhaps you'll call Wil to come collect them, as she did for you. You haven't made up your mind.\n\nThere's only one thing you want to do now:\n\n1. <span id=\"oneAct\">[[Walk outside|End Credits]]</span>\\\n<<elseif $winFree is \"yes\">><<if $goal is \"free\">>You did it. <</if>>All of Viscardi's thralls lie unconscious, but free from his control. <<if $winKill is \"yes\">>So much the easier, now that he's dead too.<<else>>They should be able to wake up before he does, and if they're smart about it they'll get out of this hellhole. Somehow.<</if>>\n\nYou can see the midday sunlight filtering through the crypt doors above you. <<if $winSteal is \"yes\">>Lucky thing you grabbed that amulet. You can already feel its power working within you. For the first time in weeks that light will have no effect on your skin, and you can't help but smile just thinking about it. Too bad those poor suckers down below won't be able to see the sun again. Maybe you'll ask Wil to come fetch them once the sun has set.\n\nYou've met your goal already, but Viscardi is still alive. You consider turning around, and going after him too, before finally deciding to:\n\n1. <span id=\"oneAct\">[[Go back downstairs|MazeStart]]</span>\n2. <span id=\"twoAct\">[[Walk outside|End Credits]]</span>\\\n<<else>>You won't be able to leave the crypt until the sun sets, not unless you go back and get that amulet. <<if $winKill is \"yes\">><<if $goal is \"kill\">>But Viscardi is dead, and right now that's really all you can care about. You're free. They're all free. The burnt sunlit air doesn't taste so bad on your lungs.\n\nYou:<<else>>But you have the time, with that bastard lying dead a mile behind. You:<</if>>Also, Viscardi is still alive. You probably have time to go back and off him before he wakes up, but you're not sure if you want to travel all the way back to that tomb. It takes you a moment, but you finally decide to:<</if>>\n\n1. <span id=\"oneAct\">[[Go back downstairs|MazeStart]]</span>\n2. <span id=\"twoAct\">[[Wait for the sun to set|End Credits]]</span><</if>>\\\n<<elseif $winKill is \"yes\">><<if $dead gt 5>>The other thralls may all be dead, but <</if>>Viscardi is dead<<if $dead gt 5>>, too<</if>>. <<if $goal is \"kill\">>That's really all you cared about. <</if>><<if $winSteal is \"yes\">>And you managed to snag that magical amulet as well, which means you can walk out of this hellhole free as a bird, despite it being the middle of the day.\n\nYou can see the sunlight filtering in through the crypt doors above. You grin, imagining how it will feel, soft against your skin once more. <<if $dead lt 4 and $freed lt 3>>There's still the thralls back down there; you haven't fully decided what you're going to do about them. You could go take care of them, or leave them to their own devices.\n\nIt takes you a moment to decide, but you finally decide to:\n\n1. <span id=\"oneAct\">[[Go back downstairs|MazeStart]]</span>\n2. <span id=\"twoAct\">[[Walk outside|End Credits]]</span>\\\n<<else>>Killing Viscardi had been sweet, but this moment is about to be much sweeter. You don't hesitate at all before:\n\n1. <span id=\"oneAct\">[[Walking outside|End Credits]]</span><</if>>\\<<else>>His finally dead corpse can keep that stupid amulet, for all you care. You're free.\n\nYou can see the sunlight filtering in through the crypt doors above. You'll have to wait for the sun to set before you can walk outside again, but for once you don't mind so much. You have the time to kill. There's nothing down here that can hurt you. <<if $dead gt 4>>You don't mind:\n\n1. <span id=\"oneAct\">[[Waiting for the sun to set|End Credits]]</span><<else>>Except for the <<if $dead gt 2 or $freed gt 2>>remaining<</if>> thralls, of course, which you still have time to take care of. You pause a moment to decide, then:\n\n1. <span id=\"oneAct\">[[Go back downstairs|MazeStart]]</span>\n2. <span id=\"twoAct\">[[Wait for the sun to set|End Credits]]</span><</if>><</if>>\\\n<<elseif $winSteal is \"yes\">>You can see the sunlight filtering in through the crypt doors above, and for the first time in what feels like forever you know it can not hurt you. The amulet is a comfortable weight against your chest. You smile.\n\nViscardi will wake up powerless without this thing. <<if $dead gt 4>>His thralls are dead, his amulet is gone, and he'll be stuck in this hellhole just like you were, crawling around in the darkness waiting for the sun to set. Revenge is sweet.\n\n<<elseif $freed gt 4>>His ex-thralls will probably turn on him as soon as they wake up, just like you did, and even if he survives that he'll be stuck in this hellhole, waiting for the sun to rise just like you were. You almost wish you could be here to see his face when he realizes what you've done to him - but for once, you've got better things to do.<<else>>He may still have a few thralls but he won't be able to disguise himself anymore; now everyone will know what he is. And you, on the other hand, are free. <</if>>You don't even hesitate, before you:\n\n1. <span id=\"oneAct\">[[Walk outside|End Credits]]</span>\\\n<</if>>\n<<else>>You take two steps back up the staircase before your breathing starts to grow difficult. <<if $goal is \"kill\">>Viscardi is still down there, unaware. You have to stop him.<<elseif $goal is \"steal\">>The amulet is still down there, in Viscardi's grasp. You have to take it.<<elseif $goal is \"free\">>The thralls are still down there, mindlessly enslaved. You have to free them.<</if>> You can't leave just yet.\n\nBesides, you can already see the sunlight filtering in through the crypt doors above. The only place to go now is:\n\n1. <span id=\"oneAct\">[[Back downstairs|MazeStart]]</span><</if>>",
      "links": [
        {
          "text": "Walk outside",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Go back downstairs",
          "destination": {
            "name": "MazeStart",
            "pid": 9
          }
        },
        {
          "text": "Wait for the sun to set",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Walking outside",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Waiting for the sun to set",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Back downstairs",
          "destination": {
            "name": "MazeStart",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "End Credits",
      "text": "!Into the Lair\nWritten and designed by Kenna May\nusing Twine 2.0 and Sugarcube 2.18.0\n\nCreated for IFComp 2018\n\nSpecial thanks to ChapelR on Reddit for designing the code used for keyboard driven twining.\n\nAlso, a huge thanks to Nathan Cox, Candy Wynia, and Taylor Andrade for helping playtest, debug, and support.\n\n\nTo return to the title page:\n\n1. <span id=\"oneAct\">[[Return to Title Page|Starter Page]]</span>\n",
      "links": [
        {
          "text": "Return to Title Page",
          "destination": {
            "name": "Starter Page",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "StoryInit",
      "text": "<<set $thrallCrypt to \"docile\">><<set $thrallTunnel to \"docile\">><<set $thrallQuarters to \"docile\">><<set $thrallDungeon to \"docile\">><<set $thrallForest to \"docile\">><<set $thrallShop to \"docile\">><<set $thrallBoss to \"docile\">><<set $viscardi to \"docile\">>\n\n<<set $goal to \"steal\">><<set $win to \"no\">><<set $winFree to \"no\">><<set $winKill to \"no\">><<set $winSteal to \"no\">><<set $gameOver to \"no\">>\n\n<<set $freed to 0>><<set $dead to 0>><<set $thirst to 0>><<set $firstBite to \"no\">><<set $wound to 0>>\n\n<<set $direction to \"in\">><<set $quarters to 0>><<set $maze to 0>><<set $dungeon to 0>><<set $dungeonTrap to 0>><<set $this to 0>><<set $mazeTrap1 to 0>><<set $redHerring to 0>><<set $magicShop to 0>><<set $potion to 0>>\n\n<<set $springTrap to 0>><<set $prisoners to \"afraid\">><<set $prisonersLocation to \"cage\">>",
      "links": []
    },
    {
      "pid": 48,
      "name": "Thrall Test",
      "text": "Thrall encounter test page for the thrall in the crypt, or ThrallBoss\n\n<<if $thrallBoss is \"docile\">>\n\n<<elseif $thrallBoss is \"alert\">>\n\n<</if>>(Either way, description)\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Dodge\">><<replace \"#levelOne\">>1. Dodge\n\nPlayer dodges the thrall's strike poorly, and is wounded.\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Bite\">><<replace \"#levelTwo\">>1. Bite\n\nYou attempt to bite the thrall but she's surprisingly too strong, and she fights you off. If wound is too high, she manages to kill you here. Link away. If not, you either draw your blade and kill her, or use your wound to force feed her blood.\n\n<<if $wound > 5>> Player dies, link Away\n\n<<else>><span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Draw your blade\">><<replace \"#levelThree\">>1. Draw your blade\n\nYou draw your blade and kill the thrall. Link away.\n\n<</replace>><</link>> /* link replace Draw your blade */\n</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Free her\">><<replace \"#levelThree\">>2. Free her\n\nYou force feed her your blood. Link away.\n\n<</replace>><</link>>  /* link replace Free her */\n</span> /* twoAct */\n</span> /* levelThree.1 */\n<</if>>\n<</replace>><</link>> /* link replace Bite */\n</span> /* oneAct */\n<<if $thirst < 4>>2. <span id=\"twoAct\"><<link \"Force feed\">><<replace \"#levelTwo\">>\n\nYou force feed your blood to the thrall. Link away. (If wound is too high, player dies)\n\n<</replace>><</link>> /* link replace Force feed */\n</span><</if>> /* twoAct */\n</span> /* levelTwo.1 */\n<</replace>><</link>> /* link replace Dodge */\n</span> /* oneAct levelOne */\n2. <span id=\"twoAct\"><<link \"Parry\">><<replace \"#levelOne\">>2. Parry\n\nPlayer parry's the thrall's strike poorly.\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Disarm her\">><<replace \"#levelTwo\">>1. Disarm her\n\nYou attempt to disarm the the thrall, which doesn't work as well as you'd like.\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Bite her\">><<replace \"#levelThree\">>1. Bite her\n\nYou bite into the thrall's neck but she manages to fight you off.\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Free her\">><<replace \"#levelFour\">>1. Free her\n\nYou feed the thrall some of your blood. Link away.\n\n<</replace>><</link>> /* link replace Free her (bite) */\n</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Kill her\">><<replace \"#levelFour\">>2. Kill her\n\nYou kill the thrall. Link away.\n\n<</replace>><</link>> /* link replace Kill her */\n</span> /* twoAct */\n</span> /* levelFour.1 */\n<</replace>><</link>> /* link replace Bite her */\n</span> /* oneAct */\n<<if $thirst < 4>>2. <span id=\"twoAct\"><<link \"Free her\">><<replace \"#levelThree\">>\n\nYou feed the thrall some of your blood. Link away.\n\n<</replace>><</link>> /* link replace Free her */\n</span> /* twoAct */\n<</if>>\n</span> /* levelThree.2 */\n<</replace>><</link>> /* link replace Disarm her */\n</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Wound her\">><<replace \"#levelTwo\">>2. Wound her\n\nYou attempt to wound the thrall.\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Bite her\">><<replace \"#levelThree\">>1. Bite her\n\nYou attempt to bite the thrall, but it doesn't go as well as you'd hope.\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Kill her\">><<replace \"#levelFour\">>1. Kill her\n\nYou kill the thrall. Link away.\n\n<</replace>><</link>> /* link replace Kill her */\n</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Free her\">><<replace \"#levelFour\">>2. Free her\n\nYou feed the thrall your blood. Link away.\n\n<</replace>><</link>> /* link replace Free her */\n</span> /* twoAct */\n</span> /* levelFour */\n<</replace>><</link>> /* link replace Bite her */\n</span> /* oneAct */\n<<if $thirst < 4>>2. <span id=\"twoAct\"><<link \"Kill her\">><<replace \"#levelThree\">>2. Kill her\n\nYou kill the thrall. Link away.\n\n<</replace>><</link>> /* link replace Kill her */\n</span> /* twoAct */\n<</if>>\n</span> /* levelThree */\n<</replace>><</link>> /* link replace Wound her */\n</span> /* twoAct */\n</span> /* levelTwo.2 */\n<</replace>><</link>> /* link replaceParry */\n</span> /* oneAct levelOne */\n</span> /* levelOne */",
      "links": []
    },
    {
      "pid": 49,
      "name": "QuartersAlert",
      "text": "You notice an immediate difference rounding the corner back to the main room again. Primarily, there's now a woman there, staring back at you.<<set $thrallQuartersLocation to \"alert\">>\n\nShe's carrying a rusted knife in her hands, the kind a peasant uses to prepare meals with, and she's watching you with that faraway look of a thrall. Even with the blade she doesn't look like much of a threat. Yours are longer, and your much faster with them, for one.\n\nYou start to reach for the dagger at your side, as a threat, and immediately the woman begins to charge at you. For a regular human in the condition she's in, it's a surprisingly agile move. For a vampire like yourself, it's clumsy and slow. You watch her begin to move, and you:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Sidestep her\">><<replace \"#levelOne\">>1. Sidestep her\n\nYou watch the thrall rush at you, and a moment before she lashes out with her dull knife, you step to the side. The knife connects only with air. The woman's face contorts with confusion as she overextends, and then her back is facing you, and she's vulnerable. You:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Stab her\">><<replace \"#levelTwo\">>1. Stab her\n\nYour hand still rests on the hilt of the dagger at your side. While her back is turned to you, you pull the dagger out - and plunge it in. You feel the blade connect with the bones of her spine.\n\nThe thrall grunts in pain, but it's muted as her face hits the floor, the rusted knife in her own hands forgotten. You pull your dagger out, and take better aim before you bury it in the thrall's body again. She's dead in moments.<<set $thrallQuarters to \"dead\">><<set $dead += 1>>.\n\nYou take a minute to clean the blood off your hand and blade before sheathing it again at your side. The rest of the thrall's blood continues to spill out of her, and you shake off the feeling of what a shame, what a waste all that blood spilled out onto the dirty floor is.\n\nOnce you've composed yourself, you:\n\n1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Go back down the side tunnel|QuartersDeadend2][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Kill her */\n\\</span> /* oneAct in levelTwo, Kill her */\n2. <span id=\"twoAct\"><<link \"Pin her arms back\">><<replace \"#levelTwo\">>2. Pin her arms back\n\nYou grab her arms and twist them behind her back, probably rougher than you meant to. The woman calls out in pain, and she drops the knife. You gather her wrists up in one hand so you can use the other to stifle her shouts.\n\nShe's not as weak as the first thrall you faced, however. You can feel her muscles straining, and if you don't act fast she's likely to break free. You give yourself but a moment to decide, and then you:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Give her your blood\">><<replace \"#levelThree\">>1. Give her your blood\n\nYou knock her in the head to stun her, then reach quickly for your dagger again, to draw your own blood the way Wil showed you. It takes the woman a second to recover, but by that time you're already ready. You force the blood into her mouth. When she won't immediately swallow, you pinch her nose and wait. She fights against you, scratching at your arms in an attempt to push you away, but she's no match for your strength, and after a few moments her motions still, and she goes limp.<<set $thrallQuarters to \"freed\">><<set $freed += 1>>\n\nYou lay the woman gently on the floor. Her breathing grows shallow and steady, but she's alive, for real again. In a sense.\n\nYou try not to dwell on that thought. With the once-thrall taken care of, you can now:\n\n1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Go back down the side tunnel|QuartersDeadend2][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Feed her your blood */\n\\</span> /* oneAct, Feed her your blood */\n2. <span id=\"twoAct\"><<link \"Drink her blood\">><<replace \"#levelThree\">>2. Drink her blood\n\nYou shift her head to give yourself a better angle, and without letting go of her arms you sink your teeth into the thrall's neck, and begin to drink. She fights against you for a moment more, and then slowly stops moving. <<if $firstBite is \"no\">>You feel the warmth of her blood flowing into you, flooding you with a sensation you did not expect. It's intoxicating, and way more than you expected, and you want more of it. More and more. You barely realize how much you've drained from her, before there are just moments to:<<else>>Viscardi trained all his thralls not to fight a feeding. Guards and chefs weren't the only reason he kept them around, after all. She even tilts her head slightly, to stretch out that vein, and as the blood rushes through you decide right then to:<</if>>\n\n<span id=\"levelFour\">1. <span id=\"oneAct\"><<link \"Let her die\">><<replace \"#levelFour\">>1. Let her die\n\nYou drink all you can get before the body begins to slump, life ebbing out, and you let it fall to the floor. <<if $firstBite is \"no\">>It didn't take nearly as long as you expected. One moment the thrall was warm and compliant, and alive, and the next.... <</if>>You rub the excess blood off of your chin with the back of your wrist - and then lick that clean as well. No point making more of a mess than necessary.<<set $firstBite to \"yes\">><<set $thrallQuarters to \"dead\">><<set $dead += 1>>\n\nFeeling energized, you:\n\n1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Go back down the side tunnel|QuartersDeadend2][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Let her die */\n\\</span> /* oneAct, Let her die */\n2. <span id=\"twoAct\"><<link \"Let her live\">><<replace \"#levelFour\">>2. Let her live\n\n<<if $firstBite is \"no\">>You feel the woman grow weaker, and pull away just in time to stop yourself from killing her. She slumps in your arms, and you feel her heartbeat growing fainter and fainter.<<else>>You drink deeply from the thrall's veins, almost satisfying your thirst before you pull yourself away. She's still alive, but only just.<</if>> You lay her barely conscious body across the floor. It's no issue to draw your own blood, and drip it into her mouth. Her eyes flutter closed after a moment, and you can feel the vampire blood beginning to take effect.<<set $firstBite to \"yes\">><<set $thrallQuarters to \"freed\">><<set $freed += 1>>\n\nYou stand one once you're sure she's fallen unconscious, and you:\n\n1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Go back down the side tunnel|QuartersDeadend2][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Let her live */\n\\</span> /* twoAct, Let her live */\n\\</span> /* levelFour, in Drink her blood */\n\\<</replace>><</link>> /* link replace Drink her blood */\n\\</span> /* twoAct, Drink her blood */\n\\</span> /* levelThree, in Pin her arms */\n\\<</replace>><</link>> /* link replace Pin her arms */\n\\</span> /* twoAct in levelTwo, Pin her arms */\n\\</span> /* levelTwo, in Defend yourself */\n\\<</replace>><</link>> /* link replace Defend yourself */\n\\</span> /* oneAct in levelOne, Defend yourself */\n2. <span id=\"twoAct\"><<link \"Knock her down\">><<replace \"#levelOne\">>2. Knock her down\n\nYou let her take a few steps in your direction, then you draw the blade from your side and bash the hilt of it into the thrall's skull. She crumples instantly. The rusty knife goes skittering across the floor.\n\nThe thrall grunts in pain, but she's still conscious. If you don't act fast... well, it's very unlikely she'll be able to hurt you, but she could raise an alarm, and that will cause problems. You:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Feed her your blood\">><<replace \"#levelTwo\">>1. Feed her your blood\n\nWhile she's unable to resist it, you draw your blade across your palm and force the blood into her mouth. Not exactly how Wil told you how to do it, but it works. The woman tries to spit it out, but you feel her swallow after a moment, and then a moment later her eyelids droop and she falls unconscious to the ground. Her heartbeat slows, but it's still going. She's alive. In a way.<<set $thrallQuarters to \"freed\">><<set $freed += 1>>\n\nYou stand back up and try not to think about the difference between life and whatever you both are now. You turn to look at your options, and:\n\n1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Go back down the side tunnel|QuartersDeadend2][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Feed her blood */\n\\</span> /* oneAct, Feed her blood */\n2. <span id=\"twoAct\"><<link \"Finish her off\">><<replace \"#levelTwo\">>2. Finish her off\n\nYou flip the blade around in your hand and stab it straight down into the thrall's neck. She doesn't have a chance to scream. Blood just oozes out of her mouth and the new hole in her throat, and within a minute she lies dead at your feel. That didn't take very long.<<set $thrallQuarters to \"dead\">><<set $dead += 1>>\n\nYou stand up and wipe the blood off your blade. It's such a pity, you think, watching the spilt blood pool on the dirty floor. It smells so strong, and you're suddenly so thirsty....\n\nYou turn away and try to shake that feeling away. There's still more work to do here. You:\n\n1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Go back down the side tunnel|QuartersDeadend2][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Finish her off */\n\\</span> /* twoAct, Finish her off */\n3. <span id=\"threeAct\"><<link \"Drink her blood\">><<replace \"#levelTwo\">>3. Drink her blood\n\nWhile the thrall still kneels down on the floor, you lean over her and sink your fangs into the exposed vein on the side of her neck. She doesn't even struggle against it. If anything, she twists her neck to give you better access.\n\n<<if $firstBite is \"no\">>The taste, the sensation of the blood hits you with an unexpected intensity. It's not delicious or anything, it's just... intoxicating. You can't get enough of it. You're nowhere near satisfied when you realize you have only moments to:<<else>>The taste of blood may not have been pleasant at first, but you've definitely warmed up to it. Especially when it's fresh like this. You drink until you feel the thrall's body grow weaker, and then you:<</if>>\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Spare her life\">><<replace \"#levelThree\">>1. Spare her life\n\nShe's definitely still conscious when you pull away from her neck, the puncture holes letting out a bit more blood before it clots up. You wipe what spilled off of your own chin.\n\nWhile she's still out of it, you pull your blade across your skin to draw your own blood, and drip it into the woman's mouth. This probably isn't the circumstances Wil expected you to be in when she taught you how to free thralls, like she freed you, but Wil isn't here. The woman's eyes droop closed, and her heartbeats slows down, but she isn't dead. At least, not technically.<<set $firstBite to \"yes\">><<set $thrallQuarters to \"freed\">><<set $freed += 1>>\n\nYou stand up and resheath your blade. Looking around, you can:\n\n1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Go back down the side tunnel|QuartersDeadend2][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Spare her life */\n\\</span> /* oneAct, Spare her life */\n2. <span id=\"twoAct\"><<link \"Take her life\">><<replace \"#levelThree\">>2. Take her life\n\nYou sink your fangs in deeper, and for a moment you think the thrall is trying to resist you, trying to pull away, but then she slumps lifelessly to the floor, and you realize she's just dead.\n\nExcess blood is dripping from your face, and you hurriedly try to wipe it away. <<if $firstBite is \"no\">>You didn't expect it to happen that fast. You'd think it was a little gross, if you didn't feel more alive than you have been in months.<</if>>. You stand up and try to compose yourself. Looking around, you can:<<set $firstBite to \"yes\">><<set $thrallQuarters to \"dead\">><<set $dead += 1>>\n\n1. <span id=\"oneAct\">[[Go through the door|ThrallQuarters][$direction to \"in\"]]</span>\n2. <span id=\"twoAct\">[[Go back down the side tunnel|QuartersDeadend2][$direction to \"in\"]]</span>\n3. <span id=\"threeAct\">[[Go back down the main tunnel|QuartersTunnel][$direction to \"out\"]]</span>\n\\<</replace>><</link>> /* link replace Take her life */\n\\</span> /* twoAct, Take her life */\n\\</span> /* levelThree, in Drink her blood */\n\\<</replace>><</link>> /* link replace Drink her blood */\n\\</span> /* threeAct, Drink her blood */\n\\</span> /* levelTwo, in Strike first */\n\\<</replace>><</link>> /* link replace Strike first */\n\\</span> /*twoAct in levelOne, Strike first */\n\\</span> /* levelOne */",
      "links": [
        {
          "text": "Go through the door",
          "destination": {
            "name": "ThrallQuarters",
            "pid": 23
          }
        },
        {
          "text": "Go back down the side tunnel",
          "destination": {
            "name": "QuartersDeadend2",
            "pid": 22
          }
        },
        {
          "text": "Go back down the main tunnel",
          "destination": {
            "name": "QuartersTunnel",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "QuartersConversation",
      "text": "You call out \"Hello\" and begin to speak to the thrall, who is startled. She grabbed a rusted knife lying on the counter nearby and points it at you, asking who you are. You can respond:\n\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"\\\"Someone who's come to save you\\\"\">><<replace \"#levelOne\">>1. \"Someone who's come to save you\"\n\nThe woman looks confused when you say that and doesn't know how to respond, though she doesn't lower her knife at all. She tells you Viscardi will be angry. You try to calm her down, and you say:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"\\\"How many of there are you?\\\"\">><<replace \"#levelTwo\">>1. \"How many of there are you?\"\n\nShe stumbles through an answer but tells you the truth - there are seven thralls currently in Viscardi's family. You take than knowledge to heart, and then you:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Free her\">><<replace \"#levelThree\">>1. Free her\n\nYou get close enough now that you can feed her your blood before she can think to react. <<set $thrallQuarters to \"freed\">><<set $freed += 1>> You then:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n\n<</replace>><</link>> /* link replace Free her */\n</span> /* oneAct */\n</span>/* levelThree */\n<</replace>><</link>> /* link replace How many of there are you */\n</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"\\\"Don't be afraid\\\"\">><<replace \"#levelTwo\">>2. \"Don't be afraid\"\n\nYou try to calm her down as you go closer and prepare to feed her your blood, to free her from Viscardi's control. She is agitated, but doesn't fight you until you actually move to smother her. You're able to feed her your blood anyways, and all that stuff happens. <<set $thrallQuarters to \"freed\">><<set $freed += 1>> You then:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n\n<</replace>><</link>> /* link replace Dont be afraid */\n</span> /* twoAct */\n</span> /* levelTwo in original 1 */\n<</replace>><</link>> /* link replace \"Someone who's come to save you\" */\n</span> /* oneAct in levelOne */\n2. <span id=\"twoAct\"><<link \"\\\"A friend of Viscardi's\\\"\">><<replace \"#levelOne\">>2. \"A friend of Viscardi's\"\n\nYou smile and show your fangs to the thrall, and she drops her knife on the ground. She's frightened, and doesn't fight or resist you. She asks you what she can do for you, and you say:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"\\\"You can give me something to drink\\\"\">><<replace \"#levelTwo\">>1. \"You can give me something to drink\"\n\nYou lean forward to drink from the thrall, and she lets you. She is terrified but she dosn't bother to resist. You can:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Drain her\">><<replace \"#levelThree\">>1. Drain her\n\nYou drain her blood. She dead. I'll add the variable sets later. You:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n<</replace>><</link>> /* link replace Drain her */\n</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Let her go\">><<replace \"#levelThree\">>2. Let her go\n\nYou feed her your blood. I'll set variables later. You:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n\n<</replace>><</link>> /* link replace Let her go */\n</span> /* twoAct */\n</span> /* levelThree */\n<</replace>><</link>> /* link replace Give me something to drink */\n</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"\\\"You can tell me about his thralls\\\"\">><<replace \"#levelTwo\">>2. \"You can tell me about his thralls\"\n\nYou ask her about the thralls, and she tells you how many thralls are in the lair as well as some basic facts about them. Once that happens, you can:\n\n<span id=\"levelThree\">1. <span id=\"oneAct\"><<link \"Kill her\">><<replace \"#levelThree\">>1. Kill her\n\nAfter you talk to her you kill her because you're heartless. I'll set the variables later. You:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n<</replace>><</link>> /* link replace Kill her */\n</span> /* oneAct */\n2. <span id=\"twoAct\"><<link \"Free her\">><<replace \"#levelThree\">>2. Free her\n\nYou finish talking to her, and then you feed her your blood - she doesn't resist but she's very confused. You:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n<</replace>><</link>> /* link replace Free her */\n</span> /* twoAct */\n</span> /* levelThree */\n<</replace>><</link>> /* link replace Tell me about his thralls */\n</span> /* twoAct*/\n</span> /* levelTwo */\n<</replace>><</link>> /* link replace A friend of Viscardi's */\n</span> /* twoAct in levelOne */\n<<if $dungeon != 1>>3. <span id=\"threeAct\"><<link \"\\\"I'm a new thrall like you\\\"\">><<replace \"#levelOne\">>3. \"I'm a new thrall, like you\"\n\nThe woman gives you a look and doesn't believe you. She knows where new thralls come from and would recognize one before it's brought into the fold proper. She threatens you, saying if you want to join Viscardi's family so badly she can help make that happen, and then she attacks you. It's sudden and clumsy, but she manages to draw blood, and you immediately:\n\n<span id=\"levelTwo\">1. <span id=\"oneAct\"><<link \"Kill her\">><<replace \"#levelTwo\">>1. Kill her\n\nIn anger you lash our with your blade, cutting the thrall's head almost clean off. She dies slowly and painfully, and you let her bleed out while you sheath your blade.<<set $thrallQuarters to \"dead\">><<set $dead += 1>> Once you're ready, you can now:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n<</replace>><</link>> /* link replace Kill her */\n</span> /* oneAct in levelTwo.3 */\n2. <span id=\"twoAct\"><<link \"Free her\">><<replace \"#levelTwo\">>2. Free her\n\nYou wipe the blood she drew from you and force it into her mouth, forcing her to ingest it so it can power Viscardi has placed over her. She struggles and fights against you but you're stronger, and eventually she passes out.<<set $thrallQuarters to \"freed\">><<set $freed += 1>> At this point the player can:\n\n1. <span id=\"oneAct\">[[Examine the room|ThrallQuarters]]</span>\n<</replace>><</link>> /* link replace Free her */\n</span> /* twoAct in levelTwo.3 */\n</span> /* levelTwo, in original 3 */\n<</replace>><</link>> /* link replace \"I'm a new thrall, like you\"\n</span> /* threeAct in levelOne */\n<</if>>\n</span> /* levelOne */",
      "links": [
        {
          "text": "Examine the room",
          "destination": {
            "name": "ThrallQuarters",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "ShopDoor",
      "text": "<<if $thrallShop is \"alert\">>Finally you see something that strikes you as out of place; a metal door along one of the maze walls. The maze forms a T-intersection at this door, with the door itself becoming a fourth pathway. There's a chance it's a false door, but you'll have to check it out yourself to be sure.\n\nYou:\n\n1. <span id=\"oneAct\">[[Open the metal door|ShopThrall][$surprised to \"yes\"]]</span>\n2. <span id=\"twoAct\">[[Double-check the hallway across from the door|ShopThrall]]</span>\n\n<<elseif $thrallShop is \"docile\">>Finally you see something that strikes you as out of place; a metal door along one of the maze walls. The maze forms a T-intersection at this door, with the door itself becoming a fourth pathway. There's a chance it's a false door, but you'll have to check it out yourself to be sure.\n\nYou:\n\n1. <span id=\"oneAct\">[[Open the metal door|MagicShop]]</span>\n2. <span id=\"twoAct\">[[Double-check the hallway across from the door|ShopThrall]]</span>\n\n<<else>><<if $anotherOne is 1>><<set $anotherOne to 0>>You close the door quietly behind you, now back in Viscardi's maze. The ex-thrall still lies slumped against the wall across from you.<<else>>You round a corner and see that T-intersection in the maze with the door <<if $magicShop is 1>>that opened up to that alchemy workshop<<else>>that you didn't actually check out<</if>>. The ex-thrall is still lying slumped against the maze wall.<</if>>\n\nYou:\n\n1. <span id=\"oneAct\">[[Go through the metal door|MagicShop]]</span>\n2. <span id=\"twoAct\">[[Continue down through the maze|SecondTrap]]</span>\n3. <span id=\"threeAct\">[[Head back|BossMaze][$direction to \"out\"]]</span>\n<</if>>",
      "links": [
        {
          "text": "Open the metal door",
          "destination": {
            "name": "ShopThrall",
            "pid": 38
          }
        },
        {
          "text": "Double-check the hallway across from the door",
          "destination": {
            "name": "ShopThrall",
            "pid": 38
          }
        },
        {
          "text": "Open the metal door",
          "destination": {
            "name": "MagicShop",
            "pid": 37
          }
        },
        {
          "text": "Go through the metal door",
          "destination": {
            "name": "MagicShop",
            "pid": 37
          }
        },
        {
          "text": "Continue down through the maze",
          "destination": {
            "name": "SecondTrap",
            "pid": 36
          }
        },
        {
          "text": "Head back",
          "destination": {
            "name": "BossMaze",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "SecondTrapSpring",
      "text": "<<if $direction is \"in\">>You head straight down the hallway, towards the door that you know must lead to Viscardi's family crypt. At last, you'll be able to get your revenge.<<elseif $direction is \"out\">>You move down the hallway, away from the mansion crypt, away from Viscardi. There's only one thing left to do now, and it shouldn't take you very-<</if>>\n\nAnd then the floor falls away beneath you. <<if $dungeonTrap is 1>>It's a sickeningly familiar feeling. <</if>>The ground caves in as what you realize was a false floor sends you plummeting down into a pit, and you try to grab hold of something near you<<if $wound > 4>> but your muscles ache, your arms are sore from the wounds you've sustained so far. Your fingers slip, and you feel your body fall, fall....\n\nIt seems like it takes forever for your body to hit the bottom of the pit, and you realize it's because it never quite does.<<if $dungeonTrap is 1>> This pit isn't exactly like the pit you stumbled on by the lair dungeons.<</if>> Instead of being a solid rock slab, the bottom of this pit is lined with stakes. Wooden stakes.\n\nYour hand touches the ground about a foot beneath you, and comes away sticky with blood. You can't even feel where the stakes are piercing your body but you know they're there, and you can feel the blood draining out of you. It's draining, and your wounds aren't closing like you're used to. You try to push yourself up away from them but now your strength is draining too, and a spring in the false floor has closed the pit door above you so where would you even go?\n\n<<if $direction is \"in\">>Viscardi is so close by<<else>>You'd almost made it<</if>>, you think, as your already blurry vision gets blurrier. You're so... close. If you could just...\n\n1. <span id=\"oneAct\">[[Get... up...|End Credits][$gameOver to \"yes\"]]</span>\n<<else>>. Your fingers just barely curl around the edge of a protruding rock, and you feel something sharp dig back into them but you grip tight anyway, and haul yourself up, away from the pit below you.<<set $wound += 1>>\n\nYour hands are covered in your own blood by the time you've crawled off of the false floor. A spring raises it back up into place and it would be indistinguishable from the rest of the ground in this hallway, if not for the splatters of your own blood that cover it. Deep wounds have been cut into your hands, arms, and legs, from sharp edges hidden in the rock of this hallway. You feel horrible, but at least you're not dead. Barely.\n\nYou take a few minutes to clean yourself up, and then:<<set $thrallBoss to \"alert\">>\n\n1. <span id=\"oneAct\">[[Move forward to the crypt|ViscardiCrypt]]</span>\n2. <span id=\"twoAct\">[[Head back through the maze|DeepRoad][$direction to \"out\"]]</span>\n<</if>>",
      "links": [
        {
          "text": "Get... up...",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        },
        {
          "text": "Move forward to the crypt",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        },
        {
          "text": "Head back through the maze",
          "destination": {
            "name": "DeepRoad",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "ViscardiAmulet",
      "text": "<<if $amulet is 1>>Now that it's empty the jewelry box seems almost... plain. Whatever power it seemed to emenate must have come entirely from what it held inside, because without it the box feels like a piece of junk.\n\nYou open the main lid of the jewelry box and check the side compartments, just to make sure it truely is empty. Then you close it, leaving it look untouched, and:\n\n1. <span id=\"oneAct\">[[Go to the coffin|ViscardiCoffin]]</span>\n2. <span id=\"twoAct\">[[Leave the room|ViscardiCrypt]]</span>\n<<else>>The jewelry box almost emenates a sort of power as you step up to it. You're not sure if that's real, or something you're imagining because you know what's inside of it.\n\nThe Amulet of False Life. You've imagined what it would look like, but when you lift up the lid of the box you finally get to see what it really looks like. It's about three inches in diameter, a stylized rendition of the sun on some metal that definitely isn't silver, but almost looks like it. It's attached to a thick black cord, and when you reach forward to touch it feels like it must weigh a full pound or two. Heavy, for such a small hunk of rock.\n\nIt also feels warm to the touch, like maybe somehow the maker actually trapped a bit of the sun inside. Maybe thats how it works its magic. Or maybe that's just an illusion.\n\nYou take a deep breath to calm yourself. You've finally found the amulet. You:\n<<if $viscardi is not \"alert\">>\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Take the amulet\">><<replace \"#levelOne\">>1. Take the amulet<<set $amulet to 1>>\n\nThe amulet lifts away from the jewelry box with no problem. You debate  for a minute what to do with it, where to put it. After a moment, you loop the thick cord over neck and let the amulet hang over your chest.\n\nYou don't feel any different.\n\nYou don't feel any different, but you do feel the warmth of the amulet through your clothes, and even without testing you're pretty sure it will work. You can leave this lair, even in midday, and survive.<<set $win to \"yes\">><<set $winSteal to \"yes\">>\n\nThe knowledge gives you a giddy feeling. You clutch the amulet at your neck, and then:\n\n1. <span id=\"oneAct\">[[Go to the coffin|ViscardiCoffin]]</span>\n2. <span id=\"twoAct\">[[Leave the room|ViscardiCrypt][$direction to \"out\"]]</span>\n\n<</replace>><</link>></span>\n2. <span id=\"twoAct\">[[Go to coffin|ViscardiCoffin]]</span>\n3. <span id=\"threeAct\">[[Leave room|ViscardiCrypt][$direction to \"out\"]]</span>\n</span> /* levelOne */\n<<else>>\n1. <span id=\"oneAct\">[[Take the Amulet|ViscardiFight][$viscardi to \"amulet\"]]</span>\n2. <span id=\"twoAct\">[[Go to coffin|ViscardiFight][$viscardi to \"other\"]]</span>\n3. <span id=\"threeAct\">[[Leave the room|ViscardiFight][$viscardi to \"other\"]]</span><</if>><</if>>",
      "links": [
        {
          "text": "Go to the coffin",
          "destination": {
            "name": "ViscardiCoffin",
            "pid": 54
          }
        },
        {
          "text": "Leave the room",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        },
        {
          "text": "Go to coffin",
          "destination": {
            "name": "ViscardiCoffin",
            "pid": 54
          }
        },
        {
          "text": "Leave room",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        },
        {
          "text": "Take the Amulet",
          "destination": {
            "name": "ViscardiFight",
            "pid": 44
          }
        },
        {
          "text": "Go to coffin",
          "destination": {
            "name": "ViscardiFight",
            "pid": 44
          }
        },
        {
          "text": "Leave the room",
          "destination": {
            "name": "ViscardiFight",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "ViscardiCoffin",
      "text": "<<if $viscardi is \"dead\">>There's no lock on the edge of the coffin. It opens easily.\n\nAll that you see when you lift the lid up a few inches is a layer of dirt and dust. Not the most restful of sleeping places, but as a  vampire....\n\nYou close the lid. This old thing is just as worthless as the rest of the junk in Viscardi's mansion now. You step away, and:\n\n1. <span id=\"oneAct\">[[Check the jewelry box|ViscardiAmulet]]</span>\n2. <span id=\"twoAct\">[[Leave the room|ViscardiCrypt]]</span>\n<<else>>You step up to the coffin until you're standing above it, looking down at the simple wooden lid. Below sleeps your worst enemy. It would be so easy to end his life right now.\n\nIt... actually would be so easy to end his life right now. You look down at the blade sheathed at your side. It's certainly strong enough to pass through solid wood. There'd be no reason to even look at his face.\n\nYou don't bother spending time deliberating. You straighten your back above Viscardi's coffin, and you:\n<<if $viscardi is \"docile\">>\n<span id=\"levelOne\">1. <span id=\"oneAct\"><<link \"Stab the coffin\">><<replace \"#levelOne\">>1. Stab the coffin\n\nYou whip out your blade with a flourish, grip it tightly in your hands, and plunge it downward. You aim for about where Viscardi's heart should be, but even if you're a little off you should be close enough. There's no way Viscardi should survive that.<<set $win to \"yes\">><<set $winKill to \"yes\">><<set $viscardi to \"dead\">>\n\nWhen you pull your blade back up, the lid of the coffin lifts a bit too, and you glance a glimpse of the man inside. Or what used to be a man, and then used to be a vampire. Now, the body deteriorates. You've never seen a vampire die before, and you're not sure you want to see, but at least you know it's working. Viscardi is dead. He won't be able to control anyone ever again. <<if $dead < 4>>You wonder what will happen to his thralls now.<</if>>\n\nWith a deep sigh of relief you step down off the platform, and:\n\n1. <span id=\"oneAct\">[[Check the jewelry box|ViscardiAmulet]]</span>\n2. <span id=\"twoAct\">[[Leave the room|ViscardiCrypt][$direction to \"out\"]]</span>\n<</replace>><</link>></span>\n2. <span id=\"twoAct\">[[Check the jewelry box|ViscardiAmulet]]</span>\n3. <span id=\"threeAct\">[[Leave the room|ViscardiCrypt][$direction to \"out\"]]</span>\n</span> /* levelOne */\n<<else>>\n1. <span id=\"oneAct\">[[Stab the coffin|ViscardiFight][$viscardi to \"coffin\"]]</span>\n2. <span id=\"twoAct\">[[Check the jewelry box|ViscardiFight][$viscardi to \"other\"]]</span>\n3. <span id=\"threeAct\">[[Leave the room|ViscardiFight][$viscardi to \"other\"]]</span><</if>><</if>>",
      "links": [
        {
          "text": "Check the jewelry box",
          "destination": {
            "name": "ViscardiAmulet",
            "pid": 53
          }
        },
        {
          "text": "Leave the room",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        },
        {
          "text": "Stab the coffin",
          "destination": {
            "name": "ViscardiFight",
            "pid": 44
          }
        },
        {
          "text": "Check the jewelry box",
          "destination": {
            "name": "ViscardiFight",
            "pid": 44
          }
        },
        {
          "text": "Leave the room",
          "destination": {
            "name": "ViscardiFight",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "ViscardiDeath",
      "text": "You impale Viscardi on the end of your silver blade, thrusting forward with such sudden strength you pin him to the stone wall behind him. You see his eyes go wide with surprise. He looks down at your hand, covered in his blood now, still clutching the hilt of the blade in his chest, and then he reaches up to grab it. He moves slowly, so slowly. You can almost see the strength drain out of him with his blood.\n\n\"H-how-?\" he manages to say. \"I could have... you were just...\"\n\n\"I made a promise to stop you,\" you say back. \"I wasn't going to let you hurt me ever again.\"\n\nWhen you pull your blade back out of his body, he crumples face-first into the ground. You watch him die. You wait until you see the last shuddering breath leave his body, and then you clean and resheath your blade.\n\nViscardi is dead. You don't physically feel any different, but knowing it... makes your mind clearer. It makes you feel stronger.\n<<set $win to \"yes\">><<set $winKill to \"yes\">>\nYou:\n\n1. [[Leave|ViscardiCrypt][$direction to \"out\"]]\n<<if $winSteal is \"no\">>2. [[Check out the jewelry box|ViscardiAmulet]]<</if>>",
      "links": [
        {
          "text": "Leave",
          "destination": {
            "name": "ViscardiCrypt",
            "pid": 34
          }
        },
        {
          "text": "Check out the jewelry box",
          "destination": {
            "name": "ViscardiAmulet",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "PlayerDeath",
      "text": "Your strength is draining out of you like blood. When you feel your body fall to the floor you try your best to catch yourself but you just end up on your back, staring up at the rafters in shock.\n\nViscardi's face appears floating over you. \"It really is a pity,\" you hear him saying from somewhere far away. \"I could have made use of you yet.\"\n\nYou... you want to curse him. You have a sharp response prepared... you think. But your tongue won't move. It won't....\n\nYou can taste blood now. Your vision is going... strangely blurry... and you're doing all you can to...\n\n1. [[stay awake...|End Credits]]",
      "links": [
        {
          "text": "stay awake...",
          "destination": {
            "name": "End Credits",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "StoryCaption",
      "text": "Use your keyboard or click on the links to advance the story. There are no back buttons in this game; choose wisely, and remember to save your progress.",
      "links": []
    },
    {
      "pid": 58,
      "name": "StorySubtitle",
      "text": "Written by Kenna May",
      "links": []
    }
  ]
}