{
  "passages": [
    {
      "pid": 1,
      "name": "127",
      "text": "“Where DID that knife come from, anyhow?” you ask him.  Why didn't you use it when you were attacked on the stairway?”\\n“I didn't have it then,” he explains.  “I found it when we went to the well.  It was just lying on the ground. Another “clue” left for us on purpose by the killer.”  \\nThey must have used it to cut the climbing ropes, knewing one of us would pick it up...\\n“Now come on,” he says, “let's get back in there before whoever else ISN'T the killer becomes his next victim...”\\nThe Bounty Hunter starts walking to the front door, so confident in himself that he just turns his back to you.\\n\\nCHOICE\\n\\n#1 [[Shoot him and run away|127a]]\\n\\n#2 [[Follow him inside|128]]\\n\\n[[|128]]",
      "links": [
        {
          "text": "Shoot him and run away",
          "destination": {
            "name": "127a",
            "pid": 218
          }
        },
        {
          "text": "Follow him inside",
          "destination": {
            "name": "128",
            "pid": 119
          }
        },
        {
          "text": "",
          "destination": {
            "name": "128",
            "pid": 119
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "104",
      "text": "“So you think the Warden found your husband and pushed him into the well? But wasn't he knocked out?” you ask her.\\n“He must have woken up!” she insists.\\n“But why would he cut the rope then, wouldn't he need it for himself to get the money?”\\nHer jaw goes slack, eyes glassy.  “I... I don't know...”\\n\\n[[So you shot the Warden?|105]]",
      "links": [
        {
          "text": "So you shot the Warden?",
          "destination": {
            "name": "105",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "91",
      "text": "Outside the door, the Bounty Hunter quietly tells you and the Lawyer that it's time the three of you talk the situation over in private. \\n“I think I know what's going on here,” he begins, “I'm placing my bets on the killer being Blondie in there.” He gestures to the door behind him. “Every time someone's died, she's disappeared.  When the Warden got shot, she was running away and you caught her.  I bet she gave the other woman my gun and put her up to it, let Wifey do the dirty work for her.”\\n\\nCHOICE\\n\\n[[#1 agree with him that it's possible|91a]]\\n[[#2 disagree, the evidence is pointing somewhere else|91b]]",
      "links": [
        {
          "text": "#1 agree with him that it's possible",
          "destination": {
            "name": "91a",
            "pid": 210
          }
        },
        {
          "text": "#2 disagree, the evidence is pointing somewhere else",
          "destination": {
            "name": "91b",
            "pid": 219
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "49b1",
      "text": "You go back up the stairs to the planetarium.  The room's unchanged since you last saw it.  You glance out the window at the darkening evening sky and heavy snow falling.  If you can get to the money tonight it's going to be a real pain in the ass getting out of here with the weather like this.\\nBut that's a problem for later.  You don't want to get too far ahead of yourself.  Find the money first, than worry about how to get it out of here.\\nYou leave the planetarium;  you weren't sure what clue you were looking for, but you didn't find it in here...\\n\\n[[check the basement|50]",
      "links": []
    },
    {
      "pid": 5,
      "name": "130",
      "text": "The door to the basement is open and the lights are also off.  The Bounty Hunter kicks the door open fully with his foot and flicks the light switch.  \\nYou're greeted with a shocking sight: the Wife is down there, dead.  She's been strangled with the very telephone wiring she was tied up with and a deep gash is on her forehead like she was struck with something first. \\n Worse still is how her body's been draped over the safe which someone's pulled out from under the floor tile where it was hidden.\\nThe Bounty Hunter nudges the door of the safe and it swings open.  Empty.\\nYou and he are exchanging a silent, mutual moment of “godfuckingdamnit!” when suddenly you hear a loud crash upstairs followed by sounds of fighting.\\nThe Bounty Hunter rushes up the stairs and out, and you follow him but hanging back slightly, pulling your gun out of your pants and slipping it back into your coat pocket.\\n\\n\\n[[continue|131]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "131",
            "pid": 240
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "137",
      "text": "3- (#3 shoot to kill the Bounty Hunter, shoot to injure the Lawyer, ally with the Journalist)\\n\\nYou shoot the Bounty Hunter once straight through the heart and he collapses.  Then you shoot the Lawyer through the leg with the other bullet and he falls to the ground screaming.  The Journalist snatches up the money and you grab her by the shoulder and haul her outside.\\n“I'm not the killer!” she shouts, clawing at your eyes.  You shove her away and she falls on her butt into the snow.\\n“I know,” you answer ,”and neither am I.”\\nYou look back the the observatory.  From the outside it looks almost peaceful in the growing morning light. Then you turn back to the Blonde. “ Now are you going to behave yourself so we can get the hell out of here?” you snap.\\nShe nods quickly and you help her up to her feet, having her walk in front of you as you make our way down the steep and icy mountain road.  It's full daylight light by the time you get to the avalanche blocking the trail, and there you make a grizzly discovery: the body of the Doctor.  He's wearing the survival equipment he got off the Con Artists and you realize that he's been dead for a long time, probably most of the night.  There's no way he could have been the killer.\\nThe Journalists eyes widen.  “So one of them was...” her voice trails off again.\\n“Either the Bounty Hunter or the Lawyer was the killer all along,” you agree.  “Let's just hope we made the right choice...”\\n\\n[[continue|137a]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "137a",
            "pid": 238
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "136",
      "text": "2- (#2 shoot to kill the Lawyer, shoot to injure the Journalist, ally with the Bounty Hunter)\\nYou shoot the Lawyer once straight through the chest and he collapses. Then you shoot the Journalist in the leg and she falls to the ground screaming, dropping the bag of money.  You rush to get it when the Bounty Hunter trips you and wrestles you to the ground.  You struggle to get out from under him but he grabs the empty gun from your hand and pistol whips you hard across the head.  He then kicks you in the stomach and you lay there, stunned and breathless.\\nYou hear him click a bullet back into the gun. \\n“Lawyer was lying when he said there was only one bullet.  He had another one in his pocket.” He explains.\\nHe stands over you and points the gun at your head, stepping on your neck to hold you down.\\n“Why?” you manage to ask him.\\n“Why?” he repeats.  “I'm not the fucking serial killer, don't ask me that shit.  But I am going to be your killer now.”  He presses down on your throat harder and the room starts to go dark.   “Did you really think I was going to let you live and just walk away with half the money?  Than you're a fucking idiot.”\\nYou shake your head slightly, trying to speak but he just presses down harder.  “Now I'm going to kill you, kill the pretty Blonde because I can't have her running her mouth, and I'm going to walk out of here a very rich man...”\\nAnd with those last words, he pulls the trigger.\\n\\nEND",
      "links": []
    },
    {
      "pid": 8,
      "name": "135",
      "text": "1- (shoot to kill the Lawyer, shoot to injure the Bounty Hunter, ally with the Journalist)\\n\\nYou shoot the Lawyer once straight through the heart and he collapses.  Then you shoot the Bounty Hunter through the leg with the other bullet and he falls to the ground screaming.  The Journalist snatches up the money and you grab her by the shoulder and haul her outside.\\n“I'm not the killer!” she shouts, clawing at your eyes.  You shove her away and she falls on her butt into the snow.\\n“I know,” you answer ,”and neither am I.”\\nYou look back the the observatory.  From the outside it looks almost peaceful in the growing morning light. Then you turn back to the Blonde. “ Now are you going to behave yourself so we can get the hell out of here?” you snap.\\nShe nods quickly and you help her up to her feet, having her walk in front of you as you make our way down the steep and icy mountain road.  It's full daylight light by the time you get to the avalanche blocking the trail, and there you make a grizzly discovery: the body of the Doctor.  He's wearing the survival equipment he got off the Con Artists and you realize that he's been dead for a long time, probably most of the night.  There's no way he could have been the killer.\\nThe Journalists eyes widen.  “So one of them was...” her voice trails off again.\\n“Either the Bounty Hunter or the Lawyer was the killer all along,” you agree.  “Let's just hope we made the right choice...”\\n\\n[[continue|135a]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "135a",
            "pid": 268
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "129",
      "text": "No one's there either, but the door to the storage room is open and it's dark inside.  You and the Bounty Hunter exchange a look, and he motions silently for you to go and have a look.  You peek inside and click on the light.\\nIt's empty except for a small pool of blood on the table at the far side.  You glance back to the Bounty Hunter, but he hasn't moved from the bottom of the stairs. You shake your head at him and go back down.\\n\\n[[continue|130]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "130",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "35a2",
      "text": "The wiring may be new, but the device itself looks pretty old.  You give it a firm smack on the casing to the side.  The machine makes a clicking sound twice than turns on.  A video begins to play, projected across the far wall.\\n\\n[[continue|36]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "36",
            "pid": 140
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "35a1",
      "text": "You start pressing different buttons, play, rewind, unknown, can't read the symbol, and the Policeman shoves your hand away in annoyance.  He mutter under his breath something less than complimentary about Americans.\\n\\n[[give it a smack|35a2]]",
      "links": [
        {
          "text": "give it a smack",
          "destination": {
            "name": "35a2",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "138",
      "text": "4-(shoot to kill the Bounty Hunter, shoot to injure the Journalist, ally with the Lawyer)\\n\\nYou shoot the Bounty Hunter once straight through the heart and he collapses.  Then you shoot the Journalist in the leg and she falls to the ground screaming, dropping the bag of money.  You rush to get it when the Lawyer trips you and wrestles you to the ground.  You struggle to get out from under him but he grabs the empty gun from your hand and pistol whips you hard across the head.  He then kicks you in the stomach and you lay there, stunned and breathless.\\nYou hear him click a bullet back into the gun.  “I lied,” he explains.  “There were three bullets left after I shot the Warden.  I'd decided to keep one just in case.  I was planning on using it on myself, but I guess I'll just have to do that some other way...”\\nYou realize then that you'd made the wrong choice: the Lawyer was the killer all along...\\nHe stands over you and points the gun at your head, stepping on your neck to hold you down.\\n“Why?” you manage to ask him.\\n“Why?” He repeats.  “The “why” is because when I let that criminal get out of his sentence, he killed my family and I swore I would avenge them.”  He presses down on your throat harder and the room starts to go dark.  “I swore I would avenge them by bringing to justice everyone who'd ever escaped from what they deserved.  So I tracked the nine of you down and brought you hear for your trial.  Don't worry, though, once I've killed you and the Journalist I'm going to hang myself.  I'll let the local police find the tape and make their own conclusions.”\\nAnd with those last words, he pulls the trigger.\\n\\nEND",
      "links": []
    },
    {
      "pid": 13,
      "name": "69b1a",
      "text": "You ask him where that screwdriver he's been using came from.  He doesn't answer you.  You tell him that you have a match in your pocket and you're going to light it, just stay calm.  A pause, and then ,”go ahead.”\\nIn the dim light you see the Bounty Hunter right where he was before, gun in hand.  Does he think you're the killer now?\\n“Let's just be civilized about this,” you tell him.  “Let's head down and go get the others.”\\n“You first, he tells you, and gestures with the gun to the door.\\nYou both start slowly walking downstairs; you're leading with a gun in your back.  Then there's the sound of a door opening and sudden gust of wind along the staircase that blows out your match.  \\n\\n[[continue|69c]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "69c",
            "pid": 108
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "102",
      "text": "“We'd been threatening and blackmailing the Warden the whole evening, trying to get him to give us the map or cut us in on the deal.  If he didn't, we told him we'd tell everyone about it.  He still refused, saying he already had another patsy in line who would be doing it for free.  My husband flew into a rage and attacked him in the garage.  I tore the map from his pocket and then the lights went out.  My husband struck him again and knocked him out.  Then I gave him the map and ran back inside, tripping over the Bounty Hunter just like I said before.  When my husband didn’t come back in a few minutes, I knew something had gone terribly wrong...”  At this, her voice breaks and she begins to sob against the Journalist's shoulder.\\n\\n[[how did your husband get the climbing equipment and flashlight?|103]]",
      "links": [
        {
          "text": "how did your husband get the climbing equipment and flashlight?",
          "destination": {
            "name": "103",
            "pid": 205
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "71a",
      "text": "It's the missing Journalist, very much still alive and tearing the room apart.  She's even moved the tool cabinet on top of where the money is, but she doesn't seem to have noticed the slightly different looking tiles yet.\\nYou rush down to stop her before she can find it, and she whirls around with a yelp.  She stares at you, wild eyed, for a moment, then lunges for the fire-extinguisher murder weapon.\\nAnd then the lights go out.\\n\\nCHOICE\\n\\n[[#1 stand your ground.|71aa]]\\n[[#2 run away.|71ab]]",
      "links": [
        {
          "text": "#1 stand your ground.",
          "destination": {
            "name": "71aa",
            "pid": 263
          }
        },
        {
          "text": "#2 run away.",
          "destination": {
            "name": "71ab",
            "pid": 262
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "69b1b",
      "text": "The Bounty Hunter calls out to you to stay still, but you keep going, crouching low.  You creep out he door and start feeling your way down the sitars. \\nThere's a sudden gust of wind and the quiet sound of a door closing, but you can't tell where its coming from.  Then suddenly someone bumps into you.  \\n“What the fuck!” It's the Bounty Hunter, and he grabs you by the shoulder.  \\n\\n[[continue|69c]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "69c",
            "pid": 108
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "24",
      "text": "The Policeman and you exchange a look.  This wasn't an accident, was it?  He says nothing, and gently sets the body back down.\\n“What's that on his hand?” the Blonde asks, getting over her shock quickly.  Someone's placed a large metal key in the dead man's hand.  She gingerly reaches out and takes it, turning it over in her palm “The tag on it says “Planetarium”, she tells the Policeman who glances up at the ceiling.  \\n“We're going to go back upstairs and tell the others,” he orders.\\n\\nCHOICE\\n\\n#1 [[go upstairs|24a]]\\n\\n#2 [[stay behind|24b]]",
      "links": [
        {
          "text": "go upstairs",
          "destination": {
            "name": "24a",
            "pid": 84
          }
        },
        {
          "text": "stay behind",
          "destination": {
            "name": "24b",
            "pid": 85
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "25",
      "text": "The Celebrity Couple is standing by the table in the main room, knocking back glasses of wine.  “Where is my partner?” the Policeman barks at them sharply.  “What?  We haven't seen him!” The man says, clearly not used to being talked at in such a tone.  The woman asks what's wrong and the Blonde tells her the Repairman had an accident  “It was no accident,” the policeman growls ,”someone bashed his head in!”\\n\\nThe woman, Petra, drops her glass in shock ,”WHAT?!” she shouts.  “You can't be serious!”  You're a pretty good judge of character, and for once the reactions of these two seems genuine.  They had no idea what was going on.  Or are better actors than you thought.\\n\\n[[continue|26]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "26",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "26",
      "text": "Just then, the partner returns from outside, kicking heavy clumps of snow off his boots.  The Policeman demands to know where he was.\\nThe other man looks slightly surprised.  “I went to get the spare flashlight from the snowmobile,” he explains.  “When the lights came back on I went outside to look at the storm.  It's getting pretty bad, maybe we should come back tom-”\\n“But the Repairman's dead!” the Wife blurts out, and her husband wraps an arm around her shoulders.\\nIf the partner has any reaction to her words, you can't see it.  “The Repairman's dead.” he repeats, and you're not sure if it's meant to be a question.\\n\\n[[continue|27]]\\n",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "27",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "27",
      "text": "The Policeman draws his partner aside, quietly explaining to him the situation while gesturing at you and the others with a sort of “stay put” wave of his hand.  You realize the Psychologist's missing from the group.  Was he here when you first came up?\\n\\n[[continue|28]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "28",
            "pid": 150
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "20",
      "text": "The Policeman comes back in, saying he found a fuse box and left the Repairman to fix it.  Where is his partner?  You tell him he went to get a flashlight from the snowmobile and the Policeman frowns.  He told him to keep everyone in here.  Where is everyone, anyhow?\\nThe only people left in the room are you and the pretty Blonde.  The Warden skipped out to join the married couple for a smoke break as soon as the cop returned.  Guess he has a problem with the law also, no surprise there.\\n\\n[[continue|21]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "21",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "21",
      "text": "The Doctor returns from the back door and mutters something about how he doesn't trust his luggage around “all these locals”.  The Policeman gives him an icy look and the Blonde comments that the snow's really starting to fall.  Shouldn't they maybe call someone to pick them up?  It doesn't look like Mr. Jameson's going to be making it today.\\n\\nSuddenly Tesler, the Lawyer, rushes in, breathless and wild eyed.  He shouts that he was just downstairs and there's been a terrible accident!  Somebody, call a medic!  The Policeman says there's no reception up here on this mountain, what's going on?\\n\\n“It's that local guy, the repairman,” Tesler says rapidly, “I went down to see if he needed help with the lights and he'd fallen over.  There was blood! Please, we must help him!”\\n\\nCHOICE\\n[[#1 stay quiet|21a]]\\n\\n[[#2 offer to help|21b]]",
      "links": [
        {
          "text": "#1 stay quiet",
          "destination": {
            "name": "21a",
            "pid": 55
          }
        },
        {
          "text": "#2 offer to help",
          "destination": {
            "name": "21b",
            "pid": 267
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "41b",
      "text": "You press your lips tightly together.  Saying anything would be worse than saying nothing.  You can feel the presence of the Warden behind you. “They used the name William Wilson,” he points out.  You're about to argue and then the next video comes on...\\n\\n[[continue|42]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "42",
            "pid": 230
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "23",
      "text": "The Repairman is lying slumped on the ground, a spray of fresh blood against the crumbling wall next to an electrical panel.  The Blonde gasps and hangs back, and the Lawyer looks sick to his stomach and kicks at the floor.  The Policeman gently turns the Repairman over and mutters a curse in Russian.  “He's dead,” he informs the room.  \\n\\nYou look over his shoulder and see the side of the man's face caved in.  The Warden approaches behind you,”Could... Could he have tripped and fallen?  When the lights were out?”  The Policeman  says he left him here and when the lights came back on, he said that there was nothing wrong with the fusebox and he wanted to look at it some more.\\n\\nCHOICE\\n\\n#1 [[look around the room|23a]]\\n\\n#2 [[examine the body|23b]]",
      "links": [
        {
          "text": "look around the room",
          "destination": {
            "name": "23a",
            "pid": 245
          }
        },
        {
          "text": "examine the body",
          "destination": {
            "name": "23b",
            "pid": 246
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "79a2",
      "text": "Suddenly, just as you're nearing the building, you hear someone screaming inside.  You rush in and find the Wife of the Couple wailing on the floor in tears.  The Journalist is hovering over her, trying to comfort her and calm her down.  The Lawyer's face is very grave and he tells you ,”there's something you all need to see.”  He leads you outside and follows the tracks to the right.\\n\\n[[continue|80]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "80",
            "pid": 220
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "79a1",
      "text": "Along the way back to the observatory, the Warden finally breaks the tense silence that had fallen over your group.  He insists on his innocence in anything that may have happened to the husband: “They attacked me in the garage!  I swear it!  They're a bunch of fucking con artists and maybe the killers for all I know.  I didn't do anything to them!”\\nYou have your doubts that he's telling the full truth, but the Bounty Hunter agrees that their whole “we're famous but you've never heard of us” alibi is incredibly thin. When you get back inside you're going to need to talk to her in private.\\n\\n[[continue|79a2]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "79a2",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "Untitled Passage 9",
      "text": "The wiring may be new, but the device itself looks pretty old.  You give it a firm smack on the casing to the side.  The machine makes a clicking sound twice than turns on.  A video begins to play, projected across the far wall.\\n\\n[[continue|36]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "36",
            "pid": 140
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "29",
      "text": "The Policeman says that he and his partner are going to go up to the Planetarium and see what they find, everyone else is to STAY HERE and not leave the room.  The Lawyer says he found the body, he should see what's up there also, and the Blonde chimes in agreement.  \\nA long pause as the Policeman glances over you all.  You almost think you see a little fear in his eyes.  Afraid of one of you, or afraid of being ambushed by the killer?  “Alright,” he finally says ,”let's all go up together.  At least this way I can keep an eye on you.”\\n\\n[[continue|30]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "30",
            "pid": 138
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "82c",
      "text": "The Lawyer offers to be the next one to talk to the Wife, she's in a delicate emotional state right now but we need to find out what her husband was doing in a well in the middle of the night in a snowstorm.  The Bounty Hunter offers to talk to the Warden about it and then they'll compare stories.\\ncont to s2nd choice below\\n\\n[[Ask about the rope again|82c1]]",
      "links": [
        {
          "text": "Ask about the rope again",
          "destination": {
            "name": "82c1",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "82b",
      "text": " The Bounty Hunter thinks the avalanche could be an accident, or it could be deliberate. The Lawyer points out there was a boom sound right before the shaking, but perhaps it was the fresh snow collapsing and starting the avalanche?  You agree that the timing is very suspicious, but it was snowing heavily and here on a mountain an avalanche is certainly a possibility.  This is something else that has to wait until the morning light.\\n\\n[[Ask about the rope again|82b1]]",
      "links": [
        {
          "text": "Ask about the rope again",
          "destination": {
            "name": "82b1",
            "pid": 235
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "4",
      "text": "The other four people have stopped talking and are glancing at you, waiting expectantly.  A young woman, tall and blonde and not at all difficult on the eyes, steps away from their little group and walks up to you with a bounce to her step.  “Hi, I'm Nicola,” she offers you her hand.  “And you must be Mr. Jameson, our mysterious host for the evening, right?  We've all been waiting to meet you.”\\n\\n[[continue|5]]\\n",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "5",
            "pid": 237
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "105",
      "text": "“What happened when the Warden died?” you ask.  “Did you shoot him?”\\n“NO!  I was arguing with him, the lights went out, and someone tried to strangle me!  I thought it was the Warden so I was trying to get away and scream his name, but he was choking me so I couldn't say it.  Then I heard the gunfire right next to my ear and then the lights came back on.  There was the gun in my hand, but the killer  must've put it there!  I didn't do it! I didn't do it!”\\n\\nThen her face crumples.  The questioning is becoming too much for her and she begins crying uncontrollably.\\n“Okay, that's enough,” says the Journalist.  She gently unwraps the Wife's arms from her neck and stands up.  “Let's talk,” she says to you.  You move to the edge of the room for a whispered conversation.\\n\\n[[continue|106]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "106",
            "pid": 167
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "106a",
      "text": "\\nShe shakes her head. “I don't believe it.  It just doesn't make sense.”\\nNot a hell of a lots making sense tonight, sweetheart.\\n\\n[[continue|107]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "107",
            "pid": 151
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "StoryTitle",
      "text": "WHO AMONG US",
      "links": []
    },
    {
      "pid": 35,
      "name": "106c",
      "text": "She pauses, eyes searching yours.  “I do too,” she agrees carefully.  “He's the only one who makes any sense.”\\nThere's something she's not telling you, but you'll be damned if you know what that is.\\n\\n[[continue|107]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "107",
            "pid": 151
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "106b",
      "text": "She pauses then nods.  “He... he's definitely a possibility.” \\nThere's something she's not telling you, but you'll be damned if you know what that is.\\n\\n[[continue|107]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "107",
            "pid": 151
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "5a",
      "text": "1: You give the woman a terse head shake.  “Sorry, wrong guy.”  An expression flashes across her face faster than you can catch it.  “Oh?  Well, we've all been waiting to meet him.  Who are you then?\"\\n\\n-Give [[her your name|5acont]]",
      "links": [
        {
          "text": "her your name",
          "destination": {
            "name": "5acont",
            "pid": 145
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "106d",
      "text": "She glares at you for that.  “Now you know that's a lie.”\\n“Do I?” you ask with a raised eyebrow. \\n“I was with you the whole time the Repairman died.  You didn't leave my sight once, which means I didn't leave yours.”  \\nShe's pretty when she's angry, you think.  She takes a deep breath and rubs her temples.\\n\\n[[continue|107]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "107",
            "pid": 151
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "5b",
      "text": "You shake her hand, glancing her up and down quickly.  “Sorry to disappoint you miss, but my name's David White.  I'm here on business.”  Business is a generic enough term, and you have a whole back story memorized about a wife and family back in small-town home in case she's interested and wants more details.\\nShe's not.  She gives you a polite smile and excuses herself back into her earlier conversation.\\n\\n[[continue|6]]\\n",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "6",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "75",
      "text": "You ask if anyone's seen the Doctor?  No, no one has since before you all went to the Policeman's crash site.  \\n  “He'd left a few of his personal items in a suitcase, but his passport was gone,” the Bounty Hunter tells the others.  “He's probably run off into the night, if he's lucky he'll freeze to death instead of falling and breaking his neck.”\\n“But what if he's still here?” the Lawyer asks.\\n“You mean... that you think he's been the next victim...” the Journalist says, reading between the lines.\\n“Or he's the killer, and he's just pretending to be dead.  It's a long shot, but possible”  the Lawyer answers.  The Bounty Hunter looks at you and you shrug.  Yeah, it's possible.  He was acting strange all evening, and now to just disappear without a trace?  It's definitely suspect.\\n\\n[[continue|76]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "76",
            "pid": 134
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "73a",
      "text": "You tell them your version of events, carefully leaving out any details that might seem too suspicious and reflect badly on you.  You tell them honestly that you were attacked in the dark, but you also have no idea by whom, and then they suffocated you with a cloth soaked in presumably chloroform.  And that's all you know.  \\n\\n[[continue|74]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "74",
            "pid": 250
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "119",
      "text": "The Bounty Hunter begins to tell you his story.  He admits that he's been following you for weeks now, or at least he was following an escaped bank robber.  He didn't know you were the mark until the tape played, you don't look anything like your mug shot anymore.  “Anyhow,” he continues,  “you've got a high bounty on your head for breaking out of prison, so I followed you to this town to capture you and cash in on it. Along the way I met a vigilante cop who was looking to improve his standing in the world.  Like every government official in the former Soviet states, the Policeman had a major chip on his shoulder and minimum wage at best.” \\nYou nod but keep silent, debating whether to just pull out your gun and shoot him now or not.\\nThe Bounty Hunter continues. “I knew there had to be a reason you were coming to this little shit-hole Russian village, and it wasn't to hard to figure out what that reason was.  But I needed some help first.  So I told the Policeman about your bounty and offered to split it 50-50 if he gets me up here and helps me arrest you.  It didn't take a lot of convincing.”\\n\\n[[So what happened?|120]]",
      "links": [
        {
          "text": "So what happened?",
          "destination": {
            "name": "120",
            "pid": 258
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "35b2",
      "text": "The wiring may be new, but the device itself looks pretty old.  You give it a firm smack on the casing to the side.  The machine makes a clicking sound twice than turns on.  A video begins to play, projected across the far wall.\\n\\n[[continue|36]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "36",
            "pid": 140
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "35b1",
      "text": "The projector's plugged in.  It's connected to the same lines as the lights, so if they're on than it should have power.\\n\\n[[give it a smack|35b2]]",
      "links": [
        {
          "text": "give it a smack",
          "destination": {
            "name": "35b2",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "139",
      "text": "5- ( shoot to kill the Journalist, shoot to injure the Bounty Hunter, ally with the Lawyer)\\nYou shoot the Journalist once straight through the heart and she collapses, dropping the money.  When the Bounty Hunter turns to grab it, you shoot him with the other bullet in his shoulder and he falls to the ground, howling in pain.\\n“Let's get the hell out of here!” the Lawyer shouts and runs for the door.  You grab the money and follow him, struggling to keep up with his fast pace through the deep snow.  Eventually he pauses to catch his breath at the start of a steep cliff face you're going to have to climb down.\\n“What happens now?” you ask him, finally catching up.  You look down at the steep and icy mountain hike that awaits you.\\n“Now?” he says.  “Now we end this.”  And he punches you square in the jaw before you can react.  You two begin wrestling in the snow, but he's much stronger than you gave him credit for.  He begins to choke you and the world starts to get darker.\\nSuddenly he's dragged off you by the very angry and bloody Bounty Hunter.  You start to pick yourself up and he kicks you hard in the head, stunning you.  Then you hear the click of the gun.  The Lawyer must have taken it from you.\\nThe Bounty Hunter turns to face him, temporarily forgetting about you.  “I thought that thing was empty...”\\n“I lied,” the Lawyer explains.  “There were three bullets left after I shot the Warden.  I'd decided to keep one just in case.  I was planning on using it on myself, but I guess I'll just have to do that some other way...” He points the gun at the Bounty Hunter.\\nYou realize then that you'd made the wrong choice: the Lawyer was the killer all along...\\n“Why?” you ask him, coughing as you slowly get to your feet.\\n“Why?” He repeats.  “The “why” is because when I let that criminal get out of his sentence, he killed my family and I swore I would avenge them.”  He turns gun from the Bounty Hunter to somewhere up and to the side of the three of you.  There's an icicle covered overhang, holding back a massive wall of snow.  If he shoots it, he's going to kill you all...\\n  “I swore I would avenge them by bringing to justice everyone who'd ever escaped from what they deserved.” he continues.  “So I tracked the nine of you down and brought you hear for your trial.  And now I'm going to finish the job and let the local police find the tape and make their own conclusions...”\\nAnd with those final words he fires the gun, burying the three of you under another avalanche of ice and rock.  It's going to be many days before the police find and dig out the three of your bodies.\\n\\nEND",
      "links": []
    },
    {
      "pid": 46,
      "name": "49a",
      "text": "You go back up the stairs to the planetarium.  The room's unchanged since you last saw it.  You glance out the window at the darkening evening sky and heavy snow falling.  If you can get to the money tonight it's going to be a real pain in the ass getting out of here with the weather like this.\\nBut that's a problem for later.  You don't want to get too far ahead of yourself.  Find the money first, than worry about how to get it out of here.\\nYou leave the planetarium;  you weren't sure what clue you were looking for, but you didn't find it in here...\\n\\n[[check the storage room|49a1]]\\n[[check the basement|50]]",
      "links": [
        {
          "text": "check the storage room",
          "destination": {
            "name": "49a1",
            "pid": 60
          }
        },
        {
          "text": "check the basement",
          "destination": {
            "name": "50",
            "pid": 73
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "49b",
      "text": "You try the door to the storage room half way up the winding staircase.  It's locked.  The Doctor said he was going in there, but why would he lock the door after himself?  Because he was doing something he didn't want you to see, obviously.  You shake your head, better keep a close eye on that one.  You move on to the next area.\\n\\n[[check the planetarium|49b1]]\\n\\n[[check the basement|50]]",
      "links": [
        {
          "text": "check the planetarium",
          "destination": {
            "name": "49b1",
            "pid": 4
          }
        },
        {
          "text": "check the basement",
          "destination": {
            "name": "50",
            "pid": 73
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "7bb1",
      "text": "This man is not so much engaged in the conversation as he is pretending to be.  He's standing with his arms crossed over his chest, nodding occasionally but at odd times.  When you introduce yourself as David White, traveling businessman, he hesitates before shaking your hand.  “I'm Mikhail Czyks,” his local accent is strong and genuine.  “Mr. Jameson called my agency and they sent me here to do repairs.  This place is falling apart, what can they want me to do?”  You glance around the decaying room in sympathy.  Yeah, it's in bad shape, you agree.  They didn't tell you anything about what you're supposed to do?  “No, nothing.  Man came, picked up and others up from train station, and we come up here and wait.”  Hmmm... he seems genuine enough.  Age could be early 40s or a weathered late 30s.  Tall but with a  rail thin build, his clothes are practically falling off him.  Definitely poor.  Probably came all the way up here in the middle of a snowstorm because he just needs the job that bad.  You give him a friendly pat on the shoulder and tell him as soon as you see Mr. Jameson you'll send him his way.  Mikhail nods in gratitude.\\n\\n[[continue on|7bb12]]",
      "links": [
        {
          "text": "continue on",
          "destination": {
            "name": "7bb12",
            "pid": 244
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "121",
      "text": "“To kill him.” he admits, looking entirely without remorse. “I went into the garage and cut the break lines of the snowmobile.  I heard someone coming in after me so I ran outside and hid until they left.” That must have been when the Con Artists and the Doctor struck the deal, you think.\\n“The plan was that I'd pick a fight with one of you lot and say you attacked me, and then the Policeman would have to go back into town for backup and get killed on the icy mountain road.  Which is exactly what happened, as it turned out.\\n\\n\\n[[-So you didn't kill the Repairman?|122]]",
      "links": [
        {
          "text": "-So you didn't kill the Repairman?",
          "destination": {
            "name": "122",
            "pid": 50
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "122",
      "text": "“No, his death was as much a surprise to me as it was to the others.  But it did the job just fine to get the cop out of the picture.”\\n\\n[[-You sure didn't look surprised when you heard about the death...|123]]",
      "links": [
        {
          "text": "-You sure didn't look surprised when you heard about the death...",
          "destination": {
            "name": "123",
            "pid": 264
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "73b",
      "text": "You lie and tell them a carefully edited version of what happened, leaving out any details of the real events that might reflect badly on you.  You tell them that when the lights went that you were attacked in the dark, but you also have no idea by whom, and then they suffocated you with a cloth soaked in presumably chloroform.  And that's all you know.  \\n\\n[[continue|74]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "74",
            "pid": 250
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "10b1",
      "text": "You step to the side and surreptitiously look the newcomers over.  Both early to mid 30s.  Expensive clothes but cheap coats hung on the wall.  Possibly expensive shoes but they're covered in snow and mud.  Did they walk here?  The man is tall, muscular, probably spends as much time at the gym as he does slicking back his hair.  You suppose he's got the popular sort of look now.  The woman is undeniable pretty, but heavily made up and with dark eye makeup and bright red lips.  Both are speaking very controlled, like they're reading lines off a script.  You make a mental note to keep an eye on these two, whatever their game is, and you head to the back door again.\\n\\n[[continue|11]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "11",
            "pid": 188
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "125",
      "text": "“When I killed him, I didn't know how the night was going to go down.  It's going to take two of us: one to get the money, and one to watch the other's back. It's almost dawn, we can make the walk into town in the daylight.  If someone tries to jump us in the house, we'll be looking out for each other and be ready for him.”\\n\\n\\n\\n[[-And what happens after that?|126]]",
      "links": [
        {
          "text": "-And what happens after that?",
          "destination": {
            "name": "126",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "126",
      "text": "“When we get to town we split the money 60-40, the extra ten's to cover your bounty loss, and then we go our separate ways.”\\n“Is there any particular reason I should trust you?” you ask, unimpressed.\\nThe Bounty Hunter grins again ,”Because I could have just killed you when I had the knife on your neck and I didn't...”\\n\\n[[-Wait, about that knife...|127]]",
      "links": [
        {
          "text": "-Wait, about that knife...",
          "destination": {
            "name": "127",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "21a",
      "text": "The Warden and the Couple rush in, alerted by all the ruckus.  The Policeman glances for his partner who's still not here, and tells everyone to stay in this room.  Then he and the Lawyer hurry downstairs.\\nYou need to see what's going on for yourself, so you tell the others you're going to help.  The Warden and Blonde join you, talking something about “knowing some first aid”.\\n\\n[[continue|22]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "22",
            "pid": 133
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "76b",
      "text": "Downstairs:  There's a broom fallen in the hallway that wasn't there before, and the basement itself has been torn apart.  Luckily, you can see that the slightly off color floor tile in the corner where the money is hasn't been tampered with.  You can't make a move for it now with everyone watching, however.\\n\\n[[continue to the garage|77]]",
      "links": [
        {
          "text": "continue to the garage",
          "destination": {
            "name": "77",
            "pid": 247
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "72a1",
      "text": "The Journalist claims that she was downstairs in the basement looking for clues when the lights went out and someone attacked her.  She was able to get away at first, but they locked her in the basement with the body.  She spent several minutes screaming for help before the lights came back on.  The Bounty Hunter confirms that when they found her she was banging at the door and shouting.  \\n\\n[[talk to the Bounty Hunter|72a2]]",
      "links": [
        {
          "text": "talk to the Bounty Hunter",
          "destination": {
            "name": "72a2",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "72a2",
      "text": "You approach the Bounty Hunter who claims that he was searching through the Doctor's locker when the lights went out.  He lit a match and went downstairs, but the match blew out when a door opened and there was a sudden breeze.  Then someone attacked him from behind, he didn't see who, and tried to suffocate him with a cloth soaked in chloroform.  The Bounty Hunter struggled with his attacker and ended up tumbling down the stairs and was knocked out.  Maybe the killer thought the fall had killed him?  When he woke up the lights were on and the Warden and the Celebrity Wife were having a screaming match in the main hall.  He and the Lawyer were trying to break it up, and then they heard shouting from downstairs.  It was the Journalist locked in the basement, and you were unconscious in the hallway.\\n\\n[[continue|73]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "73",
            "pid": 251
          }
        }
      ]
    },
    {
      "pid": 59,
      "name": "69",
      "text": "With remarkable speed, the Bounty Hunter jimmies open the door lock. Inside is another small room, windowless of course, with a single light bulb illuminating a row of metal storage lockers along the left wall and an empty line of coat hooks along the right.  There's a small table in the corner with a box marked “emergency”.\\n\\nCHOICE\\n\\n[[#1 check the box on the table|69a]]\\n[[#2 check the lockers|69b]]",
      "links": [
        {
          "text": "#1 check the box on the table",
          "destination": {
            "name": "69a",
            "pid": 78
          }
        },
        {
          "text": "#2 check the lockers",
          "destination": {
            "name": "69b",
            "pid": 174
          }
        }
      ]
    },
    {
      "pid": 60,
      "name": "49a1",
      "text": "You try the door to the storage room half way up the winding staircase.  It's locked.  The Doctor said he was going in there, but why would he lock the door after himself?  Because he was doing something he didn't want you to see, obviously.  You shake your head, better keep a close eye on that one.  You move on to the next area.\\n\\n[[check the basement|50]]",
      "links": [
        {
          "text": "check the basement",
          "destination": {
            "name": "50",
            "pid": 73
          }
        }
      ]
    },
    {
      "pid": 61,
      "name": "118",
      "text": "He slowly pulls the knife away and steps off you.  You straighten yourself up and glare at him.  Looks like it's finally your chance for a little one-on-one conversation with the Bounty Hunter.\\n\\n[[continue|119]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "119",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 62,
      "name": "133",
      "text": "“All of you STOP!!!” you shout and to your surprise they do.  The Lawyer and Journalist slowly raise their hands and even the Bounty Hunter stops moving and stares at you.\\nYou point your gun at him. “Now slowly toss me the money,” you order.\\n“He only has one bullet,” the Lawyer says.  “I heard him use the other.”\\n“One bullet,” the Bounty Hunter repeats.  “Than let's fucking get him!”  And with that, he and the Lawyer lunge at you as the Journalist ducks and runs for the money bag!\\n\\n\\n[[continue|134]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "134",
            "pid": 63
          }
        }
      ]
    },
    {
      "pid": 63,
      "name": "134",
      "text": "You only have seconds to pick which one's the killer and defend yourself.  There's no time for more questions, you know what you know and now you have to think over everything you've learned and make your final decision:\\n\\nFINAL CHOICE\\n\\n[[#1 shoot to kill the Lawyer, shoot to injure the Bounty Hunter, ally with the Journalist|135]]\\n\\n[[#2 shoot to kill the Lawyer, shoot to injure the Journalist, ally with the Bounty Hunter|136]]\\n\\n[[#3 shoot to kill the Bounty Hunter, shoot to injure the Lawyer, ally with the Journalist|137]]\\n\\n[[#4 shoot to kill the Bounty Hunter, shoot to injure the Journalist, ally with the Lawyer|138]]\\n\\n[[#5 shoot to kill the Journalist, shoot to injure the Bounty Hunter, ally with the Lawyer|139]]\\n\\n[[#6 shoot to kill the Journalist, shoot to injure the Lawyer , ally with the Bounty Hunter|140]]\\n\\n",
      "links": [
        {
          "text": "#1 shoot to kill the Lawyer, shoot to injure the Bounty Hunter, ally with the Journalist",
          "destination": {
            "name": "135",
            "pid": 8
          }
        },
        {
          "text": "#2 shoot to kill the Lawyer, shoot to injure the Journalist, ally with the Bounty Hunter",
          "destination": {
            "name": "136",
            "pid": 7
          }
        },
        {
          "text": "#3 shoot to kill the Bounty Hunter, shoot to injure the Lawyer, ally with the Journalist",
          "destination": {
            "name": "137",
            "pid": 6
          }
        },
        {
          "text": "#4 shoot to kill the Bounty Hunter, shoot to injure the Journalist, ally with the Lawyer",
          "destination": {
            "name": "138",
            "pid": 12
          }
        },
        {
          "text": "#5 shoot to kill the Journalist, shoot to injure the Bounty Hunter, ally with the Lawyer",
          "destination": {
            "name": "139",
            "pid": 45
          }
        },
        {
          "text": "#6 shoot to kill the Journalist, shoot to injure the Lawyer , ally with the Bounty Hunter",
          "destination": {
            "name": "140",
            "pid": 107
          }
        }
      ]
    },
    {
      "pid": 64,
      "name": "82c2",
      "text": " The Bounty Hunter thinks the avalanche could be an accident, or it could be deliberate. The Lawyer points out there was a boom sound right before the shaking, but perhaps it was the fresh snow collapsing and starting the avalanche?  You agree that the timing is very suspicious, but it was snowing heavily and here on a mountain an avalanche is certainly a possibility.  This is something else that has to wait until the morning light.\\n\\n[[continue|83]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "83",
            "pid": 243
          }
        }
      ]
    },
    {
      "pid": 65,
      "name": "59",
      "text": "You nod, pretending to think about what he's saying.  Then like lightning you draw back and punch him as hard in the jaw as you can.  He sees it coming and dodges just enough to get hit in the eye instead.  He tackles you and you both fall to the ground, kicking and punching and hitting each other everywhere you can find and kicking up a flurry of snow while doing it.\\nYou get in some good hits and take a few yourself before you're suddenly pulled off him and shoved away.  The Lawyer's grabbed you by your arm, and the Bounty Hunter's holding back the enraged and bloody nosed Warden by the neck with one hand and the gun with the other.  \\n\\n[[continue|60]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "60",
            "pid": 152
          }
        }
      ]
    },
    {
      "pid": 66,
      "name": "58",
      "text": "You've almost made it to the front door when the Warden grabs your shoulder and drags you back a little from the others.  “I think it's time you and I had a chat, don't you think?”  He speaks quiet enough to be only heard by you.  The kind of chat that we can't have inside?  “Exactly.  Before we go in and keep pretending we don't know each other, we need to get something settled.”  \\nYou think about how he was the by the Policemans body for so long.  It would have been impossible for him to not see the gun.  But it'd  also be too stupid of him to shoot you right here in front of everyone.  Not exactly a reassuring thought when faced with the prospect of spending the night here.\\n\\nCHOICE\\n\\n[[#1 hear what he has to say|58a]]\\n[[#2 attack him now, when he's not expecting it|59]]",
      "links": [
        {
          "text": "#1 hear what he has to say",
          "destination": {
            "name": "58a",
            "pid": 97
          }
        },
        {
          "text": "#2 attack him now, when he's not expecting it",
          "destination": {
            "name": "59",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 67,
      "name": "61",
      "text": "You wrench your arm out of the Lawyers grasp and smooth down your clothes.  The look the Warden is giving you is murderous, but he keeps his mouth shut.\\n“Listen, if you two have a problem with each other it's not my concern,” the Lawyer interjects, trying to calm down the situation. “But next time you might want to think about beating the crap out of each other when you're not being watched?”  He gestures over his shoulder with his chin to where the silhouette of a figure is watching you all from the window of the planetarium.  You can't make out who it is, but now they've seen you two fighting and the Bounty Hunter holding a gun.\\nWith a heartfelt curse directed at your bad luck, you go back inside the Observatory.\\n\\n[[continue|62]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "62",
            "pid": 154
          }
        }
      ]
    },
    {
      "pid": 68,
      "name": "19a1",
      "text": "What's clear is that you both know who the other is.  You're not sure why he hasn't done anything yet and instead keeps up this strange “getting to know you” charade, but you're damn sure not going to make the first move.  Play your cards right, maybe you can pin something on him and give him the slip.\\nYou're also acutely aware that the Blonde is listening to both your every words, pretending to check her nails or some nonsense while leaning against the wall in the dim light.\\nAfter a few more uncomfortable minutes of reciting fake history while listening to your real one, the lights finally come back on.\\n\\n[[continue|20]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "20",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 69,
      "name": "54",
      "text": " The Bounty Hunter crouches next to the body, shaking his head.  “Hell of a way to go,” he comments ,”didn't know him well but he seemed like a decent enough sort of guy.”  You resist the urge to mention a certain video to the contrary.  It doesn't matter now, anyhow.  \\nHe reaches into the Policeman's coat pocket and takes out his wallet, flipping through the contents.  You raise an eyebrow and he catches the look you're giving him.  “It's for his ID number,” he explains, sounding vaguely embarrassed at how it must look ,”when I can get a signal I need to call into the station and they'll want it.”  \\nRight then, he didn't really look like the petty thief type of person.\\n“Let's check out that vehicle, see if we can figure out what happened.” He gives you an almost friendly pat on the back as he leads you to the snowmobile, your previous hostilities to each other now forgotten.  Guess nothings warms up an icy relationship better than a grizzly sudden death.\\nYou're going to have to get the gun from the body later.  Visibility's so poor they may not even see you over there if you're quick enough.  \\nYou and the Bounty Hunter rejoin the others at the crash site.\\n\\n[[continue|55]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "55",
            "pid": 77
          }
        }
      ]
    },
    {
      "pid": 70,
      "name": "57",
      "text": "The Lawyer shuffles his feet and tucks his hands under his armpits.  “If we've seen all there's to see, then can we head back now?  Before all my fingers and toes drop off?”  Sure thing.  The Bounty Hunter whistles for the Warden to join up again, and you begin the long walk back to the observatory.\\n\\n[[continue|58]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "58",
            "pid": 66
          }
        }
      ]
    },
    {
      "pid": 71,
      "name": "56",
      "text": "“It's getting to dark to do anymore,” the Bounty Hunter says. “We'd better head back to the observatory soon.”\\n\\nCHOICE x1\\n\\n#1 [[ask about the flashlight|56a]]\\n\\n#2 [[ask about spending the night in the observatory|56b]]\\n\\n",
      "links": [
        {
          "text": "ask about the flashlight",
          "destination": {
            "name": "56a",
            "pid": 161
          }
        },
        {
          "text": "ask about spending the night in the observatory",
          "destination": {
            "name": "56b",
            "pid": 162
          }
        }
      ]
    },
    {
      "pid": 72,
      "name": "55a1",
      "text": "You open up the trunk but find it empty.  The Bounty Hunter says that they had survival equipment in there.  “Survival equipment?” you ask.  “Like cold weather gear, ropes and tire chains, I think some rations and similar.”\\n“But... aren't we going to need that stuff?” the Lawyer says, looking more concerned about that than the crash itself.  “If we're stuck here now, and have to walk back, wont we need those things?” \\n The Bounty Hunter shrugs ,”it's not that far away to town.  10, 15 kilometers at the most, is that about right?”  You nod, it took you a while to walk up here, but you were counting on downhill being faster.  The Lawyer looks deeply alarmed at the prospect and you can't help but grin a little.  A city boy, clearly.  \\n\\n[[continue|56]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "56",
            "pid": 71
          }
        }
      ]
    },
    {
      "pid": 73,
      "name": "50",
      "text": "You open the door to the basement and almost knock down the Journalist who'd been standing at the top of the stairs.  She quickly tucks something into the pocket of her coat.\\n“Planing on going out?” you ask her nonchalantly as you walk down past her.  It takes her a minute to figure out what you mean.  \\n“Er, no,” her voice is nervous, is she hiding something or afraid to be alone with you?  “I was getting cold so I put my coat back on.  I don't think there's any heating in here.”\\nYou nod and glance at the body of the repairman, deliberately keeping your back to her in case she wants to try something.  \\nInstead, Blondie comes down and joins you.  She looks the body of the Repairman over.  “Not squeamish anymore?” you ask, hoping to get rid of her.\\n“No, not anymore,” her face is still calm but there's a slight edge in her voice.  She gestures at the blood splatter on the wall.  “It's low down, from an angle.”  \\nHer comment hangs in the air.  \\n“It means the Repairman was crouched here working on the panel when he was hit from behind,” she explains with a slight roll of her eyes.\\nIs that important?  “Well, if he'd been standing up we might have been able to guess the height of the killer.  With him crouching though, anyone could have done it.”\\n“Anyone of us?” you ask, wondering where she's heading with this.\\n“Did you do it?”  she can look you in the eyes when she asks that question, you have to give her that much.  “What they said about you on the video, I mean.” she clarifies ,”I know you didn't kill this man.  We were together the whole time.”\\n\\nCHOICE\\n\\n#1 [[tell her the truth|50a]]\\n\\n#2 [[tell her the video was lying|50b]]",
      "links": [
        {
          "text": "tell her the truth",
          "destination": {
            "name": "50a",
            "pid": 200
          }
        },
        {
          "text": "tell her the video was lying",
          "destination": {
            "name": "50b",
            "pid": 198
          }
        }
      ]
    },
    {
      "pid": 74,
      "name": "53",
      "text": "It's a miserable mile long walk to the crash site.  The weather's steadily getting worse and with the fading daylight you can barely see more than a few meters in any direction.  The outline from the snowmobile's treads is already hard to follow and your plans of getting the money and then just disappearing into the night are fading with every step.\\nWhen you finally arrive, the snowmobile's entire front end is crunched down.  It looks like it hit the cliff wall of the mountain at incredible speeds, and the Policeman's body was thrown a good 30 feet away.  \\nWhen you get to him, the image is... not pretty.  He's definitely dead, that's for sure.  At least it saves you the trouble of having to dig him out and carry him back. \\nHowever, you notice that his gun is still in the holster of his belt.  If you can distract the others, you may be able to take it without them noticing. The way things have been going, it might just become a critical part of your escape plan.\\n\\n[[continue|54]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "54",
            "pid": 69
          }
        }
      ]
    },
    {
      "pid": 75,
      "name": "52",
      "text": "And so you get shoe-horned into a 4 man search and rescue operation: you, the Bounty Hunter, Warden, and the Lawyer.  The two “celebrities” were useless and the Doctor would have just been a liability. No surprise, the Journalist had made herself scarce when you were leaving.\\n\\n[[continue|53]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "53",
            "pid": 74
          }
        }
      ]
    },
    {
      "pid": 76,
      "name": "7ba12",
      "text": "This man is not so much engaged in the conversation as he is pretending to be.  He's standing with his arms crossed over his chest, nodding occasionally but at odd times.  When you introduce yourself as David White, traveling businessman, he hesitates before shaking your hand.  “I'm Mikhail Czyks,” his local accent is strong and genuine.  “Mr. Jameson called my agency and they sent me here to do repairs.  This place is falling apart, what can they want me to do?”  You glance around the decaying room in sympathy.  Yeah, it's in bad shape, you agree.  They didn't tell you anything about what you're supposed to do?  “No, nothing.  Man came, picked up and others up from train station, and we come up here and wait.”  Hmmm... he seems genuine enough.  Age could be early 40s or a weathered late 30s.  Tall but with a  rail thin build, his clothes are practically falling off him.  Definitely poor.  Probably came all the way up here in the middle of a snowstorm because he just needs the job that bad.  You give him a friendly pat on the shoulder and tell him as soon as you see Mr. Jameson you'll send him his way.  Mikhail nods in gratitude.\\n\\n[[continue|8]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "8",
            "pid": 179
          }
        }
      ]
    },
    {
      "pid": 77,
      "name": "55",
      "text": "The Warden points out that the tracks are leading straight into the wall.  It's not a slide like you'd expect if he'd somehow just lost control.  The trunk of the snowmobile is also open, possibly having been damaged during the crash.\\n\\nCHOICE\\n\\n[[#1 investigate the bottom of the snowmobile|55a]]\\n[[#2 investigate the trunk|55b]]",
      "links": [
        {
          "text": "#1 investigate the bottom of the snowmobile",
          "destination": {
            "name": "55a",
            "pid": 255
          }
        },
        {
          "text": "#2 investigate the trunk",
          "destination": {
            "name": "55b",
            "pid": 257
          }
        }
      ]
    },
    {
      "pid": 78,
      "name": "69a",
      "text": "It's empty.  There's little pieces of blackish soot on the inside.  The Bounty Hunter picks up a piece and sniffs it.  “Charcoal.  Probably was a box of emergency flares,” he surmises. “Shame, we could have really used those.”\\n\\n[[check the lockers|69b]]",
      "links": [
        {
          "text": "check the lockers",
          "destination": {
            "name": "69b",
            "pid": 174
          }
        }
      ]
    },
    {
      "pid": 79,
      "name": "82a1",
      "text": " The Bounty Hunter thinks the avalanche could be an accident, or it could be deliberate. The Lawyer points out there was a boom sound right before the shaking, but perhaps it was the fresh snow collapsing and starting the avalanche?  You agree that the timing is very suspicious, but it was snowing heavily and here on a mountain an avalanche is certainly a possibility.  This is something else that has to wait until the morning light.\\n\\n[[Ask about the husband|82a2]]",
      "links": [
        {
          "text": "Ask about the husband",
          "destination": {
            "name": "82a2",
            "pid": 114
          }
        }
      ]
    },
    {
      "pid": 80,
      "name": "96a2",
      "text": "You ask him if he thinks the Bounty Hunter could be the killer.\\n“Maybe...” he answers carefully.  He's acting a little strange, but maybe he's just scared and you're reading into things too much? “Maybe he is.  The Policeman's break lines were cut; he's been up in everyone’s business; he'd be in a position to know these details of peoples personal lives.”  \\n“A lot of people here might have had access to private records,” you point out. “The Warden and Policeman easily, maybe the Doctor.  Maybe the Journalist, too.  She could have found out who all of us are and is still going for that breakthrough story.”\\n“You left me off the list,” he points out.  “As a lawyer, I could've heard things too.”\\n“You're absolutely right.”\\n\\n[[-Ask him why you have to be the one to go upstairs|97]]",
      "links": [
        {
          "text": "-Ask him why you have to be the one to go upstairs",
          "destination": {
            "name": "97",
            "pid": 186
          }
        }
      ]
    },
    {
      "pid": 81,
      "name": "30a1",
      "text": "“Got any reception?” you ask.  “We need to call for assistance.”  The Doctor shakes his head and the Policeman glares at you, angry that you're stepping in on his territory.  His partner says he had no bars outside, and the Lawyer confirms it.  Inside the concrete's blocking the signal and outside it must be due to the storm.\\n\\n[[continue|31]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "31",
            "pid": 137
          }
        }
      ]
    },
    {
      "pid": 82,
      "name": "69b1",
      "text": "There's a moment of silence as both of you freeze.  The Bounty Hunter tells you not to move a muscle, and you hear the familiar click of a gun.\\n  \\nCHOICE\\n\\n[[#1 hold your ground|69b1a]]\\n[[#2 sneak out quietly|69b1b]]",
      "links": [
        {
          "text": "#1 hold your ground",
          "destination": {
            "name": "69b1a",
            "pid": 13
          }
        },
        {
          "text": "#2 sneak out quietly",
          "destination": {
            "name": "69b1b",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 83,
      "name": "82c1",
      "text": "You ask the Bounty Hunter again where did the rope come from? He confirms that it was part of the survival equipment in the snowmobile.  Either the Husband stole it earlier, before the Policeman drove off, or somehow he stole it after the snowmobile crashed (the trunk was open).  But the Husband wasn't even there at the crash site.  The Lawyer agrees, it just doesn't make sense.  \\nThe Bounty Hunter looks shiftily to the side, there's something he's not telling you...\\n\\n#1 [[Ask about the avalanche|82c2]]",
      "links": [
        {
          "text": "Ask about the avalanche",
          "destination": {
            "name": "82c2",
            "pid": 64
          }
        }
      ]
    },
    {
      "pid": 84,
      "name": "24a",
      "text": "You follow the Policeman up, glancing back at the grizzly scene.  The Blonde is scanning the room, taking it all in, but hurries to leave with the rest of the group.  Doesn't want to be alone with the body and you don't blame her.  The Warden is giving you an accusing look, as if he thinks you did this somehow despite not having gotten out of his sights once since arriving.\\n\\n[[continue|25]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "25",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 85,
      "name": "24b",
      "text": "You linger behind, pretending to shake your head and study the grizzly scene.  The Blonde hangs back with you and is about to say something when the Policeman barks ,”Out!  All of you!  This is a crime scene!”  You both hurry up, the Blonde not meeting your eyes.  In the hallway the Warden is giving you an accusing look, as if he thinks you did this somehow despite not having gotten out of his sights once since arriving.\\n\\n[[continue|25]]\\n",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "25",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 86,
      "name": "10b",
      "text": "These two are putting on a show alright.  All eyes are on them and that seems to be how they want it. The woman, Petra, begins loudly introducing herself again to the remaining guests.  The Warden rolls his eyes and fills up another glass of wine.   You wouldn't mind a drink yourself, but you don't want to let the Warden get too close of a look at you.  The man of the couple, Mr. Famous Guyovich or whatever his name was, starts shamelessly flirting with the blonde, ignoring his wife completely.  Good to see romance isn't dead.\\n\\n[[continue|10b1]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "10b1",
            "pid": 52
          }
        }
      ]
    },
    {
      "pid": 87,
      "name": "58a1",
      "text": "The Warden crosses his arms over his chest, like he's trying to look imposing.  No gun, you notice.  But it doesn't mean its not in his pocket...\\n“This is about the money, Mr. William D. Wilson.  I know you think it's about revenge for you two breaking out and costing me my job, but its not.  It's always about the money.”  Right, the money I stole and you just want your cut of it?  Is that it?\\n“Exaaactly,” he says with a grin ,”now I think we understand each other.  I'm not even being greedy here!  I'll even let you keep a million.”  \\nNinety percent's not greedy?\\n“No, greedy's if I told Mr. Vigilante Cop Buddy here who you really are, got my share of the bounty on your head, and then took all the money for myself.  That would be greedy.”\\nYeah, the Bounty Hunter.  You hadn't forgotten.  He's a big problem. \\n“Why haven't you done exactly that, yet?” you ask.\\n“Because I need your help.  You're going to help me get the money out of the well, and then we go our separate ways.  Come morning, of course.”  \\nThe well.  Of course.  Somehow the Warden must have gotten a hold of your partners old map, the one with the wrong location drawn in.\\n“Gonna be stuck here all night together, huh?” you deadpan.  “What are we going to do, play poker all night to keep awake?”\\n“Got a pack right here in my pocket,” he tosses back, patting his coat from the outside.\\n\\nOkay, you've heard enough.  There's no way you're spending the night cooped up here with this asshole, just waiting for him to stick a knife in your back AND think you're his lapdog as he's doing it!\\n\\n[[attack him!|59]]",
      "links": [
        {
          "text": "attack him!",
          "destination": {
            "name": "59",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 88,
      "name": "10a",
      "text": "You approach the odd couple and introduce yourself.  They greet you warmly, a sparkle in their eyes as soon as you say you're an American.  The man, Josef, chats unpleasantries with you about the worsening weather and the woman, Petra, begins loudly introducing herself again to the remaining guests.  The Warden rolls his eyes and fills up another glass of wine.  While you are talking about how much snow may fall by morning,  you surreptitiously look the newcomers over.  Both early to mid 30s.  Expensive clothes but cheap coats hung on the wall.  Possibly expensive shoes but they're covered in snow and mud.  Did they walk here?  The man is tall and muscular.  Probably spends as much time at the gym as he does slicking back his hair.  You suppose he's got the popular sort of look now.  The woman is undeniable pretty, but heavily made up and with dark eye makeup and bright red lips.  Her black hair is styled in loose waves, slightly unkempt from the hat she'd been wearing.  Both are speaking very controlled, like they're reading lines off a script.  You make a mental note to keep an eye on these two, whatever their game is, and you head to the back door again.\\n\\n[[continue|11]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "11",
            "pid": 188
          }
        }
      ]
    },
    {
      "pid": 89,
      "name": "23ab",
      "text": "There's no way this man could have tripped and fell.  The wound's angled from the back and there's nothing for him to hit his head on.  Than you see it: a metal fire extinguisher, placed upright nearby, with blood shining on it.  Next to it is the Repairman's little flashlight, crushed like someone stepped on it. \\n\\n[[continue|24]]\\n",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "24",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 90,
      "name": "115",
      "text": "You crawl out onto a narrow landing.  The ground is a vague dark shape 30 feet plus below you, but dawn's just starting to brighten the horizon so you can at least see what's in front of your feet.  The snow's finally stopped but dumped a thick layer on the roof, so you have to climb down with extreme care.\\nYou slowly crawl your way along the edge, trying to find the safest way down.  At the far side of the roof you see an emergency fire escape ladder, so you head there.  You slip and slide across the icy roofing tiles, but always manage to catch yourself.  You're not usually very acrobatic, but apparently when the situation demands it you can still surprise yourself.\\n\\n[[continue|116]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "116",
            "pid": 201
          }
        }
      ]
    },
    {
      "pid": 91,
      "name": "114",
      "text": "It's not a big room and it doesn't take you long to conclude there's certainly none of those “little Soviet spaces” the Lawyer mentioned.  The only way out is the window, but it doesn't have hinges.  \\nYou dump the contents of the metal drawer from the projector onto the table top and go to the window. Carefully wrapping your hands in your sleeves to protect from shards of glass, you swing the drawer against it.  The window cracks promisingly.  Three more blows and some help from your booted foot and you've got it open enough to crawl out.  It was noisy work, unfortunately, and anyone listening probably figured out what you just did.\\n\\n[[continue|115]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "115",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 92,
      "name": "88",
      "text": "You ask what are we going to do with her now?  She's clearly unstable.  The Journalist suggests locking her up somewhere until she calms down.\\n\\n[[continue|89]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "89",
            "pid": 93
          }
        }
      ]
    },
    {
      "pid": 93,
      "name": "89",
      "text": "You put her into the storage room and “lock” the door shut from the outside with some more of the phone line wiring.  The Bounty Hunter says that he tied her securely, she wont be going anywhere until we can figure out whats going on.   She's shouting from the room to be untied, so you all go down to the bottom of the stairs to get away from her noise.\\n“So that's it then?” the Lawyer asks.  “SHE was the killer all this time?”\\nIf you have any questions you want to ask, now's the time.\\n\\nCHOICE x1\\n\\n[[#1 Why wouldn't she have shot the WARD earlier if she had the gun?|89a]]\\n[[#2 How could she have even gotten the gun?|89b]]\\n[[#3 Do you really think she's the killer?|89c]]",
      "links": [
        {
          "text": "#1 Why wouldn't she have shot the WARD earlier if she had the gun?",
          "destination": {
            "name": "89a",
            "pid": 213
          }
        },
        {
          "text": "#2 How could she have even gotten the gun?",
          "destination": {
            "name": "89b",
            "pid": 214
          }
        },
        {
          "text": "#3 Do you really think she's the killer?",
          "destination": {
            "name": "89c",
            "pid": 215
          }
        }
      ]
    },
    {
      "pid": 94,
      "name": "111",
      "text": "Secondly there's a small cloth bag.  The fabric feels brand new.  You open it and find... an instruction sheet?    Yes, it's an instruction sheet for night vision goggles.  The text is in English, so whoever brought it here didn't buy it locally.   If you find who has those goggles, it's another piece of pretty damning evidence.\\n\\n[[continue|112]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "112",
            "pid": 212
          }
        }
      ]
    },
    {
      "pid": 95,
      "name": "110",
      "text": "You decide to check the projector itself but don't find anything.  You pop out the tape of the incriminating videos and pocket it in case the police sweep this building later.\\nIn the desk itself you find a hidden drawer at the underside of the tabletop.  You probably wouldn't have found it otherwise, but it was sticking out just slightly.  As if someone was in a hurry when they last used it.\\nYou pull out the drawer, and inside are three items:\\nThe first is a detailed blueprint of the building.  Perhaps this explains how the killer was able to move so quickly around; he simply had the layout memorized.\\n\\n[[continue|111]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "111",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 96,
      "name": "113",
      "text": "Suddenly the door behind you slams shut!  You dash to it but it's too late; you hear the lock and chain click into place second before you slam into it.  Stupid, stupid move on you part, you berate yourself. You were so engrossed in the files and what they could mean that you didn't notice that someone was watching you.  \\nAs you scan the small planetarium, it occurs to you that anyone of the others could have locked you in.  The Doctor definitely is not here now, but that doesn't mean he wasn't using this room as a hideout.  The Journalist and Lawyer both new you were in here and the Wife could have overheard.  And of course the Bounty Hunter only said he was going outside, you didn't actually see him go.\\nAnyone of them could be the killer and was just locking you in here to finish you off later. Or... or maybe they assume you're the killer, and just trapped you...\\nYou shake your head violently, trying to clear your thoughts and to focus.  There are too many ifs and maybes, but they can wait.  Right now you need to find a way out of here...\\n\\n[[continue|114]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "114",
            "pid": 91
          }
        }
      ]
    },
    {
      "pid": 97,
      "name": "58a",
      "text": "He hasn't directly threatened you yet.  If he's going to shoot you, you might as well hear why.  \\nYou wait until the other two have disappeared through the front door before turning to him. “Alright, what's this about?”\\n\\n[[continue|58a1]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "58a1",
            "pid": 87
          }
        }
      ]
    },
    {
      "pid": 98,
      "name": "82",
      "text": "Later:\\nIt took a while, but you finally got the Wife of the couple to calm down and stop wailing.  You're now positive that she's been lying about a lot of things, but her grief for her husband is genuine.  She had no hand in whatever happened to him at the well, though you're not ready to write her off the other murders just yet.\\nNow the Journalist is with her, trying to comfort her and gently ask her what really happened.  If she doesn't succeed, the Bounty Hunter's going to question her next and you can guarantee he won't be so considerate.  You approach him and the Lawyer to talk the situation over.\\n\\nCHOICE \\n\\n#1 [[Ask about the rope again.|82a]]\\n#2 [[Ask about the avalanche|82b]]\\n#3 [[Ask about the husband|82c]]\\n",
      "links": [
        {
          "text": "Ask about the rope again.",
          "destination": {
            "name": "82a",
            "pid": 207
          }
        },
        {
          "text": "Ask about the avalanche",
          "destination": {
            "name": "82b",
            "pid": 30
          }
        },
        {
          "text": "Ask about the husband",
          "destination": {
            "name": "82c",
            "pid": 29
          }
        }
      ]
    },
    {
      "pid": 99,
      "name": "30a",
      "text": "You point to his hand, “what's that you got there?”.  The Policemen tenses by your side, ready to pull his gun out at any moment.  Dr. Hayes calmly regards you and flips up his cellphone.  It's an old fashioned style, the kind with a little built in flashlight at the top.  Oh, so that's how he was able to see in the dark.  Handy thing, that.\\n-[[ask about the phone|30a1]]",
      "links": [
        {
          "text": "ask about the phone",
          "destination": {
            "name": "30a1",
            "pid": 81
          }
        }
      ]
    },
    {
      "pid": 100,
      "name": "30b",
      "text": "The Policeman scowls at the Doctor who seems entirely unphased.  He tells him there was a key placed on the body, everyone's going upstairs together so he can be sure no one thinks about running away.  This is a criminal investigation now, you're all suspects.\\nThe partner shifts to the back of the group and you all proceed single file up the twisting staircase.\\n\\n[[continue|31]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "31",
            "pid": 137
          }
        }
      ]
    },
    {
      "pid": 101,
      "name": "81",
      "text": "There's nothing more you can do here until it's morning and you can see better.  You and the others walk back inside the observatory.\\n\\n[[continue|82]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "82",
            "pid": 98
          }
        }
      ]
    },
    {
      "pid": 102,
      "name": "86",
      "text": "When the Journalist sees that its you who grabbed her she starts clawing at your face and shouting “it's him! He was trying to kill me!”.  You try to restrain her and she knees you between the legs.  You slap her hard and she elbows you in the face only to get pulled off you by the Bounty Hunter who roars at you two to STOP!  LOOK! He points to the other side of the room.\\nThe Wife is standing over the body of the Warden.  She's disheveled and crazy eyed and holding the gun in her hand.  The Warden's dead, three shots squarely in his chest. \\n\\n[[continue|87]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "87",
            "pid": 103
          }
        }
      ]
    },
    {
      "pid": 103,
      "name": "87",
      "text": "Nobody moves for a second, then the Lawyer slowly approaches her from the corner he was hiding in. He tells her to put the gun down and she points it at him, stopping him in his tracks.  She's clearly in shock and the Lawyer raises his hands, telling her to keep calm and realize what she's doing.  He's distracting her from the Bounty Hunter who's carefully sneaking up behind her.  She lowers the gun slightly and the Bounty Hunter makes his move, lunging up grabbing her from behind.  She screams and fires off one shot, missing wildly before dropping the gun.  The Lawyer kicks it away and pins her arms behind her back as she struggles to get free.\\nThe Bounty Hunter shouts for someone to give him something to tie her up with.  You've got nothing but the Journalist tosses him some telephone wires.\\n\\nCHOICE x1\\n\\n[[#1 ask the Journalist where did she get those from|87a]]\\n\\n[[#2 talk to the Wife|87b]]",
      "links": [
        {
          "text": "#1 ask the Journalist where did she get those from",
          "destination": {
            "name": "87a",
            "pid": 272
          }
        },
        {
          "text": "#2 talk to the Wife",
          "destination": {
            "name": "87b",
            "pid": 270
          }
        }
      ]
    },
    {
      "pid": 104,
      "name": "84",
      "text": "Chaos suddenly erupts in the room.  You can't see a thing, but someone runs into you.  It's the Lawyer who starts screaming for you to stay the hell away from him.  You hear the Bounty Hunter trip and stumble in the dark.  Something is knocked over and one of the women starts screaming.  It sounds like the Wife.  \\n\\n[[turn on your light|85]]",
      "links": [
        {
          "text": "turn on your light",
          "destination": {
            "name": "85",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 105,
      "name": "85",
      "text": "You fumble in your pockets for your light but can't find it.  The screaming continues, as well as sounds of a scuffle.  \\nSuddenly there are three gunshots in rapid succession.  The room goes quiet and you drop to the floor and crouch.  It's impossible to make out any shapes in the pitch blackness.\\nYou hear the sounds of footsteps running right toward you.\\n\\nCHOICE\\n\\n[[#1 avoid the person, they could have a gun|85a]]\\n[[#2 tackle the person, you need to know who they are|85b]]",
      "links": [
        {
          "text": "#1 avoid the person, they could have a gun",
          "destination": {
            "name": "85a",
            "pid": 202
          }
        },
        {
          "text": "#2 tackle the person, you need to know who they are",
          "destination": {
            "name": "85b",
            "pid": 203
          }
        }
      ]
    },
    {
      "pid": 106,
      "name": "55b1",
      "text": "You dig your way down to the bottom but its too dark to make out much.  You ask the others for a flashlight, but no one has one.  Didn't the Bounty Hunter say he was getting one earlier, when the Repairman was killed?\\nOkay, something to think about.  You light one of your matches and cautiously look at the undercarriage, there's a lot of spilled substances down here that might ignite if you're not careful.  \\nAnd you think one of them might be brake fluid.  Which would explain why it crashed the way it did.  You're not a mechanic, you're not sure, but you think that's what it is.\\nYou crawl out and tell the others your findings.  \\nIt's just the Bounty Hunter and Lawyer.  The Wardens gone?  “Looking at the body, apparently” they tell you.  You think about that gun in the holster.  Something else to weigh on your mind.\\n\\n[[continue|56]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "56",
            "pid": 71
          }
        }
      ]
    },
    {
      "pid": 107,
      "name": "140",
      "text": "6- (shoot to kill the Journalist, shoot to injure the Lawyer , ally with the Bounty Hunter)\\n\\n\\nYou shoot the Journalist once straight through the chest and she collapses. Then you shoot the Lawyer in the leg and he falls to the ground screaming, dropping the bag of money of he was moving for.  You rush to get it when the Bounty Hunter trips you and wrestles you to the ground.  You struggle to get out from under him but he grabs the empty gun from your hand and pistol whips you hard across the head.  He then kicks you in the stomach and you lay there, stunned and breathless.\\nYou hear him click a bullet back into the gun. \\n“Lawyer was lying when he said there was only one bullet.  He had another one in his pocket.” He explains.\\nHe stands over you and points the gun at your head, stepping on your neck to hold you down.\\n“Why?” you manage to ask him.\\n“Why?” he repeats.  “I'm not the fucking serial killer, don't ask me that shit.  But I am going to be your killer now.”  He presses down on your throat harder and the room starts to go dark.   “Did you really think I was going to let you live and just walk about with half the money?  Than you're a fucking idiot.”\\nYou shake your head slightly, trying to speak but he just presses down harder.  “Now I'm going to kill you, then kill the Lawyer because I can't have him running his mouth, and I'm going to walk out of here a very rich man...”\\nAnd with those last words, he pulls the trigger.\\n\\nEND",
      "links": []
    },
    {
      "pid": 108,
      "name": "69c",
      "text": "You turn and tackle the BH, trying to wrestle the gun from him in the dark.  A shot goes off, barely missing you by the sound of it, and you both end up falling down the stairs.  The Bounty Hunter pulls away part way down, and when you reach the bottom you're trying to dig out a match to light when someone jumps on you from behind and presses a foul smelling rag over your face.  You struggle valiantly, but with the wind already knocked out of you it's not long before you pass out...\\n\\n[[continue|72]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "72",
            "pid": 252
          }
        }
      ]
    },
    {
      "pid": 109,
      "name": "51a",
      "text": "“I couldn't give a shit if you want to help or not, you're coming!” he growls at you. “We're going to need as many strong men as we've got if we have to dig him out!”  He drags you to the main room where the Warden and Lawyer are putting on their coats and gloves.  “I told him you'd be happy to help,”  the Warden says with a smile.  “Then I'm sure you're coming too, huh?” you reply and he glares but nods. \\nJust what is his problem with you?\\n\\n[[continue|52]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "52",
            "pid": 75
          }
        }
      ]
    },
    {
      "pid": 110,
      "name": "96c1",
      "text": "“I still think it may be the Doctor.  Maybe he's gone crazy or took too many drugs and just lost it.  We haven't seen him in several hours, but it just doesn't make sense that he'd take off alone into the night.\\n\\n[[-Ask him why you have to be the one to go upstairs|97]]",
      "links": [
        {
          "text": "-Ask him why you have to be the one to go upstairs",
          "destination": {
            "name": "97",
            "pid": 186
          }
        }
      ]
    },
    {
      "pid": 111,
      "name": "96c2",
      "text": "“Maybe when the lights went out the second time she took it off the Bounty Hunter when he was out. She said she'd tripped over him in the dark.  Or maybe the Warden stole it during your fight with him outside, and they took it off him when the jumped him in the garage.”\\n“Is that what you think happened back there?” you ask.\\nHe shakes his head,” I don't know.  I really don't.”\\n\\n[[-Ask him why you have to be the one to go upstairs|97]]",
      "links": [
        {
          "text": "-Ask him why you have to be the one to go upstairs",
          "destination": {
            "name": "97",
            "pid": 186
          }
        }
      ]
    },
    {
      "pid": 112,
      "name": "51b",
      "text": "“That's the fucking spirit.  Last thing we need is a dead cop on our hands after all the other shit that's been going down.”  He drags you to the main room where the Warden and Lawyer are putting on their coats and gloves.  “I told him you'd be happy to help,”  the Warden says with a smile.   “Then I'm sure you're coming too, huh?” you reply and he glares but nods.  Just what is his problem with you?\\n\\n[[continue|52]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "52",
            "pid": 75
          }
        }
      ]
    },
    {
      "pid": 113,
      "name": "3",
      "text": "You step into the main room and glance at the four other people standing around, talking quietly.  No, make that five.  An older man just walked in from another room, wiping his hands off on his pants.  He glances at you and you instantly recognize him.  Warden Leon Abrusti, chief Corrections Officer of the  maximum security penitentiary you broke out of the better part of 8 months ago.  He stops in his tracks and looks at you, his expression odd.  Does he recognize you?  No, he couldn't possibly... You've changed everything about yourself.\\n\\n[[continue|4]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "4",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 114,
      "name": "82a2",
      "text": "The Lawyer offers to be the next one to talk to the Wife, she's in a delicate emotional state right now but we need to find out what her husband was doing in a well in the middle of the night in a snowstorm.  The Bounty Hunter offers to talk to the Warden about it and then they'll compare stories.\\ncont to s2nd choice below\\n\\n[[continue|83]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "83",
            "pid": 243
          }
        }
      ]
    },
    {
      "pid": 115,
      "name": "7",
      "text": "There are no windows to break up the concrete walls and floor, typical of Soviet governmental construction, and the only other door is on the far side of the room where the Warden came from.  That's where you need to go.  Your partner hid the 10 million dollars you'd stolen together in a floor safe in the corner of the basement.  You just need to get past these people unnoticed and find a way down.\\nCHOICE\\n0- [[check your items|7a]]\\n1a- [[Introduce yourself to the other three people in the room|7b]]",
      "links": [
        {
          "text": "check your items",
          "destination": {
            "name": "7a",
            "pid": 209
          }
        },
        {
          "text": "Introduce yourself to the other three people in the room",
          "destination": {
            "name": "7b",
            "pid": 208
          }
        }
      ]
    },
    {
      "pid": 116,
      "name": "23bb",
      "text": "You glance at the corner where your partner hid the money.  You see it: the slightly off color floor tile, partially covered up by an empty metal tool cabinet.  It looks untouched.\\n\\n[[continue|24]]\\n",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "24",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 117,
      "name": "72c2",
      "text": "You approach the Lawyer and ask him what happened.  You note he's one of the few people here without any visible cuts and bruises. He claims that when the lights went out he was upstairs.  He'd just seen a figure with a flashlight walking outside on the grounds and he was heading down to investigate and see if it was the Doctor when the lights went out.  Suddenly he heard someone rushing up the stairs so he hid under a table.  He couldn't see anything but heard footsteps walking by.  Then the person left and he waited a minute.  He heard the sounds of a fight and someone falling down the stairs, than a woman screaming and a lot of commotion.  He stayed upstairs, afraid to use his lighter in case the killer came back.  A few minutes later the lights came back.  When he came downstairs he found the Bounty Hunter at the bottom of the stairs, a nasty bump on his head.  He says you were found unconscious in the hallway, a broom handle on the ground near you that you must have tripped over in the dark.\\n\\n[[continue|73]]\\n\\n",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "73",
            "pid": 251
          }
        }
      ]
    },
    {
      "pid": 118,
      "name": "72c1",
      "text": "The Journalist claims that she was downstairs in the basement looking for clues when the lights went out and someone attacked her.  She was able to get away at first, but they locked her in the basement with the body.  She spent several minutes screaming for help before the lights came back on.  The Bounty Hunter confirms that when they found her she was banging at the door and shouting.  \\n\\n[[talk to the Lawyer|72c2]]",
      "links": [
        {
          "text": "talk to the Lawyer",
          "destination": {
            "name": "72c2",
            "pid": 117
          }
        }
      ]
    },
    {
      "pid": 119,
      "name": "128",
      "text": "You and the Bounty Hunter go back inside quietly.  He has his knife drawn and ready, but you don't want him to know you've got the gun just yet.\\nInside the main room the lights are on but it's totally silent.  You cautiously open the door to the hallway.\\n\\n[[continue|129]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "129",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 120,
      "name": "132",
      "text": "“Search her pockets,” he growls at last.\\nYou frisk her and find a little plastic box, about the size of a credit card.  It's the remote control clicker for the lights.  “Care to explain this?” you ask her, watching out of the corner of your eye as the Bounty Hunter searches the Lawyer.\\nHer face goes pale.  “I found it.  In this room, after the Warden was shot.  I figured out what it did, but I didn't tell you about it because-”  \\n“Just what the fuck is this?” the Bounty Hunter demands, pulling out a dark object from the inside pocket of the Lawyers coat.  It's the night vision goggles.\\n“What the hell?!” the Lawyer shouts, staring at them. “Those aren't mine!  She must have put them in my coat!”\\n“You've been wearing your coat all goddamn night!” the Journalist hisses, still trying to wriggle out of your grasp.\\nThen you see your dead partner's duffel bag in the corner of the room where it must have fallen during their fight.  The money!\\nThe Bounty Hunter sees it too and shoves the Lawyer away from him as he dashes for it.  The Lawyer lunges at you and the Journalist, so you toss her at him and back away.\\n\\n\\n[[Pull out your gun|133]]",
      "links": [
        {
          "text": "Pull out your gun",
          "destination": {
            "name": "133",
            "pid": 62
          }
        }
      ]
    },
    {
      "pid": 121,
      "name": "108",
      "text": "You unlock the Planetarium and slide the chain out as quietly as you can; you don't know who's listening in but you're betting someone is.  The door opens mercifully without a squeak and you step inside and turn the lights on, gun in hand in case someone jumps you.  \\nNo one's here.  Something about the room looks a little different from the last time you saw it, but there's definitely no killer hiding out here right now.\\nFirst things first, though.  You pop out the two bullets from your gun, hold it by the barrel, and with all your might swing the handle down against the metal door.  It makes a terrific, echoing “bang” and you hope that it's convincing enough to fool the Lawyer or whoever else that you just wasted a bullet on the lock.  \\nThe lights flicker on and off twice but then stay on.  Odd...\\nYou put the bullets back in, cock one into the chamber, and start searching the room for clues.\\n\\n[[continue|109]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "109",
            "pid": 122
          }
        }
      ]
    },
    {
      "pid": 122,
      "name": "109",
      "text": "There was a pile of old building materials by the door that you didn't have a chance to look at earlier. You push the bricks and dried up paint cans to the side and, lo and behold, there's a smaller second circuit breaker on the wall behind them.  You jimmy it open with the edge of a painters spatula.  It looks recently installed, much newer than the one in the basement which probably came with the original building.\\nYou don't know much about electricals, but there's this black and green side piece attached to the main breaker that looks out of place.  You force it off and examine it.  The writing on it's in Russian, but you make out enough to guess this is some sort of short range remote device.\\nSo someone could have had a radio switch in their pocket this whole time and been turning the lights on and off from anywhere in the house?  If you find that person with the switch, you may have just found the killer.\\nYou smash the device under your heel and keep looking.\\n\\n[[continue|110]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "110",
            "pid": 95
          }
        }
      ]
    },
    {
      "pid": 123,
      "name": "70d",
      "text": "It's pitch black in the room.  You tell the Lawyer to stay calm, you're going to get a light.  He doesnt say anything , but you hear him shuffling away from you.  You pull out your matchbox from your pocket and fumble in the dark a little to get one lighted.  It takes your eyes a second to adjust, and by then the lawyer has crossed the room to near the door, an unidentified object in his hand.\\nHe whirls around at the light, a look of horror on his face. “What... what are you doing?” he stammers.\\nI'm giving us some light, what the hell are you doing?  \\nThe lawyer hides the object behind his back and hold up his free hand, “you... you're really him! You're the killer, aren't you?!”  He looks terrified and is edging toward the door.\\n\\n[[continue|70e]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "70e",
            "pid": 124
          }
        }
      ]
    },
    {
      "pid": 124,
      "name": "70e",
      "text": "You shake your head at him, just where is he getting this from? “If I was the killer, why would I-”\\nHe runs out he door and down the stairs, not waiting to hear you finish.  You sprint after him, your match blowing out in the dash.  \\nThen part way down the stairs, someone tackles you.  You can't tell if it's the Lawyer or not, but the cry of pain as you strike out wildly almost sounds like the Bounty Hunter's.  You and your attacker begins to wrestle, and a shot goes off, barely missing you by the sound of it.  You loose your footing and you both end up falling down the stairs, your attacker pulling away part way down. When you reach the bottom you're trying to dig out another match to light when someone jumps on you from behind and presses a foul smelling rag over your face.  \\n\\nYou struggle valiantly, but with the wind already knocked out of you it's not long before you pass out...\\n\\n[[continue|72]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "72",
            "pid": 252
          }
        }
      ]
    },
    {
      "pid": 125,
      "name": "100",
      "text": "“Boghdan and I aren't... aren't who we've said we were.  We're not famous.  We're not even on TV.”\\nYou snort and fight back a grin.  Yeah, no shit.\\n“We're... we're con artists, just like the video said.” Her voice wavers but she continues. “We'd gotten a big score with this family in central Europe, but then it was getting too hot for us so we fled out east.  We found our way here to this village.  That's where we met Abrusti, the Warden.”\\nYou raise an eyebrow, but let her continue.\\n“We were staying at the hotel in town, low on money and waiting for our next mark.  Last night this rich Frenchman comes in, throwing Rubles around on cheap women and making a spectacle of himself.”\\nAh Warden Abrusti, he sounds just like you remember  him.\\n“He was obviously well off, so my husband and I think we can roll him for all he's worth.   Maybe even enough to leave the continent, try our luck in America.  So we take him to the bar, get him drunk.  The plan's for me to catch his eye, get him to take me back to his room.  Than I let my husband in, he knocks him out, and we rob him and take anything he has.”\\nHer honesty is almost refreshing after the night you've been having.  Almost.  \\n\\n[[continue|101]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "101",
            "pid": 126
          }
        }
      ]
    },
    {
      "pid": 126,
      "name": "101",
      "text": "“Yes, I know it's not a nice way to make a living, but we were getting desperate.”  she continues, occasionally looking to the Journalist for a comforting squeeze of the hand.  “Robbing Abrusti was the original plan, but then he just gets hammered and starts going on and on about this 10million US dollars that's hidden nearby somewhere and that's why he's here.  He claims he found a map with the personal effects of a convict who'd escaped his penitentiary.  Of course we didn't think too much of this story at first, but he went into so many details about the convicts and the location, we started to believe him.”\\nSo of course they figured out who you were after they heard your tape...\\n“We decided to leave him alone that night, to follow him up here and see what he does.  We had a taxi drop us off a few miles down the mountain, he wouldn't come closer in the storm, and we walked up here ourselves.  That's why we arrived so late.”\\n\\n[[So what happened when the lights went out?|102]]",
      "links": [
        {
          "text": "So what happened when the lights went out?",
          "destination": {
            "name": "102",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 127,
      "name": "19a",
      "text": "Your conversation with the Warden doesn't go like you thought it would.  In fact, he spends most of his time talking about himself and how he's out here looking for an escaped criminal.  Is there a bounty out for him?  Yes, I believe so, but that's not what this is about.  This man publicly humiliated me, cost me my job.  I want to see him brought to justice.\\n\\n[[continue|19a1]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "19a1",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 128,
      "name": "70a",
      "text": "You say that yeah, your video was true.  For the most part.  But you don't know how whoever did all this could have found out about it, though.\\nThe Lawyer nods thoughtfully.  “Mine is true, yes, but it left out the part about how the man I'd set free had mafia connections who were threatening my family.  When he was released, he killed three people before being caught again.”  He sighs deeply before turning his back to you and going to the window.\\n\\n[[continue|70c]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "70c",
            "pid": 271
          }
        }
      ]
    },
    {
      "pid": 129,
      "name": "70b",
      "text": "“I'm asking because I just realized that I'm alone with you in this room,” he says quietly, watching you from the corner of his eye.\\nAnd you think I'm the killer? \\nA long pause, then,”No.  No, I don't think you killed the  other two.  But...”  He doesn't need to finish the sentence, and you point out he could as well be the killer and now you're  alone with him.\\nThe Lawyer nods thoughtfully.  “My video is true,” he confesses ,” but it left out the part about how the man I'd set free had mafia connections who were threatening my family.  When he was released, he killed three people before being caught again.”  He sighs deeply before turning his back to you and going to the window.\\n\\n[[continue|70c]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "70c",
            "pid": 271
          }
        }
      ]
    },
    {
      "pid": 130,
      "name": "41a",
      "text": "“It's not true,” you tell the others, though most of them are paying you little attention.  Knowing their turn is next.  “They used the name William Wilson,” the Warden points out.  You're about to argue and then the next video comes on...\\n\\n[[continue|42]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "42",
            "pid": 230
          }
        }
      ]
    },
    {
      "pid": 131,
      "name": "39",
      "text": "Kanaks himself is the next movie, as it turns out.\\n“Brock Kanaks, professional bounty hunter” the voice continues, and you raise your eyebrows at his title.  “ You are found guilty of intentionally and unlawfully killing a suspect who was being uncooperative of arrest, and then using your police connections to cover up the crime.”\\nTo your surprise you see him nod slightly at his accusation.  That's not a good sign.\\n\\n[[continue|40]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "40",
            "pid": 232
          }
        }
      ]
    },
    {
      "pid": 132,
      "name": "38",
      "text": "Everyone turns to stare at the Psychologist, who's crossed his arms and is pouting in the shadows. “What?!  What are you all-” his eyes dart around the room, taking in the shocked and angry looks from the others.  “They're lies,  they're all damn LIES!”  He shouts and storms out of the room. \\n\\n The Policeman starts to go after him when:\\n“Officer Damator.”  the machine voice continues, an official looking ID image of the Policeman projected against the wall.  The man in question stops and pauses, looking nervously at his reflection.  “You are found guilty of the crime of beating your young wife Masha Damator to death in a drunken rage, then of and abandoning your only child into the welfare system.”\\n\\n\\nThe Policeman looks frantically at his partner who merely raises an eyebrow.  “The is all bullshit!” he declares, stomping away.  “Kanaks, keep them in here. I need to find that man before he leaves!”  And with that he disappears down the stairwell. \\n \\nThe Lawyer moves to turn off the projector, and the partner (Kanaks apparently is his name, you note, he'd never introduced himself) stops him.  “Let's just see what all this is about.”\\n\\n[[continue|39]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "39",
            "pid": 131
          }
        }
      ]
    },
    {
      "pid": 133,
      "name": "22",
      "text": "The door from the main room opens to a narrow, windowless hallway with two doors and a staircase going up between them.  The first door is marked “garage” in Russian, , the staircase goes spiraling up and you can't see what's at the top, but half way is a flat landing and a side door marked “storage”.  The door at the end of your hallway is slightly opened, and you see a short flight of stairs going down into the basement.\\n\\n[[continue|23]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "23",
            "pid": 24
          }
        }
      ]
    },
    {
      "pid": 134,
      "name": "76",
      "text": "You've gathered all the information that you can right now.  Where do you want to search next?\\n\\nCHOICE \\n\\n#1 [[Downstairs in the basement|76b]]\\n#2 [[In the garage|77]]",
      "links": [
        {
          "text": "Downstairs in the basement",
          "destination": {
            "name": "76b",
            "pid": 56
          }
        },
        {
          "text": "In the garage",
          "destination": {
            "name": "77",
            "pid": 247
          }
        }
      ]
    },
    {
      "pid": 135,
      "name": "33",
      "text": "The group gathers inside the room and looks to the Policeman for answers.  He seems as surprised as the rest of them.  Someone lost their life to bring you up here, but this room just looks like a regular planetarium in an abandoned observatory.\\n\\n[[continue|34]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "34",
            "pid": 142
          }
        }
      ]
    },
    {
      "pid": 136,
      "name": "32",
      "text": "The room is smaller than you'd expected, a dark and decaying half dome of white painted concrete.  There's a single large window to one side, a dust covered pile of bricks and other construction materials next to the door, and the only piece of furniture is a heavy wooden table with an old fashioned projector.  One of the black electrical lines runs from the ceiling down to it.\\n\\n[[continue|33]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "33",
            "pid": 135
          }
        }
      ]
    },
    {
      "pid": 137,
      "name": "31",
      "text": "At the top is another small landing and a large metal door with a placard of a telescope.  Draped around the handle of the door is a heavy metal chain and lock.  The Policeman takes the key from the Blonde, glances at his partner who's looming in the background, and opens the lock.\\n\\n-[[go inside the planetarium|32]]",
      "links": [
        {
          "text": "go inside the planetarium",
          "destination": {
            "name": "32",
            "pid": 136
          }
        }
      ]
    },
    {
      "pid": 138,
      "name": "30",
      "text": "Your little procession files into the hallway and you meet Dr. Hayes coming out of the storage room half way up the staircase.  “Where the hell have you been?!” the partner of the Policeman demands, and you see the cop's hand drift to clasp the gun at his hip holster.\\nThe good doctor seems rather out of it, and he stumbles slightly as he navigates the steps.  He says he went to the storage lockers to check on his belongings and make a phone call.  Then he heard all this shouting.   So someone was just murdered?  The question is so blasé he might as well have just asked if it was still snowing.  You see a small object in his hand.\\n\\nCHOICE\\n\\n[[#1 ask what he's holding|30a]]\\n\\n[[#2 stay quiet (cont.)|30b]]",
      "links": [
        {
          "text": "#1 ask what he's holding",
          "destination": {
            "name": "30a",
            "pid": 99
          }
        },
        {
          "text": "#2 stay quiet (cont.)",
          "destination": {
            "name": "30b",
            "pid": 100
          }
        }
      ]
    },
    {
      "pid": 139,
      "name": "37",
      "text": "You've missed the first part of what was being said, but the rest seems to be some sort of accusation:\\n“-guilty of the charge of having intentionally giving an excessive prescription to a patient known to be suicidal, with the intention of having him overdose.  There was a criminal investigation of which you were acquitted, despite the patient's life insurance policy recently being transferred to your benefit.”\\n\\n[[continue|38]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "38",
            "pid": 132
          }
        }
      ]
    },
    {
      "pid": 140,
      "name": "36",
      "text": "The image displayed is fuzzy at first, but the Policeman gives the device a shake and it slowly clears into a portrait of Dr. Hayes, the Psychologist.  You stare at the image for a moment, should something be happening?\\n“Is the sound on?” the Lawyer asks, coming up to join you and the Policeman next to the device.  You fiddle with a dial and a computerized sounding voice emanates from small speakers on the walls.  \\n\\n[[continue|37]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "37",
            "pid": 139
          }
        }
      ]
    },
    {
      "pid": 141,
      "name": "35",
      "text": "Growing impatient, you walk to the projector and try to figure out where the “on” button is.  The Policeman joins you and flips a switch on the side.  \\nNothing happens.\\n\\nCHOICE\\n\\n[[#1 check that its plugged in|35a]]\\n\\n[[#2 start hitting buttons|35b]]\\n\\n[[#3 give it a smack|35c]]\\n",
      "links": [
        {
          "text": "#1 check that its plugged in",
          "destination": {
            "name": "35a",
            "pid": 224
          }
        },
        {
          "text": "#2 start hitting buttons",
          "destination": {
            "name": "35b",
            "pid": 223
          }
        }
      ]
    },
    {
      "pid": 142,
      "name": "34",
      "text": "An awkward silence falls over the scene.  The Policeman glances at his partner who shrugs.  The Lawyer kicks at the floor again.  And the married couple hold hands while the Doctor stares absentmindedly out the window.\\n\\n-[[turn on the projector|35]]",
      "links": [
        {
          "text": "turn on the projector",
          "destination": {
            "name": "35",
            "pid": 141
          }
        }
      ]
    },
    {
      "pid": 143,
      "name": "83b",
      "text": "You ask them what do they think about the Doctor disappearing?  Do they believe that he just took off like that?\\n“Well,” the Lawyer begins, “the last time any of us saw him was...right after we got back from the Policeman's crash site.  He was talking to the Couple, it didn't look too friendly, then the lights went out, and he disappeared.”\\n“Something else we need to talk to the Wife about,” the Bounty Hunter says.\\nAnd then the lights go out again for the third time.\\n\\n[[continue|84]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "84",
            "pid": 104
          }
        }
      ]
    },
    {
      "pid": 144,
      "name": "83a",
      "text": "You ask the Bounty Hunter how could he not  notice the missing survival equipment when he went to get the flashlight during the first power outage?  When the Repairman was killed?\\nRather than answer your question, the Bounty Hunter gets angry. “Are you accusing me of something here or just talking out your ass?”\\n“He's got a point,” the Lawyer says, agreeing with you.  “The lights have been out twice, we've been walking in the woods, and you've never once pulled out the flashlight.  You never got it, did you?”\\n“Just what are you implying?”  the Bounty Hunter growls.  “Everyone here's been acting suspicious as hell, you two included.”  He gestures at the other three people in the room.  “That woman and the Warden are clearly lying to our faces, we haven't seen the Doctor in hours, and the Journalist disappears the second anyone's back is turned!”\\nAnd then the lights go out again for the third time.\\n\\n[[continue|84]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "84",
            "pid": 104
          }
        }
      ]
    },
    {
      "pid": 145,
      "name": "5acont",
      "text": "You introduce yourself as David White.  An American businessman.  From the Midwest, small town.  You're not in an interesting line of business, you've got a wife and kids back home, and you don't travel much so you're a little nervous at times.  You don't tell her all those lines just yet, but you have them ready in case someone asks.  For now David White is enough to dull her interest.  She shakes your hand and excuses herself back into her earlier conversation.\\n\\n[[continue|6]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "6",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 146,
      "name": "79b",
      "text": "These two sets of footprints are definitely more recent, but its hard to make out many more details.  They form a clear path, however, and the three of you follow it along a wide open field at the side of the observatory.\\nWhen you get out of possible earshot from the others, the Warden finally breaks the tense silence that had fallen over your group.  He insists on his innocence in anything that may have happened to the husband: “They attacked me in the garage!  I swear it!  They're a bunch of fucking con artists and maybe the killers for all I know.  I didn't do anything to them!”\\nYou have your doubts that he's telling the full truth, but the Bounty Hunter agrees that their whole “we're famous but you've never heard of us” alibi is incredibly thin.  You agree to talk to the Wife in private when you get back.\\nThe path you were following comes to an end at a small hill with a well.\\n\\n[[continue|80]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "80",
            "pid": 220
          }
        }
      ]
    },
    {
      "pid": 147,
      "name": "79a",
      "text": "These footprints are definitely older than the other two, they're hard to follow in many places as they wind their way down the steep mountain road.  After maybe half a mile they end in deep snow, where the avalanche you heard earlier must have fallen.  Whoever went this way either made it out and is having a cold night, or they're trapped under there.  There's nothing you can do for them now, not until you have more light.\\n\\n[[continue|79a1]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "79a1",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 148,
      "name": "72b1",
      "text": "You approach the Lawyer and ask him what happened.  You note he's one of the few people here without any visible cuts and bruises. He claims that when the lights went out he was upstairs.  He'd just seen a figure with a flashlight walking outside on the grounds and he was heading down to investigate and see if it was the Doctor when the lights went out.  Suddenly he heard someone rushing up the stairs so he hid under a table.  He couldn't see anything but heard footsteps walking by.  Then the person left and he waited a minute.  He heard the sounds of a fight and someone falling down the stairs, than a woman screaming and a lot of commotion.  He stayed upstairs, afraid to use his lighter in case the killer came back.  A few minutes later the lights came back.  When he came downstairs he found the Bounty Hunter at the bottom of the stairs, a nasty bump on his head.  He says you were found unconscious in the hallway, a broom handle on the ground near you that you must have tripped over in the dark.\\n\\n[[talk to the BOunty Hunter|72b2]]\\n",
      "links": [
        {
          "text": "talk to the BOunty Hunter",
          "destination": {
            "name": "72b2",
            "pid": 149
          }
        }
      ]
    },
    {
      "pid": 149,
      "name": "72b2",
      "text": "You approach the Bounty Hunter who claims that he was searching through the Doctor's locker when the lights went out.  He lit a match and went downstairs, but the match blew out when a door opened and there was a sudden breeze.  Then someone attacked him from behind, he didn't see who, and tried to suffocate him with a cloth soaked in chloroform.  The Bounty Hunter struggled with his attacker and ended up tumbling down the stairs and was knocked out.  Maybe the killer thought the fall had killed him?  When he woke up the lights were on and the Warden and the Celebrity Wife were having a screaming match in the main hall.  He and the Lawyer were trying to break it up, and then they heard shouting from downstairs.  It was the Journalist locked in the basement, and you were unconscious in the hallway.\\n\\n[[continue|73]]\\n",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "73",
            "pid": 251
          }
        }
      ]
    },
    {
      "pid": 150,
      "name": "28",
      "text": "The Policeman wants to take another look at the key found on the body.  Highly doubtful the man died holding this in his hand, why would he when he was in the basement fixing electrical?  So the killer put it in his hand and intended for it to be found, just like how the murder weapon was left deliberately on the scene.\\n\\n[[continue|29]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "29",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 151,
      "name": "107",
      "text": "You tell her about how you're going into the Planetarium and the Lawyer gave you the gun with two bullets but you think she still has the key.  She nods, she'd almost forgotten about that.  And no, she stops you before you ask, she wasn’t the one who locked the door.  She has no idea why anyone here would, unless they were trying to hide something.\\nShe gives you the Planetarium key and tells you to “save all the bullets.  If the killer's not in there, we're going to need all of them to get out of here alive.”\\n“What about you two?” you ask.\\n“I'm going to stay down here with Iva.  I'll lock the door from the inside and we'll be safe.”\\nYou nod and turn to leave, but she stops you with a hand on your shoulder. “ I'm trusting you to let us out, okay?” she pleads, her eyes big and soulful and you can't help but notice how she's trying to manipulate you into doing her dirty work.\\nYou close the door quietly behind you.  Let her think what she wants but you're not striking her off the list just yet.\\n\\n[[continue|108]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "108",
            "pid": 121
          }
        }
      ]
    },
    {
      "pid": 152,
      "name": "60",
      "text": "You blink at it a few times.  How did he- When he took the Policeman's wallet, of course.  Son of a bitch, you sure didn't see that one coming...\\nHe follows your gaze to the gun.  “Earlier,” he explains. “From when he left the building.  Gave it to me on his way out for crowd control” Now you two want to tell me what's going on?”  \\n\\n[[continue|61]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "61",
            "pid": 67
          }
        }
      ]
    },
    {
      "pid": 153,
      "name": "Start",
      "text": "WHO AMONG US\\n\\nA modern noire murder mystery set in Eastern Europe\\n\\n//By Tia Orisney//\\n\\n[[START|1]]\\n",
      "links": [
        {
          "text": "START",
          "destination": {
            "name": "1",
            "pid": 234
          }
        }
      ]
    },
    {
      "pid": 154,
      "name": "62",
      "text": "When you enter the main room, the Celebrity Couple and the Doctor are in the midst of their own heated conversation.  It hasn't quite come to blows like yours just did, but it's clear that your presence is  breaking up something about to happen.  “Little surprised he's not “checking on his luggage”, the Bounty Hunter mutters under his breath at you.\\nSpoke too soon, the Doctor immediately turns stomps away, not even bothering to hear the whole story from the Lawyer past “The Policeman's dead.”  \\nThe Couple exchange a meaningful look, and quietly ask what happened.  “It doesn't look like an accident. We think the brake lines were cut.”\\n“But... that snowmobile was our only way out of here!” the woman wails.  \\n “We can't even call a taxi, there's no goddamn cellphone coverage anywhere!” her husband joins in.\\nAnd another man just died, you think about pointing out.  But nobody seems to care much about that.\\n“So what are we going to do?  Spend the night here?!”\\n“That's the idea,” says the Bounty Hunter.  “I'm sure we've all slept in worse places.”  Meaningful glance over the couple.  “In the morning the storm'll have passed and if we can't get a signal, one of us walks out and gets help.”  The woman begins to whine at her husband to do something.  The Bounty Hunter starts to walk away when the Lawyer stops him.\\n“There's something we're forgetting about here,” he begins.  \\nThe two dead bodies and the accusatory video?  Nope, haven't forgotten about those.\\n“I'm referring to how the local police might react to this scene.  In a small Russian village like this, they may not take too kindly to a dead local worker and a policeman, both murdered, and surrounded only by foreigners who shouldn't have been up here to begin with.”\\nWell it sounds really bad when it's laid out straight like that.\\n\\nCHOICE x1\\n\\n#1 [[So you think the local police will blame us for their deaths?|62a]]\\n#2 [[Are you afraid of the police?|62b]]",
      "links": [
        {
          "text": "So you think the local police will blame us for their deaths?",
          "destination": {
            "name": "62a",
            "pid": 178
          }
        },
        {
          "text": "Are you afraid of the police?",
          "destination": {
            "name": "62b",
            "pid": 177
          }
        }
      ]
    },
    {
      "pid": 155,
      "name": "63",
      "text": "\"So what are you suggesting we do next,\" you ask the Lawyer.\\n“I'm suggesting we say nothing,” he says.  “We wait until morning, and walk out.  We get on a train, bus, whatever, and go our separate ways.  We try to get out of the country, and we never speak of this again.”\\n\\nCHOICE\\n[[1- Sounds like a plan.|63a]]\\n[[2- Why are you so eager to leave?|63b]]",
      "links": [
        {
          "text": "1- Sounds like a plan.",
          "destination": {
            "name": "63a",
            "pid": 180
          }
        },
        {
          "text": "2- Why are you so eager to leave?",
          "destination": {
            "name": "63b",
            "pid": 211
          }
        }
      ]
    },
    {
      "pid": 156,
      "name": "64",
      "text": "He paces the floor, hand on his chin, thinking over all the possibilities.  You're waiting to test his response.  If he's against the plan, maybe he actually did have some connections with the Policeman and wants to see justice be brought.  If he goes for it, than probably his criminal accusation was true.  He's a very bad man and if he finds out who you are, you're in a lot of trouble.\\nYou glance at the Warden who's been here the whole time but hasn't said a word.  He's holding a snowball against his blackening eye and the last of the wine's in a glass in his hand.  Whatever's on his mind he's not about to let you know.\\nThe Bounty Hunter stops his pacing and turns to look at you,“Where's the blonde girl?  The Journalist?  She's not here.”\\n\\n[[continue|65]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "65",
            "pid": 157
          }
        }
      ]
    },
    {
      "pid": 157,
      "name": "65",
      "text": "You blink twice.  You'd forgotten completely about her.  When was the last time you saw her?\\n“The Doctor's gone too,” the Warden finally speaks up.  “But he was here just a minute ago.”\\n“I think its about time we look at that luggage of his,” the Bounty Hunter scowls, and you couldn't agree more.  He asks the Couple when was the last time they saw her.\\n“Um, just after you four left to the crash site,” the man begins ,”she was with us for a few minutes and then we turned around and she was gone.  We thought she'd left to freshen up, but she never came back.”\\nThe last time you'd seen her she was in the basement, acting strange.  You didn't think much of it at the time, but the money's down there and...\\n\\n-[[offer to go search for her.  You'll take the basement, someone takes the upstairs, someone the gara-|66]]",
      "links": [
        {
          "text": "offer to go search for her.  You'll take the basement, someone takes the upstairs, someone the gara-",
          "destination": {
            "name": "66",
            "pid": 158
          }
        }
      ]
    },
    {
      "pid": 158,
      "name": "66",
      "text": "“No, we're not going to be splitting up.  Out of the question.”  the Bounty Hunter stops you mid sentence.  “Not when two people have just been killed.”\\n“Agreed,” the Lawyer adds ,”for all we know she may be the third victim.”\\n“Or the killer,” suggests the Warden, drawing looks from the others.  You doubt his idea, she doesn't seem the type.  Or maybe you're just being fooled by her pretty face? It's been known to happen before, and there's definitely something odd about her.\\n\\n[[continue|67]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "67",
            "pid": 159
          }
        }
      ]
    },
    {
      "pid": 159,
      "name": "67",
      "text": "And so it's decided: the Bounty Hunter (acting as the new self appointed leader) divides the people into  two groups of three.  It's going to be you, the Lawyer, and himself searching the Planetarium first for bodies and clues, then the outside grounds. The Couple and the Warden are taking the garage first, then the basement.  If you spoke up now for basement duty it might seem suspicious, so you're just going to have to get down there later.  Unless they know exactly where to look, there's no way they could find the money under the floor.\\n\\n[[continue|68]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "68",
            "pid": 160
          }
        }
      ]
    },
    {
      "pid": 160,
      "name": "68",
      "text": "On the way up to the Planetarium, the Bounty Hunter stops at the storage room and tries the door.  “It's locked.”  You tell him it was locked earlier also, before you left to the crash site.  This is where the Doctor kept going throughout the evening.  \\n“If anyone's in there, open up!” the Lawyer bangs on it with his fist.\\nNo answer.\\n“Fuck this,” the Bounty Hunter mutters, pulling out a screwdriver from his pocket that you didn't know he had.  He starts working on the lock with it and tells you and the Lawyer to ,”go on up, I'll be with you in a minute.  I need to see what's been going on it here.”  \\nYou glance at the Lawyer who shrugs, than continues on up the stairs without you.\\n\\nCHOICE x1\\n\\n[[#1 stay with the Bounty Hunter|69]]\\n[[#2 go with the Lawyer|70]]\\n[[#3 give them both the slip and go to the basement|71]]",
      "links": [
        {
          "text": "#1 stay with the Bounty Hunter",
          "destination": {
            "name": "69",
            "pid": 59
          }
        },
        {
          "text": "#2 go with the Lawyer",
          "destination": {
            "name": "70",
            "pid": 254
          }
        },
        {
          "text": "#3 give them both the slip and go to the basement",
          "destination": {
            "name": "71",
            "pid": 253
          }
        }
      ]
    },
    {
      "pid": 161,
      "name": "56a",
      "text": "“It's too bad no one thought to bring a flashlight,” you comment, staring at the dark sky.  “Did you say you were going out to get one from here earlier?”  The Bounty Hunter's face is unreadable, but he pretends to check the pockets of his coat.  “Guess it must've fallen out in the snow on the walk here.”\\n\\n[[continue|57]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "57",
            "pid": 70
          }
        }
      ]
    },
    {
      "pid": 162,
      "name": "56b",
      "text": "“Are you sure spending the night there is a good idea?  Two people just died.  Everyone's going to be on edge.”  \\nThe Bounty Hunter shrugs again.  “Don't have much choice.  We can't have some sort of nighttime exodus down a mountain in the middle of a blizzard.”\\n\\n[[continue|57]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "57",
            "pid": 70
          }
        }
      ]
    },
    {
      "pid": 163,
      "name": "46a",
      "text": "“Go fuck yourself,” you spit at him.  The Warden glares and steps forward, but the Lawyer steps between you two before it can come to blows.  “Let's just all go downstairs and get out of here, okay?  I've had enough of whoevers' sick joke this is.”  \\n“No shit,” the Bounty Hunter agrees ,”I've heard more than enough.” He shoulders past you out the door.\\n\\n[[continue|47]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "47",
            "pid": 265
          }
        }
      ]
    },
    {
      "pid": 164,
      "name": "72b",
      "text": "The Journalist claims that she was downstairs in the basement looking for clues when the lights went out and someone attacked her.  She was able to get away at first, but they locked her in the basement with the body.  She spent several minutes screaming for help before the lights came back on.  The Bounty Hunter confirms that when they found her she was banging at the door and shouting.  \\n\\n[[72b1]]\\n\\n",
      "links": [
        {
          "text": "72b1",
          "destination": {
            "name": "72b1",
            "pid": 148
          }
        }
      ]
    },
    {
      "pid": 165,
      "name": "72c",
      "text": "You approach the Bounty Hunter who claims that he was searching through the Doctor's locker when the lights went out.  He lit a match and went downstairs, but the match blew out when a door opened and there was a sudden breeze.  Then someone attacked him from behind, he didn't see who, and tried to suffocate him with a cloth soaked in chloroform.  The Bounty Hunter struggled with his attacker and ended up tumbling down the stairs and was knocked out.  Maybe the killer thought the fall had killed him?  When he woke up the lights were on and the Warden and the Celebrity Wife were having a screaming match in the main hall.  He and the Lawyer were trying to break it up, and then they heard shouting from downstairs.  It was the Journalist locked in the basement, and you were unconscious in the hallway.\\n\\n[[talk to the Journalist|72c1]]\\n",
      "links": [
        {
          "text": "talk to the Journalist",
          "destination": {
            "name": "72c1",
            "pid": 118
          }
        }
      ]
    },
    {
      "pid": 166,
      "name": "72a",
      "text": "You approach the Lawyer and ask him what happened.  You note he's one of the few people here without any visible cuts and bruises. He claims that when the lights went out he was upstairs.  He'd just seen a figure with a flashlight walking outside on the grounds and he was heading down to investigate and see if it was the Doctor when the lights went out.  Suddenly he heard someone rushing up the stairs so he hid under a table.  He couldn't see anything but heard footsteps walking by.  Then the person left and he waited a minute.  He heard the sounds of a fight and someone falling down the stairs, than a woman screaming and a lot of commotion.  He stayed upstairs, afraid to use his lighter in case the killer came back.  A few minutes later the lights came back.  When he came downstairs he found the Bounty Hunter at the bottom of the stairs, a nasty bump on his head.  He says you were found unconscious in the hallway, a broom handle on the ground near you that you must have tripped over in the dark.\\n\\n[[talk to the journalist|72a1]]\\n",
      "links": [
        {
          "text": "talk to the journalist",
          "destination": {
            "name": "72a1",
            "pid": 57
          }
        }
      ]
    },
    {
      "pid": 167,
      "name": "106",
      "text": "Cont.\\nYou tell her what the Lawyer said, about how he still suspects it's the Doctor.  She shakes her head but keeps listening.  Then you tell her about what the Bounty Hunter said as he was leaving, about how he's waiting for the rest of us to get killed and then will pick off whoever is left because they must be the murderer.\\nHer eyes widen,”So he just left us like this?  He's waiting outside?!”\\nYou tell her that's what he said, but there's always the chance he's really the killer and is still in the building.\\n“And what do you think?” she asks you. “Do you think the Doctor could be behind all this?”\\n\\nCHOICE x1\\n\\n#1 [[Tell her he could be.|106a]]\\n\\n#2 [[Tell her you suspect the Bounty Hunter.|106b]]\\n\\n#3 [[Tell her you suspect the Lawyer|106c]]\\n\\n#4 [[Tell her you suspect she's the killer|106d]]\\n",
      "links": [
        {
          "text": "Tell her he could be.",
          "destination": {
            "name": "106a",
            "pid": 33
          }
        },
        {
          "text": "Tell her you suspect the Bounty Hunter.",
          "destination": {
            "name": "106b",
            "pid": 36
          }
        },
        {
          "text": "Tell her you suspect the Lawyer",
          "destination": {
            "name": "106c",
            "pid": 35
          }
        },
        {
          "text": "Tell her you suspect she's the killer",
          "destination": {
            "name": "106d",
            "pid": 38
          }
        }
      ]
    },
    {
      "pid": 168,
      "name": "96a1",
      "text": "“Maybe when the lights went out the second time she took it off the Bounty Hunter when he was out. She said she'd tripped over him in the dark.  Or maybe the Warden stole it during your fight with him outside, and they took it off him when the jumped him in the garage.”\\n“Is that what you think happened back there?” you ask.\\nHe shakes his head,” I don't know.  I really don't.”\\n\\n[[-Ask him why you have to be the one to go upstairs|97]]",
      "links": [
        {
          "text": "-Ask him why you have to be the one to go upstairs",
          "destination": {
            "name": "97",
            "pid": 186
          }
        }
      ]
    },
    {
      "pid": 169,
      "name": "2",
      "text": "Nevermind that now, you tell yourself.  It has taken you over half a year to make it this far,  you're not going to let some tourists get in the way.  You walk inside and put your hat and coat along with the others hanging in the entrance way.  With whatever's going on, you want to blend in.\\n\\n[[continue|3]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "3",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 170,
      "name": "96a",
      "text": "“I still think it may be the Doctor.  Maybe he's gone crazy or took too many drugs and just lost it.  We haven't seen him in several hours, but it just doesn't make sense that he'd take off alone into the night.\\n\\nCHOICE\\n\\n#1 [[How do you think the Wife got the gun?|96a1]]\\n#2 [[What about the Bounty Hunter?|96a2]]\\n\\n",
      "links": [
        {
          "text": "How do you think the Wife got the gun?",
          "destination": {
            "name": "96a1",
            "pid": 168
          }
        },
        {
          "text": "What about the Bounty Hunter?",
          "destination": {
            "name": "96a2",
            "pid": 80
          }
        }
      ]
    },
    {
      "pid": 171,
      "name": "96b",
      "text": "“Maybe when the lights went out the second time she took it off the Bounty Hunter when he was out. She said she'd tripped over him in the dark.  Or maybe the Warden stole it during your fight with him outside, and they took it off him when the jumped him in the garage.”\\n“Is that what you think happened back there?” you ask.\\nHe shakes his head,” I don't know.  I really don't.”\\n\\nCHOICE\\n\\n#1 [[hat do you think is going on?|96b1]]\\n#2 [[What about the Bounty Hunter?|96b2]]\\n\\n",
      "links": [
        {
          "text": "hat do you think is going on?",
          "destination": {
            "name": "96b1",
            "pid": 206
          }
        },
        {
          "text": "What about the Bounty Hunter?",
          "destination": {
            "name": "96b2",
            "pid": 204
          }
        }
      ]
    },
    {
      "pid": 172,
      "name": "6",
      "text": "You look around, evaluating both the people gathered here and the room itself.  Clearly this building has been abandoned for a while, heavy layers of dust coat the minimal furniture and the paint on the walls is crumbling into piles on the ground.  The odd thing is the heavy black electrical lines running along the roof to the light fixtures.  Obviously they're a much more recent addition, but why would anyone bother to fix up a condemned building?  \\n\\n[[continue|7]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "7",
            "pid": 115
          }
        }
      ]
    },
    {
      "pid": 173,
      "name": "19b",
      "text": "You casually approach the woman and ask her wouldn't she be more comfortable outside?  “Why, am I in danger around you?” she answers flirting and you wish you could see her eyes in the dark room to gauge her real opinion.  No, no, of course not, you're just looking out for her.  You can feel the Warden hovering nearby, but you try to keep your voice casual.  She says she's staying in here, doesn't want to have to deal with the famous couple.  “Have you heard of them?” she asks.  No, I'm an American, here on business.  I don't watch much local TV.  “Me neither,” she says,”this is my first time to Russia, too.  I'm here looking for someone, actually-”\\n“Is this a private chat, or can I dive in?” the Warden interrupts, “you said you're an American, is that right?”  The question's directed at you.\\n\\n-[[give him your cover story|19b1]]",
      "links": [
        {
          "text": "give him your cover story",
          "destination": {
            "name": "19b1",
            "pid": 221
          }
        }
      ]
    },
    {
      "pid": 174,
      "name": "69b",
      "text": "Most of the lockers are empty or have uninteresting items in them like an old flannel shirt, old notebook with various astronomical observations, and another flashlight which doesn't work.  The door of the last locker's slightly open and inside is the Doctor's suitcase.\\n\\nYou pull it out and set it on the table, studying it while the Bounty Hunter works at the locks on it.  The suitcase is a very old fashioned style, expensive leather, and looks barely used.  The Doctor had said it was heavy, but when you lifted it it could barely have weighted more than a pound or two.\\nWhen it's opened, inside you find a small amount of personal effects (comb, read glasses, pens), an alarming number of unmarked bottles and needles, and an empty glass bottle.  You pick it up and the label reads “Chloroform”. \\n \\n“Well, that's an interesting find, isn't it?” the Bounty Hunter comments before checking the suitcase of hidden panels.\\n“No identification, no passport,” he says, “I'm guessing he got drugged out of his mind, got spooked with the killings, and took off on his own.”\\n“Damned stupid thing to do in this weather,” you say.\\nThe Bounty Hunter nods ,” We're probably better off witho-”\\n\\nAnd then the lights go out again.\\n\\n[[continue|69b1]]\\n\\n",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "69b1",
            "pid": 82
          }
        }
      ]
    },
    {
      "pid": 175,
      "name": "96c",
      "text": "You ask him if he thinks the Bounty Hunter could be the killer.\\n“Maybe...” he answers carefully.  He's acting a little strange, but maybe he's just scared and you're reading into things too much? “Maybe he is.  The Policeman's break lines were cut; he's been up in everyone’s business; he'd be in a position to know these details of peoples personal lives.”  \\n“A lot of people here might have had access to private records,” you point out. “The Warden and Policeman easily, maybe the Doctor.  Maybe the Journalist, too.  She could have found out who all of us are and is still going for that breakthrough story.”\\n“You left me off the list,” he points out.  “As a lawyer, I could've heard things too.”\\n“You're absolutely right”\\n\\n#1 [[What do you think is going on?|96c1]]\\n#2 [[How do you think the Wife got the gun?|96c2]]\\n\\n",
      "links": [
        {
          "text": "What do you think is going on?",
          "destination": {
            "name": "96c1",
            "pid": 110
          }
        },
        {
          "text": "How do you think the Wife got the gun?",
          "destination": {
            "name": "96c2",
            "pid": 111
          }
        }
      ]
    },
    {
      "pid": 176,
      "name": "99",
      "text": "The Journalist is talking to the other woman who's calmed down by now enough to talk.  She looks up at you with real fear in her eyes, but the Journalist holds her hand.  “It's okay, Iva,” she reassures her. “he's not going to hurt us.”  And she knows that for sure, does she?\\nSteeling her resolve, Iva ,the Wife, looks up at you, and starts to tell you their real story...\\n\\n[[continue|100]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "100",
            "pid": 125
          }
        }
      ]
    },
    {
      "pid": 177,
      "name": "62b",
      "text": "“Yeah, I am, I'll admit it.  And you should be too if you knew anything about what they're like out here.\\nThe Bounty Hunter agrees.  They look after their own out here.  If they're angry enough they might not even take us into the station, if you know what I'm saying.  The couple gasp, horror written across their faces.  It seems everyone here has a reason to be afraid.\\n\\n[[continue|63]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "63",
            "pid": 155
          }
        }
      ]
    },
    {
      "pid": 178,
      "name": "62a",
      "text": "The Lawyer says he thinks the local police will take one look at the dead officer with the cut brake lines and they're not even going to ask questions.  We'll all be arrested and when they find that video up there?  It's going to get very bad for us.\\nThe Bounty Hunter agrees.  They look after their own out here.  If they're angry enough they might not even take us into the station, if you know what I'm saying.  The couple gasp, horror written across their faces.  It seems everyone here has a reason to be afraid.\\n\\n[[continue|63]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "63",
            "pid": 155
          }
        }
      ]
    },
    {
      "pid": 179,
      "name": "8",
      "text": "Having met everyone, you take the chance to try and slip out the door at the back and find the basement.\\n\\n[[continue|9]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "9",
            "pid": 239
          }
        }
      ]
    },
    {
      "pid": 180,
      "name": "63a",
      "text": "You agree: we all go our own ways in the morning.  Someone will find the bodies soon enough, but it might be long enough for us to get a head start.  The Couple hesitates, than nods in agreement.  Nobody has to mention the video, guess we've all got skeletons in our past to hide.  \\nAnd that just leaves the Bounty Hunter...\\n\\n[[continue|64]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "64",
            "pid": 156
          }
        }
      ]
    },
    {
      "pid": 181,
      "name": "90",
      "text": "The Journalist says she'll go in and talk to her, see if she can get any information out of her.  If she says anything at all, she'll let you all know.\\nYou don't like the idea, but you agree that her talking to the Wife alone is your best chance at getting answers.  \\nThe Lawyer unties the door and lets her in.\\n\\n[[continue|91]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "91",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 182,
      "name": "93",
      "text": "“If the Doctor's here, we need to find out,” the Lawyer insists.  “There's only one door into that storage room, it's the safest place for them to stay while we search the building.”\\n“Except there's no we in this,” the Bounty Hunter says, backing away from you two.  “I'm not going anywhere with either of you, just waiting for the lights to go off and I find out I'm wrong about the Blonde.”\\n\\n[[-so what are you saying?|94]]",
      "links": [
        {
          "text": "-so what are you saying?",
          "destination": {
            "name": "94",
            "pid": 185
          }
        }
      ]
    },
    {
      "pid": 183,
      "name": "92",
      "text": "The Lawyer seems more skeptical about this theory than the Bounty Hunter.  He argues that it might well be the Doctor who's never been accounted for. Men in his line of work have a history of going crazy themselves.  Maybe he's been hiding out here all the time? We need to search the place for him. \\n\\n[[-and leave the Wife alone with a woman we suspect is a serial killer?|93]]\\n\\n",
      "links": [
        {
          "text": "-and leave the Wife alone with a woman we suspect is a serial killer?",
          "destination": {
            "name": "93",
            "pid": 182
          }
        }
      ]
    },
    {
      "pid": 184,
      "name": "95",
      "text": "Now it's just you and the Lawyer. He eyes you carefully, clearly sizing you up as he backs a little away from you.\\n“Did you lock the door to the Planetarium?” he asks, and you look up to the top of the staircase. The heavy lock and chain's been put back on.\\n“No, that's new...” you mutter.  Why would anyone...\\n“So what happens now?” he asks you.\\n\\nCHOICE\\n\\n[[#1 search the building alone|95a]]\\n[[#2 search the building together|95b]]",
      "links": [
        {
          "text": "#1 search the building alone",
          "destination": {
            "name": "95a",
            "pid": 266
          }
        },
        {
          "text": "#2 search the building together",
          "destination": {
            "name": "95b",
            "pid": 269
          }
        }
      ]
    },
    {
      "pid": 185,
      "name": "94",
      "text": "“I'm saying I'm OUT.  I'm leaving.  Alone.”  The Bounty Hunter starts backing down the stairs, watching you both intently.  \\n“So what?  You're just going to try your luck not freezing to death in the snow?” the Lawyer asks, sounding irritated and worried at the same time.\\n“Not exactly.  I'm going to wait outside, let the real killer pick the rest of you off and reveal himself. And for that, I know I'm better off alone.”\\n“So you think it's one of us then?” the Lawyer asks, gesturing between you and him.\\n“Well, I know its not me, I prefer my odds by myself.”  \\nAnd with that he turns and walks down the stairs.\\n\\n[[continue|95]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "95",
            "pid": 184
          }
        }
      ]
    },
    {
      "pid": 186,
      "name": "97",
      "text": "“So you just expect me go into a suspected killers hideout unarmed?” you ask, making your voice angrier than you really are to try and scare something out of him.  “You're trying to get me killed, aren't you?!”\\nThe Lawyer raises his hands in a conciliatory gesture.  “Listen, I just want to live through the night, okay? I  know I'm not the killer.  And we both know its not one of the women. It's got to be either the Bounty Hunter or the Doctor.”\\nYou cross your arms, unconvinced.\\n“Okay, okay,” he says quickly ,”if you still don't believe me, here, take this:”  He reaches into his coat and hands you the gun, holding it to you by the barrel.  Where the hell did he get that from?\\n“When the Bounty Hunter was tying up that woman, he'd kicked it away on the floor” he explains, “and when no one was looking I picked it up. It only has 2 bullets left, use one to shoot the lock to the Planetarium.  If the killer's in there, use it to threaten him and then lock him in the room.”\\n\\n[[continue|98]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "98",
            "pid": 261
          }
        }
      ]
    },
    {
      "pid": 187,
      "name": "96",
      "text": "The Lawyer turns to go down, but you stop him.  There's a few questions you need to ask him first.\\n\\nCHOICE x2\\n\\n[[#1 What do you think is going on?|96a]]\\n[[#2 How do you think the Wife got the gun?|96b]]\\n[[#3 What about the Bounty Hunter?|96c]]\\n",
      "links": [
        {
          "text": "#1 What do you think is going on?",
          "destination": {
            "name": "96a",
            "pid": 170
          }
        },
        {
          "text": "#2 How do you think the Wife got the gun?",
          "destination": {
            "name": "96b",
            "pid": 171
          }
        },
        {
          "text": "#3 What about the Bounty Hunter?",
          "destination": {
            "name": "96c",
            "pid": 175
          }
        }
      ]
    },
    {
      "pid": 188,
      "name": "11",
      "text": "Not fast enough though.  The sound of an engine pulling up stirs the apathetic group into attention. It sounds different from a normal vehicle engine.  A small jeep, maybe?  You hear the sound of a metal door being opened by the side of the building and the vehicle pulling into the adjoining garage.\\n“Oh, I hope it's not another paparazzi!  I was so hoping for a nice quiet evening!”  That would be Petra making a scene, of course.  “Don't worry”, her husband grandly reassures her ,”we'll just give them our autographs and send them on their way.”\\n\\nYikes.  You and the Mechanic in overalls exchange a head shake at the duo.  \\n\\n[[continue|12]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "12",
            "pid": 191
          }
        }
      ]
    },
    {
      "pid": 189,
      "name": "10",
      "text": "The blonde (Nicola, you remind yourself) steps up and introduces herself to them, just as she did to you.  The new woman laughs and kisses her on both cheeks.  The blonde seems caught off guard but quickly regains her composure.  “And you must be Mr. Jameson then?” she addresses the man.  The couple both laugh as if on que.  “Of course you all must know my husband, Josef Resnik, yes?  He's been on all  the popular shows!” \\n\\n“So, you're not-” the blonde starts to speak, but is interrupted by a flutter of the other woman’s hand.  “Well, I'm Petra.  Petra Resnik, and don't be telling anyone but I've just been scheduled onto next seasons Celebrity Watch!”  She makes a finger to the lips gesture.\\n\\nCHOICE\\n1) [[introduce yourself|10a]]\\n2) [[keep watching|10b]]",
      "links": [
        {
          "text": "introduce yourself",
          "destination": {
            "name": "10a",
            "pid": 88
          }
        },
        {
          "text": "keep watching",
          "destination": {
            "name": "10b",
            "pid": 86
          }
        }
      ]
    },
    {
      "pid": 190,
      "name": "13",
      "text": "“Well?”  the tall man demands, “and just what are you all doing in here?”  You've been asking yourself the same question, actually.  You wait for the perky blonde to ask which one's the host, but it's the  Warden who beats her to the greetings.  “We were all invited here to meet a Mr. Jameson,” he starts ,”and you are?”.  The question was polite enough but it draws an angry glare from the policeman.  “I'm Officer Damator,” local name and accent ,”my associate and I have come up here to see what you are all doing in a condemned building.” \\nThe first man hasn't said a word.\\n\\n[[continue|14]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "14",
            "pid": 193
          }
        }
      ]
    },
    {
      "pid": 191,
      "name": "12",
      "text": "Two men walk through the door at the back, surprising you slightly.  There must be an entrance to the garage that way. The first man is about your height and build, though it's hard to tell under his heavy coat.  He walks part way into the room and surveys the surprised looks on the guests faces.  The second man comes in moments behind him.  Tall and muscled and wearing a policeman's uniform.  You instinctively back away a few steps, only to realize the first man was watching your reaction.  Damnit.\\n\\n[[continue|13]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "13",
            "pid": 190
          }
        }
      ]
    },
    {
      "pid": 192,
      "name": "15",
      "text": "It's pitch black inside this windowless concrete structure.  Amidst the agitated grumbles you hear the wife of the couple theatrically wail “oh dear oh dear”.  The repairman turns on a small flashlight he'd had on his belt and the Lawyer opens the front door to let a little bit of light in.  \\n\\nSomeone clicks at the light switch a few times.  “No, nothing,” it's the Doctor, Dr. Tesler, voice.  The Mechanic suggests maybe they blew a fuse, it's such an old building after all.  You don't mention how the wiring was clearly new.  You can feel the Wardens eyes in the back of your head, like he's expecting you to run at any second.  Which was an idea that had crossed your mind.\\n\\n[[continue|16]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "16",
            "pid": 195
          }
        }
      ]
    },
    {
      "pid": 193,
      "name": "14",
      "text": "“Well, my wife and I were invited here to a party,” the man of the celebrity couple joins in.  “Though I have to say this isn't quite what we were expecting.”  “Yes, we rather thought there'd be a different sort of person here,” the wife smiles sweetly at the Psychologist she was talking to, who looks mildly offended. The cop gives them the look you give something unpleasant on the bottom of your shoe.\\n\\nCHOICE \\n#1 [[Wait and watch what happens|14a]]\\n\\n#2 [[Try to slip away|14b]]",
      "links": [
        {
          "text": "Wait and watch what happens",
          "destination": {
            "name": "14a",
            "pid": 217
          }
        },
        {
          "text": "Try to slip away",
          "destination": {
            "name": "14b",
            "pid": 216
          }
        }
      ]
    },
    {
      "pid": 194,
      "name": "17",
      "text": "The associate tells everyone to remain calm, the lights will be back on shortly.  He's going to go out an get their emergency flashlight from their snowmobile.  Ah, a snowmobile, that explains the odd sounding motor you'd heard.\\n\\n[[continue|18]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "18",
            "pid": 197
          }
        }
      ]
    },
    {
      "pid": 195,
      "name": "16",
      "text": "The Policeman sighs and says something to the repairman in Russian.  You can pick up enough words to figure out they're going to look for a fusebox.  He whispers some instructions to his associate as he leaves with the repairman through the back door.  \\nGuess you're going to have to wait to find that basement...\\n\\n[[continue|17]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "17",
            "pid": 194
          }
        }
      ]
    },
    {
      "pid": 196,
      "name": "19",
      "text": "With both exits blocked by people, you're stuck in this room until the lights come back on.  The Warden is hovering behind you, waiting for you to make a move, and the blonde is looking out the door at the storm.  It's odd that she hasn't gone outside to wait and instead is staying in a dark room with two strange men...\\n\\nCHOICE\\n#1 [[Talk to the Warden, get it over with|19a]]\\n\\n#2 [[Talk to the Blonde|19b]]\\n",
      "links": [
        {
          "text": "Talk to the Warden, get it over with",
          "destination": {
            "name": "19a",
            "pid": 127
          }
        },
        {
          "text": "Talk to the Blonde",
          "destination": {
            "name": "19b",
            "pid": 173
          }
        }
      ]
    },
    {
      "pid": 197,
      "name": "18",
      "text": "As soon as his rather imposing presence leaves, the others stir into action.  The Lawyer says he's going to try to find cellphone reception somewhere.  The “celebrity” couple, Resniks was their last name, go outside for a smoke.  The Doctor mutters something about wanting to make sure no one was in his luggage.  He shakily walks back into the pitch black hallway.  If you didn't know any better, you'd swear he's been shooting up.  \\n\\n[[continue|19]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "19",
            "pid": 196
          }
        }
      ]
    },
    {
      "pid": 198,
      "name": "50b",
      "text": " You tell her everything on the video was a lie.  They even called you by the wrong name.  This is just a bad joke from someone with too much time on their hands. She looks away from you and nods.  “Yeah, mine was a lie too.”\\nJust then, before you can respond, the Bounty Hunter upstairs throws open the door.  “There you two are.  Didn't you hear me call for you?!”  You shake your head “no” and the Journalist asks what's going on.\\n“Officer Damator's snowmobile just crashed into the side of the mountain, that's what's going on!” he shouts ,”hurry up, we're mounting a rescue party!” He grabs you by the arm and starts hauling you up to the main room.\\n\\n\\nCHOICE\\n\\n#1 [[tell him you don't want to go|51a]]\\n\\n#2 [[offer to help in any way you can|51b]]",
      "links": [
        {
          "text": "tell him you don't want to go",
          "destination": {
            "name": "51a",
            "pid": 109
          }
        },
        {
          "text": "offer to help in any way you can",
          "destination": {
            "name": "51b",
            "pid": 112
          }
        }
      ]
    },
    {
      "pid": 199,
      "name": "117",
      "text": "“Before I kill you,” he continues, “just tell me one thing: why did you do it?”  He loosens his grip on you slightly to let you breathe, but keeps the knife where it is.  \\nYou realize then that the Bounty Hunter must think you're the killer and you've just finished the job with the remaining people and are trying to leave.\\nYou tell him the truth: that someone locked you in the Planetarium and you had to break the window to get out.  \\nThe Bounty Hunter pauses and you wait, wondering if this is the end or if you have a chance of fighting him off...\\n“You know what?” he says ,”I actually believe you.  The killer's got to be a really smart guy to be able to pull off all this.  Getting locked up in your own hidey hole by one of these other fools?  Too sloppy and stupid, doesn't match the MO.”\\nHe quickly frisks you but struggles with holding you down and keeping the knife on you so that he misses the gun somehow.  Luckily, when you were climbing down from the roof, you were afraid of dropping it so you'd shoved it down your pants.  Guess he wasn't too eager to check //there...//\\n\\n[[continue|118]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "118",
            "pid": 61
          }
        }
      ]
    },
    {
      "pid": 200,
      "name": "50a",
      "text": "You tell her that everything that the video said was true, but it wasn't the whole story.  There was more to it than they said.  She looks away from you and nods.  “Yeah, mine was too.”\\nJust then, before you can respond, the Bounty Hunter upstairs throws open the door.  “There you two are.  Didn't you hear me call for you?!”  You shake your head “no” and the Journalist asks what's going on.\\n“Officer Damator's snowmobile just crashed into the side of the mountain, that's what's going on!” he shouts ,”hurry up, we're mounting a rescue party!” He grabs you by the arm and starts hauling you up to the main room.\\n\\nCHOICE\\n\\n#1 [[tell him you don't want to go|51a]]\\n\\n#2 [[offer to help in any way you can|51b]]",
      "links": [
        {
          "text": "tell him you don't want to go",
          "destination": {
            "name": "51a",
            "pid": 109
          }
        },
        {
          "text": "offer to help in any way you can",
          "destination": {
            "name": "51b",
            "pid": 112
          }
        }
      ]
    },
    {
      "pid": 201,
      "name": "116",
      "text": "When you reach the ladder you breathe a sigh of relief.  Almost down now.  The ice-cold metal is painful and sticks to your hands as you carefully climb down. \\nThen, just as you reach the bottom wrung, someone grabs you from behind and pulls you down!  You struggle and lash out, then freeze up when you feel the cold steel of a knife pressed on your throat.\\n“That sure was fast, I'm impressed...”  It's the Bounty Hunter.  Of course he must have heard the window smash and was waiting for you here.\\n\\n[[continue|117]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "117",
            "pid": 199
          }
        }
      ]
    },
    {
      "pid": 202,
      "name": "85a",
      "text": "You crouch lower and shift to the side as the footsteps run by you.  In the last moment you stick your leg out and trip them.  They fall to the ground and you grab them by the ankle.  It's the Journalist.  She starts screaming, kicking, and clawing at you.\\nThen the lights come back on.\\n\\n[[continue|86]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "86",
            "pid": 102
          }
        }
      ]
    },
    {
      "pid": 203,
      "name": "85b",
      "text": "You wait until the footsteps have almost ran by you and then you lunge out at them, dragging them to the ground.  It's the Journalist.  She starts screaming, kicking, and clawing at you.\\nThen the lights come back on.\\n\\n[[continue|86]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "86",
            "pid": 102
          }
        }
      ]
    },
    {
      "pid": 204,
      "name": "96b2",
      "text": "You ask him if he thinks the Bounty Hunter could be the killer.\\n“Maybe...” he answers carefully.  He's acting a little strange, but maybe he's just scared and you're reading into things too much? “Maybe he is.  The Policeman's break lines were cut; he's been up in everyone’s business; he'd be in a position to know these details of peoples personal lives.”  \\n“A lot of people here might have had access to private records,” you point out. “The Warden and Policeman easily, maybe the Doctor.  Maybe the Journalist, too.  She could have found out who all of us are and is still going for that breakthrough story.”\\n“You left me off the list,” he points out.  “As a lawyer, I could've heard things too.”\\n“You're absolutely right.”\\n\\n[[-Ask him why you have to be the one to go upstairs|97]]",
      "links": [
        {
          "text": "-Ask him why you have to be the one to go upstairs",
          "destination": {
            "name": "97",
            "pid": 186
          }
        }
      ]
    },
    {
      "pid": 205,
      "name": "103",
      "text": "“Earlier, when the lights were out the first time, we had sneaked into the garage and stole the equipment out of the snowmobile,” she admits.  “Then the Doctor walked in and caught us.  He was clearly strung out and paranoid and he said he just wanted to leave, so we struck a deal with him:  we keep the climbing gear and flashlight, and he takes the rest of the equipment and walks out.  We didn't think for a minute he could have been dangerous, we just wanted to keep him quiet.”\\nNever trust a junkie.\\n1 cont. Didn't it strike you as odd the Doctor was so eager to leave after the 1st death?  \\n“Well, no, it didn't.  It struck us as more odd that nobody else wanted to leave.\"\\n\\n[[Did she really think the Warden killed her husband?|104]]",
      "links": [
        {
          "text": "Did she really think the Warden killed her husband?",
          "destination": {
            "name": "104",
            "pid": 2
          }
        }
      ]
    },
    {
      "pid": 206,
      "name": "96b1",
      "text": "“I still think it may be the Doctor.  Maybe he's gone crazy or took too many drugs and just lost it.  We haven't seen him in several hours, but it just doesn't make sense that he'd take off alone into the night.\\n\\n[[-Ask him why you have to be the one to go upstairs|97]]",
      "links": [
        {
          "text": "-Ask him why you have to be the one to go upstairs",
          "destination": {
            "name": "97",
            "pid": 186
          }
        }
      ]
    },
    {
      "pid": 207,
      "name": "82a",
      "text": "You ask the Bounty Hunter again where did the rope come from? He confirms that it was part of the survival equipment in the snowmobile.  Either the Husband stole it earlier, before the Policeman drove off, or somehow he stole it after the snowmobile crashed (the trunk was open).  But the Husband wasn't even there at the crash site.  The Lawyer agrees, it just doesn't make sense.  \\nThe Bounty Hunter looks shiftily to the side, there's something he's not telling you...\\n\\n#1 [[Ask about the avalanche|82a1]]",
      "links": [
        {
          "text": "Ask about the avalanche",
          "destination": {
            "name": "82a1",
            "pid": 79
          }
        }
      ]
    },
    {
      "pid": 208,
      "name": "7b",
      "text": "You walk up to the group.  There are three men of different ages and descriptions, all chatting animatedly to the pretty blonde (Nicola, wasn't it?).  Off to the side the good Warden is by himself, pouring a glass of wine from a decanter left on a table.  You mentally note the table's new and dust free,  most likely laid out for the evening.\\nYou greet the first man and introduce yourself as David White.  He gives you a slightly critical look before shaking your hand.  He introduces himself as Dr. Anthony Hayes.  English.  Mid 40s.  Either doesn't like you or just doesn't like Americans.\\nMD? You ask him.  “No, Psychology.”  He voice is cool and clipped.  He really doesn't like you.  You glance at the large suitcase in his hand and he shifts his weight on his feet. “Ah... Books.  I'm an avid reader.  In fact, this bag is rather heavy.  I believe I saw a storage room in the back, I think I'll take the weight off.”  He leaves through the back door, suitcase in hand.\\nCHOICE\\n1- [[talk to the man in the business suit|7ba1]]\\n2- [[talk to the man in the overalls|7bb1]]",
      "links": [
        {
          "text": "talk to the man in the business suit",
          "destination": {
            "name": "7ba1",
            "pid": 227
          }
        },
        {
          "text": "talk to the man in the overalls",
          "destination": {
            "name": "7bb1",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 209,
      "name": "7a",
      "text": "You step to the side and  flip through your small shoulder bag of personal belongings.  Not much in there other than a fake American passport complete with fake visa, a small amount of Rubles, a toothbrush, a little bar of hotel soap, and a pack of cigarettes and matches.  Life on the run means being ready for anything, and you've had more than one near miss getaways with INTERPOL since breaking out.  If anyone were to search you now your lack of belongings would be suspicious, but they'd have nothing to detain you on.\\n\\n[[talk to the other guests|7b]]\\n",
      "links": [
        {
          "text": "talk to the other guests",
          "destination": {
            "name": "7b",
            "pid": 208
          }
        }
      ]
    },
    {
      "pid": 210,
      "name": "91a",
      "text": "You think back to the times she disappeared or was caught searching in the basement. Most people would go out of their way to avoid being around a dead body, but other than her initial appalled reaction she seemed pretty unmoved by it.  If she knows about the 10million hidden in there, it would be a motive enough to kill the Repairman if he was getting in her way.  But what about the others?  Maybe she was afraid of the Policeman getting backup and the Warden might have been... blackmailing her? With what?  You're grasping at straws here.  You just don't have enough information yet.\\n\\n[[continue|92]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "92",
            "pid": 183
          }
        }
      ]
    },
    {
      "pid": 211,
      "name": "63b",
      "text": "“Why would you possibly want to stay?” the Lawyer snaps back.  “If it wasn't for this storm I'd be out the door already!”  \\n“Yeah, us too,” the Couple agrees.  Nobody has to mention the video, guess we've all got skeletons in our past to hide.  \\nAnd that just leaves the Bounty Hunter...\\n\\n[[continue|64]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "64",
            "pid": 156
          }
        }
      ]
    },
    {
      "pid": 212,
      "name": "112",
      "text": "And the last item is the most intriguing of all: a folder with a full dossier of details on ALL ten of the people here.  It contains numerous newspaper clipping, online articles, and photographic evidence supporting all the crimes the ten of you were accused of.  \\nYou don't have time to read them all, so you skim over the rest and focus on the remaining living suspects: the Bounty Hunter, Wife of the Couple, Journalist, Lawyer, and the Doctor.  \\nAs it turns out, all five of them have a history of mental illness and run-ins with the law.  The Bounty Hunter has an incredibly long wrap sheet of crimes ranging from minor to he should have been in the cell next to yours.  The Journalist has been arrested numerous times for breaking and entering, and is on several different medications.  The Con Artist Couple have been implicated in several murders over the pasts decade.  The Doctor is under investigation for an accusation of secretly killing off two of his patients with intentional overdoses.  He also appears to have a real death fixation, having written numerous books on the subject and even volunteered at a funeral home.  Lastly, the convict that the Lawyer got released on a technicality killed the Lawyer's own family, not just some random woman and kids.  Funny, he'd left that part out of his story.  You wouldn't blame him if it was just something he didn't want to talk about...\\n\\n\\n[[continue|113]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "113",
            "pid": 96
          }
        }
      ]
    },
    {
      "pid": 213,
      "name": "89a",
      "text": "“Maybe she was waiting for the right moment, and when the lights went out she just snapped?” the Bounty Hunter guesses.\\n“Or maybe the Warden attacked her and it was self-defense?” the Journalist counters.\\n“You women always stick together, don't you?”  The Journalist glares at him and the Lawyer rubs his temples.  It's been a long night.\\n\\n[[continue|90]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "90",
            "pid": 181
          }
        }
      ]
    },
    {
      "pid": 214,
      "name": "89b",
      "text": "“I had the gun with me up until the lights went out the second time,” the Bounty Hunter admits. “When I woke up it was gone.  Anyone could have taken it.”\\n“Why didn't you mention this to any of us before now?” you ask, getting angry.\\n“Because I didn't want to get shot in the back by whoever took it.”\\n\\n[[continue|90]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "90",
            "pid": 181
          }
        }
      ]
    },
    {
      "pid": 215,
      "name": "89c",
      "text": "“Her husband was just horribly murdered,” the Lawyer answers.  “If she believed the Warden was responsible, that's motive enough to shoot him.”\\n“What about the other two deaths, the Policeman and Repairman?” you ask.  “She had no reason to want them dead.”\\nThe Bounty Hunter nods in agreement.  “We need to calm her down and find out what she knows.”\\n\\n[[continue|90]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "90",
            "pid": 181
          }
        }
      ]
    },
    {
      "pid": 216,
      "name": "14b",
      "text": "“Are you looking for something?” the voice of the Warden stops you just as your hand's on the doorknob.  You turn slightly and give him a little smile which he doesn't return. “Yeah, the restroom.  It's back here isn't it?”  You're confident in your American accent, but its just too much a coincidence, meeting your old prison warden here of all places.\\n\\n“You know...” he starts, “there's something very familiar about you.  Have we met before?”  You can't tell if he's genuinely asking or just fucking with you.  You tell him your David White, American Businessman story.  He shakes your hand with an iron grip, “nice to meet you, Mr. White.”  Shit, he knows exactly who you are...\\n\\nThen the lights go out.\\n\\n[[continue|15]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "15",
            "pid": 192
          }
        }
      ]
    },
    {
      "pid": 217,
      "name": "14a",
      "text": "You shift to the side of the room and pour yourself a glass of red wine from the serving table.  No snacks anywhere.  What kind of cheap party is this?\\nThe blonde is repeating the story of how they were invited here by a Mr. Jameson whom nobody seems to know much about.  He should have arrived here already, perhaps he was delayed by the snowstorm?  The policeman's associate speaks for the first time and says there's a blizzard scheduled overnight and everyone needs to return to town.  How did they even get here anyhow, there were no other vehicles in the garage?  Apparently the original five were dropped off by some driver who picked them up at the train station in town.  \\n\\nYou've heard enough.  No one's paying you any attention, so you start very casually moving over towards the back door.\\n\\n[[continue|14b]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "14b",
            "pid": 216
          }
        }
      ]
    },
    {
      "pid": 218,
      "name": "127a",
      "text": "When you first came here, you told yourself you weren't leaving empty handed.  But now the story's changed and you realize that empty handed is better than dead.  You pull out the gun and shoot the Bounty hunter twice in the back before turning and running down the mountain road.\\nIt's partially light by the time you get to the avalanche blocking the trail, and there you make a grizzly discovery: the body of the Doctor.  He's wearing the survival equipment he got off the Con Artists and you realize that he's been dead for a long time, probably most of the night.  There's no way he could have been the killer.\\nIt's too late to turn back now, though.  You pull off the heavy snow clothing from him and leave, continuing on the long walk into the town.\\nYou've managed to escape alive, but you've lost your chance at the money.  You take the first train out and begin a new life on the run.  The following morning you pick up a local paper that's headlined “Murder At the Old Observatory!”.  The police showed up that afternoon to check on the avalanche, and when they got to the Observatory they found a total of  nine bodies.  When you left the killer must have finished his task and killed himself.  Or herself.  You'll never find out what really happened, but you know your guilty conscious will haunt you for the rest of your life...\\n\\nEND\\n",
      "links": []
    },
    {
      "pid": 219,
      "name": "91b",
      "text": "The fact that she was running away during the last blackout isn't enough to peg these crimes on her. Maybe she was just scared for her own safety?  And there's always the question of motive. If she knew about the 10million hidden in the basement, it would explain why she kept going down there, and it would be a reason enough to kill the Repairman if he was getting in her way.  But what about the others? You think back, trying to remember where she was during each of the murders...\\n\\n\\n[[continue|92]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "92",
            "pid": 183
          }
        }
      ]
    },
    {
      "pid": 220,
      "name": "80",
      "text": "A dim light emerges from inside the well.  When you look in, you can faintly make out the outline of the Husband. The pool of blood surrounding him is illuminated by a flashlight.  He must have been the figure the Lawyer saw wandering outside before the lights went out.\\n\\n[[investigate the area|80c]]",
      "links": [
        {
          "text": "investigate the area",
          "destination": {
            "name": "80c",
            "pid": 259
          }
        }
      ]
    },
    {
      "pid": 221,
      "name": "19b1",
      "text": "You dive into your small town family-man story, throwing in little bits of real details just for authenticity.  The Blonde seems genuinely interested, a complete 180 from her boredom the first time you spoke to her.\\n You're sure the Warden knows who you are, and you brace yourself to have to try and make a run for it, hide out in the woods and come back later.  But he hardly asks you anything, simply nodding as you describe how you're hoping for a raise after you return home.  In fact, the Warden spends most of his time talking about himself and how he's out here looking for an escaped criminal.  \\n“Is there a bounty out for him?” you ask.  \\n\"Yes, I believe so,\" he says ,\"but that's not what this is about.  This man publicly humiliated me, cost me my job.  I want to see him brought to justice.”\\n\\n[[continue|19b2]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "19b2",
            "pid": 222
          }
        }
      ]
    },
    {
      "pid": 222,
      "name": "19b2",
      "text": "What's clear is that you both know who the other is.  You're not sure why he hasn't tried something yet and instead keeps up this strange “getting to know you” charade, but you're damn sure not going to make the first move.  Play your cards right, maybe you can pin something on him and give him the slip.\\nYou're also acutely aware that the Blonde is listening to both your every words, pretending to check her nails or some nonsense while leaning against the wall in the dim light.\\n\\nAfter a few more uncomfortable minutes of reciting fake history while listening to your real one, the lights finally come back on.\\n\\n[[continue|20]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "20",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 223,
      "name": "35b",
      "text": "You start pressing different buttons, play, rewind, unknown, can't read the symbol, and the Policeman shoves your hand away in annoyance.  He mutter under his breath something less than complimentary about Americans.\\n\\n[[check that it's plugged in|35b1]]",
      "links": [
        {
          "text": "check that it's plugged in",
          "destination": {
            "name": "35b1",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 224,
      "name": "35a",
      "text": "The projector's plugged in.  It's connected to the same lines as the lights, so if they're on than it should have power.\\n\\n[[start hitting buttons|35a1]]",
      "links": [
        {
          "text": "start hitting buttons",
          "destination": {
            "name": "35a1",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 225,
      "name": "49",
      "text": "When the Policeman leaves to the garage the Bounty Hinter announces that he's been put in charge.  No one is allowed to leave the room without his permission.  You need to go to the toilet, you ask him first.  \\n\\nThe man of the couple, Josef or what his name really is, steps forward and demands to know what authority a Bounty Hunter has to keep people against their will. \\n \\n“My own, you got a problem with it?”  The Bounty Hunter crosses his arms and stares down the other man who glances back at his wife for direction.  The Lawyer is less cowed, however, and demands to see the Hunter's credentials: if he's going to act like a police sidekick, he'd better have the paperwork to back it up.  The three of them begin arguing, with the wife chiming in with a sniping comment whenever she can.\\n\\nThe sound of the snowmobile roars by outside and into the distance.  The Psychologist, watching the spectacle with a bored expression, says he's going back to “check on his belongings” again.  You turn to slip out the back door as well and you notice that the journalist has disappeared as well.\\n\\nCHOICE\\n\\n[[#1 check the planetarium again|49a]]\\n\\n[[#2 look in the storage room |49b]]\\n\\n[[#3 go to the basement|50]]",
      "links": [
        {
          "text": "#1 check the planetarium again",
          "destination": {
            "name": "49a",
            "pid": 46
          }
        },
        {
          "text": "#2 look in the storage room ",
          "destination": {
            "name": "49b",
            "pid": 47
          }
        },
        {
          "text": "#3 go to the basement",
          "destination": {
            "name": "50",
            "pid": 73
          }
        }
      ]
    },
    {
      "pid": 226,
      "name": "46",
      "text": "The projector whirs to a stop.\\nThe only people who remained to watch the whole show are you, the Lawyer, the Warden, and the Bounty Hunter.   No one wants to be the first persons to leave.\\n“Well, isn't that something...”  you say finally, tapping your fingers against the wooden table.\\n“We both know ours is the truth, don't we?”  the Warden comments.  Just what the hell does he want from you?\\n\\nCHOICE\\n\\n[[#1 tell him off|46a]]\\n[[#2 leave the room|47]]",
      "links": [
        {
          "text": "#1 tell him off",
          "destination": {
            "name": "46a",
            "pid": 163
          }
        },
        {
          "text": "#2 leave the room",
          "destination": {
            "name": "47",
            "pid": 265
          }
        }
      ]
    },
    {
      "pid": 227,
      "name": "7ba1",
      "text": "This man returns your handshake firmly with a bored but polite smile.  Lukas Tessler, he says.  He's a lawyer, here to meet the host Mr. Jameson who contacted him seeking legal advice.  Tessler asks you a few casual questions about yourself, and you give him your businessman story.  He turns back into his conversation of local architecture with the blonde, and you glance him over.  Mid 40s, medium build, middle range suit.  Must do well enough for himself, but not stellar.  Very controlled way of speaking, but that may just go with the profession.  He didn't say what legal advise was being requested, and you didn't ask.  \\n[[continue on|7ba12]]",
      "links": [
        {
          "text": "continue on",
          "destination": {
            "name": "7ba12",
            "pid": 76
          }
        }
      ]
    },
    {
      "pid": 228,
      "name": "44",
      "text": "“Nicola Larson, aspiring journalist and murderer.”  It's the blonde turn and to her credit she remains stoic though you sense she's ready to bolt at any second.  “You greed and ambition lead your cameraman to his death when you recklessly pursued a dangerous mafia hitman in the hopes f a career making headline. When the situation turned bad you refused to call for backup in the fear of someone else stealing your story.”\\nNicola turns on her heels and stiffly walks out the door.  \\n\\n[[continue|45]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "45",
            "pid": 229
          }
        }
      ]
    },
    {
      "pid": 229,
      "name": "45",
      "text": "Nine down, one left to go.\\n“Mikhail Czyks.” The dead repairman.  “You are found guilty of drinking on the job and performing faulty electrical work that caused a fire in a housing complex, killing three people and injuring numerous others.  Though you were investigated, the police found insufficient evidence to press charges against you.”\\nOuch.  Maybe its for the best that Mikhail wasn't around to hear this.  The fact that he died while fixing an electrical panel is suspiciously ironic.\\n\\n\\n[[continue|46]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "46",
            "pid": 226
          }
        }
      ]
    },
    {
      "pid": 230,
      "name": "42",
      "text": "It's the Wardens'.  Of course it is.\\n“Warden Leon Abrusti: you are guilty of overlooking repeated instances of guard brutality to inmates during your leadership of a maximum security prison.  When one of these instances lead to the death of a prisoner, you filed the papers as being a suicide.”\\nAbrusti says nothing.  You stare at him and he stares at you.\\n\\n[[continue|43]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "43",
            "pid": 231
          }
        }
      ]
    },
    {
      "pid": 231,
      "name": "43",
      "text": "“Iva and Bogdhan Franc” it's the two celebrities turn now, and you can't remember their names but it sure wasn't what the tape just called them.  “You are guilty of conning a Czech business owner out of his life saving and causing his companies bankruptcy.  When you left Prague, the man shot himself and his wife jumped off a bridge.”\\nAt this, the woman of the couple screams and rushes out of the room, her husband chasing after her.\\n\\n[[continue|44]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "44",
            "pid": 228
          }
        }
      ]
    },
    {
      "pid": 232,
      "name": "40",
      "text": "The Lawyer's face is next, with an image that looks like it was taken out of a newspaper article. \\n“Lukas Tesler, you are found guilty of defending in a court of law the innocence of a man you knew to be guilty.  He was freed of charges and upon his release killed an innocent woman and her two children.”\\nTesler backs away from the projector as if he was afraid it would bite him, his face pale and stricken.\\n\\n[[continue|41]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "41",
            "pid": 233
          }
        }
      ]
    },
    {
      "pid": 233,
      "name": "41",
      "text": "Your own turn is next.  Your image, your mugshot from your arrest, is displayed across the wall and you know what's coming:\\n“William D. Wilson, international bank robber and fugitive.”  You can't stop the flinch at the use of your real name, and the knowledge that the Warden can confirm everything the voice is about to say.”You are found guilty of the crime of leaving your partner to die during a shootout with the police.  His death could have been avoided if you'd stayed to perform emergency care .”\\nThat wasn't the whole story of what happened, but it was true.  Your partner had been shot through the chest, and as he was dying he told you the truth: the money he'd hidden wasn't buried in a well in the grounds here like his map had indicated, but really under the floor of the basement.  He'd confessed he'd planned on shooting you and taking all the 10 million for himself,  but with his last breaths he told you the truth and he wanted you to have the money and split with his daughter, his only living relative.  Maybe if you'd stayed behind you could have performed CPR or done something for him, but that would have guaranteed you being caught and spending the rest of your life behind bars.\\n\\nCHOICE\\n\\n[[#1 refute the accusation|41a]]\\n[[#2 stay silent|41b]]",
      "links": [
        {
          "text": "#1 refute the accusation",
          "destination": {
            "name": "41a",
            "pid": 130
          }
        },
        {
          "text": "#2 stay silent",
          "destination": {
            "name": "41b",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 234,
      "name": "1",
      "text": "The last thing you'd expected to find when you walked up to the abandoned observatory was someone throwing a party.  Everything else was just like your dead partner had told you it would be, from the tiny Russian village at the bottom of the mountain, to the unpaved winding road, to the wire fence-line partially torn down.  The building itself was almost an exact replica of his sketch: a small and abandoned tribute to the plans of the former Soviet Union, long since forgotten by everyone except the local youths in the summertime. \\nThe fact that it was early winter and that there was already  a few feet of snow on the ground with more starting to fall made it even stranger to see the fresh tire tracks and footprints littered around the grounds.  The place should have been completely abandoned.\\n\\n[[continue|2]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "2",
            "pid": 169
          }
        }
      ]
    },
    {
      "pid": 235,
      "name": "82b1",
      "text": "You ask the Bounty Hunter again where did the rope come from? He confirms that it was part of the survival equipment in the snowmobile.  Either the Husband stole it earlier, before the Policeman drove off, or somehow he stole it after the snowmobile crashed (the trunk was open).  But the Husband wasn't even there at the crash site.  The Lawyer agrees, it just doesn't make sense.  \\nThe Bounty Hunter looks shiftily to the side, there's something he's not telling you...\\n\\n[[Ask about the husband|82b2]]",
      "links": [
        {
          "text": "Ask about the husband",
          "destination": {
            "name": "82b2",
            "pid": 236
          }
        }
      ]
    },
    {
      "pid": 236,
      "name": "82b2",
      "text": "The Lawyer offers to be the next one to talk to the Wife, she's in a delicate emotional state right now but we need to find out what her husband was doing in a well in the middle of the night in a snowstorm.  The Bounty Hunter offers to talk to the Warden about it and then they'll compare stories.\\ncont to s2nd choice below\\n\\n[[continue|83]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "83",
            "pid": 243
          }
        }
      ]
    },
    {
      "pid": 237,
      "name": "5",
      "text": "You take a second before answering to regard her.  Mid 20s, American but with a good quality fake continental accent, well off, nice clothes, oddly messy hair, strange choice of emphasis on her words.  Too friendly, even for an American.  Is she's lying to you?\\n\\nCHOICE \\n1) [[Greet her coldly|5a]]\\n2) [[Greet her friendly|5b]]",
      "links": [
        {
          "text": "Greet her coldly",
          "destination": {
            "name": "5a",
            "pid": 37
          }
        },
        {
          "text": "Greet her friendly",
          "destination": {
            "name": "5b",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 238,
      "name": "137a",
      "text": "It's a long and miserably cold walk back into the village, but you both arrive in time to catch the last trains of the day.  To your surprise, the Journalist is amicable to just splitting up the money and going your separate ways.  You watch her carefully as she board the train going east, waiting to see if she's going to make some last minute play for the cash.\\nShe doesn't.  You get on a train heading west, ready to find your partner's daughter and give her all of your share of the money.  Or almost all, you're going to keep a few hundred thousand to start your new life on some tropical island somewhere.\\nThe following morning you pick up a local paper that's headlined “Murder At the Old Observatory!”. The police had showed up late that afternoon to check on the avalanche, and when they got to the Observatory they found a total of eight bodies.  Did the Lawyer die from his injuries, or was he the real killer and committed suicide before the police could find him? \\nYou'll never know the full truth about what happened up there, but you made it out with $5 million and your life.  Not too bad for one night's work...\\n\\nEND",
      "links": []
    },
    {
      "pid": 239,
      "name": "9",
      "text": "Easier said than done, because no sooner than you started to sidle towards that second door than the first door burst open and two more people rush in, brushing the thick layer of snow off their clothes with great fanfare.  It's a man and a woman, both well dressed, mid 30s perhaps, and it seems like they're deliberately making as big an entrance as they can.\\n\\nThe woman turns to the crowd, a look of fake surprise on her pretty face.  “Oh!  Josef, look!  The others' are here already!”  The man next to her hangs up their coats and walks to her side, conspicuously placing an arm around her waist.  “I certainly hope we aren't too late, we'd  hate to have kept you all waiting.”  His voice and smile are every bit as insincere as the woman.\\n\\n[[continue|10]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "10",
            "pid": 189
          }
        }
      ]
    },
    {
      "pid": 240,
      "name": "131",
      "text": "When you get to the main room the Lawyer and Journalist are scrabbling along the floor, fighting each other violently.  They're both trying to grab at the leg of a broken chair to use as a weapon.  The Bounty Hunter charges in and pulls the Lawyer off, and you grab the Journalist and  pin her arms behind her back as she screams and kicks.\\n“He tried to kill me!  He's killed all the others!” the Journalist howls at you, struggling to break free.  “I SAW him shoot the Warden!  It has to be him!”\\n“No!” the Lawyer shouts “This crazy bitch killed the other woman and then she jumped on me!  SHE'S THE REAL KILLER!”\\n“What the hell do you mean “you saw him shoot the Warden”?!” you ask.\\n“When the lights were out.   Saw him with the gun in his hand when the trigger flashed!  That's why I ran out of the room!”\\n“She's lying!  I didn't do anything!  I found the gun on the floor later!” the Lawyer insists.\\nA long pause as you  the Bounty Hunter look at each other.  Evaluating.\\n\\n\\n[[continue|132]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "132",
            "pid": 120
          }
        }
      ]
    },
    {
      "pid": 241,
      "name": "124",
      "text": "“So, you just killed the Policeman?  How... honest of you.” you say, ready to move into action.\\n“Whatever,” he shrugs you off.  “Here's the thing:  You're too sloppy to be the killer, and now you know I'm not it either.  So you and I, we team up now.  We go back in there, get that money, and get out of here.”\\n\\n\\n\\n[[-You want us to work together?  After you just admitted to killing your last partner?|125]]",
      "links": [
        {
          "text": "-You want us to work together?  After you just admitted to killing your last partner?",
          "destination": {
            "name": "125",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 242,
      "name": "78",
      "text": "The Celebrity Wife demands that you search for her husband, he could be out there injured with a killer on the loose!  The Bounty Hunter asks everyone to pool together every piece of lighting equipment they have.  It's a rather disappointing list: your pack of matches, one candle the Journalist found downstairs, and the Lawyer has a flashlight app on his cellphone.  That's it. \\n \\nCHOICE\\n\\n[[#1 take the candle and matches|79]]\\n\\n[[#2 take the cellphone|79]]\\n",
      "links": [
        {
          "text": "#1 take the candle and matches",
          "destination": {
            "name": "79",
            "pid": 256
          }
        },
        {
          "text": "#2 take the cellphone",
          "destination": {
            "name": "79",
            "pid": 256
          }
        }
      ]
    },
    {
      "pid": 243,
      "name": "83",
      "text": "You still have a few more questions to ask.\\n\\nCHOICE x1\\n\\n[[#1 How could the husband have gotten the Policeman's flashlight?|83a]]\\n[[#2 What are their thoughts about the Doctor?|83b]]",
      "links": [
        {
          "text": "#1 How could the husband have gotten the Policeman's flashlight?",
          "destination": {
            "name": "83a",
            "pid": 144
          }
        },
        {
          "text": "#2 What are their thoughts about the Doctor?",
          "destination": {
            "name": "83b",
            "pid": 143
          }
        }
      ]
    },
    {
      "pid": 244,
      "name": "7bb12",
      "text": "This man returns your handshake firmly with a bored but polite smile.  Lukas Tessler, he says.  He's a lawyer, here to meet the host Mr. Jameson who contacted him seeking legal advice.  Tessler asks you a few casual questions about yourself, and you give him your businessman story.  He turns back into his conversation of local architecture with the blonde, and you glance him over.  Mid 40s, medium build, middle range suit.  Must do well enough for himself, but not stellar.  Very controlled way of speaking, but that may just go with the profession.  He didn't say what legal advise was being requested, and you didn't ask.  \\n\\n[[continue|8]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "8",
            "pid": 179
          }
        }
      ]
    },
    {
      "pid": 245,
      "name": "23a",
      "text": "You glance at the corner where your partner hid the money.  You see it: the slightly off color floor tile, partially covered up by an empty metal tool cabinet.  It looks untouched.\\n\\n[[examine the body|23ab]]\\n",
      "links": [
        {
          "text": "examine the body",
          "destination": {
            "name": "23ab",
            "pid": 89
          }
        }
      ]
    },
    {
      "pid": 246,
      "name": "23b",
      "text": "There's no way this man could have tripped and fell.  The wound's angled from the back and there's nothing for him to hit his head on.  Than you see it: a metal fire extinguisher, placed upright nearby, with blood shining on it.  Next to it is the Repairman's little flashlight, crushed like someone stepped on it. \\n\\n[[look around the room|23bb]]",
      "links": [
        {
          "text": "look around the room",
          "destination": {
            "name": "23bb",
            "pid": 116
          }
        }
      ]
    },
    {
      "pid": 247,
      "name": "77",
      "text": "There definitely was a fight in here alright, judging by the debris scattered around and the occasional spot of blood from someone's punched nose.  The gate is closed but the exit door to the outside is slightly open.  \\nYou push it open fully and see three sets of footprints in the snow heading away from the building.  The first set seems older, with the outlines mostly lost in the fallen snow, and they take off to the left down the mountain road.  The other set has two  sets of prints, slightly fresher but still too vague to make out any details of the owner.  These prints go to the right, away from the first, and along the side of the building.\\nIt occurs to you now that the storm largely  passed by.  A little snow is still falling, but for the most part it's just a dark and moonless night.  You ask for how long you were out, and apparently it was a while and it's now the middle of the night.\\n\\n[[continue|78]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "78",
            "pid": 242
          }
        }
      ]
    },
    {
      "pid": 248,
      "name": "74a",
      "text": "According to her, she and her husband and the Warden were in the garage, looking for clues about where the Journalist or Doctor might have gone.  Suddenly the lights went out and the Warden jumped on her and tried to strangle her!  (You notice an absence of bruising on her neck, but keep quiet and let her continue.)  She says her husband started bravely fighting him off in the dark and she ran back inside, calling for help.  She tripped over someone's body in the dark and she thought the was dead so she started screaming.  Then the lights came back on and she'd tripped over the Bounty Hunter who was laying at the bottom of the stairs.\\n\\n[[continue|75]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "75",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 249,
      "name": "74b",
      "text": "According to the Warden: the three of them were searching for clues in the garage when the lights went out and the Couple attacked him.  He fought back, and the wife jumped on his back and was tearing at his coat, trying to mug him or strangle him or something.  (You notice the torn pockets of his coat, that much of his story is true at least...) The Warden says he elbowed her to her face, probably giving her that black eye, and she ran inside screaming like a banshee.  Then her husband hit him hard and he was briefly knocked out.  He woke up when the lights came on again and the Bounty Hunter dragged him back inside, with the Wife howling threats at him.  He didn't do anything to her husband, and he has no idea where he is now.  \\n\\n[[continue|75]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "75",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 250,
      "name": "74",
      "text": "The Bounty Hunter and Lawyer stare at you incredulously.  You can tell they don't think much of your story.  Before they can interrogate you further, however, you hear a sharp bang in the distance outside. Like a gunshot, but louder and further away.  Moments later there's a faint roaring sound, and then the whole building begins to shake.  Everyone scrambles against a wall as the shaking intensifies.  This goes on for about half a minute, and then it stops.\\n“What the hell was that?” the Journalist asks, cautiously stepping away from the wall.\\n“An avalanche, probably,” the Bounty Hunter guesses ,”we're lucky it didn't hit us here, we could've been buried here for days.”\\n\\nBefore the others can turn the questioning back to you, you decide to find out what the Celebrity Couple and the Warden's stories are.\\n\\nCHOICE\\n\\n[[#1 talk to the Wife|74a]]\\n[[#2 talk to the Warden|74b]]",
      "links": [
        {
          "text": "#1 talk to the Wife",
          "destination": {
            "name": "74a",
            "pid": 248
          }
        },
        {
          "text": "#2 talk to the Warden",
          "destination": {
            "name": "74b",
            "pid": 249
          }
        }
      ]
    },
    {
      "pid": 251,
      "name": "73",
      "text": "Now it's your turn to explain how you ended up where you did.\\n\\nCHOICE\\n\\n[[#1 tell them the truth, what you know of it|73a]]\\n[[#2 lie|73b]]",
      "links": [
        {
          "text": "#1 tell them the truth, what you know of it",
          "destination": {
            "name": "73a",
            "pid": 41
          }
        },
        {
          "text": "#2 lie",
          "destination": {
            "name": "73b",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 252,
      "name": "72",
      "text": "You wake up an indefinite time later with a pounding headache and the lights back on.  Someone's dragged you back into the main room, where it looks like the remaining people have gathered. \\nThe wife of the Couple is screaming at the Warden, accusing him of attacking her husband whom you don't see anywhere.  She has a black eye and her face is streaked with mascara like she's been crying.  The Warden is nursing a wound on his head to go with his black eye, and he's insisting to the Bounty Hunter that it was her husband who attacked him, not the other way around.  The Bounty Hunter also looks rather worse for wear, his clothes are torn and he's got a painful looking split lip.  He's holding back the Wife who looks ready to tear the Wardens throat out.  The Lawyer is hovering between them, trying to diffuse the situation and get a word in edgewise but not having much luck with either. The Journalist is standing in the far corner by herself, arms wrapped around her chest and looking deeply upset over something.  She meets your eyes and scowls at you.\\nNo sign of either the Husband or the Doctor.\\n\\nCHOICE\\n\\n[[1- talk to the Lawyer.|72a]]\\n\\n[[2- talk to the Journalist.|72b]]\\n\\n[[3- talk to the Bounty hunter.|72c]]\\n\\nNo point in talking to either the Wife or the Warden, they're both too busy shouting accusations and threats at each other.",
      "links": [
        {
          "text": "1- talk to the Lawyer.",
          "destination": {
            "name": "72a",
            "pid": 166
          }
        },
        {
          "text": "2- talk to the Journalist.",
          "destination": {
            "name": "72b",
            "pid": 164
          }
        },
        {
          "text": "3- talk to the Bounty hunter.",
          "destination": {
            "name": "72c",
            "pid": 165
          }
        }
      ]
    },
    {
      "pid": 253,
      "name": "71",
      "text": "You quietly go back downstairs, listening for any noises from the others but hearing no one.  When you get to the bottom, you hear voices coming from the garage and the door at the end to the basement is open with a light on inside.  You're certain it was closed when you went up earlier with the others.  You can faintly hear the sounds of movement coming from inside.\\nYou quietly move to it and peak in.\\n\\n[[continue|71a]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "71a",
            "pid": 15
          }
        }
      ]
    },
    {
      "pid": 254,
      "name": "70",
      "text": "You both enter the Planetarium but find neither the Journalist or the Doctor there.  Something about the room looks a little different, though. You start looking over the table with the projector for clues.\\n“Is your video true?” the Lawyer asks you, eyes following the electrical lines running from the device and out the door.\\n\\nCHOICE x1\\n\\n[[#1 Say that it's true|70a]]\\n\\n[[#2 Why is he asking?|70b]]",
      "links": [
        {
          "text": "#1 Say that it's true",
          "destination": {
            "name": "70a",
            "pid": 128
          }
        },
        {
          "text": "#2 Why is he asking?",
          "destination": {
            "name": "70b",
            "pid": 129
          }
        }
      ]
    },
    {
      "pid": 255,
      "name": "55a",
      "text": "You dig your way down to the bottom but its too dark to make out much.  You ask the others for a flashlight, but no one has one.  Didn't the Bounty Hunter say he was getting one earlier, when the Repairman was killed?\\nOkay, something to think about.  You light one of your matches and cautiously look at the undercarriage, there's a lot of spilled substances down here that might ignite if you're not careful.  \\nAnd you think one of them might be brake fluid.  Which would explain why it crashed the way it did.  You're not a mechanic, you're not sure, but you think that's what it is.\\nYou crawl out and tell the others your findings.  \\nIt's just the Bounty Hunter and Lawyer.  The Wardens gone?  “Looking at the body, apparently” they tell you.  You think about that gun in the holster.  Something else to weigh on your mind.\\n\\n[[investigate the trunk|55a1]]",
      "links": [
        {
          "text": "investigate the trunk",
          "destination": {
            "name": "55a1",
            "pid": 72
          }
        }
      ]
    },
    {
      "pid": 256,
      "name": "79",
      "text": "The Bounty Hunter splits the 6 of you up into two groups: the Wife, Journalist, and Lawyer in the first, and you, the Bounty Hunter, and Warden in the second.\\n\\nCHOICE\\n\\n[[#1 follow the single footprints to the left|79a]]\\n\\n[[#2 follow the two footprints to the right|79b]]",
      "links": [
        {
          "text": "#1 follow the single footprints to the left",
          "destination": {
            "name": "79a",
            "pid": 147
          }
        },
        {
          "text": "#2 follow the two footprints to the right",
          "destination": {
            "name": "79b",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 257,
      "name": "55b",
      "text": "You open up the trunk but find it empty.  The Bounty Hunter says that they had survival equipment in there.  “Survival equipment?” you ask.  “Like cold weather gear, ropes and tire chains, I think some rations and similar.”\\n“But... aren't we going to need that stuff?” the Lawyer says, looking more concerned about that than the crash itself.  “If we're stuck here now, and have to walk back, wont we need those things?” \\n The Bounty Hunter shrugs ,”it's not that far away to town.  10, 15 kilometers at the most, is that about right?”  You nod, it took you a while to walk up here, but you were counting on downhill being faster.  The Lawyer looks deeply alarmed at the prospect and you can't help but grin a little.  A city boy, clearly.  \\n\\n[[investigate the snowmobile|55b1]]",
      "links": [
        {
          "text": "investigate the snowmobile",
          "destination": {
            "name": "55b1",
            "pid": 106
          }
        }
      ]
    },
    {
      "pid": 258,
      "name": "120",
      "text": "“Well, the thing is, I got a little paranoid.” he says.  “I started wondering how I was going to look for the money without the Policeman noticing me and demanding his share.  And I sure as hell wasn't walking away with just half.  So I was waiting for a chance to slip away, and when the lights went out it was the perfect opportunity.”\\n \\n\\n\\n[[-Opportunity for what?|121]]",
      "links": [
        {
          "text": "-Opportunity for what?",
          "destination": {
            "name": "121",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 259,
      "name": "80c",
      "text": "It's hard to tell whose footprints were here before you came, but some of the ones further back look to be older.  In one stretch they're very far apart and show sliding, like the person was running to the wall and slipping  in the snow.\\nThe Bounty Hunter points out that the imprint is from a relatively large shoe, not one of the womens'. So a man was running out here earlier?  The killer?  Or could it have been the Husband himself?\\n\\nNexy to examine the well. A piece of severed rope is tied to a strut on the outside of the well.  You examine it and it's heavy duty climbing robe, the kind that a professional mountaineer might use.  \\n“That was part of the survival equipment that went missing from the snowmobile's trunk,” the Bounty Hunter says. “For some reason this man must have been using it to climb into the well and then someone cut the line and killed him.”\\nSo the Husband was going after the money also, you think.  Which means he must have had the wrong map which he took off the Warden.  So maybe the Warden was telling the truth that the couple attacked him in the garage instead of the other way around...\\n\\n[[continue|81]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "81",
            "pid": 101
          }
        }
      ]
    },
    {
      "pid": 260,
      "name": "48",
      "text": "Downstairs, the Policeman has gathered the remaining people around.  You notice the wine decanter is almost empty; looks like someone's been hitting the sauce pretty hard.\\n“This is now a criminal investigation,” he begins.  “I'm going to go back into town and get backup.  You are all suspects who will be taken to the station for questioning.  We'll be sending up a vehicle to collect you shortly.”  He turns to leave and the Bounty Hunter, his partner or associate or whatever he is, pulls him to the side for a quiet word.  You glance around and see that everyone else looks as displeased at the announcement of a police investigation as you are.  After seeing those videos, you're not surprised.\\n\\n[[continue|49]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "49",
            "pid": 225
          }
        }
      ]
    },
    {
      "pid": 261,
      "name": "98",
      "text": "The Lawyer backs down the stairs, nervously watching you hold the gun.  “I trust you, just... not a lot.” he says, then scurries away.  \\nYeah, the feeling's mutual at very best.  But you check the gun and it does indeed have two bullets left.\\nThen you remember that way back, right after the Repairman was killed, it was the Journalist who had the key that unlocked the door.  Before you go up there, you need to talk to her.\\nYou knock on the door to the storage room softly, then open it and step inside the small room.\\n\\n[[continue|99]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "99",
            "pid": 176
          }
        }
      ]
    },
    {
      "pid": 262,
      "name": "71ab",
      "text": "You turn and run, stumbling in the pitch darkness.  You trip over some object on the ground and fall, and immediately someone tackles you.  You can't tell if it's the Journalist or someone else.  They don't make a sound as you lash out at them in the pitch blackness.   They press a foul smelling rag over your face and you struggle valiantly, but its not long before you pass out...\\n\\n[[continue|72]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "72",
            "pid": 252
          }
        }
      ]
    },
    {
      "pid": 263,
      "name": "71aa",
      "text": "You back up and try to pull out and light a match, but she smacks you HARD over the head with the fire extinguisher.  You fall to your knees in a daze and you hear her jump back and scramble to the doorway exit.  Suddenly she screams and there are sounds of a struggle than rapidly running away footsteps.  Seconds later you're on your feet, trying to follow, when someone tackles you.  You can't tell if its the Journalist or someone else, they don't make a sound as you lash out at them in the pitch blackness.   They press a foul smelling rag over your face and you struggle valiantly, but its not long before you pass out...\\n\\n[[continue|72]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "72",
            "pid": 252
          }
        }
      ]
    },
    {
      "pid": 264,
      "name": "123",
      "text": "The Bounty Hunter laughs and shakes his head at you. “In case you haven't noticed, I'm not exactly Mr. Rogers here.  This sure 'aint the first time a dead body's crossed my path.”  Yeah, you'd gathered that much yourself.\\n“But no,” he continues, “I didn't kill the Repairman.  Or any of the others, for that matter.”\\n\\n\\n\\n[[-just the cop then?|124]]",
      "links": [
        {
          "text": "-just the cop then?",
          "destination": {
            "name": "124",
            "pid": 241
          }
        }
      ]
    },
    {
      "pid": 265,
      "name": "47",
      "text": "The four of you leave the room; the Bounty Hunter first, than you, than followed by the others.  You descend the stairs in silence and return to the main room.\\n\\n[[continue|48]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "48",
            "pid": 260
          }
        }
      ]
    },
    {
      "pid": 266,
      "name": "95a",
      "text": "You tell him that the two of you should split up and look for any clues about the Doctor.  If you don't find anything, maybe the Wife will be ready to talk.\\n“So you think I might be it, don't you?” he asks, glancing over his shoulder down the staircase as if he expects the Bounty Hunter to jump out on him at any second.\\n“It's crossed my mind,” you tell him. “The list's getting shorter by the hour.”\\nHis expression is odd, but he nods in agreement.  “Okay, I'll check the basement and downstairs. You go find a way into that planetarium. That would be a likely spot for the killer to be hiding; maybe it even has  a secret exit outside?  These old Soviet buildings had a lot of little spaces.”\\n\\n[[continue|96]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "96",
            "pid": 187
          }
        }
      ]
    },
    {
      "pid": 267,
      "name": "21b",
      "text": "You offer to help the Policeman, telling him you know a little first aid.  The Warden and the Couple rush in, alerted by all the ruckus. The Policeman hesitates than nods tersely, telling the others to stay in this room.  You hurry with him and the Lawyer downstairs, followed by the Warden and Blonde who've decided to have a look for themselves.\\n\\n[[continue|22]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "22",
            "pid": 133
          }
        }
      ]
    },
    {
      "pid": 268,
      "name": "135a",
      "text": "It's a long and miserably cold walk back into the village, but you both arrive in time to catch the last trains of the day.   You offer to just split the money 50/50 now and go your separate ways, but to your surprise the Journalist says she wants to stay with you.  She says that you make a pretty damn nice team, and why have $5 million when you both can share the 10?\\nYou eye her suspiciously, but you've always been a sucker for a pretty face.  You two both get on the last train heading west, first class of course.\\nThe following morning you pick up a local paper that's headlined “Murder At the Old Observatory!”. The police had showed up late that afternoon to check on the avalanche, and when they got to the Observatory they found a total of seven bodies.  Looks like the Bounty Hunter made it out after all. You know that he's going to be coming after you, and the Journalist pleads for you to skip the Continent with her, to get on a plane and go somewhere warm and sunny.  You tell her that first you've got to track down your partner's daughter and give her half the money like you'd promised you would.\\nTo your surprise, the Journalist is still with you when you wake up the next morning.  You don't know if the Bounty Hunter was the real killer or not, but we've got to stick together, she says.\\nOkay, so maybe she's not staying with you for your charming personality, but you've got $5 million, you've got the girl, and pretty soon you're going to start a new life together on some tropical island as a very rich man.\\nNot too bad for one night's work...\\n\\nEND",
      "links": []
    },
    {
      "pid": 269,
      "name": "95b",
      "text": "You tell him that the two of you need to stick together and search the building for any clues about the Doctor.  If something happens or the lights go out again, we'll need to watch each others' backs.\\nHe hesitates for a second, you can tell he doesn't like this idea. “The thing is-” he begins.\\n“You think I'm in, don't you?” you ask, studying him to gauge his current emotional state.\\n“It's crossed my mind,” he admits. “The list’s getting shorter by the hour.”\\nHis expression is odd.  You know he's got something else on his mind, but doesn’t want to say.  Maybe teaming up wasn't the best idea.  If he's not the killer he may still do something reckless and get you both dead. “Okay, you'll check the basement and downstairs. I'll go find a way into that planetarium.”\\n“That would be a likely spot for the killer to be hiding; maybe it even has  a secret exit outside?” he wonders.  “These old Soviet buildings had a lot of little spaces.”\\n\\n[[continue|96]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "96",
            "pid": 187
          }
        }
      ]
    },
    {
      "pid": 270,
      "name": "87b",
      "text": "The woman's sobbing against the floor as the Bounty Hunter ties her arms behind her back.  You're not going to get anything out of her now.\\n\\n[[continue|88]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "88",
            "pid": 92
          }
        }
      ]
    },
    {
      "pid": 271,
      "name": "70c",
      "text": "“There's someone outside!” the Lawyer suddenly whispers, as if whoever it is might hear him.  You quickly move to his side and you can barely see it through the falling snow: the faint outline of a figure walking, illuminated by a flashlight.  You can't identify who it is, but the only one who could have a flashlight is the Bounty Hunter.\\n\\nThen the lights go out.\\n\\n[[continue|70d]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "70d",
            "pid": 123
          }
        }
      ]
    },
    {
      "pid": 272,
      "name": "87a",
      "text": "She glares at you and says she just pulled it out of the wall, it wasn't connected to anything.\\n\\n[[continue|88]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "88",
            "pid": 92
          }
        }
      ]
    }
  ]
}