{
  "passages": [
    {
      "pid": 1,
      "name": "Letter",
      "text": "April 12, 2012\n\nHey [[Protege]], \n\nI should have [[told you]] sooner.  I know. Life's a [[bitch]] though, amiright? \n\nI really hope my [[father]] will give this to you.  And at the same time, I really don't.  I'm worried about what will happen.  \n\nIt doesn't seem real.  It's still so far away.  Because the date here...it isn't your today.  It's my today.   It isn't the day you [[found out everything]], but the day I began to [[understand]] everything.  \n\nI know you [[kept the rest of these]].  Hopefully they help.  Hopefully they're enough of an [[apology]].  And hopefully...the one's I've left behind, all the ones I couldn't send you, help as well.\n\nYou deserve it.\n\nThis might be the last letter I write to you. It might not be.\n\nEither way, I'm going to miss you. \n\n[[Love]] and [[Sunsets]], \n\nCadence\n\n",
      "links": [
        {
          "text": "Protege",
          "destination": {
            "name": "Protege",
            "pid": 2
          }
        },
        {
          "text": "told you",
          "destination": {
            "name": "told you",
            "pid": 14
          }
        },
        {
          "text": "bitch",
          "destination": {
            "name": "bitch",
            "pid": 16
          }
        },
        {
          "text": "father",
          "destination": {
            "name": "father",
            "pid": 17
          }
        },
        {
          "text": "found out everything",
          "destination": {
            "name": "found out everything",
            "pid": 18
          }
        },
        {
          "text": "understand",
          "destination": {
            "name": "understand",
            "pid": 3
          }
        },
        {
          "text": "kept the rest of these",
          "destination": {
            "name": "kept the rest of these",
            "pid": 29
          }
        },
        {
          "text": "apology",
          "destination": {
            "name": "apology",
            "pid": 13
          }
        },
        {
          "text": "Love",
          "destination": {
            "name": "Love",
            "pid": 32
          }
        },
        {
          "text": "Sunsets",
          "destination": {
            "name": "Sunsets",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "Protege",
      "text": "<memories>\nShe always called you that.  Her protege.  It started after you met in eighth grade.  She was in your English class.  Alphabetically, her last name, Huges, was seven people after your last name, Coleman. \n\nAt least, that's what you told her when she sat down, and said she was confused by the seating chart that was stapled to the front door.\n\n\"I get the fact that we're in alphabetic order - what I don't get is why.\"  She rolled her eyes.  If a voice could roll it's eyes, you were pretty sure it did as well. \n\nYou nodded.  Shy. Awkward.  You didn't know anyone in this class. \n\n\"What's your name, kid?\"  She popped the collar on her leather jacket.  \n\nShe had a leather jacket.  You almost snrrked a bubble of laughter - you thought she was trying too hard. \n\nYou gave her your name, fidgeting with the sleeves of your calm blue plaid shirt. \n\nWithout a pause, she wrapped her arm around your shoulders.\n\n\"Well, Coleman, you're going to be my protege!\"\n\nYou reminded her that you had a first name. \n\n\"Eh, Coleman sounds more interesting. Anyways, none of that's important.  A name is just a name. I'm Cadence, and I'm going to be your mentor, and that's all you need to know.\"\n\nYou thought there was a lot more you needed to know - like why the hell you needed a 'mentor' - but you couldn't get out any questions past your clenched throat. You figured a mentor is like a [[friend]] - right?\n</memories>",
      "links": [
        {
          "text": "friend",
          "destination": {
            "name": "friend",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "understand",
      "text": "October 15, 2011,\n\nHey Coleman, \n\nSo, buddy o' pal o' mine.  You gotta help me out. \n\nI haven't been to Trig in like.  A month.  Teacher was chill and gave me extensions for my sweet [[skippings]], but now I'm in a rut because this textbook fucking sucks and I have three assignments about the law of cosines and sines and I need a sign here buddy. \n\nI've known you for a couple years now, and I still don't understand how you just vomit correct [[numbers]] onto the page.  \n\nI'll buy you cookies?\n\nYou're My Only Hope Obi-One, \n\nCadence",
      "links": [
        {
          "text": "skippings",
          "destination": {
            "name": "skippings",
            "pid": 8
          }
        },
        {
          "text": "numbers",
          "destination": {
            "name": "numbers",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "small picture",
      "text": "<memories>\nAs you hold the letter in your hand, a crinkled picture gracefully falls to the floor. \n\nA sunset.  \n\nShe was right - you had spent hours, choosing the best [[picture]]. Yes, always the top five of every [[shot]].  \n\nBut you spent longer on this one.\n\nIt was the first picture you had given her. \n</memories>",
      "links": [
        {
          "text": "picture",
          "destination": {
            "name": "picture",
            "pid": 11
          }
        },
        {
          "text": "shot",
          "destination": {
            "name": "shot",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "friend",
      "text": "September 04, 2008\n\nDear Coleman, \n\nSo - What's your locker number? I have to start quick on this mentorship.  I can feel you fading, fading fast.  Fading into the deep abyss. \n\nConcerned, \n\nCadence\n\n---\n<reader>\nPaying attention to class.  \n\nDramatic, much?\n</reader>\n---\nDear Coleman, \n\nNerdy much?  There is nothing to pay attention to, because all we're doing is going over the same rules all the other classes have and names plastered to the front door. Apparently I'm seven places after you.  \n\nI think I'm going to work on your [[perspective]] first. \nAnd your locker number.\n\nMore Concerned,\n\nCadence\n---\n<reader>\nI don't need a mentor.  I'm fine.  Why is this dated?\n</reader>\n---\nDear Coleman, \n\nAgree - disagree.\nLife needs some dramatic flare.  \nLOCKER NUMBER PLEASE.\n\nAnnoyed, \n\nCadence\n---\n<reader>\n[[4-210]]\n</reader>\n",
      "links": [
        {
          "text": "perspective",
          "destination": {
            "name": "perspective",
            "pid": 9
          }
        },
        {
          "text": "4-210",
          "destination": {
            "name": "4-210",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "Sunsets",
      "text": "August 10, 2011\nHey Dear, \n\nDo you remember last summer?  During the few weeks when I was back home?\n\nThere was one day, a Thursday I think.  We walked around Western Hills and laughed at the pretentious houses.  We went into Town Square, our shoes scrabbling against the rough concrete as we just strolled through different stores. \n\nAnd we just talked.  We didn't care about the floods of people pooling around us, flowing in and out of the streets and sidewalks and stores.  It was just us, really. \n\nWe ended up in that dinky little park in the center of the Square, staring up at the mountains.  It was hot as hell outside, like 90 degrees, but it didn't matter.  \n\nThe sun started to dip, dip past the buildings, past the mountains.  As it said goodbye, the sky slowly exploded in colors.  Orange and pink and peach waves lapped over the blue sky, tinged the perfectly offwhite clouds. \n\nI sat in silence.  You buzzed around for a while, snapping photos with your Kodak. I think it took you thirty minutes until you were satisfied with a result.  I wonder how many pictures you deleted before you came up with your perfect five.  You always only keep five of the same scene, right?\n\nBut eventually you sat down on the dying grass with me, and we talked again.  I can't even remember what we talked about, but I guess it doesn't matter. It wasn't the [[words]] that mattered, but the fact that I had a friend there.\n\nThe next week, you gave me a [[small picture]] of that sunset.  Wallet sized.  \n\nI still keep it with me. It's crinkled a little bit on the top left corner, but it's still with me. I hold it when I'm scared.\n\nIt's in my hand right now, as I stare out into the open field, the sun dipping past the trees. \n\nBest wishes, \n\nCadence",
      "links": [
        {
          "text": "words",
          "destination": {
            "name": "words",
            "pid": 31
          }
        },
        {
          "text": "small picture",
          "destination": {
            "name": "small picture",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "numbers",
      "text": "March 9, 2011\n\nDear Protege, \n\nThis weekend, get pumped. \nGET PUMPED.\n\nI got us wicked tickets to Remote Control. \n\nWe're going to get smashed.  Pound to all the music. Get all the numbers. \n\nIt will be glorious.\n\nYour ticket is paperclipped!\n\nPUMPED,\n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 8,
      "name": "skippings",
      "text": "March 27, 2009\n\nDear Protege, \n\nI'm skipping today again - fuck learning about prepositions and interjections.  We speak English goodly. We don't need this shit.\n\nI doubt actual writers stay up into the middle of the night frantic about their present participles. \n\nBut, I wanted to make sure you have a good day. \n\nBecause look at what you're missing out on (though, really, you should just skip with me sometime).  \n\nSo I highly suggest you sit outside, see the sun (it's supposed to be a beautiful 72 degrees out!) and listen to these songs on your cd player.  It's Panic! at the Disco (the exclamation mark is apparently important?) - the band I was telling you about last week. They're from Vegas!\n\n----\n<memories>\nThe letter was neatly folded on top of a CD inside your locker.  You wonder how she got them in there, but since you met her, you realized these were questions you didn't want the answers to.  \n\n//\"Pretty. Odd.\"//  By Panic! at the Disco.  \n\nThat was more than three years ago.  \n\nHolding the CD, you place it gingerly, into your laptop, throw in your headphones, and layback as //\"Nine in the Afternoon\"// fills your ears. \n\n</memories>\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 9,
      "name": "perspective",
      "text": "<memories>\nHer lunches were pretty predictable.  \n\nA canteen of some weird, green sludge drink.  \n\nA protein bar.  \n\nSome form of steamed vegetable, generally spinach or brocolli.  \n\nA piece of fruit. \n\nThen some form of meat. Usually grilled chicken with some experimental sauce or another her mom marinated it in.  \n\nThen again, you couldn't say much.  You generally had a ham or turkey sandwich and a piece of fruit.  Sometimes, you'd throw in a Hershey's bar. \n\nYou'd razz her about her lunch versus her tough girl cred.\n\nPushing your shoulder, she'd flash a look. \"Just because I'm tough doesn't mean I gotta eat like shit. I'd rather continue looking hot, thank you.\"  \n\nYou'd sit out on the dead grass and look out towards the sun.  Somedays it was hot as hell.  Others, mildly cold.  But you two could generally count on greeting the the desert sun shining in a blue sky speckled with clouds. \n\nAnd then you'd talk.\n\nWell, more appropriately, Cadence would talk and you'd give smart ass remarks when you could.  \n\n\"I think we all need to see things better. Clearer.\"  She'd say after a  bout of silence. \n\n\"Get glasses.  They work wonders for me.\"  A small shove.\n\n\"You know what I mean.  I mean - there's this endless, blue sky.  And we're sitting here, learning about benign shit we might not even get to use.\"\n\n\"Wow- Benign's a big word for you.\"\n\n\"Fucker.\"\n</memories>\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 10,
      "name": "4-210",
      "text": "<memories>\nLater that day, after lunch, you opened your locker.\n\nA lined piece of paper was tucked into the space between the door and the edge of the locker.  \n\nThe first letter Cadence sent you. \n</memories>\n--- \nDear Coleman, \n\nMeet me outside school tomorrow before English. \n\nYour training begins. \n\nYour Yoda,\n\nCadence\n\n---\n<memories>\nThe next day, she angrily pushed another piece of paper at your desk, just like the first day of school, but with way more force. \n\n</memories>\nThe hell!\n--\n<reader>\nHello Cadence\n</reader>\n--\nDon't 'Hello Cadence' me. \n\nYou didn't meet me outside yesterday.\n--\n<reader>\nYeah. I don't want to skip class.\n</reader>\n--\nIt's really not that big of a deal.  You learn all this from reading the books anyways.  We're not even doing discussions yet.\n--\n<reader>\nI don't like skipping class \n</reader>\n--\n<memories>\nShe sighed. \"Fine. I guess...this was too much.\" she whispered.  She rested her chin on her hand, and lacksadaisically took notes.  \n\nThere was a gloom around her.  The energy from before - it was gone.  \n\nYou rolled your eyes this time.  She glanced at you - she was pouting.\n</memories>\n--\n<reader-character-writing>\nI wouldn't mind hanging out with you\n</reader>\n--\n<memories>\nYou could see her reaction after she read the note.\n\nShe beamed.   0 to 100 in a second flat. \n</memories>\n--\nFine - we'll meet outside during lunches\n\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n\n",
      "links": []
    },
    {
      "pid": 11,
      "name": "picture",
      "text": "March 18, 2010\n\nDear Friend\n\nWe have very different views of the world, don't we?\n\nYou're my protege, but sometimes I think I learn a lot more from you. \nBut you are nerd. Like a fucking nerd. You should know that. \n\nIn the face of noise, you seek calm.\nI scream. \n\nIn the face of danger, you plan.\nI charge. \n\nYour pictures- you find pretty things, beautiful things, happy things.  Your art is your happy place, the place you can run to when everything else is crashing around you.  You empty yourself into the abyss of beauty. \n\nMy writing is cathartic.  It hardly ever shows pretty things or wonderous things.  I keep those locked up in a special corner inside me.  No - I write out everything else.  The fear.  The dark. The confusion.  \n\nIn this painful world, all you want is to do good.\n\nIn the face of so much destruction, all I want to do is create. \n\nSincerely at 2AM, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 12,
      "name": "shot",
      "text": "July 6, 2011\n\nDear Coleman, \n\nI lost her. \n\nGabriella's gone. She's dead. \n\nI never thought...\nNothing seems real. \n\nAnd I can't even tell you\n\nA shot in the dark, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 13,
      "name": "apology",
      "text": "May 24, 2012\n\nDear [[Friend->friend]], \n\nIt sucks you had another bad week. I guess life's a bit of a bitch. I dunno - for now, there really isn't much of a solution.  But try and get some space, take some walks, take some pictures.  Let it out - maybe use the journal I got you?\n\nYou don't have to apologize for having a shitty week though.  It's legit not your fault.  \n \nThat's what this whole friendship thing is about, right? \n\nYou listen to my bullshit about how annoying people are. \n\nYou apologize a lot though, you know?  \n\nI mean, it makes sense.  I guess it makes things easier for you.  Gets you out of conflict.\n\nBut it's a powerful word, even if we aren't willing to admit it to ourselves.\n\nWhen you say it out of sympathy, you're really saying you're sorry you can't do more to help.  \n\nOr if in an elevator or the hall or the street, you're saying that you think you don't deserve that space as much as someone else.  Excuse me is just fine - you're asking them to move. \n\nAnd if you say it now, during a really rough time in your life, you're saying that you don't think you should talk about things.\n\nYou're a quiet person - but are you quiet because you don't have much to say, or because you don't think you can?\n\nI'm here,\n\nCadence\n\n",
      "links": [
        {
          "text": "Friend",
          "destination": {
            "name": "friend",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "told you",
      "text": "December 19, 2011\n\nDear Friend, \n\nI hate it. \n\nI hate how they try to hide things from me. Like I'm a child. Like I need to be coddled. \n\nThey say I'm too young, but by what measurement?  \nI don't know how long I'll be here.  So why the fuck measure me by an average person’s life?  If I die tomorrow, then today I've lived most of my life, which I more than these 30 something chickens can say. \n\nLying to me does not change jackshit. \n\nTelling me everything is fine, then going and telling my family that you don't know how long I have, or if x or y procedure is best yet…\n\nWe lie to our children. We tell them that babies come from storks and that alcohol is bad and pretend the world is perfect because adults can have smiles on their faces. But the longer we lie isn't just the longer a child can live in ignorant bliss. \n\nThe longer we lie is really a measurement of how much the crash to reality will hurt. \n\nIt's the cowards way out.\n\nAnd the most frustrating thing is, I guess I'm doing it too. We all do. \n\nGrowing up is really just learning how to [[lie]].\n\n[[Confused]],\nCadence\n",
      "links": [
        {
          "text": "lie",
          "destination": {
            "name": "lie",
            "pid": 15
          }
        },
        {
          "text": "Confused",
          "destination": {
            "name": "Confused",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "lie",
      "text": "January 1, 2012\n\nDear Coleman, \n\nConsider this my new years resolution.\n\nYet, I have no resolve to send this to you. \n\nThe lies I've told you: A reference guide.\n\n1.  The camp I go to every summer isn't really for \"developmentally challenged kids\".  It's a treatment center camp for children with terminal illnesses where we can \"have fun and not die!\" The idea is that it's hard for us to get close to other people, so like \"Yo, you all have deathly illnesses, that's a common factor, right?\" and then friendship.  \n\n2.  I've only actually skipped class once - the time I asked you to skip with me.  Most of the time, I'm at doctors appointments.  But at some point...I didn't want to deal with the questions.  So I started to pretend that I was really just skipping.  But I wouldn't get any of the consequences. \nI didn't even get detention for actually skipping.  She knew...but didn't say anything. Actually pisses me off a little, weirdly.\n\nBasically, I'm not a badass with lots of badass friends.  I'm a dumbass in a leather jacket with approximatley one friend. \n\n3. My friend.  The reason she didn't come back isn't because she got over her issues.\n\nShe didn't come back because she died. \n\nShe always said she couldn't stand the waiting.\n\nAbout to Punch a Wall, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 16,
      "name": "bitch",
      "text": "June 7, 2010\nDear Coleman, \n\nAs you know, I'm stuck in this goddamned [[camp]] again. \n\nI forgot how boring it was over here.  There's legit nothing to do here. \n\nThe people are the same every year, really.  I mean, a couple of newbs, and a couple people leave.  But really, they're all the same types. \n\nThe counselors always round us up in this introductory group, where we have to introduce ourselves, tell what's bothering us, what we like to do, whatever. \n\nAs if any of us give a shit.  \n\nAny of the ones who do give a shit are deluded. \n\nThere's a craft room, but it's full of crayons and coloring books and water colors for the young kids.\n\nA TV rec room.  They didn't really like my suggestion to watch Pulp Fiction.  Too \"Graphic\".\n\nBullshit\n\nThe girls are in gradeschool or all too ready to cause shitty drama.  Always gossipping or whispering about some shit or another.   I saw [[one]] try to rifle through my journal just for the lols - I threw one of my stress relief balls at her neck.\n\nThey work very well- I felt a lot less stressed. \n\nBut she's my roommate, so I might as well try to [[play nice]]. \n\nOh well.  Day 1 outta 80 down.\n\nFuck me, \nCadence",
      "links": [
        {
          "text": "camp",
          "destination": {
            "name": "camp",
            "pid": 21
          }
        },
        {
          "text": "one",
          "destination": {
            "name": "one",
            "pid": 19
          }
        },
        {
          "text": "play nice",
          "destination": {
            "name": "play nice",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "father",
      "text": "<memories>\nYou'd never seen a house that large before, not in person at least.  \n\nIt was a three story house. Their yard was more like a garden.  Something that green was rare in the desert. Most homes were landscaped with grainy rocks, and the occaisional island of grass. \n\nThe entire neighborhood was like that.  Each house unique in everything  besides their size.  \n\nCadence's house was made of stone.  Gray against the cerulean sky.  Like a castle without the regality.  \n\nThe door had stained glass.  Blues and purples and grays, twirling around in a mix of triangles and squares. \n\nShe answered the door, a bundle of energy, inviting you in. \n\nShe flippantly waved her hands.  The inside was even more ridiculous, but you doubt she noticed you fidgeting with your watch. The fidgeting was normal, the magnitude was not.  \n\nDinner.  The dining table felt as long as one of the school hallways. \nA deep red wooden table, a perfectly cut rectangle. \n\nYou counted twenty seats. \n\nCadence waltzed around the room, pulling out a chair.  \n\n\"My Guest?\" she flourished, sticking her tongue out at the end.  You took a second to guess that she wanted you to sit down. You almost tripped into the chair as you shuffled over. \n\nWithout looking, she slipped herself into a chair across from you.  Her grace had a nonchalant bitterness to it.  \n\nHer father came into the room a moment later. He had a wiry frame, trapped inside a fitted gray suit and a white button up underneath.  He was thin, sharp.  \n\nHe talked to you.  A series of questions. \n\n\"How are you?\"\n\n\"What do you want to do? When you grow up, that is?\"\n\n\"What do you like to do in your free time?\"\n\n[[\"Where do you live?\"]]\n\n\"Does Cadence give you much trouble?\" A roll of the eyes. \n\n\"You seem like a nice kid.  She needs that.\" \n\nHis voice was deep, but bordered on a monotone.  His gaze felt like knives poking at the side of your head as you numbly nod your head.  Trembling. \n\nCadence rallied.  For the sharpness on the left side of you, in front of you there was the biting airiness of snark. It seemed overplayed.\n\nIt was one of the most awkward dinners of your life - and that was really saying something, for you at least. It lasted about an hour. \n\nAll you could do is nod and [[whisper]]. \n\nShe walked you out, just as she walked you in.  She rambled about a million and two things, excited.\n\nShe said most of the kids around here went to a private school nearby. It was closer than the public school you both went to, but she stated confidently \"there's no way that place could handle me.\"  \n\nYou nodded, just as you normally do. \n\nTurning your head, you could see her father, standing at one of the house's pillars (it even had fucking pillars - they looked Greek).  He seemed to smile at you.  \n\nBack where you began, in the frame of the door. \n\nYou hugged her.  She held on a little longer than you expected. \n\n[[\"Goodbye\"]]\n\n\"See you later, Cadence.\"\n\n</memories>\n",
      "links": [
        {
          "text": "\"Where do you live?\"",
          "destination": {
            "name": "\"Where do you live?\"",
            "pid": 22
          }
        },
        {
          "text": "whisper",
          "destination": {
            "name": "whisper",
            "pid": 23
          }
        },
        {
          "text": "\"Goodbye\"",
          "destination": {
            "name": "\"Goodbye\"",
            "pid": 24
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "found out everything",
      "text": "\n<obituary>\nIn Loving Memory\n\nCadence Hughes \nFifteen Years Old   \nLas Vegas\nJuly 27, 2012\nChronic Lymphadic Leukemia \n\nCadence was born on September 9, 1996 in the middle of Green Valley, in the Palms neighborhood, to proud parents, Victor and Talia.  She had a strong spirit, determined.  Despite difficulties in attending class due to appointments and check ups, she pushed on and received A’s and B’s in her classes.  She loved to write, and her parents attest that she could spend hours in her room, blasting music and crafting sonnets.  \nHer friends know her for her charm, her energy, and her impeccable sense of sarcasm.  She drew people in with her warmth.  She was [[adventurous]], attending concerts and operas and [[museums]] in her spare time.  She will be deeply missed by her family, her friends, and her community in Palms. \nThe service will be held on August 10th from 12:30 pm to 4:00 pm at the Linden Church. The Davidson Memorial Services will be organizing the service.  \nCondolences may be offered at 5434 Kenai Street.  \n “Heard melodies are sweet, but those unheard are sweeter.” - Keats\n</obituary>",
      "links": [
        {
          "text": "adventurous",
          "destination": {
            "name": "adventurous",
            "pid": 28
          }
        },
        {
          "text": "museums",
          "destination": {
            "name": "museums",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "one",
      "text": "June 8, 2010\n\nDear Protege, \n\nI'm going to learn you something.  Right here, right now. \n\nI'm not one for petty drama.  It's a waste of my goddamn time.\n\nSo if someone decides \"Let's rifle through my roommate's bags for shit to make fun of\", I reach high levels of fuck-no.  \n\nThe answer, though, isn't revenge.  Revenge becomes this downward spiral of two people shitting on eachother, and nothing is accomplished.  You both leave at the end of the day thinking the other is a bitch. \n\nThe answer isn't going behind someone's back and finding gossip or whatever it is people do. \n\nDirectness is key.\n\nSo, I told her, directly - \"Touch my shit again, you asshole\"\n\nThen I invited her to sit with me at dinner.  Because then, after you set boundaries, I prefer to kill with kindness. Then shit doesn't escalate.\n\nBout a 68 percent success rate.\n\nSide effects may include:\n1. Strange looks.\n\n2.  Actual assholes continuing to be assholes, and at that point, you just find a way to tap out.  Sometimes, you just can't fix stupid. \n\n3. Punches.\n\n4. Best friends. \n\nHer name's Gabriella, and she seems pretty cool so far.  It's not her first time at one of these camps, but her first time at San Jose location.  \n\nTonight, we're sneaking out to look at the stars.  There's this really cool dried up lake that's covered in weeds that apparently you can see all of the star. \n\n\nGlad today fell in the 68% range,\n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 20,
      "name": "Confused",
      "text": "February 22, 2011\n\nHey Dear, \n\nMissed you today in class.  I heard you weren't feeling well - I hope you feel better soon.  \n\nUsually, I'm the one ditching. \n\nIt was empty without you there.  I couldn't distract myself from learning matrices.  Boring as all hell. \n\nIdk. It was weird. \n\nFeel Better and Save Me From This Class, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 21,
      "name": "camp",
      "text": "May 26, 2009\n\nDear Coleman, \n\nI'm not going to be able to hang out with you over the summer.  Not until like August that is.  \n\nWhich fucking sucks, because that Oliver Wilde in the Park shit looked awesome.\n\nBut...every summer, I go to this camp.  for \"Developmentally Challenged Children.\"\n\nThey stick us all in a college dorm (because let's put the \"challenged kids next to all the frat bro's and their mar-a-ja-wannas\"), and we sit around for 80 days.\n\nWe do \"Group exercises\" and \"Bonding Adventures\" and watch a shit ton of movies.\n\nSo basically, we sit around in circles, spew bullshit about our feelings, then go throw rocks at some beach or whatever. \n\nHonestly, I think they're strategy of \"reforming\" people lies more in the \"I never want to go to this goddamned place again\" and less in the \"bonding and helping people come together\"\n\n\nDon't wanna deal with this shit, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 22,
      "name": "\"Where do you live?\"",
      "text": "September 27, 2009\n\nDear Protege, \n\nThanks for letting me crash your place yesterday.  That was so much fun.\n\nI like your apartment.  I've never actually been in one.  Your view is great.  And everything's quaint, cute almost. \n\nRidiculous to find though. Everything looks the fucking same, man, and there are like, three apartments mixed into one building sometimes. I have no idea how you don't get lost half the time. \n\nYour music selection is crazy.  I've never seen that much classical rock in any place other than a library.  I guess it helps when things get intense around your place, huh? \n\nYou should come to my place again next weekend - let's see if my selection compares to yours. \n\nBack in Black, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 23,
      "name": "whisper",
      "text": "January 3, 2010\nDear Coleman, \n\nYou said you wanted to see my [[writing]].\n\nSo here goes. \n\n\nWhispers:\n\nPrepare for the bullets and the bombs.  Pin is pulled, but the detonation delayed.  I carry a shield across my heart.  \n\nExplosions knock us back, but we always stand up in the wreckage.  We live by Murphy's law.  We prepare for the \"Fuck yous\" and the screams and lost jobs and the reports and the deadlines.\n\nIt's the little things we forget.  The stares burn slowly through our armor. Whispers float around, wisps sneaking past our defenses.  Cutting at our hearts. Judgements. Smirks. Gossip. Words. Crawling under our skin, rotting from the inside out. \n\nThe discomfort is normal.  Yet it makes you feel weaker than you are.\n\n\"Are you really wearing that?\"\n\"Oh come on-\"\n\"You didn't-\"\n\"Oh honey-\"\n\"She's a little...you know-\"\n\nLittle words and little questions ram against us, rain against mountains, [[weathering]]. \n\nWe build up walls and walls and walls, but never see how they're doomed to crumble down.  \n\n\n\nTired, \nCadence",
      "links": [
        {
          "text": "writing",
          "destination": {
            "name": "writing",
            "pid": 26
          }
        },
        {
          "text": "weathering",
          "destination": {
            "name": "weathering",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "\"Goodbye\"",
      "text": "May 10, 2012\n\nHey Dear, \n\nI'm sure you've already figured this out, but I'm kinda tunnel visioned.  I don't really see outside of my own perspective I guess.\n\nI've hurt a lot of people from this.\n\nI've probably hurt you a number of times. Dear god, I'm sorry. \n\nI get caught up though.  In anger, in happiness, in guilt, in whatever.  And I forget everything I have, and I forget the people near me and how they feel.\n\nI was a complete bitch when I went over to your house the first time.  I still reel over the shit I said.  And yet you took it all. You were so patient, even as I was shitting on your fucking home.  \n\nOne day, I'm going to die. I can accept that. CLL is rare in kids.  But it happens, apparently.  I'm at stage one right now, but I could jump up a stage at any minute if I do the wrong treatment. How I've hid it, I really don't know. I frequently get sick. Maybe all the pills I've got hidden at the bottom of my backpack.\n\nAnd it's really hard to see this, sometimes, but I am lucky. In a weird way.  And it hurts to say so.  But both my parents have great jobs - we have so many resources.  The reason I'm not in private school is because I'd fall way behind with how much school I miss.  I have access to doctors and appointments and experimental treatments and I can go to a fancy treatment center every summer, even if I shit on it all the time, it's a blessing.  \n\nIf we had less, I could have already been dead. \n\nI have parents who put as much time and effort into me, just me, as possible, even when everything else in their lives seems to be falling apart.  As if they're putting their lives on hold until the final beep blares from a monitor. \n\nAnd that's hard to accept.  I know it's because they care, but I can't help but feel responsible.  And half the time, I don't even notice how they try, because of my tunnel vision.  Whenever I remember again, it sucks. \n\nIt hurts to see their exhausted eyes.  And their sad smiles after leaving the doctors office.  As if they're trying to be brave for me.\n\nI can accept the fact that I will be dead, possibly soon. \n\nI can't accept this pain now though.  I can't accept seeing their broken hearts.  \n\nI can't imagine seeing yours. \n\nI know how Gabriella felt.  She was more frustrated than I was- her family has a lot, lot less than mine, and yet she was at all the same places I was.  Same treatment center over the summer. Even more experimental drugs and trials.  Homeschooled to give her more flexibility in doctors appointments and treatments.\n\nAnd she put a brave smile for me too, in the end.  I knew the look all too well.  The softened eyes, the slouched shoulders, the sympathetic hand on my back, and the small corners upturned at the edges of their lips.  \n\nAnd then they all say, \"I love you.\"\n\nIt took me a while, but if I've learned anything about this world, it's that \"I love you\" really means \"Goodbye\". \n\n\nI'm so sorry, \n\nCadence. \n\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 25,
      "name": "weathering",
      "text": "April 7, 2010\n\nDear Friend,\n\nStorms\nby Cadence Hughs \n\nPeople are always talking about the calm before the storm.  \nI'm not really sure they're using the right words. \nIt seems like it really should be the \"normal\" before the storm - but when we're experiencing the \"normal\", it doesn't seem calm. \n\nIt's only after the storm we feel it was calm.  Calm by comparision. \n\nThere are many different types of storms.\n\nSome storms you weather, and you make it through fine. You're hurt, sure, but you rebuild.  More grateful for the normals.\n\nOthers - they leave nothing but wreckage and shock.  Silence. \n \nI've been in ones where you sit in the eye, watching the world fall apart with a cold emptiness.  The instant you reach out, though, you're swept into the chaos. \n\nBut there's the storm I feel now. \n\nI hear the reports and I know the range of dates and the magnitude, but not the specific time.\n\nAll I have is an empty anticipation.\nA buzz, hidden under my nerves. \nAs I sit here and wait. \n\n\nWhaddya think?  I hope it can get into the Catachresis Journal. \n\nExcited and Nervous and Hot Damn I should Tear This Up, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 26,
      "name": "writing",
      "text": "August 17, 2010\n\nHey Friend, \n\nSo I wrote another poem.  \n\nGod this place is boring.\n\nI shouldn't be sending this to you.  Not now. I know it's selfish. \n\nBut I need a voice here Coleman.   Even if its mine shouting silently into this piece of paper. \n\nThis place is even grayer now that she's left. \n\n\nHere it is: \n\nLoud, vibrant, crazy, fun.\nAdventure and light wrapped up into one. \nEye rolls and eyebrows raised\nA bitter smile to end all days\n\nTalking to her is heartbreak\n\tThis constant grieving, a crack every time I open my mouth\n\tOpen up but never see in   \nWarmth on the outside, an addicting charisma\nand a broken glass bottle hidden under the floor panel\n\nQuestion.  \nThe 3am chats and the tears and the words written across LCD screens and etched into trees\nQuestion. \nThe smile and the bubbly hugs and the screams and all the nearly forgotten memories\nQuestion. \nThe dividing lines between the truth and the lies.  Who is she and Who am I\n\n\nTorn, tattered, and scattered, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 27,
      "name": "museums",
      "text": "<memories>\nYou remember going to the museum with her. \n \nIt was sometime during winter break of freshman year. \n\nIt was the Museum of Fine Arts at the edge of the city.  Three stories with 25 different exhibits.\n\nCadence wasn't much of an art person.  She point blank said \"What's the point of going to a museum if you can see all the images on google?\"\n\nBut today was just for you she said.  \n\nDespite rolling her eyes at first, she was a buzz of energy once you walked in. \n\n\"Look! That one has a dog in it.  It's trying to be all scary lookin'\"\n\n\"Wow, they really had a thing for red cheeks huh.  And fuck tons of corsets\"\n\n\"Look! This dagger is based off Shakespeare! SHAKESPEARE!\"\n\n\"I swear, it looks like a pancake.\"\n\nYou laughed at her a little bit, and for the most part, watched over her as you took her to your favorite exhibits - the Impressionists, the Landscape Exhibit, the Ancient Instruments Exhibit.  She flowed and buzzed, a bee following honey, as you dragged her to new sights and horizons.  You appreciated the newfound excitement.  The peaches ans the pinks and the blues and the reds- the colors mixing and twirling and tumbling - they were home to you. A place you had explored every inch of intensely.  To her, every brush stroke was a new opportunity. \n\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n\n</memories>",
      "links": []
    },
    {
      "pid": 28,
      "name": "adventurous",
      "text": "August 8, 2010\n\nDear Coleman, \n\nI've got this shit all planned out.  I'm coming home soon.  \n\nWhich means, we gonna light this bitch up.  One week before school starts.\n\nItenary (Tentatively not tentative):\n\nMonday:  Fireworks at my house.  Because this dumbass camp wouldn't listen when I said sparklers was all I needed to light up my day, or anyone elses. Literally.\n\nTuesday:  Watch Inception matinee at the Drive in Theater. See if we can stick around shadily for another movie.  \n\nWednesday:  Doctor Who marathon - I can't believe you haven't watched this.\n\nThursday: Twelfth Night is playing at the community college. We're watching it.  There's no way you're getting out of Shakespeare this time. You will be educated, my dear protege. \n\nSo that's at night.  So before that, I think we'll go to Town square and walk around.  \n\nFriday:  This is your day - you can choose whatever you want to do.\n\n\nExcited to get out of this hell hole, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 29,
      "name": "kept the rest of these",
      "text": "<memories>\nYou gulped.  She was wrong.  You kept a lot of them, sure.  But lots of others have been lost - in cleaning up, in being swept up, from rain or just not thinking some notes were important.  You kept a ton of shit, sure, but you were no hoarder. \n\nIn an hour, your room went from a ridiculously organized place (you were generally very particular about these things) to a goddamned mess.  Scrambling for any piece of paper you could clasp your shaking hands on. \n</memories>\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 30,
      "name": "play nice",
      "text": "July 9, 2010\n\nDear Coleman, \n\nToday, Gabriella and I have taken the world by storm.  \n\nWell, by cracker jacks at least. \n\nThe Dodgers were playing today, about ten miles off from the camp.  \n\nGabriella's a huge fan of guys throwing balls around apparently, so we snuck in.  \n\nIt was beautiful, honestly, how we did it.   The camp was on another one of our \"Group Adventures!\" into town.  They were going to watch some CGI movie bullshit. \n\nNot us.\n\nRight after the lights went out in the theater, Gabriella \"went to the bathroom\".  I followed suit about 10 minutes into some of the commercials. \n\nWe both sat at the edge fo the rows so no one would really remember having to move their legs for somebody scrambling through the rows. \n\nI had some extra cash on me, and with some of my wonderous flirtation, I got the ticketeer to let me in.  \n\nTheir number, by the way, is 521-544-9684. \n\nI didn't care much for the game itself, but damn I've never had a pretzel that good before. The pretzel of rebellion.  Gabriella was fucking nuts though.  She screamed her head off.  I've never seen anyone that excited. \n\nWe looked up the run time of the movie before hand, and we showed up 20 minutes before the movie ended and caught the after credits scene.  \n\nNo one questioned a damned thing.\n\nVictorious, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    },
    {
      "pid": 31,
      "name": "words",
      "text": "June 28, 2011\n\nDear Coleman, \n\nGabriella left camp early this year.  You know - my roommmate from last year's session of camp who I've been messaging this year.  She's \"graduated\" I guess, from the program.  They bought her bullshit. \n\nShe's free, I guess. \n\nNow there is legit nothing to do here. \n\nIt's a lot quieter without her rambling about the nature of words or whatever meta bullshit she gets into. \n\nUgh, \n\nCadence\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n\n",
      "links": []
    },
    {
      "pid": 32,
      "name": "Love",
      "text": "June 13, 2012\n\nDear Coleman, \n\nI talk so much, yet I know I don't really say anything at all.  \n\nI'm not dead yet.  That's a plus.\n\nI'm not really alive either.  I don't feel like I'm living.\n\nIt feels weird, going to school, getting grades, meeting people.  I'm pretending, in this little bubble, that I know there will be a tomorrow.\n\nBut I never know.  \n\nAnd yet, there's this little voice in the back of my mind, telling me to not waste my time thinking I don't have any left. Because there's that small chance I could make it.  \n\nYou know me more than anyone else. But you don't know me at all, not really.  And that's not your fault. \n\nI show you an image.  The hyper, anti-establishment writer. \n\tNever the contradicitons.  Opened a window, never a door. \n\nBut I showed you my poetry - as if that was ever enough.  Giving you glimmers of truth, but with no context. Feelings, never the facts.  \n\nI write so I can say the truth without saying anything at all. \n\nBut for once, I'm going to be real. \n\nI love you.\n\nThank you, \n\nCadence \n\n\n(link:\"Start Over\")[(gotoURL:\"Letters.html\")]\n",
      "links": []
    }
  ]
}