{
  "passages": [
    {
      "pid": 1,
      "name": "beginning",
      "text": "I've never had the best grasp on the passage of time--maybe I don't want to know the specifics; so many details are still as fresh as if they were happening before me while others have vanished completely, things that seem like they should be important--but I suppose it's been about ten years. What I know about your past decade (thanks [[<span style=\"color: #4083ff;\">Facebook</span>->Facebook]]): you knocked up your girlfriend not too long after high school, and she had your son. She dumped you, and for a while you seriously entertained the thought of winning her back, but it never happened, and you moved on, or so it seems. You met someone new. The two of you are raising your son together. You have a home, I mean a house, and a nice one if the pictures are to be believed. \n\nYou seem happy.\n\nAnd it's not that I'm not. I don't need to be dwelling on this. I'm not sitting at my desk with a bottle of gin and crying over what could have (could it have?) been. It's just that it all felt so [[<span style=\"color: #4083ff;\">intense</span>->intense]] back then. Those feelings were such a huge part of my life for a while. Eventually they faded, but nothing that big ever fades completely. It was years I was hung up on you. On occasion I'll think about it and yeah, I do wonder. If I had been [[<span style=\"color: #4083ff;\">brave</span>->brave]], what would have changed?",
      "links": [
        {
          "text": "<span style=\"color: #4083ff;\">Facebook</span>",
          "destination": {
            "name": "Facebook",
            "pid": 2
          }
        },
        {
          "text": "<span style=\"color: #4083ff;\">intense</span>",
          "destination": {
            "name": "intense",
            "pid": 3
          }
        },
        {
          "text": "<span style=\"color: #4083ff;\">brave</span>",
          "destination": {
            "name": "brave",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "Facebook",
      "text": "Scrolling through these pictures is bizarre. I can still see parts of what I was attracted to back then, but my feelings now fluctuate from picture to picture. In one you're dressed in a suit, handsome as hell, and I can see the mature man you became, and in another your hair is dyed and you wear a chain around your neck and I can only cringe at what I imagine that says about your personality now. Your shitty goatees, your fashion choices good and bad, I pass over and judge in seconds what took you years to get through. But it's still nice to see you [[<span style=\"color: #3dc3eb;\">smile</span>->beginning]].",
      "links": [
        {
          "text": "<span style=\"color: #3dc3eb;\">smile</span>",
          "destination": {
            "name": "beginning",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "intense",
      "text": "Excerpt from a journal entry, May 19, 2008\n\n//I've been thinking, and I know I do too much of that already, but this is kind of important. I keep imagining what it might be like to be with Billy, or even just to have him say he feels the same way about me that I do about him. Even just as daydreams, it feels so good! I would really give anything to have that feeling for real.\n\nOn the other end of the spectrum, what if he were to reject me? I've tried to avoid imagining that, because... it hurts. It makes me want to cry. I'm almost crying right now just writing this. It's true that I would give anything to feel Billy's love, but I'd also do anything to avoid the feeling of rejection, and those two desires are in conflict with each other.\n\nEven if I don't end up telling him how I feel, I want to be close to him. Because too much distance from him for too long and I start to go insane. Take last summer for example, or even spring break. My feelings are so much more [[<span style=\"color: #3dc3eb;\">intense</span>->beginning]] than last year, I don't think I can survive the whole summer away from him this time.//",
      "links": [
        {
          "text": "<span style=\"color: #3dc3eb;\">intense</span>",
          "destination": {
            "name": "beginning",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "brave",
      "text": "Tracking you down wasn't hard. The picture of your new house has the number in white by the door, and Red Deer isn't that big. I could never have asked [[<span style=\"color: #4083ff;\">back then</span>->back then]], but now it has no consequence. We haven't spoken in a decade, and we don't run in the same circles. We're both in happy relationships, so whatever you say will simply settle a 'what if' so I can stop thinking about it. I can be like a spectre, in and out, something you mention once to your family over dinner. \"An old friend came to see me today.\" That's all.\n\nDuring one of my few visits to my parents, I find a moment to slip away. It is a Monday morning, when your kid should be at school and your girlfriend at her office job. I don't know your schedule, so I'm taking it on faith that you'll be there. I feel like you will be.\n\nIt's cold, and it's starting to snow. The walk through the city reminds me of those [[<span style=\"color: #4083ff;\">cold school years</span>->cold school years]], and you're in every memory. If you're not the star then you're in the background, somewhere, maybe just around a corner. If you're not there at all then I'm thinking of you. My feelings follow me [[<span style=\"color: #4083ff;\">wherever I go</span>->wherever I went]].",
      "links": [
        {
          "text": "<span style=\"color: #4083ff;\">back then</span>",
          "destination": {
            "name": "back then",
            "pid": 5
          }
        },
        {
          "text": "<span style=\"color: #4083ff;\">cold school years</span>",
          "destination": {
            "name": "cold school years",
            "pid": 6
          }
        },
        {
          "text": "<span style=\"color: #4083ff;\">wherever I go</span>",
          "destination": {
            "name": "wherever I went",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "back then",
      "text": "I almost did, once.\n\nI fancied myself a writer even then, but at that point it was just [[<span style=\"color: #3dc3eb;\">shitty poetry</span>->shitty poetry]], and it was all, all about you. It was too hard to say the words aloud, even to myself, alone, so I thought my poems could do the talking for me.\n\nWe both went up the same hill to walk home before you turned straight up the steep incline and I followed the path through to the main road. There was a wooden viewing platform looking out over downtown, and we met there sometimes. That day I waited for you, a folder full of poems clutched in my arms.\n\nWhen you arrived, you lingered a while, but I could barely speak. I was sure you could feel the tension, could tell what was on my mind, so I told myself there was no point in holding out any longer. Still, I had second, third, fourth thoughts, and in the end I let you pass by. \n\nI cursed myself as a [[<span style=\"color: #3dc3eb;\">coward</span>->brave]].",
      "links": [
        {
          "text": "<span style=\"color: #3dc3eb;\">shitty poetry</span>",
          "destination": {
            "name": "shitty poetry",
            "pid": 8
          }
        },
        {
          "text": "<span style=\"color: #3dc3eb;\">coward</span>",
          "destination": {
            "name": "brave",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "cold school years",
      "text": "We were in gym class together, as well as recreational education, which was like gym lite. We were always going somewhere, for bowling or curling or something else, and now there are all these pockets of memory, of places I only went once, and only with you.\n\nI remember we went to the indoor soccer court, and we were on the same team. You were a pretty sports-oriented guy, and I wasn't. My fear of getting a ball in the face overrode any desire to succeed, but I knew that wouldn't fly with you, so that day I actually tried. I put myself in the fray, and tried my best to get the ball and score with it. I played well because I wanted to impress you.\n\nI don't think you [[<span style=\"color: #3dc3eb;\">noticed</span>->brave]].",
      "links": [
        {
          "text": "<span style=\"color: #3dc3eb;\">noticed</span>",
          "destination": {
            "name": "brave",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "wherever I went",
      "text": "It never takes long to get anywhere in Red Deer, and soon enough I'm in front of your house. It really is nice. It's classic in style with a bit of a modern red flair. There's a tree out front.\n\nNow that I'm here I feel that old cowardice coming back. I could always turn back, return to my parents' house and retreat into a book, instead of closing this gap. Even though it doesn't matter. Even though there are no possible consequences. \n\nI make myself walk up to your door and ring your doorbell. I hear it resound throughout the house. For a moment there's silence and I think maybe you're not home, and I can walk away without feeling guilty. But then your footsteps, and the door, and there you are.\n\n\"Can I help you?\" you say, and though your voice is deeper now I can still hear the same lilt. You've come to the door in jeans and a plain blue t-shirt and you're clean shaven. Your cheeks are slightly red, your permanent blush. What the pictures didn't tell me is that you got tall.\n\n\"Hey, Bill. Billy. It's, um, Michael. We went to middle school together. I don't know if you remember me. I know [[<span style=\"color: #4083ff;\">I look pretty different now</span>->I look pretty different now]].\"\n\nIn the moments when you are scrutinizing my now bearded face, I try to decide what I actually want: for you to [[<span style=\"color: #4083ff;\">remember me</span>->remember me]] fully, vividly, as vividly as I remember you, and to know the truth, or [[<span style=\"color: #4083ff;\">not to remember me</span>->not to remember me]] at all.",
      "links": [
        {
          "text": "<span style=\"color: #4083ff;\">I look pretty different now</span>",
          "destination": {
            "name": "I look pretty different now",
            "pid": 9
          }
        },
        {
          "text": "<span style=\"color: #4083ff;\">remember me</span>",
          "destination": {
            "name": "remember me",
            "pid": 10
          }
        },
        {
          "text": "<span style=\"color: #4083ff;\">not to remember me</span>",
          "destination": {
            "name": "not to remember me",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "shitty poetry",
      "text": "<span>A prime example of the garbage I wrote back then:</span>\n\n<span>graphite scrawls</span>\n<span>on paper walls</span>\n<span>get me out of here</span>\n<span>please, let me free</span>\n\n<span>every scream</span>\n<span>they all seem</span>\n<span>to be sent back</span>\n<span>magnified, mocking</span>\n\n<span>going insane</span>\n<span>can't stand this pain</span>\n<span>but this is what i get</span>\n<span>for [[<span style=\"color: #3dc3eb;\">loving you</span>->back then]]</span>",
      "links": [
        {
          "text": "<span style=\"color: #3dc3eb;\">loving you</span>",
          "destination": {
            "name": "back then",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "I look pretty different now",
      "text": "Middle school was the height of my anime phase, which included going to conventions in costume, even though preparing these costumes was often a huge money sink that I regretted when no one recognized me. Still I persisted, perhaps because I desperately longed for some sense of community, somewhere, to fight back my crippling loneliness.\n\nFor one costume I decided on a character named Firo, an immortal gangster. His green suit and hat were easy enough to find at Value Village, but Firo has light hair, and my naturally black hair wouldn't cut it. So I decided to dye my hair blond. I deluded myself into thinking it would look good and would be a fun new look for me even after the convention. But it was a cheap dye and it turned out terribly. My hair was the colour of straw and I was ashamed to be seen, which unfortunately was not a valid reason to skip school.\n\nStill, I held out hope that you would like it. When I walked past you that day, you stared at me the whole time and smiled. I didn't know if you thought it looked [[<span style=\"color: #3dc3eb;\">good or just funny</span>->wherever I went]].",
      "links": [
        {
          "text": "<span style=\"color: #3dc3eb;\">good or just funny</span>",
          "destination": {
            "name": "wherever I went",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "remember me",
      "text": "Your eyes light up with recognition. \"Michael, wow, it's been forever!\" I can see you searching for the correct act of physical affection for the circumstance. Surely not a hug, we were never that close. In the end we awkwardly shake hands. \"Come in, come in,\" you say. You usher me inside. I take off my shoes and coat at the front closet and follow you to the living room, where you seat me on the sleek black couch in almost perfect condition. You take the loveseat at an angle to me.\n\n\"So fill me in,\" you say. \"What have you been up to for the past decade?\"\n\nI do fill you in, telling you about school and jobs. I leave out my relationships, I don't know why. I've been out for years, but something about talking to someone from when I was still in the closet makes the words catch in my throat. All in due time, I think.\n\nYou fill me in as well, and I act interested though little is new to me. Like many in these parts, you work in the oil fields, a few days on, a few days off. I was lucky to catch you at a good time. \n\n\"So what brings you to my door after all this time?\" you ask. I suppose [[<span style=\"color: #4083ff;\">it's unavoidable now</span>->it's unavoidable now]].",
      "links": [
        {
          "text": "<span style=\"color: #4083ff;\">it's unavoidable now</span>",
          "destination": {
            "name": "it's unavoidable now",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "not to remember me",
      "text": "You click your tongue and say, \"Sorry man, doesn't ring a bell.\" I'm both disappointed and relieved. \n\n\"Well, I guess that answers my question,\" I say, and I try to laugh in a way that says none of this was a big deal anyway. \n\nYou're hovering with your mouth slightly open, like maybe there's still something you can help me with but you don't know how to say so. It's good to see you're still kind.\n\n\"Don't worry about it,\" I say, and start backing off. \"It was nice to see you again. Even if you don't remember me.\"\n\n\"I'm sorry,\" you repeat, but I wave it away with my hand and pass on.\n\nAnd with that, the past is in the past. I'm surprised to realize that part of me wanted you to say you loved me then and you love me now, even after all these years, even though neither of us is in a position to act. Perhaps it's the remnants of my younger self, still silently begging, please like me, please like me, please like me. \n\nThat's the undercurrent of all my memories of you. The begging, the pleading, in every look I gave you and then turned away from when you'd catch me. I never said the words though I never stopped asking, and all my anguish came down to not knowing. Did you like me? Could you, even? Or would it only work if I was a girl? Would you recoil in disgust if I put out my hand or showed you my heart? How would I know?\n\nWell, now I know.",
      "links": []
    },
    {
      "pid": 12,
      "name": "it's unavoidable now",
      "text": "\"I had a question,\" I say. \"About back then,\" I add. As I try to work through the words, I realize I should have rehearsed (as if I haven't thought about this a thousand times. The real thing is always harder than you think it will be). I'm looking at my hands on my lap.\n\n\"Now, you have to remember that this was a long time ago,\" I start, \"but basically, while we were in school together I was completely in love with you.\" I fight the urge to correct myself. It would be easy enough to brush it off as a crush, but with the amount of pain I went through every day, to call it less than love seems like a disservice to my past self. \n\n\"It was torture,\" I say, to myself as much as you. \"I was constantly in anguish, just wanting to see you, but seeing you never helped because then it was the sorrow of not being able to tell you how I felt. I never knew if you would make fun of me, or tell everyone else at school. But looking back, it consumed me to the point that I don't know how people didn't notice. I feel like I was [[<span style=\"color: #4083ff;\">so obvious</span>->so obvious]]. So I guess what I'm asking is, was I? Obvious, I mean? Did you know?\"\n\nI'm sweating now. I try to remind myself that there are no stakes. It was forever ago. [[<span style=\"color: #4083ff;\">It doesn't matter anymore</span>->It doesn't matter anymore]].",
      "links": [
        {
          "text": "<span style=\"color: #4083ff;\">so obvious</span>",
          "destination": {
            "name": "so obvious",
            "pid": 13
          }
        },
        {
          "text": "<span style=\"color: #4083ff;\">It doesn't matter anymore</span>",
          "destination": {
            "name": "It doesn't matter anymore",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "so obvious",
      "text": "My strongest, and best, memory of you is mostly removed from time. I know we were at school. There were other people around. Perhaps we were in class, or just lounging around before school started, or after it ended. None of those details matter.\n\nI remember looking at you, as I often did. I did it as often as I could, in fact, whenever I could get away with it. I just liked looking at you. This was usually a candid act, but this time you looked back, and smiled.\n\nGod, your smile was so infectious. If there's one real, logical reason I can come up with to explain why I felt the way I did, it was because you were always so happy, and you made others happy wherever you went. You made me happy too, even in my misery.\n\nI saw your smile and smiled back, not as a greeting or a courtesy, but genuinely, because I loved your smile. Abashed, I looked away, then looked back. You were still smiling at me. So I kept smiling at you. We just looked at each other, silent, happy in our shared moment. From the outside it could only have looked like two people in love. \n\nMaybe the rest of it was just me chasing that feeling. I've rarely felt such [[<span style=\"color: #3dc3eb;\">pure joy</span>->it's unavoidable now]]. ",
      "links": [
        {
          "text": "<span style=\"color: #3dc3eb;\">pure joy</span>",
          "destination": {
            "name": "it's unavoidable now",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "It doesn't matter anymore",
      "text": "\"I did,\" you say finally. I look at you and you're smiling. \"You're right, you were really obvious. You couldn't stop staring at me.\"\n\n\"I suspected as much,\" I say. Now that it's out there I feel embarrassed more than anything. \"How come you never said anything? It would have saved me a lot of grief.\"\n\n\"It wasn't mine to confess,\" you say.\n\nOf course you're right. Sorting out my feelings was only ever my responsibility. But does that mean things had to go the way they did? I was doomed to spend those years wanting to kill myself in silence because I knew, or thought I knew, I would never find love?\n\n\"What would you have said?\" I ask. \"If I did confess? If I went up to you in eighth grade and told you I was in love with you, what would you have said?\"\n\n\"Hey, I'm not gay,\" you say. It's a kneejerk response I should have seen coming.\n\n\"I know,\" I say. A silence falls over us. I don't know what else I can say. I start to think I should just leave, but I look at you to say so and you're trembling.\n\n\"I'm sorry,\" you say, quiet. \"My therapist says I should be more honest with my feelings.\" This is the first real surprise of the day: you have a therapist. I know you've seen pain in the years since we went to different high schools. Maybe you needed the help I never asked for.\n\n\"The truth is, I did think about what I would do if you ever said it. Sometimes I wanted to tell my brother and our friends, which is shitty and a jerk move but we were in middle school. Everyone was kind of a jerk then, [[<span style=\"color: #4083ff;\">even you</span>->even you]]. Sometimes I thought I would let you down gently. And sometimes I thought I might kiss you, [[<span style=\"color: #4083ff;\">just to see how it felt</span>->just to see how it felt]].\"",
      "links": [
        {
          "text": "<span style=\"color: #4083ff;\">even you</span>",
          "destination": {
            "name": "even you",
            "pid": 15
          }
        },
        {
          "text": "<span style=\"color: #4083ff;\">just to see how it felt</span>",
          "destination": {
            "name": "just to see how it felt",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "even you",
      "text": "I thought everyone was out to get me sometimes. I would avoid interactions because I knew they wouldn't end well. If someone tried to talk to me and I didn't want to converse, I didn't hesitate to tell them to kill themselves. What I was really doing was taking my anger out on them. I was mad at myself, at my life, at being gay and afraid, so I hated myself and I hated everyone else.\n\nBut I never said those things to you. I never wanted you to think I was [[<span style=\"color: #3dc3eb;\">cruel</span>->It doesn't matter anymore]].",
      "links": [
        {
          "text": "<span style=\"color: #3dc3eb;\">cruel</span>",
          "destination": {
            "name": "It doesn't matter anymore",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "just to see how it felt",
      "text": "My heart drops. If things had gone the way you imagined them, the way I imagined them so many times, you would have been my first kiss. I suddenly, desperately wish you had been.\n\n\"You mean that?\" I ask. The way you're looking at me, I can tell you do. \n\n\"I've always sort of wondered,\" you say. The gravity of what you've said seems to be pulling us together, inch by inch. It almost seems like we really could kiss, all these years later, except that it's too late. I have someone else. I know I'll have to stop, but part of me wants to get as close as possible, to wait until the last possible second before pulling away.\n\nBefore I can, you sit back on the loveseat and stare at the ceiling, your fists clenched. \"My girlfriend,\" you say.\n\n\"I know,\" I say. There's nothing else to be done, so I move to leave. I put my shoes and coat back on and drop a quick \"Thanks\" before exiting your home. \n\nOn the walk back to my parents' place I try to keep my thoughts blank, but soon enough one comes to me anyways: I wish I'd told you earlier. But of course I don't. If I had, if you had kissed me in our youth and dissolved my pain, so many things in my life would not be where they are now, and I'm happy now. I'm in a good place. I wouldn't want that to change.\n\nThen I scold myself. I don't have to think about the sequence of events. I can wish you'd kissed me and want to keep my life the way it is. I'm allowed to have uncomplicated regret. Aren't I? \n\nAren't I?",
      "links": []
    },
    {
      "pid": 17,
      "name": "Header",
      "text": "{\n(print: \"<script>$('html').removeClass(\\)</script>\")\n(if: (passage:)'s tags's length > 0)[\n(print: \"<script>$('html').addClass('\" + (passage:)'s tags.join(' ') + \"'\\)</script>\")\n]\n}",
      "links": []
    },
    {
      "pid": 18,
      "name": "Title Page",
      "text": "<span id=\"next\">[[beginning]]</span>",
      "links": [
        {
          "text": "beginning",
          "destination": {
            "name": "beginning",
            "pid": 1
          }
        }
      ]
    }
  ]
}