{
  "passages": [
    {
      "pid": 1,
      "name": "Funeral Opening",
      "text": "{\n(set: $_lbracket to \"`[`\")\n(set: $_rbracket to \"`]`\")\n(set: $_link_color to '#ba0000')\n(set: $_link_hover_color to '#ff4c4c')\n}<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$funeral_image+'\" alt=\"Hands holding a Bible\" title=\"Hands holding a Bible\" />')\n</div><span class=\"cap\">F</span><span>unerals are a kind of spectator sport for you these days. You come to see who’ll show up,</span> (link: \"{\n[what…]<first-link|\n(live: 10s)[\n\t(replace: ?first-link)[\n\t\t<span class='pulseWithDelay'>$_lbracket</span>what…<span class='pulseWithDelay'>$_rbracket</span>\n\t]\n\t(stop:)\n]}\")[what well-meaning but thoughtless words they’ll say, that sort of thing.\n\nThis one’s in the late afternoon instead of the heat of the day, thank goodness. There aren’t any clouds between you and the sun, just red red rays coloring everyone crimson.\n\nIt’s the usual graveside arrangement, with one of those green tents over the open grave and (link-reveal: \"the casket on a\")[&mdash;some kind of contraption that’ll drop it into the hole once the platitudes are done and no one’s looking any more. The funeral home workers scattered cheap plastic seats around the grave like birdseed. At least you got one. There’s not much fun about being old, but they do give you a chair when you damn well need one.\n\nBeing so close to the front, down with the [[mourners]], means you’re also close enough to the preacher to hear him over the [[tent fringe]] snapping in the wind.]]",
      "links": [
        {
          "text": "mourners",
          "destination": {
            "name": "mourners",
            "pid": 5
          }
        },
        {
          "text": "tent fringe",
          "destination": {
            "name": "tent fringe",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "after verses",
      "text": "It’s not a bad Bible passage. It didn’t launch the preacher into a bunch of hellfire and damnation talk, thankfully. You’ve been to one funeral that went that way. It was like being strapped in a dentist’s chair, and the only thing that made it tolerable was that you didn’t pay for the experience.\n\nBesides, the verses must’ve done their job because the [[man next to you]] is working hard not to tear up, though he’s not succeeding. He glances over and sees you staring, so you look down and fiddle with the [[funeral program]] they handed you.",
      "links": [
        {
          "text": "man next to you",
          "destination": {
            "name": "man next to you",
            "pid": 7
          }
        },
        {
          "text": "funeral program",
          "destination": {
            "name": "funeral program",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "tent fringe",
      "text": "The tent’s there in case it rains, which is damn foolish. There aren’t even [[clouds]] to hint at rain. Shame there’s no rain, though. Make it more of a proper funeral, provide some welcome distraction. Though you’ve been to so many now that funerals are like oatmeal, all gray and bland no matter what you dump into them.",
      "links": [
        {
          "text": "clouds",
          "destination": {
            "name": "clouds",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "preacher",
      "text": "The preacher means well, which is part of his job description when you get down to it. Mean well; do well. Visit the orphans and the widows. Most else is noise and distraction. He’s got on a dark and somber (link: \"smock\")[//suit//, the kind that’s meant to show he’s there on God’s business.\n\nHe gestures with his worn, dog-eared Bible and flips it open one-handed. You wonder if he practices the move in front of a mirror. “I’ll be reading from Paul’s first letter to the church in Corinth,” he says all serious-like.\n\n<div class=\"quotes\">“Behold, I shew you a mystery;\nWe shall not all sleep, but we shall all be changed,\nin a moment, in the twinkling of an eye, at the last trump:\nfor the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed.\n\n“For this corruptible must put on incorruption, and this mortal must put on immortality.\n\n“So when this corruptible shall have put on incorruption, and this mortal shall have put on immortality, then shall be brought to pass the saying that is written, (link-reveal: \"Death is swallowed up in victory.\")[\n\n“O death, (link-reveal: \"where is thy sting?\")[\n“O grave, (link-reveal: \"where is thy victory?\")[\n\n“The sting of death is sin; and the strength of sin is the law. But thanks be to God, which giveth us the victory through [[our Lord Jesus Christ.”->after verses]]\n]]]</div>]",
      "links": [
        {
          "text": "our Lord Jesus Christ.”",
          "destination": {
            "name": "after verses",
            "pid": 2
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "mourners",
      "text": "It’s the usual mix of folks. Some are here because they loved the person who died. Some, like you, are here because they’re expected to be. Many are dressed in their everyday clothes, which annoys you, just a bit. If you’re going to a funeral, dress up. The dead person won’t know, but you will, and showing respect’s the right thing to do. There aren’t enough people in suits or dresses besides you and the [[preacher]].",
      "links": [
        {
          "text": "preacher",
          "destination": {
            "name": "preacher",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "clouds",
      "text": "There ought to be clouds. Some sign of God hiding his face in sadness over the life He’s taken. But there aren’t any. The only evidence of God is the [[preacher]] who’s being all sober and serious.",
      "links": [
        {
          "text": "preacher",
          "destination": {
            "name": "preacher",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "man next to you",
      "text": "He’s sandy-haired, like you used to be before you went gray and then white. He’s in a suit(if: (history:) contains \"mourners\")[, same as you and the pastor,] and his face is completely still in a way that shows how hard he’s working not to cry. He keeps twisting his wedding ring around and around his finger(if: (history:) contains \"funeral program\")[. He must have [[known her well]]](else:)[ like how you’re [[twisting your funeral program->funeral program]]].",
      "links": [
        {
          "text": "known her well",
          "destination": {
            "name": "known her well",
            "pid": 9
          }
        },
        {
          "text": "twisting your funeral program",
          "destination": {
            "name": "funeral program",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "funeral program",
      "text": "A Thomas Kinkade painting glows on the front. The inside has the dead person’s name, Virginia, along with a terrible poem and “With Our Deepest Sympathy” above the funeral home’s name. Because nothing conveys deep sympathy like a small fold of paper printed by the thousands.\n\nIt’s also full of those (link: \"infuriating…\")[infuriating euphemisms like “Entered Into Rest” instead of “Died” and “Interment” instead of “Burial.” It’s another piece of the junk that gathers around a dead person(if: (history:) contains \"man next to you\")[, all of it pretending to have [[known her well]].](else:)[. Maybe the [[man next to you]] finds it comforting.]]\n",
      "links": [
        {
          "text": "known her well",
          "destination": {
            "name": "known her well",
            "pid": 9
          }
        },
        {
          "text": "man next to you",
          "destination": {
            "name": "man next to you",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "known her well",
      "text": "“Let’s close with one of Virginia’s favorite hymns, ‘It Is Well With My Soul’,” the preacher says. “If you’ll join me.”\n\nIt’s one of your favorite hymns, too. The hymnist wrote it after a ship sunk with his four daughters on board, so it fits the occasion. “When peace like a river attendeth my way,” you sing out, your baritone voice rougher than it used to be. It’s (link: \"been…\")[been&mdash;well, years since you sang in the church choir, and you still miss it.\n\nThen the graveside service is over. The man next to you stands up and rests his hand on the casket, gently, as if to convince himself that it’s there. “Love you, mom,” he whispers. The woman beside him leans on the casket, letting it keep her upright. The wind lifts her fine gold hair into a halo, and the sun’s red light catches her tears. Embarassed by the raw emotion, you put your hand on your four-legged cane and stand. The sandy-haired man takes your other arm, surprising you.\n\n“C’mon, dad,” he says. “[[Let’s get you to the car->Title]].”]\n",
      "links": [
        {
          "text": "Let’s get you to the car",
          "destination": {
            "name": "Title",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "Title",
      "text": "{\n(set: $_link_color to '#905e26')\n(set: $_link_hover_color to '#ffcb90')\n}<!-- This “live” macro lets us skip this weird flicker that otherwise happens -->(live: 1s)[<div class=\"fadeIn title\"><h1>Will Not Let Me Go</h1></div>(stop:)](live: 3s)[<div class=\"fadeIn title\"><h2>by Stephen Granade</h2></div>(stop:)]\n(live: 5s)[<div class=\"fadeIn\">(set: $_percent_complete to 3)(display: \"Waffle House\")</div>(stop:)]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "Waffle House",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "Waffle House",
      "text": "{\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$waffle_house_image+'\" alt=\"Cup of coffee\" title=\"Cup of coffee\" />')\n</div>\n}<span class=\"cap\">“T</span><span>hat’s one large order of hashbrowns, scattered, smothered, covered; two eggs, scrambled, side of grits; and an oatmeal with fruit and a glass of OJ.” Gerald grimaces across from you. Ever since that scare last year he’s watched what he eats and been jealous watching what other people eat. You like the man, but you won’t give up hashbrowns with cheese and onions for him. “I’ll be back, top off those coffees for you.”</span>\n\nAs the waitress walks away, Dick leans back, clearly pleased with himself. “Finished the kitchen yesterday.”\n\n“About time,” you say with a grin. “You’ve been at that remodel (link-reveal: \"for…\")[well, I can’t even remember how long.” You pretend it’s a joke, but you really can’t remember. There’s a [[blank spot->new appliances]] there.]",
      "links": [
        {
          "text": "blank spot",
          "destination": {
            "name": "new appliances",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "new appliances",
      "text": "(set: $warm_coffee=false)“Hasn’t been that long.” Dick shrugs. “Besides, I’ve got the time. I’d been putting the remodel off, but once I retired I left my excuses at the office.” Dick loves working with his hands. He’s tackling all of the projects he’d talked about for years and years but not done. He updates you weekly on his progress.\n\nDick mentioning retirement reminds you that you should tell Dick and Gerald about your own [[upcoming retirement->retirement]], but then you (link: \"hesitate\")[(set: $hid_condition_count to it+1)(go-to: \"next project\")].(set: $hid_condition_max to it+1)",
      "links": [
        {
          "text": "<go-to>",
          "destination": {
            "name": "next project",
            "pid": 14
          }
        },
        {
          "text": "upcoming retirement",
          "destination": {
            "name": "retirement",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "retirement",
      "text": "“Speaking of, I’m retiring at the end of this month.” \n\n“Good for you, Fred,” Gerald says. “Say, if you get bored, you can join up with Dick and work on his house.”\n\n“Thanks, no. I’ve got plenty to do my own self.” (display: \"warm coffee\") “I’ve been down to three days a week for a while now, and I thought, well, why not go down to no days a week.” What you don’t say is that you’re far slower than you used to be, far less able to make columns of numbers add up. Problems keeping track of dollars isn’t a trait people want in their accountant.\n\n“You’ll love it,” Dick says, and he nods once. “Really love it.” And you will. [[Probably->next project]].\n",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "warm coffee",
            "pid": 17
          }
        },
        {
          "text": "Probably",
          "destination": {
            "name": "next project",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "next project",
      "text": "“So what’s next on your list, Dick?” you ask(unless: (history:) contains \"retirement\")[ instead]. (if: $warm_coffee)[You take a sip of coffee while it’s still warm.](else:)[(display: \"warm coffee\")]\n\n“Can’t decide between the guest bathroom or Eugene’s old room.”\n\n“Wouldn’t it be easier to burn your house down and start again?” Gerald asks.\n\n“Heh. Not really,” Dick replies.\n\n“Besides,” you say, “you’d be a terrible arsonist. You’d take forever pouring the gas just so around the house to make it burn the way you’d want it to.” It’s the engineer in Dick. Some people measure twice and cut once. He thinks about the best way to measure, measures twice, re-thinks how he’s measuring, measures three more times, and only then does he maybe cut once.\n\nThere’s a lull in the conversation, the kind of hole that tends to get filled in with talk of [[sports]] or [[weather]].\n",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "warm coffee",
            "pid": 17
          }
        },
        {
          "text": "sports",
          "destination": {
            "name": "sports",
            "pid": 15
          }
        },
        {
          "text": "weather",
          "destination": {
            "name": "weather",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "sports",
      "text": "“So how ‘bout them Cowboys,” you say.\n\nGerald huffs. “You don’t care about Dallas. Don’t pretend you do.”\n\n“It’s not my fault Irvin got himself arrested,” you say. “He’ll be suspended and leave a hole in your offence. Guess that’s what happens when you’re caught with cocaine and…” (link-reveal: \"What’s that word.\")[ (link-reveal: 'Starts with a “p”.')[ (link-reveal: \"Not proselytes.\")[\n\n“You’re heartless, Fred,” Gerald says in the silence. “Heartless.”\n\n“Strippers!” you say, louder than you meant to.\n\n“Fred!” Gerald says, looking around in case someone might faint because a man in his sixties said “strippers.”\n\n“We’re old, Gerald,” Dick says in the measured way he has when he advises someone. “We don’t have to care what other people think. Why fritter away our time on stuff that doesn’t matter?” He smiles then, pleased with what he’s about to say. “Like Dallas football.”\n\n“Heartless. Both of y’all.” Gerald points at you. “In your case, I blame [[Ole Miss->Ole Miss grad]].”]]]\n",
      "links": [
        {
          "text": "Ole Miss",
          "destination": {
            "name": "Ole Miss grad",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "weather",
      "text": "“So how ‘bout the weather,” you say.\n\n“Hot,” Dick says with a shrug. “Not much else to say. You following the news about the plane that exploded?” \n\n“Shot down,” Gerald says definitively.\n\n“They say something exploded in it,” says Dick.\n\n“Right. A missile. A terrorist missile exploded in it.”\n\n“Who’d want to shoot down a plane?” you ask.\n\n“Terrorists,” Gerald says. When he gets all certain like this, he can be a right pain. “It’s a terrorist thing. Probably linked to the Olympic bombing.”\n\nDick shakes his head and frowns. “I thought they had a suspect. A security guard.”\n\n“Jewell!” you say, louder than you meant to. The name popped out of your mouth, like it had been floating around in your brain where you couldn’t feel it, waiting for a connection to hook it and drag it out of you.\n\nGerald isn’t having it. “Two big events, nearly back to back? [[It’s got to be a terrorist thing->terrorist thing]].”\n",
      "links": [
        {
          "text": "It’s got to be a terrorist thing",
          "destination": {
            "name": "terrorist thing",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "warm coffee",
      "text": "The waitress stops by and tops off your coffee. You wrap your hands around the mug and let the heat seep into your fingers before you doctor the coffee. (set: $warm_coffee=true)",
      "links": []
    },
    {
      "pid": 18,
      "name": "Ole Miss grad",
      "text": "“It’s not my fault you went to an inferior school,” you say, sipping at your coffee. It’s gone cold.\n\n“You couldn’t pay me to live in Mississippi,” Dick says. He’s a die-hard Texan. He jokes about Texas being a whole ‘nother country, but you suspect he really believes that. He doesn’t have much time for other states.\n\n(if: (history:) contains \"retirement\")[“You can spend some of your retirement time going to games,”](else:)[“You should go to some games this season,”] Gerald says as you’re flagging down your waitress for a coffee refresh. “See Billy Brewer’s team in person.”\n\n“Tommy Tuberville’s team now.” You hand your coffee mug to the waitress. “Brewer got himself fired a bit ago.”\n\n“Oh, right,” Gerald says. He snorts. “See? You’re not the only one who forgets things.”\n\n(display: \"anger\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "anger",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "anger",
      "text": "There’s a familiar and sudden flush of anger, like your whole body’s been set alight. Your ears turn hot and your hands tremble, more than they normally do. Dr. Johns warned you you’d have a looser grip on your emotions, but you’d discovered that already. You should [[let this go]], though it’s so hard not to [[lash out]].(set: $gave_in_to_anger_max to it+1)",
      "links": [
        {
          "text": "let this go",
          "destination": {
            "name": "let this go",
            "pid": 20
          }
        },
        {
          "text": "lash out",
          "destination": {
            "name": "lash out",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "let this go",
      "text": "Deep breaths. Feel the air move in and out of you. Close your eyes, just for a second. You run through all the old tricks you learned as a teenager who got into fights as easy as you got into your clothes. “No, not the only one,” you say, and the moment passes. The thump of your pulse in your ears dies down.\n\n(if: (history:) contains \"sports\")[“How do you think they’ll do?” asks Gerald.\n\nYou shrug. “Last year was fair to middlin’. We’re still coming off of those sanctions thanks to Brewer. I don’t know if Tuberville will [[make a go of it->food arrives]] this year or not.”](else:)[“Anyway, I can’t imagine what that’s like. Having to wait in a hotel for investigators to tell you they found your husband’s body and are [[dragging it up out of the ocean->food arrives]].” Gerald shakes his head.]\n",
      "links": [
        {
          "text": "make a go of it",
          "destination": {
            "name": "food arrives",
            "pid": 22
          }
        },
        {
          "text": "dragging it up out of the ocean",
          "destination": {
            "name": "food arrives",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "lash out",
      "text": "(set: $gave_in_to_anger_count to it+1)“No, but I //am// the only one who’s literally losing his mind. You think forgetting (if: (history:) contains \"sports\")[the current coach of a team you don’t follow in a conference you don’t care about](else:)[what hotel chain some grieving relatives are staying in a hundred miles away] is like what I’ve got? Do you?”\n\nDick intervenes. (if: (history:) contains \"sports\")[“He kind of follows the conference.”\n\n“I don’t care!](else:)[“It’s closer to fifteen hundred miles away.”\n\n“A hundred, a thousand, a million&mdash;I don’t care!] It’s a minor thing that doesn’t impact his life at all. Of course he’d forget it!”\n\nGerald holds his hands out in front of him like he might have to ward you off. “Hey, hey, easy there.”\n\n“You take it easy.” You keep your voice down as best you can, but your best isn’t all that good right now. “If I’d lost my foot in Korea, would you say, ‘I know how you feel, I twisted my ankle once’?”\n\nDick and Gerald don’t reply. You realize how far forward you’re leaning. You sit back and [[take a deep breath->food arrives]].",
      "links": [
        {
          "text": "take a deep breath",
          "destination": {
            "name": "food arrives",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "food arrives",
      "text": "The waitress arrives at the table(if: $_gave_in_to_anger_count > 0)[, breaking the tension], arms loaded down with plates. “Hope you’re hungry,” she says. “Eggs for you, here’s your oatmeal,” making Gerald grimace again, “and here’s hashbrowns. All set?” You all nod yes. “Holler if you need anything else.”\n\nYou dump ketchup on your plate, fork up some hashbrowns, and dip them in the ketchup. The potatoes are piping hot and crispy around the edges, with onion bits frozen in a sea of melted American cheese. You used to be more careful about food, but why bother now? It’s not your ticker that will take you out. You can always claim you forgot Dr. Johns’ advice about your diet.\n\nYou start to drink your coffee when you realize that you can’t remember if you [[put sugar in it->didn't doctor coffee]] already or [[not->already doctored coffee]].\n",
      "links": [
        {
          "text": "put sugar in it",
          "destination": {
            "name": "didn't doctor coffee",
            "pid": 24
          }
        },
        {
          "text": "not",
          "destination": {
            "name": "already doctored coffee",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "terrorist thing",
      "text": "“You’re awful hung up on terrorists, Gerald,” says Dick.\n\n“Eye witnesses saw the plane get shot down. There was a streak of light. Multiple people saw it.”\n\n“Multiple people have seen sun dogs and called ‘em UFOs. Doesn’t make them right.” Sometimes Dick’s natural skepticism annoys you, but right now you’re enjoying him doubt Gerald’s theories.\n\nGerald gives up arguing the point. “I saw the news reporters trying to talk to the dead peoples’ relatives at the Day’s Inn,” he says.\n\n“Ramada Inn, actually,” Dick corrects him.\n\n“Right, Ramada Inn.” Gerald turns to you. “See? You’re not the only one who forgets things.”\n\n(display: \"anger\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "anger",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "didn't doctor coffee",
      "text": "The coffee is bitter. Fifty-fifty chance, so of course you guess wrong.\n\n(display: \"Dick notices your bad coffee\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "Dick notices your bad coffee",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "already doctored coffee",
      "text": "You grab a sugar packet and tear it open with a quiet rip. You pour it in and stir the coffee around for a bit. But the first mouthful of coffee is sickly sweet, far too sweet to drink. Fifty-fifty chance, so of course you guess wrong.\n\n(display: \"Dick notices your bad coffee\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "Dick notices your bad coffee",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "Dick notices your bad coffee",
      "text": "Dick pauses, a spoon full of grits halfway to his mouth. “The coffee off?”\n\n“Must’ve been an old pot.”\n\n“You look like you just bit into a mad cow.”\n\n“No,” Gerald objects. “We’re not [[talking about mad cow disease->mad cow intro]] while we’re eating. We can talk about the [[Wal-Mart greeter job->greeter job]] (if: (history:) contains \"retirement\")[Fred](else:)[Dick]’ll have to get when he’s fed up with being retired(if: (history:) contains \"retirement\")[ and doing nothing].”",
      "links": [
        {
          "text": "talking about mad cow disease",
          "destination": {
            "name": "mad cow intro",
            "pid": 270
          }
        },
        {
          "text": "Wal-Mart greeter job",
          "destination": {
            "name": "greeter job",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "mad cow",
      "text": "“No. This isn’t fit for mealtime&mdash;”\n\n“Doubtful,” Dick says. “We don’t grind up animals for feed as much as the Brits do.”\n\n“I don’t think we&mdash;”\n\n“It’s near about put me off hamburgers, I can tell you that,” you say, shoving your coffee cup aside. Better you switch to water anyway. It’ll keep you from being all jittery by late morning.\n\nGerald sighs and gives up trying to change the subject. “At least I’m safe. I can’t eat beef any more, so no mad cows for me.”\n\n“Bovine spongiform encephalopathy.” Trust Dick to know the full term for it. “The cows eat brains and then their brains rot away....” Dick trails off. He carefully doesn’t look at you.\n\n“Maybe that’s my problem,” you say. “I ate bad beef. Guess the docs were right and I should’ve switched to chicken years ago.” (if: $gave_in_to_anger_count > 0)[Gerald looks taken aback at your joke, and [[you feel bad->where's Tom?]] for blowing up at him like you did.](else:)[\n\nGerald laughs. “It’s not too late to change. You and I can get oatmeal and fruit for the rest of our lives.”\n\n“[[Far too late->where's Tom?]], I figure.”]\n",
      "links": [
        {
          "text": "you feel bad",
          "destination": {
            "name": "where's Tom?",
            "pid": 29
          }
        },
        {
          "text": "Far too late",
          "destination": {
            "name": "where's Tom?",
            "pid": 29
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "greeter job",
      "text": "“That sounds like some kind of terrible punishment,” you say, “having to be a Wal-Mart greeter.” You can be cheerful and all, but to be cheerful hour after hour, doing nothing more than saying “Welcome to Wal-Mart!” to everyone who walks past you? No thank you.\n\n“It’s probably not that bad,” Gerald says.\n\nYou can't help yourself. “You don’t have to have mad cow disease to be a greeter here, but it helps.”\n\n“Fred,” Gerald says peevishly.\n\n“Wonder if we’ll get mad cows here.”\n\n(display: \"mad cow\")\n",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "mad cow",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "where's Tom?",
      "text": "A stray thought makes you say, “Where’s Tom been hiding himself? It’s been ages since he came to breakfast with us.” You, Dick and Tom have run around together for a long time. You met when the three of you worked for the same small company, you as the accountant and business manager, Dick as an engineer and Tom as a sales rep. You took to eating lunch together whenever Tom wasn’t off on a sales call. The receptionist&mdash;(link-reveal: \"what //is// her name?\")[ (link-reveal: \"Ruth?\")[&mdash;anyway, she saw you three come down the hall together and called out, “If it isn’t Tom, Dick, and Freddy.”\n\nYou like Gerald, but Tom and Dick are two of your [[oldest friends]].]]\n",
      "links": [
        {
          "text": "oldest friends",
          "destination": {
            "name": "oldest friends",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "you argued",
      "text": "“The last time he was here, the two of you really got into it, hammer and tongs.” Gerald won’t meet your eye. “Remember how&mdash;” He clears his throat. “Well. You told him you and he were [[through->done with Tom]].”",
      "links": [
        {
          "text": "through",
          "destination": {
            "name": "done with Tom",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "done with Tom",
      "text": "[[Wait, that can’t&mdash;->done with Tom 1]]",
      "links": [
        {
          "text": "Wait, that can’t&mdash;",
          "destination": {
            "name": "done with Tom 1",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "done with Tom 1",
      "text": "[[You wouldn’t&mdash;->done with Tom 2]]",
      "links": [
        {
          "text": "You wouldn’t&mdash;",
          "destination": {
            "name": "done with Tom 2",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "done with Tom 2",
      "text": "He [was]<was-to-is| one of your best friends. (click: ?was-to-is)[(replace: ?was-to-is)[''is''] You can’t believe you’d want him gone. You want to [[deny it happened->pretend you didn't argue]], but [[Gerald wouldn’t lie->admit you argued]]. Not about this.]",
      "links": [
        {
          "text": "deny it happened",
          "destination": {
            "name": "pretend you didn't argue",
            "pid": 34
          }
        },
        {
          "text": "Gerald wouldn’t lie",
          "destination": {
            "name": "admit you argued",
            "pid": 35
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "pretend you didn't argue",
      "text": "“I think you’ve mixed me up with some other Fred.” You laugh, but no one else does.\n\n“Fred,” Dick says, and when you see his expression you feel the pit open up, the one that’s always waiting these days, swallowing moments and memories and now, evidently, whole people. “He felt it best not to push you. Said you needed some time and figured you’d call when you were ready to see him again.”\n\n[[“When?”->when you argued with Tom]] you ask.\n",
      "links": [
        {
          "text": "“When?”",
          "destination": {
            "name": "when you argued with Tom",
            "pid": 36
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "admit you argued",
      "text": "There’s a pit that’s with you all the time now. You never know when it’s opened up, swallowing moments and memories and now, evidently, whole people. “I wouldn’t&mdash;” You stop, take a deep breath, reconsider what you’re going to say. You’ve learned to be honest about what’s going on with you. You can’t remember lies well enough to carry them off.\n\nYou just hate how many opportunities you get to be honest.\n\n“I don’t remember.” Your hands around your water glass are white as you grip it. The smell of your hashbrowns nearly makes you sick. “I just don’t.”\n\nYou //do// remember that time you were [downsized]<downsized| and you had to walk through the halls with your box of things, no one willing to acknolwedge you, leper unclean, and you got outside to find Tom waiting on the sidewalk, and he said, “Turns out I’m knocking off early. Let’s get you a drink.”(click-replace: ?downsized)[fired]\n\n[[“When?”->when you argued with Tom]] you ask.\n",
      "links": [
        {
          "text": "“When?”",
          "destination": {
            "name": "when you argued with Tom",
            "pid": 36
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "when you argued with Tom",
      "text": "“When what?”\n\n“When did we fight?”\n\n“Late last year.” Dick’s sigh is heavy, like twenty years of friendship just settled on his shoulders, a yoke that used to be far lighter. “Not too long after you told us.”\n\nYou should [[call him->agree to call Tom]](if: (history:) contains \"admit you argued\")[, even though you’re [[not looking forward->pretend you'll call Tom]] to the conversation. You could [[ask Dick to call Tom]]. He’d be willing to help.](else:)[. But you [[can’t->pretend you'll call Tom]]. You could [[ask Dick->ask Dick to call Tom]] to talk to Tom for you, even though hiding behind Dick doesn’t sit well with you.]\n",
      "links": [
        {
          "text": "call him",
          "destination": {
            "name": "agree to call Tom",
            "pid": 37
          }
        },
        {
          "text": "not looking forward",
          "destination": {
            "name": "pretend you'll call Tom",
            "pid": 38
          }
        },
        {
          "text": "ask Dick to call Tom",
          "destination": {
            "name": "ask Dick to call Tom",
            "pid": 39
          }
        },
        {
          "text": "can’t",
          "destination": {
            "name": "pretend you'll call Tom",
            "pid": 38
          }
        },
        {
          "text": "ask Dick",
          "destination": {
            "name": "ask Dick to call Tom",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "agree to call Tom",
      "text": "(set: $made_up_with_tom to true)“I’ll call.” You pull the small set of folded index cards from your back pocket and a pen from your front one. The cards are a poor substutite for a working brain, but they’re better than nothing. You carefully write, “Call Tom. You argued. Ask him what about.” Your handwriting’s gone spidery over the last year, but its webbing helps hold you together. “We’ll hash it out like we always have.”\n\n“Good.” Dick’s nod feels like [[absolution->pay and leave]].\n",
      "links": [
        {
          "text": "absolution",
          "destination": {
            "name": "pay and leave",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "pretend you'll call Tom",
      "text": "(set: $made_up_with_tom to false)“I’ll call.” Dick looks at you, and you know what he wants you to do. You pull the small set of folded index cards from your back pocket and a pen from your front. The cards are a poor substutite for a working brain, but they’re better than nothing. You flip to a fresh card and carefully write, “Call Tom. You argued. Ask him what about.” But you know this card’s going into the trash the next time you pull it out.\n\n“Good.” Dick’s nod makes you feel guilty. But you can’t remember what for. Might as well feel guilty about [[someone else’s behavior->pay and leave]].\n",
      "links": [
        {
          "text": "someone else’s behavior",
          "destination": {
            "name": "pay and leave",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "ask Dick to call Tom",
      "text": "(set: $made_up_with_tom to true)You look at Dick. “Can you…?”\n\nHe studies you for a minute. “Yeah, can do. The two of us’ll come over later this week.”\n\n“Give Virginia a call. She’ll need a heads-up.”\n\nDick nods, and your guilt uncurls and drifts away from you like smoke. You and Tom will hash it out [[like you always have->pay and leave]].\n",
      "links": [
        {
          "text": "like you always have",
          "destination": {
            "name": "pay and leave",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "pay and leave",
      "text": "Some time during your conversation the waitress slipped the bill on the table. You start to fish your wallet out but Gerald puts his hand on your arm. “My turn to pay.”\n\n“I’ll have to take your word for it,” you say, which wins a (if: $gave_in_to_anger_count > 0)[small smile from Gerald. He’ll be okay](else:)[smile from Gerald]. He counts out several bills and some loose change and puts it all on top of the bill.\n\nWhen you get up and start for the door, your gait’s a little unsteady. Has been for months now. Poor circulation or nerves or something. Keeping up with your health’s near a full-time job. Another good reason to retire. As you pass two women in a booth, one of them mutters to the other, “That drunk was in here last week, too.”\n\nGuess it’s time to do like Dr. Johns said and [[get that cane->waffle house end]].",
      "links": [
        {
          "text": "get that cane",
          "destination": {
            "name": "waffle house end",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "oldest friends",
      "text": "The realization that no one answered your question brings you out of your reverie. Dick and Gerald are studying their food like they’re trying to read entrails. “[[What?->you argued]]”",
      "links": [
        {
          "text": "What?",
          "destination": {
            "name": "you argued",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "waffle house end",
      "text": "(live: 2s)[(set: $_percent_complete to 10)(goto: \"awake in chair\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "awake in chair",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "awake in chair",
      "text": "{\n(set: $_link_color to '#b79115')\n(set: $_link_hover_color to '#e5b722')\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$glasses_image+'\" alt=\"Glasses near sofa\" title=\"Glasses near sofa\" />')\n</div>\n}<span class=\"cap\">Y</span><span>ou snore yourself awake, your eyes popping open. Your mouth’s terrible,</span> (link: \"like…\")[like coffee left out for days. You take stock. Were you (link-reveal: \"asleep for the night?\")[ Were you (link-reveal: \"reading?\")[ (link-reveal: \"Watching TV?\")[\n\nIt’s dim but not dark. Must be getting on in the afternoon, or maybe it’s morning. You’re upright in the(link: \"…the stuffed thing.\")[ //chair//. Can’t have been night. You were probably watching TV. You feel to either side of you for the clicker. You don’t find it, but you do find a (link-reveal: \"book.\")[\n\n<div class=\"centerImage\">(print: '<img src=\"'+$sum_of_all_fears_cover+'\" alt=\"The cover is too blurry for you to tell what it is.\" />')</div>\n\nYou blink, eyes heavy. There’s (link-reveal: \"something missing.\")[ Round, goes on your (link-reveal: \"face.\")[\n\nGlasses, right.\n\nThey’re not in your sweater pocket, or on a chain around your neck. Did you take them off to sleep? They’re [[around here somewhere->transition from chair to living room 1]].\n]]]]]]]]",
      "links": [
        {
          "text": "around here somewhere",
          "destination": {
            "name": "transition from chair to living room 1",
            "pid": 266
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "living room 1",
      "text": "Your living room is quiet this (either: \"morning\", \"afternoon\"). Your chair is over in one corner near the TV and a TV tray. There’s a big (either: \"seasonal\", \"sectional\") [sofa]<sofa| opposite the chair, with a [pile of papers]<papers| lying on it. [Photos]<photos| decorate the wall above the sofa.\n\nMaybe you left your glasses in (if: $had_bathroom_conversation)[the [[kitchen->kitchen 1]] or in ]your [[bedroom->transition from living room 1 to hallway 1]].\n{\n(unless: $searched_sofa)[(click: ?sofa)[(goto: \"search sofa\")]]\n(unless: $searched_papers or $had_bathroom_conversation)[(click: ?papers)[(goto: \"search papers\")]]\n(unless: $looked_at_photos or $had_bathroom_conversation)[(click: ?photos)[(goto: \"look at photos\")]]\n}",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "search sofa",
            "pid": 45
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "search papers",
            "pid": 46
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "look at photos",
            "pid": 47
          }
        },
        {
          "text": "kitchen",
          "destination": {
            "name": "kitchen 1",
            "pid": 48
          }
        },
        {
          "text": "bedroom",
          "destination": {
            "name": "transition from living room 1 to hallway 1",
            "pid": 269
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "search sofa",
      "text": "(set: $searched_sofa to true)You rest your weight on your cane and lower yourself, slowly, slowly, to the sofa. There aren’t any glasses in between (link: \"the…\")[the cushions. They could be [under the sofa]<under-sofa|, maybe.\n\n(click: ?under-sofa)[You could get on the floor. Gravity would help you get down just fine, but then you’d be stuck there. “I’ve fallen, and I can’t get up!”\n\n(link-reveal: \"Who told you that?\")[\n\nOh, the woman on the TV.\n\nNo, you and the floor aren’t friends any more. Best hope [[your glasses are elsewhere->transition from sofa to living room 1]]. ]]]\n",
      "links": [
        {
          "text": "your glasses are elsewhere",
          "destination": {
            "name": "transition from sofa to living room 1",
            "pid": 267
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "search papers",
      "text": "(set: $searched_papers to true)You riffle through the papers. They’re likely bills, or letters, but regardless they’re not much use right now, not when you don’t have [[your glasses->living room 1]].",
      "links": [
        {
          "text": "your glasses",
          "destination": {
            "name": "living room 1",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "look at photos",
      "text": "(set: $looked_at_photos to true)Without your glasses, those photos are washes of color, like paintings by (link: \"Manet\")[(link: \"Monet\")[&mdash; whichever it was.\n\nGuess you’d better [[look elsewhere for your glasses->living room 1]].]]",
      "links": [
        {
          "text": "look elsewhere for your glasses",
          "destination": {
            "name": "living room 1",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "kitchen 1",
      "text": "(set: $visit_count to (count: (history:), \"kitchen 1\"))A refrigerator and cabinets take up one kitchen wall. The gas stove is on the other wall next to the window. (unless: $visit_count is 0)[These days you leave the stove alone, and your eyebrows are the better for it.]\n\nThe kitchen table is bare, which must be Virginia’s doing. You tend to leave things in piles, like the small drift of papers on a drop-leaf table(if: $had_bathroom_conversation and $visit_count > 2)[ next to [[the door to the carport->mailbox]]](else:)[. You’ve dragged a kitchen chair over by the [[doorway to the living room->living room 1]]].\n{\n(unless: $searched_refrigerator)[(click: \"refrigerator\")[(goto: \"search refrigerator\")]]\n\n(unless: $searched_cabinets)[(click: \"cabinets\")[(goto: \"search cabinets\")]]\n\n(unless: $looked_out_window)[(click: \"window outside\")[(goto: \"look out window\")]]\n\n(unless: $looked_at_thinking_chair and $visit_count <= 2)[(click: \"kitchen chairs\")[(goto: \"look at thinking chair\")]]\n}",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "search refrigerator",
            "pid": 62
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "search cabinets",
            "pid": 63
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "look out window",
            "pid": 64
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "look at thinking chair",
            "pid": 66
          }
        },
        {
          "text": "the door to the carport",
          "destination": {
            "name": "mailbox",
            "pid": 65
          }
        },
        {
          "text": "doorway to the living room",
          "destination": {
            "name": "living room 1",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "hallway 1",
      "text": "More photos line the hallway in haphazard rows. Doors lead to (if: $had_bathroom_conversation)[the (unless: $seen_guest_bathroom)[[[guest bathroom]]](else:)[guest bathroom], ]the kids’ old bedrooms and your own.\n\nThe hallway (if: $came_from_living_room)[behind](else:)[ahead of] you goes (if: $came_from_living_room)[back to ]to the [[living room->living room 1]].\n\n(unless: $looked_at_more_photos or $had_bathroom_conversation)[(click: \"more photos\")[(goto: \"more photos\")]]\n(unless: $tried_kids_bedroom_door or $had_bathroom_conversation)[(click: \"kids’ old bedrooms\")[(goto: \"kid bedrooms are locked\")]]\n(click: \"your own\")[(set: $came_from_living_room to false)(if: $had_bathroom_conversation)[(goto: \"your bedroom 1\")](else:)[(goto: \"bathroom conversation\")]]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "more photos",
            "pid": 189
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "kid bedrooms are locked",
            "pid": 51
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "your bedroom 1",
            "pid": 54
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "bathroom conversation",
            "pid": 52
          }
        },
        {
          "text": "guest bathroom",
          "destination": {
            "name": "guest bathroom",
            "pid": 50
          }
        },
        {
          "text": "living room",
          "destination": {
            "name": "living room 1",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "guest bathroom",
      "text": "The bathroom’s been cleaned recently enough that you can still smell Lysol on the (unless: $seen_guest_bathroom)[(link: \"white…\")[(display: \"rest of the guest bathroom desc\")]](else:)[(display: \"rest of the guest bathroom desc\")]\n{\n(set: $seen_guest_bathroom to true)\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "rest of the guest bathroom desc",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "kid bedrooms are locked",
      "text": "(set: $tried_kids_bedroom_door to true)One of the bedroom doors is stuck, or maybe locked. You should go find the key and the can (link: \"of…\")[of WD-40 to fix it.\n\nNo, not now. Right now you’re hunting your glasses.\n\nIf you repeat that to yourself enough you’ll [[remember to keep looking for them->hallway 1]].]",
      "links": [
        {
          "text": "remember to keep looking for them",
          "destination": {
            "name": "hallway 1",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "bathroom conversation",
      "text": "(set: $had_bathroom_conversation to true)You’re surprised to see a man in your bedroom, on the other side of the white (link: \"bed\")[ //sink//. Without your glasses you don’t recognize him, but surely you’d have heard a stranger break in. It must be [[your son, Michael->thinks it's Michael]]. Or was [[Dick->thinks it's Dick]] coming by today?\n\nIt might be better [[not to guess->don't guess who the visitor is]], and figure it out as you go along.]",
      "links": [
        {
          "text": "your son, Michael",
          "destination": {
            "name": "thinks it's Michael",
            "pid": 55
          }
        },
        {
          "text": "Dick",
          "destination": {
            "name": "thinks it's Dick",
            "pid": 56
          }
        },
        {
          "text": "not to guess",
          "destination": {
            "name": "don't guess who the visitor is",
            "pid": 57
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "rest of the guest bathroom desc",
      "text": "white sink. Your glasses aren’t on the vanity or the toilet, and the tile makes your slippers slip, which is the opposite of what they ought to do, so you [[head back to the hallway->hallway 1]].",
      "links": [
        {
          "text": "head back to the hallway",
          "destination": {
            "name": "hallway 1",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "your bedroom 1",
      "text": "(set: $visit_count to (count: (history:), \"your bedroom 1\"))The covers are rumpled from your fitful night of sleep. You’ll have to make the bed after you find your glasses. Virginia hates sleeping in an unmade bed.(if: $visit_count < 2 and not $searched_dresser)[ The nightstand next to the bed has a couple of drawers in it where your glasses might be hiding.]\n\nThere are still more photos hanging above your dresser(if: $visit_count is 0)[. Virginia loves having them around. “It keeps our family with us in spirit,” she likes to say. One time after she said that, you told her that you could always stuff your parents after they died and mount them in the living room. “Our house’ll be a cross between Madame Tussauds and a mausoleum.” She hit you, gently, and laughed.](elseif: $visit_count is 1)[. They need to be straightened. You reach for your index cards to add the chore to your to-do list, but they’re not in your robe and you’re not about to try to look for two things at once.](else:)[ next to the [[hallway door->hallway 1]].]\n{\n(if: $visit_count < 2)[\n\t(unless: $searched_covers)[(click: \"covers\")[(goto: \"search covers\")]]\n\t(unless: $searched_nightstand)[(click: \"nightstand\")[(goto: \"search nightstand\")]]\n\t(unless: $searched_dresser)[(click: \"dresser\")[(goto: \"search dresser\")]]\n]\n}\n",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "search covers",
            "pid": 59
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "search nightstand",
            "pid": 60
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "search dresser",
            "pid": 61
          }
        },
        {
          "text": "hallway door",
          "destination": {
            "name": "hallway 1",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "thinks it's Michael",
      "text": "(set: $visitor to \"Michael\")“Michael?”\n\n“Dad,” he says. His smile reminds you of your own.\n\n“What’re you doing here?”\n\n“Checking up on you.” In case you’ve done something stupid, he means, but he doesn’t say it. There’s so much he doesn’t say these days, volumes of unsaid things. “Just get up from a nap?”\n\nStanding is hell on your feet, and your slippers don’t grip like they should on the tile floor, so you risk sitting on the lid of the toilet opposite $visitor. You ignore the smell of Lysol cleaner and say, “[[I was reading->ask guest about glasses]].”",
      "links": [
        {
          "text": "I was reading",
          "destination": {
            "name": "ask guest about glasses",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "thinks it's Dick",
      "text": "(set: $visitor to \"Dick\")“Dick?”\n\n“Fred.”\n\nYou’re thrilled to see him, and pleased that you guessed right, and a little sad at how much guessing right pleases you. “You come to take me to work?” You’re not dressed for it yet. You’ll have to pull on a shirt and some slacks.\n\n“You’re retired now, Fred,” he says, and then you remember. It’s been years since you worked. “I hadn’t seen you in a while. Wanted to correct that.” He nods to the door. “Didn’t want to disturb your nap.”\n\nStanding is hell on your feet, and your slippers don’t grip like they should on the tile floor, so you risk sitting on the lid of the toilet opposite $visitor. You ignore the smell of Lysol cleaner and say, “[[I was reading->ask guest about glasses]].”\n",
      "links": [
        {
          "text": "I was reading",
          "destination": {
            "name": "ask guest about glasses",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "don't guess who the visitor is",
      "text": "(if: $made_up_with_tom)[(set: $visitor to \"Tom\")](else:)[(set: $visitor to \"Gerald\")]“Hello?” You didn’t mean for it to be a question, but it became one somewhere between your brain and your mouth.\n\n“Fred.” It’s $visitor. \n\nYou’re thrilled to see him. “You come to take me to breakfast?” You’re not dressed for it yet. You’ll have to pull on a shirt and some pants.\n\n“Just came by to see you.” Your thrill fades to disappointment. You don’t get out like you used to. It takes too much effort, both for you and for the person who gets to drag your old carcass around town. “Didn’t want to disturb your nap.”\n\nStanding is hell on your feet, and your slippers don’t grip like they should on the tile floor, so you risk sitting on the lid of the toilet opposite $visitor. You ignore the smell of Lysol cleaner and say, “[[I was reading->ask guest about glasses]].”",
      "links": [
        {
          "text": "I was reading",
          "destination": {
            "name": "ask guest about glasses",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "ask guest about glasses",
      "text": "The mention of reading jogs your memory about your glasses. That’s when you realize where they must be.\n\n“Give them back,” you say. “I know you took them.”\n\n“Took what?”\n\n“You’ve got my glasses.” You’re getting a good mad on as you think about what $visitor’s been doing. “You’ve been sneaking in here, taking my things. Hiding them from me!”\n\n“Have you looked in your bedroom? I bet you left them on the nightstand.”\n\n“You’re trying to trick me!” You stand as quickly as you can, which isn’t that quick. Those NASA guys down in Houston didn’t have as much trouble standing (link: \"the…\")[the Saturn rocket up.\n\n“Go look and see.”\n\n“[[They’d better be there->hallway 1]],” you growl, and stalk out.]\n",
      "links": [
        {
          "text": "They’d better be there",
          "destination": {
            "name": "hallway 1",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 59,
      "name": "search covers",
      "text": "You fold the comforter further back from your side of the bed, and then (link: \"the…\")[the quilt, and then the striped bedsheet. No sign of your glasses. To make sure, you reverse the process, pulling bedsheet, quilt, and then comforter back into place. It’s not quite making the bed, but it’s [[better than nothing->your bedroom 1]].](set: $searched_covers to true)",
      "links": [
        {
          "text": "better than nothing",
          "destination": {
            "name": "your bedroom 1",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 60,
      "name": "search nightstand",
      "text": "The top drawer sticks a little when you open it, so you give it a harder tug, and almost lose your balance. Finding your balance again is thankfully easier than finding your glasses has been so far.\n\nThe drawers are full of stuff you’ve collected over the years, the (link: \"destitute\")[//detritus// that always ends up in nightstand drawers, but [[no glasses->your bedroom 1]].](set: $searched_nightstand to true)",
      "links": [
        {
          "text": "no glasses",
          "destination": {
            "name": "your bedroom 1",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 61,
      "name": "search dresser",
      "text": "The dresser’s only got clothes in it, but you’ve found your glasses in stranger places before, so you lift up shirts and undershirts and undershirts that are under shirts. [[No glasses->your bedroom 1]].(set: $searched_dresser to true)\n",
      "links": [
        {
          "text": "No glasses",
          "destination": {
            "name": "your bedroom 1",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 62,
      "name": "search refrigerator",
      "text": "(set: $searched_refrigerator to true)The food inside the refrigerator is stored haphazardly, as if there was a small explosion in (link: \"a…\")[a Piggly Wiggly. \n\nYou’re a bit hungry. A [small sandwich]<dont-make-sandwich| wouldn’t ruin your dinner, surely.\n\n(click: ?dont-make-sandwich)[Then the blurry label on a milk jug reminds you that you’re [[looking for your glasses->kitchen 1]].]]\n",
      "links": [
        {
          "text": "looking for your glasses",
          "destination": {
            "name": "kitchen 1",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 63,
      "name": "search cabinets",
      "text": "(set: $searched_cabinets to true)The cabinets have glasses in them, but they’re [[not the kind you’re looking for->kitchen 1]].",
      "links": [
        {
          "text": "not the kind you’re looking for",
          "destination": {
            "name": "kitchen 1",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 64,
      "name": "look out window",
      "text": "(set: $looked_out_window to true)There’s a light dusting of snow, the kind you hated as a kid. Not enough to make a snowman, let alone to close the school. One time you prayed real hard for snow and woke up the next day to a blinding white world. You sledded and sledded with your best friend from the (link-reveal: \"neighborhood&mdash;\")[(link-reveal: \"what was his name?&mdash;\")[and went to bed so happy.\n\nFor years after, you carefully chose what to pray for, since it worked so well for you. [[That was before you learned better->kitchen 1]].]]\n",
      "links": [
        {
          "text": "That was before you learned better",
          "destination": {
            "name": "kitchen 1",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 65,
      "name": "mailbox",
      "text": "You’re by the mailbox, [[envelopes in hand->getting the mail]]. ",
      "links": [
        {
          "text": "envelopes in hand",
          "destination": {
            "name": "getting the mail",
            "pid": 67
          }
        }
      ]
    },
    {
      "pid": 66,
      "name": "look at thinking chair",
      "text": "(set: $looked_at_thinking_chair to true)You moved it over by the doorway years ago to give yourself somewhere to sit and think when you came in the kitchen and forgot why. Virginia found you in it one day and asked “What are you after?”\n\nYou just shook your head. “Can’t tell you that.”\n\n“Why not?”\n\n“First I have to remember if I was coming in or [[going out->kitchen 1]].”\n",
      "links": [
        {
          "text": "going out",
          "destination": {
            "name": "kitchen 1",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 67,
      "name": "getting the mail",
      "text": "Wait, were you [[mailing these->mailbox is no help]]? Or is this [[today’s mail->mailbox is no help]]?",
      "links": [
        {
          "text": "mailing these",
          "destination": {
            "name": "mailbox is no help",
            "pid": 68
          }
        },
        {
          "text": "today’s mail",
          "destination": {
            "name": "mailbox is no help",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 68,
      "name": "mailbox is no help",
      "text": "The flag’s down and the mailbox is closed. It’s empty when you open it, so that’s no help.\n\nMaybe you should [[go inside]].",
      "links": [
        {
          "text": "go inside",
          "destination": {
            "name": "go inside",
            "pid": 69
          }
        }
      ]
    },
    {
      "pid": 69,
      "name": "go inside",
      "text": "You start back up the driveway when you realize this isn’t your house. It’s [[someone else’s->not your house]].",
      "links": [
        {
          "text": "someone else’s",
          "destination": {
            "name": "not your house",
            "pid": 70
          }
        }
      ]
    },
    {
      "pid": 70,
      "name": "not your house",
      "text": "You must have wandered away. Every time it happens you tell yourself you’ll know better next time, but you don’t.\n\nYou look around for your house. One [[up the hill]] looks like yours, though it’s hard to tell since you don’t have your glasses. But then again, there’s one [[down the street]] that could be it.\n",
      "links": [
        {
          "text": "up the hill",
          "destination": {
            "name": "up the hill",
            "pid": 71
          }
        },
        {
          "text": "down the street",
          "destination": {
            "name": "down the street",
            "pid": 72
          }
        }
      ]
    },
    {
      "pid": 71,
      "name": "up the hill",
      "text": "(set: $direction to \"up the hill\")(goto: \"trudging through snow\")",
      "links": [
        {
          "text": "<set>",
          "destination": {
            "name": "up the hill",
            "pid": 71
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "trudging through snow",
            "pid": 73
          }
        }
      ]
    },
    {
      "pid": 72,
      "name": "down the street",
      "text": "(set: $direction to \"down the street\")(goto: \"trudging through snow\")",
      "links": [
        {
          "text": "<set>",
          "destination": {
            "name": "down the street",
            "pid": 72
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "trudging through snow",
            "pid": 73
          }
        }
      ]
    },
    {
      "pid": 73,
      "name": "trudging through snow",
      "text": "You make your way $direction, cane in one hand, mail in the other. Virginia will know what to do with the mail. Your slippers push tiny mounds of snow in front of you, which makes you think to check for a trail behind you, one that you could reverse and follow to your house, but you can’t tell your tracks from the ones left by other people.\n\nWhen you get to the house you thought was yours, you see [[you were wrong->Virginia comes for you]].",
      "links": [
        {
          "text": "you were wrong",
          "destination": {
            "name": "Virginia comes for you",
            "pid": 74
          }
        }
      ]
    },
    {
      "pid": 74,
      "name": "Virginia comes for you",
      "text": "The snow starts to fall again, cold on your cheeks and nose. Impulsively you stick out your tongue and catch a flake, like you always do. Michael(unless: (history:) contains \"thinks it’s Michael\")[, your son,] loved catching snowflakes with you. You’d make snow angels and throw snowballs at him and your daughter Rebecca until the cold and wet drove you all inside.\n\nShouting. Someone’s shouting. Further $direction, someone runs towards you, waving her arms. “|its-not-virginia>[Virginia!]” you call out as the woman reaches you.\n\n(click: ?its-not-virginia)[“No, it’s me,” the woman says. “[Rebecca]<thats-my-daughters-name|.”\n\n(click: ?thats-my-daughters-name)[“Oh!” you say in surprise. “That’s my daughter’s name, too!”\n\n“I know, daddy.” She takes the mail from you and links her arm through yours. “[[We should go back inside->don't tell Virginia]].”]]",
      "links": [
        {
          "text": "We should go back inside",
          "destination": {
            "name": "don't tell Virginia",
            "pid": 75
          }
        }
      ]
    },
    {
      "pid": 75,
      "name": "don't tell Virginia",
      "text": "As the two of you head back through the snow, a thought occurs to you. “Can you not tell Virginia I went walkabout? She worries more than is good for her.”\n\nThe woman doesn’t say anything for a moment. You start to ask her again when she says, “I won’t.” She sounds so sad. “I promise [[she can’t find out->house 1 end]].”",
      "links": [
        {
          "text": "she can’t find out",
          "destination": {
            "name": "house 1 end",
            "pid": 76
          }
        }
      ]
    },
    {
      "pid": 76,
      "name": "house 1 end",
      "text": "(live: 2s)[(set: $_percent_complete to 29)(goto: \"church service\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "church service",
            "pid": 87
          }
        }
      ]
    },
    {
      "pid": 77,
      "name": "day program",
      "text": "{\n(set: $_link_color to '#1d746c')\n(set: $_link_hover_color to '#8cfff4')\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$exercise_image+'\" alt=\"Exercise band under a sneaker\" title=\"Exercise band under a sneaker\" />')\n</div>\n}<span class=\"cap\">Y</span><span>ou move your feet in time with the music, your heels occasionally banging into the legs of your chair. “Remember, while we march, keep that posture straight! You’re looking good, Ethel!”</span> The (link: \"inspector\")[//instructor// is desperately cheerful. She force-feeds enthusiasm to all of you like you’re cows being fattened up for slaughter.\n\n“You’re looking good, dad!” Michael sings out softly from behind you, mimicking the instructor. “[[Keep your heart rate and your spirits up, up, up!->knee squeezes]]” He brings you to this day program and stays with you, which means he has to suffer through armchair aerobics as well.]\n",
      "links": [
        {
          "text": "Keep your heart rate and your spirits up, up, up!",
          "destination": {
            "name": "knee squeezes",
            "pid": 78
          }
        }
      ]
    },
    {
      "pid": 78,
      "name": "knee squeezes",
      "text": "“Let’s do some knee squeezes! Squeeze together; now relax! Squeeze together; now relax!” The exercises make you feel better, but that doesn’t make you like them. The day program doesn’t cost money, but you pay for it with your dignity. “Don’t forget to squeeze your…you know…your ‘cheeks’ as well.” She makes little quote marks with her fingers. You sigh.\n\n“You’re slacking on those knee squeezes,” Michael says.\n\n“Want to show me how they’re done?”\n\n“Fred!” the instructor calls out. “Keep going! Don’t get distracted!” She glares at Michael. He lifts his hands and makes his “sorry” face. The instructor doesn’s buy it any more than Virginia did when Michael was a kid and tried to convince her he was sorry for misbehaving. “You’re not sorry you did it, you’re sorry you got caught!” Virginia would tell him. Michael would duck his head so you wouldn’t [[see his grin->time for jumping jacks]].\n",
      "links": [
        {
          "text": "see his grin",
          "destination": {
            "name": "time for jumping jacks",
            "pid": 79
          }
        }
      ]
    },
    {
      "pid": 79,
      "name": "time for jumping jacks",
      "text": "Michael scoots his chair closer. “Just watching you tires me out. I don’t know how you do it.”\n\n“First, you get old and senile. Second, you get your no-account son to take you to a program where they strap you to a chair and torture you.”\n\n“Fred!” The instructor’s cheerfulness is slipping. Behind every aerobics instructor’s smiling mask is the scowl of a born drill sergeant.\n\n“Sorry, miss!” you reply. You realize you’re ducking your head and grinning like Michael used to do.\n\n“Now let’s do some jumping jacks!” It’s like being back in Basic, except you have to sit the whole time. You didn’t enjoy Basic then, and you don’t enjoy this pale imitation of it now. You consider [[rebelling]] instead of [[following orders]].(set: $gave_in_to_anger_max to it+1)",
      "links": [
        {
          "text": "rebelling",
          "destination": {
            "name": "rebelling",
            "pid": 80
          }
        },
        {
          "text": "following orders",
          "destination": {
            "name": "following orders",
            "pid": 81
          }
        }
      ]
    },
    {
      "pid": 80,
      "name": "rebelling",
      "text": "(set: $gave_in_to_anger_count to it+1)You relax back into the chair, arms draped over the armrests. Truth be told, your breath’s a mite heavy from the marching.\n\n“Dad.” Michael’s playful tone is gone. “You don’t have to like the exercises, but you //do// have to do them.”\n\nThe instructor’s noticed your minor rebellion. “Nice, Harry!” she says. “Fred, look at Harry. See what great jumping jacks he’s doing?” Harry barely moves his arms. He’s in too much constant pain to be energetic thanks to a bad fall he took when he was a lineman for Ma Bell.\n\n“Now the other are showing you up,” Michael says.\n\n“Don’t treat me like I’m your fucking kid,” you snap.\n\n“Then [[act like an adult->following orders]],” Michael says.\n",
      "links": [
        {
          "text": "act like an adult",
          "destination": {
            "name": "following orders",
            "pid": 81
          }
        }
      ]
    },
    {
      "pid": 81,
      "name": "following orders",
      "text": "You dutifully spread your arms and legs, then pull them back in, then spread them out again. “When I was twenty I did hundreds of these,” you grumble. “And I was standing up while I did them.”\n\n“What do you always tell me?” Michael pretends to think. “Oh, right: comparisons like that do nobody any good.”\n\n“The benefit of being senile is that I can forget my own bad advice.” You (link-replace: \"sound like a…\")[sound like a peevish old man.\n\n“I found your advice to be pretty good,” Michael says, one eyebrow cocked. You’ve given him too many chances to practice being calm and polite.\n\nYou shake your head to throw off your bad mood. “You know the other benefit of being senile?”\n\n“No, but I’m sure you’ll tell me.” He smiles as he says it.\n\n“This routine’s [[new to me every time]].”]\n",
      "links": [
        {
          "text": "new to me every time",
          "destination": {
            "name": "new to me every time",
            "pid": 82
          }
        }
      ]
    },
    {
      "pid": 82,
      "name": "new to me every time",
      "text": "You stop talking for a bit to concentrate on the jumping jacks. Dr. Johns warned you that, if you didn’t exercise more, you’d graduate from your cane to a walker in short time. You’ll get there eventually, but you want to push that date as far forward as you can.\n\n“Out! And in! And out! And in!” says the instructor. You should ask Michael what her name is, so you can better focus your annoyance on her. “And now it’s time for resistance band work! We’ll take a short break while our helpers put them on your legs.”\n\nMichael drags a wad of the long, stretchy lengths of rubber from under his chair. “You want the [[light bands]] today? Or are you going to be a real man and use the [[medium->medium bands]] ones?”\n",
      "links": [
        {
          "text": "light bands",
          "destination": {
            "name": "light bands",
            "pid": 83
          }
        },
        {
          "text": "medium",
          "destination": {
            "name": "medium bands",
            "pid": 84
          }
        }
      ]
    },
    {
      "pid": 83,
      "name": "light bands",
      "text": "(set: $band_type to \"Light\")(set: $band_color to \"yellow\")(goto: \"tying the stretchy bands\")",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "tying the stretchy bands",
            "pid": 85
          }
        }
      ]
    },
    {
      "pid": 84,
      "name": "medium bands",
      "text": "(set: $band_type to \"Medium\")(set: $band_color to \"green\")(goto: \"tying the stretchy bands\")",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "tying the stretchy bands",
            "pid": 85
          }
        }
      ]
    },
    {
      "pid": 85,
      "name": "tying the stretchy bands",
      "text": "“$band_type,” you tell Michael, who pulls the $band_color ones out of the pile, teasing apart tangled bands. As he ties your legs to the chair’s, you say, “You know an exercise program is a good one when they strap you in place.”\n\n“Excuse me, young man?” The woman in the chair in front of you has turned around, her eyes owlish behind huge glasses. “Could you tie my bands to me when you’re done with him?”\n\n“I’ll never be done with him, ma’am, but I can help you out all the same.”\n\nYou stretch your legs against the $band_color bands(if: $band_type is \"Medium\")[ and hope you’re not being over-confident in picking them]. Maybe this will work out the soreness you’ve been feeling (link: \"since…\")[since&mdash;well, something happened and now your legs hurt and that’s the [[end of that->and streeeeeetch]].]",
      "links": [
        {
          "text": "end of that",
          "destination": {
            "name": "and streeeeeetch",
            "pid": 86
          }
        }
      ]
    },
    {
      "pid": 86,
      "name": "and streeeeeetch",
      "text": "Once everyone’s strapped in, the instructor smiles a smile with more teeth than any human should have. “Okay? Here we go! And streeeeeetch! And relax. And streeeeeetch! And relax!” She must buy the word “and” in 55 gallon drums. You hope she gets a steep discount on them.\n\n(if: $band_type is \"Medium\")[It doesn’t take many repetitions before your muscles ache. You push on regardless, as if each kick shoves a walker further and further away from you. You grit your teeth and concentrate, refusing to stop until, suddenly, you have to.\n\nYou pant, satisfied with your effort for once.](else:)[There’s resistance, but not too much. You’re able to keep up with the instructor, kicking in time to her chirpy instructions. The soreness leaves your legs after a time. You know it’ll come back&mdash;it’s only slunk outside for a quick smoke&mdash;but the break from it is nice.]\n\n“You’re all doing so well!” the instructor says. She’s lying, of course. Some folks here can hardly move, age weighs them down so heavily. “Your heart rate and your spirits should be up, up, up!”\n\nYou and Michael look at each other and bust out laughing. “Fred!” the instructor says. “You’re disturbing everyone!” You should stop. You know you should. But the thought just makes you laugh all the more, until tears are streaming down your face. You’ve not laughed this hard since Virginia died.\n\n[[It feels pretty damn great->day program end]].\n",
      "links": [
        {
          "text": "It feels pretty damn great",
          "destination": {
            "name": "day program end",
            "pid": 88
          }
        }
      ]
    },
    {
      "pid": 87,
      "name": "church service",
      "text": "{\n(set: $_link_color to '#2d3e7b')\n(set: $_link_hover_color to '#aabcff')\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$choir_image+'\" alt=\"Man in church choir robe\" title=\"Man in church choir robe\" />')\n</div>\n}<span class=\"cap\">T</span><span>he Sundays when your church does the Lord’s Supper are great. The hymns you sing are better, the sermon’s far shorter, and you get a small snack. You told that to Virginia one time and a deacon overheard it. “I don’t think you should make fun of a sacred observance.”</span>\n\n“I figure if He’s big enough to make the world, He’s big enough to deal with my jokes,” you said. The deacon huffed off like a steam train. Maybe he had to go swap out the stick up his ass.\n\n“Let us stand now and sing hymn number 372, ‘According To Thy Gracious Word’.” The music minister gestures like he’s opening a window. You rise along with the other choir members, robes rustling.\n\nThen you realize you stood up without your hymnal. You’ll have to hope you [[remember the words->fake it]].\n",
      "links": [
        {
          "text": "remember the words",
          "destination": {
            "name": "fake it",
            "pid": 89
          }
        }
      ]
    },
    {
      "pid": 88,
      "name": "day program end",
      "text": "(live: 2s)[(goto: \"birthday party\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "birthday party",
            "pid": 226
          }
        }
      ]
    },
    {
      "pid": 89,
      "name": "fake it",
      "text": "<div class=\"quotes\">//According to Thy// (link-reveal: \"//gracious Word//\")[\n//In //(?) (link-reveal: \"//humility,//\")[\n//This {(text-style: \"strike\")[I] will I do},// (link-reveal: \"//my //(something)// Lord://\")[\n//I will //(link-reveal: \"//remember Thee.//\")[\n\n//{(text-style: \"strike\")[Gethsemane] The body given}// (link-reveal: \"(tum te tum)\")[\n//My bread //(hm hm hm) (link-reveal: \"//be://\")[(replace: ?exit-link)[You give up and only pretend to sing the [[rest of the hymn->bread and cup]].]\n]]]]]]</div>\n[]<exit-link|",
      "links": [
        {
          "text": "rest of the hymn",
          "destination": {
            "name": "bread and cup",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 90,
      "name": "bread and cup",
      "text": "The deacons gather with Pastor Mark to distribute tiny squares of unleavened bread on silver platters. When a platter reaches you, you take one square and hold it in your palm. The bread gleams tooth-white. “This is my body, broken for you,” the pastor says. You chew the bread, which lodges itself between your teeth. Everyone spends a moment picking the bits of bread out with their tongue while trying not to be obvious about it.\n\nThe platter with the tiny cups is heavy, weighed down by the glass and liquid. It’s Welch’s grape juice, because everyone knows alcohol’s bad for you and you certainly can’t admit drinking it. As Tom always says, the difference between Baptists and Methodists is that the Methodists will say hello to each other in the liquor store. “This is my blood, poured out for you.” The juice washes away the rest of the bread, replacing it with an acid tang. [[Quiet clicks->choir loft after service]] fill the sanctuary as people put their empty cups in the holders on the backs of the pews.",
      "links": [
        {
          "text": "Quiet clicks",
          "destination": {
            "name": "choir loft after service",
            "pid": 91
          }
        }
      ]
    },
    {
      "pid": 91,
      "name": "choir loft after service",
      "text": "One final hymn and a prayer, and the service is over. A hum rises as people greet each other and make lunch plans. You normally [[go down into the sanctuary proper->sanctuary]] after singing, but you tire more easily these days. You might should [[head to the choir room->choir room]], change out of your robe, and go find Virginia.\n{\n(set: $went_to_choir_room_first to false)\n}",
      "links": [
        {
          "text": "go down into the sanctuary proper",
          "destination": {
            "name": "sanctuary",
            "pid": 92
          }
        },
        {
          "text": "head to the choir room",
          "destination": {
            "name": "choir room",
            "pid": 93
          }
        }
      ]
    },
    {
      "pid": 92,
      "name": "sanctuary",
      "text": "You lift your hymnal and music folder and file out of the choir loft with the other singers, defined rows becoming a turbulent mix as you pour out into the sanctuary. You spot Virginia over at her usual pew and make your way through the crowd to her.\n\n“Nice anthem,” she says. “But I saw you bluff your way through the hymn.” She can always tell. After more than four decades together, you track each other the way that your mom tracked the weather. Long experience and careful observation let each of you predict what will come next.\n\n“I’ve got to get Peggy the blanket I knitted for her new grandson. Let me fetch it from the car and then meet you in the gathering area,” Virginia says.\n\n“Find Tom and Rachel while you’re at it,” you say. “See if they [[want to go to lunch->shake some hands]].”\n",
      "links": [
        {
          "text": "want to go to lunch",
          "destination": {
            "name": "shake some hands",
            "pid": 109
          }
        }
      ]
    },
    {
      "pid": 93,
      "name": "choir room",
      "text": "You lift your hymnal and music folder and file out of the choir loft with the other singers. A bunch of them head into the sanctuary, the defined rows becoming a turbulent mix, so you side-step the dawdlers and head for the choir room.\n\nPlenty of your fellow choir members beat you to it. There are two entrances to the room, so people inevitably come in both and end up milling about like sheep without a shepherd. They clump together around [[the table->return music]] where you return today’s anthem and the [[hangers->hang up robe]] where your choir robe goes.\n{\n(set: $went_to_choir_room_first to true)\n}",
      "links": [
        {
          "text": "the table",
          "destination": {
            "name": "return music",
            "pid": 94
          }
        },
        {
          "text": "hangers",
          "destination": {
            "name": "hang up robe",
            "pid": 95
          }
        }
      ]
    },
    {
      "pid": 94,
      "name": "return music",
      "text": "You click open your three-ring binder and pull out the sheet music to this week’s anthem. Your white hymnal goes into the pile on one end of the table and the sheet music into the wire basket on the other end. The bookcase where your binders go has numbered slots. You slide the binder into number 17 [[with a twinge of sadness->last Sunday in the choir]].(set: $return_to to \"Liz is sorry you're going\")",
      "links": [
        {
          "text": "<set>",
          "destination": {
            "name": "Liz is sorry you're going",
            "pid": 98
          }
        },
        {
          "text": "with a twinge of sadness",
          "destination": {
            "name": "last Sunday in the choir",
            "pid": 96
          }
        }
      ]
    },
    {
      "pid": 95,
      "name": "hang up robe",
      "text": "Choir robes go on numbered hangers. Hanger 17 (link: \"belongs\")[belonged [[to you->last Sunday in the choir]].(set: $return_to to \"hang up robe 2\")]",
      "links": [
        {
          "text": "<set>",
          "destination": {
            "name": "hang up robe 2",
            "pid": 97
          }
        },
        {
          "text": "to you",
          "destination": {
            "name": "last Sunday in the choir",
            "pid": 96
          }
        }
      ]
    },
    {
      "pid": 96,
      "name": "last Sunday in the choir",
      "text": "It’s time to be done singing in the choir. Past time, really. You delayed the decision for as long as you could, but you can’t fight time, not and win. You’re more unsteady on your feet than you used to be, you can’t learn the anthems in time for the service, and your bedtime has crept early enough that you fall asleep most Wednesday nights during rehearsal.\n\nIt’ll be strange, sitting out in the pews with Virginia. You’ve not been out there since Rebecca and Michael were young enough to spend the service squirming like puppies. You’d sit on one side of them and Virginia on the other, bookending them so each had a parent to help them behave.\n\nThey grew up and moved into the youth group, which meant they sat in the youth pew down front, where they pretended to listen to Pastor Mark and parents kept eyes on them. You went back to the choir with Virginia’s blessing.\n\n(link-goto: \"That was a long time ago, though\", $return_to).",
      "links": []
    },
    {
      "pid": 97,
      "name": "hang up robe 2",
      "text": "You always have to do this little juggling act in the choir room where you take off your robe, remove your sports coat from hanger 17, put the robe and stole on the hanger, and shrug on your coat. Once that’s done, you [[pick up the folder with your sheet music to return it->Liz is sorry you're going]].",
      "links": [
        {
          "text": "pick up the folder with your sheet music to return it",
          "destination": {
            "name": "Liz is sorry you're going",
            "pid": 98
          }
        }
      ]
    },
    {
      "pid": 98,
      "name": "Liz is sorry you're going",
      "text": "As you make your way through the other choir members, a hand falls on your shoulder. You recognize her when you turn around, which isn’t guaranteed these days. “Liz!” She’s the soprano who’s had to suffer you singing the baritone parts at the back of her head for years.\n\n“Hey, Fred! I wanted to tell you, I’m sorry you won’t be (link: \"singing with us any more\")[(if: $hid_condition_count > 0)[(goto: \"how does Liz know\")](else:)[(goto: \"Liz's reaction\")]].”",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "how does Liz know",
            "pid": 99
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "Liz's reaction",
            "pid": 264
          }
        }
      ]
    },
    {
      "pid": 99,
      "name": "how does Liz know",
      "text": "[[Wait, how&mdash;->how does Liz know 1]]",
      "links": [
        {
          "text": "Wait, how&mdash;",
          "destination": {
            "name": "how does Liz know 1",
            "pid": 100
          }
        }
      ]
    },
    {
      "pid": 100,
      "name": "how does Liz know 1",
      "text": "[[You didn’t tell&mdash;->how does Liz know 2]]",
      "links": [
        {
          "text": "You didn’t tell&mdash;",
          "destination": {
            "name": "how does Liz know 2",
            "pid": 101
          }
        }
      ]
    },
    {
      "pid": 101,
      "name": "how does Liz know 2",
      "text": "You’d talked to Yancy, the music minister, over lunch on Monday and told him you were done. There weren’t any other church members at Denny’s, and Yancy doesn’t betray confidences.\n\nLiz puts her hand on your arm and says, “You told the whole choir about it after Wednesday rehearsal. Made us promise not to throw you a party.”\n\nNow you remember. She knows (link-reveal: \"your…\")[condition, of course, and helps you when you forget. Once you started telling folks, you figured they’d gossip. Keeping a secret like that in church is like carrying water in a colander.\n\n[[But Liz you told direct]].]",
      "links": [
        {
          "text": "But Liz you told direct",
          "destination": {
            "name": "But Liz you told direct",
            "pid": 108
          }
        }
      ]
    },
    {
      "pid": 102,
      "name": "so many synonyms for crazy",
      "text": "“Crazy.” “Out of my mind.” “Loco.” “Insane.” “Idiot.”\n\nBefore, you’d never realized how often you said [[those words->you'll get a pie]].\n",
      "links": [
        {
          "text": "those words",
          "destination": {
            "name": "you'll get a pie",
            "pid": 103
          }
        }
      ]
    },
    {
      "pid": 103,
      "name": "you'll get a pie",
      "text": "“Tell you what. I’ll bring one of my pies for you next Sunday.”\n\n“Young lady, are you trying to butter me up?”\n\n“The butter’s for the pie, Fred.” The corner of her eyes crinkle with mirth.\n\nTom sticks his head into the rapidly-emptying choir room and shouts, “Hey, Fred, get out here or we’ll [[pick the restaurant->oh shit you forgot something]] without you.”\n\n“Looks like I’ve got to go,” you tell Liz. “But don’t forget that pie.”\n\n“Not a chance.”",
      "links": [
        {
          "text": "pick the restaurant",
          "destination": {
            "name": "oh shit you forgot something",
            "pid": 104
          }
        }
      ]
    },
    {
      "pid": 104,
      "name": "oh shit you forgot something",
      "text": "Tom, Virginia, and Tom’s wife Rachel are talking in the gathering area right outside the choir room. Tom takes one look at you and asks, (if: (history:) contains \"return music\")[“You going to lunch in your [[robe->hang up robe hastily]]?”](else:)[“You taking your [[music->return music hastily]] with us to lunch?”]",
      "links": [
        {
          "text": "robe",
          "destination": {
            "name": "hang up robe hastily",
            "pid": 105
          }
        },
        {
          "text": "music",
          "destination": {
            "name": "return music hastily",
            "pid": 106
          }
        }
      ]
    },
    {
      "pid": 105,
      "name": "hang up robe hastily",
      "text": "Crap. “I&mdash;I’ve gotta&mdash;just hang on a sec.” You double-time it back into the choir room, pulling your stole over your head and unzipping the front of your robe as you go. Hanger 17 has your sports coat on it, which you knock to the floor in your haste.\n\nYancy’s tidying up the room since the herd of choral sheep has headed off to find grass. He raises an eyebrow at you. “You know we charge you rental fees if you take your robe home.”\n\n“Yeah, yeah,” you say. The robe and stole replaced on the hanger and your sports coat snagged from the floor, you [[head back to Virginia and the others->pick the restaurant]].",
      "links": [
        {
          "text": "head back to Virginia and the others",
          "destination": {
            "name": "pick the restaurant",
            "pid": 107
          }
        }
      ]
    },
    {
      "pid": 106,
      "name": "return music hastily",
      "text": "Crap. “I&mdash;I’ve gotta&mdash;just hang on a sec.” You double-time it back into the choir room, clicking open your three-ring binder and fishing out the sheet music to the anthem you sang. You toss the anthem into the wire basket on the table where everyone else’s returned music is.\n\nYancy’s tidying up the room since the herd of choral sheep has headed off to find grass. He raises an eyebrow at you. “You’re more than welcome to take your music home and keep singing with us, you know.”\n\nYou wave your hand dismissively at Yancy, though it’s tempting. You shelve the binder in slot 17 in the bookcase and [[head back to Virginia and the others->pick the restaurant]].",
      "links": [
        {
          "text": "head back to Virginia and the others",
          "destination": {
            "name": "pick the restaurant",
            "pid": 107
          }
        }
      ]
    },
    {
      "pid": 107,
      "name": "pick the restaurant",
      "text": "Rachel, Tom and Virginia have been waiting with varying degrees of patience. Tom keeps looking out the double doors to the parking lot.\n\n“What’re you in the mood for?” Rachel asks. “[[Burgers->Tom ignores you]]? [[Soup and sandwich->Tom ignores you]]?”",
      "links": [
        {
          "text": "Burgers",
          "destination": {
            "name": "Tom ignores you",
            "pid": 110
          }
        },
        {
          "text": "Soup and sandwich",
          "destination": {
            "name": "Tom ignores you",
            "pid": 110
          }
        }
      ]
    },
    {
      "pid": 108,
      "name": "But Liz you told direct",
      "text": "(if: $hid_condition_count is 0)[“You insisted that no one throw you a party,” Liz says.\n\n]“Was someone //offering// to throw me a party?”\n\n“No, which is why you kept telling us not to hold one.” Liz looks like a stereotypical school librarian, stern and serious. When she smiles, though, the librarian vanishes and you see the warm, funny person she really is.\n\n“That doesn’t sound like me. One last chance to eat your chocolate pecan pie? And I pass? I reckon I’m(link: \" not in my right mind.”\")[&mdash;” You stop yourself at the last second and instead say, “[[missing out->so many synonyms for crazy]].”]",
      "links": [
        {
          "text": "missing out",
          "destination": {
            "name": "so many synonyms for crazy",
            "pid": 102
          }
        }
      ]
    },
    {
      "pid": 109,
      "name": "shake some hands",
      "text": "You move through the sanctuary greeting old friends and shaking hands. Some people hesitate, just for a brief moment, before they take your outstretched hand. Others are careful not to see you, so they don’t have to acknowledge you.\n\nThey all know (link-reveal: \"your…\")[condition, of course. Once you started telling folks, (if: $hid_condition_count > 0)[you figured they’d gossip.](else:)[you assured them they could tell others as well.] Keeping a secret like that in church is like carrying water in a colander.\n\nPeople aren’t sure how to respond to you. What do you say to a man who you just learned suffers from dementia? Some people are compassionate. Some people are uncomfortable. Some pity you, which is frustrating. But worse are those who avoid you entirely, like you’re contagious, like sitting next to you or talking to you would leach their brains away, too.\n\nYou suspected your illness would bother some people. You didn’t suspect how many people would [[avoid you->walk the sanctuary]].]\n",
      "links": [
        {
          "text": "avoid you",
          "destination": {
            "name": "walk the sanctuary",
            "pid": 121
          }
        }
      ]
    },
    {
      "pid": 110,
      "name": "Tom ignores you",
      "text": "“Nah, let’s go to the Nile,” Tom says. It’s his favorite restaurant, so you end up going there a lot. You also end up going there a lot because Tom has a habit of ignoring what //you// want to do. It’s been a low-level but constant annoyance the whole time you’ve known him. Talking to him about it doesn’t do anybody any good. Tom denies it and gets indignant; you get even angrier.\n\nYou’ve been [swallowing]<swallowing| that anger for years. (click: ?swallowing)[Maybe that’s why you say what you do:\n\n“You sure you want to go there? You know they let [blacks]<blacks| eat at the Nile now.”\n\n(click: ?blacks)[You didn’t set out to say it. It just popped out of your mouth.\n\n“Fred!” Virginia whispers, (link-reveal: \"horrified.\")[\n\nYou realize [[you didn’t say “blacks.”->so that just got said]]] ] ]",
      "links": [
        {
          "text": "you didn’t say “blacks.”",
          "destination": {
            "name": "so that just got said",
            "pid": 131
          }
        }
      ]
    },
    {
      "pid": 111,
      "name": "apologize for being a racist",
      "text": "“Tom, I… Virginia… Y’all know I didn’t mean…”\n\n“We know.” Rachel won’t meet your eye, and Virginia’s gone taut like a chalk line just before you snap it.\n\nYou breathe out heavily through your nose. “Sometimes I open my mouth and my dad falls out.”\n\nTom looks closely at you. “You sure you’re [[up for lunch]] today?”\n\n“We can [[go home]] if you want,” Virginia says. “There’s ham from last night I can reheat.”\n",
      "links": [
        {
          "text": "up for lunch",
          "destination": {
            "name": "up for lunch",
            "pid": 113
          }
        },
        {
          "text": "go home",
          "destination": {
            "name": "go home",
            "pid": 114
          }
        }
      ]
    },
    {
      "pid": 112,
      "name": "ignore your racist shit",
      "text": "“The Nile’s fine, Tom,” you say. That’s almost an apology, right? Letting him have his way? “We’d better get there before the Methodists.”\n\nVirginia shakes her head. “We’ll head home. There’s ham from last night I can reheat.”\n\nYou want to argue with her so badly, but the anger’s passed and left you tired. When it went, it took some vital spark of energy with it. “Home it is.”\n\n“We’ll catch you next week, then,” Rachel says.\n\n(if: $went_to_choir_room_first)[Virginia tells you, “I left my purse in the sanctuary. [[Go grab it for me->get Virginia's purse]] and we can leave.”](else:)[You’ve got to get rid of your choir stuff before you can leave. “Let me [[drop off my choir robe and hymnal->nearly empty choir room]] and we can go,” you tell Virginia.]",
      "links": [
        {
          "text": "Go grab it for me",
          "destination": {
            "name": "get Virginia's purse",
            "pid": 115
          }
        },
        {
          "text": "drop off my choir robe and hymnal",
          "destination": {
            "name": "nearly empty choir room",
            "pid": 116
          }
        }
      ]
    },
    {
      "pid": 113,
      "name": "up for lunch",
      "text": "You’re not going to miss lunch with friends just because you’re ill. It’d be too easy to beg off of all social events, to use your sickness as a shield between you and the world. There’s time enough in your future to be stuck at home. “I’m fine. Have some sweet tea waiting for me so I can get my blood sugar back up.”\n\n“I’d take sweet tea, too,” Virginia says. (if: $went_to_choir_room_first)[She turns to you. “Just let me get my purse from the sanctuary and we can head out.”\n\n“[[I’ll grab it->get Virginia's purse]],” you tell her.](else:)[\n\n“Let me [[drop off my choir robe and hymnal->nearly empty choir room]] and we can go,” you tell Virginia.]\n",
      "links": [
        {
          "text": "I’ll grab it",
          "destination": {
            "name": "get Virginia's purse",
            "pid": 115
          }
        },
        {
          "text": "drop off my choir robe and hymnal",
          "destination": {
            "name": "nearly empty choir room",
            "pid": 116
          }
        }
      ]
    },
    {
      "pid": 114,
      "name": "go home",
      "text": "You hate to miss lunch with friends just because you’re ill, but if you don’t pace yourself, you’ll be of no use to anyone. Besides, you and Virginia can have ham and then take a nap. Maybe come back for evening service. “Home sounds good. We’ve got ham to finish off.”\n\n“We’ll catch you next week, then,” Rachel says.\n\n(if: $went_to_choir_room_first)[Virginia turns to you. “I left my purse in the sanctuary. Wait here while I grab it and we can head home.”\n\n“[[I’ll grab it->get Virginia's purse]],” you tell her. When she looks concerned, you say, “It’s okay. I can make it the thirty steps between us and the sanctuary.](else:)[“Let me [[drop off my choir robe and hymnal->nearly empty choir room]] and we can go,” you tell Virginia.]\n",
      "links": [
        {
          "text": "I’ll grab it",
          "destination": {
            "name": "get Virginia's purse",
            "pid": 115
          }
        },
        {
          "text": "drop off my choir robe and hymnal",
          "destination": {
            "name": "nearly empty choir room",
            "pid": 116
          }
        }
      ]
    },
    {
      "pid": 115,
      "name": "get Virginia's purse",
      "text": "The sanctuary’s nearly empty now. Most people have braved the cold and gone to their cars. One couple&mdash;you think they were in your Sunday School class&mdash;are careful not to see you. That way they don’t have to talk to you.\n\nThere are too many folks who act like you’re contagious, like sitting next to you or talking to you would leach their brains away, too. You mostly shrug and work hard not to let it bother you.\n\nVirginia’s purse is on her usual pew(unless: $went_to_choir_room_first)[ in the sanctuary], tucked tight against the arm. It’s a white leather thing that’s more for decoration than for practicality.\n\nWhen you straighten up after getting it, [[Pastor Mark]]’s appeared beside you.\n",
      "links": [
        {
          "text": "Pastor Mark",
          "destination": {
            "name": "Pastor Mark",
            "pid": 117
          }
        }
      ]
    },
    {
      "pid": 116,
      "name": "nearly empty choir room",
      "text": "The choir room’s near to empty, so you sail through. Your hymnal and the sheet music from the morning’s anthem go on a table near the door and your three-ring binder goes in the bookcase where the folder lives. You always have to do this little juggling act at the rack where the robes go: you take off your robe, remove your sports coat from the hanger, put the robe and stole on the hangar, and shrug on your coat.\n\nWhen you turn around after putting your coat back on, [[Pastor Mark]]’s appeared beside you.\n",
      "links": [
        {
          "text": "Pastor Mark",
          "destination": {
            "name": "Pastor Mark",
            "pid": 117
          }
        }
      ]
    },
    {
      "pid": 117,
      "name": "Pastor Mark",
      "text": "“Yancy told me you’re stepping down from choir as of today.” The pastor’s handshake is firm, his hands calloused from the work he does around the community. “Sorry you won’t be singing, but now I’ll get to see you during service.”\n\nWith Samuel Mark for a name and wood-working for a hobby, Pastor Mark must’ve been destined to be a preacher. He’s been at Second Baptist for going on a decade now. He replaced a man who, it turns out, didn’t take kindly to things the church did like ordain women deacons. He’d tried to split the church, but he ended up being the one to split. Sam’s been a calming influence and done wonders for the church’s work around the city and elsewhere.\n\n“You want I should make faces at you? Keep you on your toes?”\n\nSam’s laughter is a deep rumble, the sound of distant thunder. “The congregation does that plenty without you [[piling on]].”\n",
      "links": [
        {
          "text": "piling on",
          "destination": {
            "name": "piling on",
            "pid": 118
          }
        }
      ]
    },
    {
      "pid": 118,
      "name": "piling on",
      "text": "In the following companionable pause, you say, “I’d best get back to Virginia. We’re headed (if: (history:) contains \"up for lunch\")[out for lunch with Tom and Rachel before we go home](else:)[home for lunch]. Don’t want to leave her waiting.”\n\nSam nods. “You do that.” You move towards the door, but stop when Sam says, “Fred?”\n\n“Yeah?”\n\n“All us ministers are here for you, but we’re not gonna press. Not our way. Know we’ll only do what you’re comfortable with us doing, and remember you can call on us any time. Tell Virginia too, will you?”\n\nYour eyes are wet, and you blink rapidly. Your emotions won’t be leashed any more, but you’ll be dipped if you’re going to cry in front of the pastor.\n\n[[“I’ll let her know.”->church service end]]\n",
      "links": [
        {
          "text": "“I’ll let her know.”",
          "destination": {
            "name": "church service end",
            "pid": 119
          }
        }
      ]
    },
    {
      "pid": 119,
      "name": "church service end",
      "text": "(live: 2s)[(goto: \"placement\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "placement",
            "pid": 224
          }
        }
      ]
    },
    {
      "pid": 120,
      "name": "sick Virginia",
      "text": "{\n(set: $_link_color to '#910e90')\n(set: $_link_hover_color to '#ff65fe')\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$flu_image+'\" alt=\"Kleenex on a bedside table\" title=\"Kleenex on a bedside table\" />')\n</div>\n}<span class=\"cap\">V</span><span>irginia’s voice floats from the hallway. You stop reading, turning the paperback book upside down on the TV tray to mark your place.</span> [[She must be feverish again->living room 2]]. (set: $virginia_call to 1)(set: $bell_location to \"sofa\")(set: $tylenol_location to \"kitchen\")(set: $glass_location to \"kitchen\")(set: $current_bedroom to \"bedroom 2\")",
      "links": [
        {
          "text": "<set>",
          "destination": {
            "name": "bedroom 2",
            "pid": 135
          }
        },
        {
          "text": "She must be feverish again",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        }
      ]
    },
    {
      "pid": 121,
      "name": "walk the sanctuary",
      "text": "You wander to one side of the sanctuary to escape the crush of people. You trail a hand along a pew back, the wood roughened and darkened by successive generations gripping it to sit, to stand, to sing.\n\nEven when you’re often confused and uncertain, you find that church calms you. It’s the routine. The years of attendance and ritual have worn grooves in your brain that dementia hasn’t yet smoothed away.\n\nYou realize you’re walking your old deacon’s beat, [[cleaning up discarded programs]] and [[straightening hymnals]] to help the staff prepare for tonight’s service.\n",
      "links": [
        {
          "text": "cleaning up discarded programs",
          "destination": {
            "name": "cleaning up discarded programs",
            "pid": 122
          }
        },
        {
          "text": "straightening hymnals",
          "destination": {
            "name": "straightening hymnals",
            "pid": 123
          }
        }
      ]
    },
    {
      "pid": 122,
      "name": "cleaning up discarded programs",
      "text": "The tri-fold paper programs give the order of worship: hymn numbers and lyrics, special music, who’ll pray and when. There’s a blank space on one fold where you can take notes on the sermon. At least, that’s the theory. You’ve never used it for that, and you haven’t seen anyone else doing it, either. Too much like school, taking notes for a test that won’t be handed out until you die.\n\nPastor Mark would get on to you for that last thought. “Religion that’s too focused on heaven is no good here on Earth. Jesus didn’t call us to think happy thoughts about the next life. He called us to [[make life better here->the tidy sanctuary]].”\n",
      "links": [
        {
          "text": "make life better here",
          "destination": {
            "name": "the tidy sanctuary",
            "pid": 124
          }
        }
      ]
    },
    {
      "pid": 123,
      "name": "straightening hymnals",
      "text": "The white hymnals get knocked askew during service, and the staff want them back in place before the next service. When you were an active deacon you never minded straightening them. Why have hymnals that don’t get used? A hymnal out of place is [[one that’s been sung from->the tidy sanctuary]].\n",
      "links": [
        {
          "text": "one that’s been sung from",
          "destination": {
            "name": "the tidy sanctuary",
            "pid": 124
          }
        }
      ]
    },
    {
      "pid": 124,
      "name": "the tidy sanctuary",
      "text": "Once you’ve got the sanctuary straightened to your satisfaction, you retrieve your own hymnal and folder of choir music from the pew where you left them. You’d better change out of your robe and put away your music so everyone can eat.\n\nSomeone coming back into the sanctuary spies you and waves at you like you’re an airplane and they want to help you land.\n\nOh, no, it’s [[Joan]].\n",
      "links": [
        {
          "text": "Joan",
          "destination": {
            "name": "Joan",
            "pid": 125
          }
        }
      ]
    },
    {
      "pid": 125,
      "name": "Joan",
      "text": "Some people need projects like they need food. They throw themselves into knitting, or working on cars, or volunteering at the downtown rescue mission. The project consumes them, and every conversation with them will turn to their project like a compass needle swinging north.\n\nJoan is one of those people, and [[her project is you->Joan has cures]].\n",
      "links": [
        {
          "text": "her project is you",
          "destination": {
            "name": "Joan has cures",
            "pid": 126
          }
        }
      ]
    },
    {
      "pid": 126,
      "name": "Joan has cures",
      "text": "“Joan,” you say, dropping a practiced mask of politeness over your features. “Hope you’re having a good Sunday.”\n\n“Fred, you’ll never guess what I found.” She’s got a red file folder. You know from past experience that its tab reads “FRED STRICKLAND” in Joan’s careful hand. One ragged corner of a torn-out newspaper article peeks from between the folder’s covers.\n\n“You know, Joan, it’d save time if you just came out and told me instead of us playing ‘Watch Fred fail to guess’.”\n\nJoan’s unfazed by your remark. Once she’s got up a good head of steam, she doesn’t turn aside for anything. “I saw this article in the paper last week and thought of you.” She slides the newspaper clipping from the file folder and [[presses it into your hand->save the newspaper article]].\n",
      "links": [
        {
          "text": "presses it into your hand",
          "destination": {
            "name": "save the newspaper article",
            "pid": 127
          }
        }
      ]
    },
    {
      "pid": 127,
      "name": "save the newspaper article",
      "text": "“Thanks, Joan.” You put down your hymnal and binder of sheet music so you can fold up the article. She saw you throw away one of her clippings once and came back with fresh copies the next week, so now, as long as she’s looking, you treat her clippings like bearer bonds. “I’ll read this when I get home.”\n\n“It’s about the brain!” Of course it is.\n\n“Great, I’ll read it&mdash;”\n\n“See, the brain is a muscle. It has to keep lifting heavy things or it won’t stay strong.”\n\nYou imagine lifting heavy things to drop on Joan. It’s not a charitable thought, but you don’t much care. Especially since you suspect that, even if you crushed her, she’d just slide more clippings to you out from under the rock.\n\n“That’s great. I’m [[sure the article&mdash;->have a puzzle book too]]”\n",
      "links": [
        {
          "text": "sure the article&mdash;",
          "destination": {
            "name": "have a puzzle book too",
            "pid": 128
          }
        }
      ]
    },
    {
      "pid": 128,
      "name": "have a puzzle book too",
      "text": "“That’s why I got you this, too!” The book she brings from behind her back is garish yellow and has a cartoonish crossword puzzle on the front. The puzzle has big round eyes and a dopey grin like a Labrador retriever. The title seals the deal, though: ''[[SUPER FUN CROSSWORD PUZZLES FOR SUPER FUN SENIORS->cures that don't cure]]''.",
      "links": [
        {
          "text": "SUPER FUN CROSSWORD PUZZLES FOR SUPER FUN SENIORS",
          "destination": {
            "name": "cures that don't cure",
            "pid": 129
          }
        }
      ]
    },
    {
      "pid": 129,
      "name": "cures that don't cure",
      "text": "When Dr. Johns diagnosed you with dementia, he gave you a brochure explaining what to expect. It warned you how friends might cope by suggesting cures. “It’s their way of trying to control the uncontrollable,” the brochure said. It predicted Joan’s behavior to a T. Last month it was herbal supplements her friend swore would bring your memory back. You tried one of the ginkgo biloba tablets and then threw the rest away.\n\nIt’s infuriating to spend energy being polite to people who should know better. You keep telling yourself that Joan means well, but there’s a yawning gulf between meaning well and [[doing well->saved by Tom]].\n",
      "links": [
        {
          "text": "doing well",
          "destination": {
            "name": "saved by Tom",
            "pid": 130
          }
        }
      ]
    },
    {
      "pid": 130,
      "name": "saved by Tom",
      "text": "You scoop up your hymnal and music folder from the pew where you dropped them. “Gee, Joan, that’s thoughtful, but I’m carrying a lot of things already. How ‘bout you bring that book to church tonight and I’ll take it then?”\n\nJoan’s frown is a weapon she’s happy to use to make you feel guilty. “I think you should take it now so you can start on the puzzles this afternoon. The sooner you start, the sooner your brain’ll be better.”\n\nTom sticks his head into the rapidly-emptying sanctuary and hollers, “Hey, get out here or we’ll [[pick the restaurant]] without you.” You’re saved.\n\n“Looks like I’ve got to go,” you tell Joan and head to Tom quick as you can.\n\n“Hang on, Fred, the book&mdash;” but you point at your ears and shrug, pretending you can’t hear her even though you can. \n\nGod surely forgives lies for self-preservation.\n",
      "links": [
        {
          "text": "pick the restaurant",
          "destination": {
            "name": "pick the restaurant",
            "pid": 107
          }
        }
      ]
    },
    {
      "pid": 131,
      "name": "so that just got said",
      "text": "You can’t un-say what you said, much as you’d like to. It’s hard to know what’s worse: saying things like that, or knowing you’ll likely say more things like that in the future, or knowing that sometimes you won’t remember at all.\n\nYou should [[apologize->apologize for being a racist]], but the words are [[lodged in your throat->ignore your racist shit]], stuck tight.\n",
      "links": [
        {
          "text": "apologize",
          "destination": {
            "name": "apologize for being a racist",
            "pid": 111
          }
        },
        {
          "text": "lodged in your throat",
          "destination": {
            "name": "ignore your racist shit",
            "pid": 112
          }
        }
      ]
    },
    {
      "pid": 132,
      "name": "bye-bye Tom and Rachel",
      "text": "(if: $went_to_choir_room_first)[Virginia tells you, “Fred, I left my purse in the sanctuary. [[Go grab it for me->get Virginia's purse]] and we can leave.”](else:)[You’ve got to get rid of your choir stuff before you can leave. “Let me [[drop off my choir robe and hymnal->nearly empty choir room]] and we can go,” you tell Virginia.]\n",
      "links": [
        {
          "text": "Go grab it for me",
          "destination": {
            "name": "get Virginia's purse",
            "pid": 115
          }
        },
        {
          "text": "drop off my choir robe and hymnal",
          "destination": {
            "name": "nearly empty choir room",
            "pid": 116
          }
        }
      ]
    },
    {
      "pid": 133,
      "name": "living room 2",
      "text": "The living room lamps are off this evening except for one that spills light onto your overstuffed chair and the TV tray next to it. (if: $virginia_call < 5)[Earlier, Virginia slept fitfully out here on (if: $virginia_call > 1 and $virginia_call < 4)[[[the sofa->look at sofa 2]]](else:)[the sofa], and the lights hurt her eyes. ](unless: (history:) contains \"living room 2\")[She’s had the flu for four days now, and she can’t find anywhere where she’s comfortable.](if: $virginia_call is 1)[\n\n“Fred,” she calls again, her voice coming from the [[hallway to your bedroom->bedroom 2]].\n\n](else-if: $virginia_call is 5)[\n\nYou settle back into your chair with a sigh and [[pick up the paperback->trying to read Clancy]] where you left it on the TV tray.\n\n](else-if: $virginia_call is 6)[\n\n(if: $bell_location is \"bedroom\")[The bell (link-goto: \"rings again and again\", $current_bedroom).](else:)[“(link-goto: \"Fred!\", $current_bedroom)” Virginia sounds frantic.]\n\n](else:)[The [[opening to the kitchen->kitchen 2]] is on one side of the room, and the (link-goto: \"hallway to your bedroom\", $current_bedroom) is on the other.]\n",
      "links": [
        {
          "text": "the sofa",
          "destination": {
            "name": "look at sofa 2",
            "pid": 134
          }
        },
        {
          "text": "hallway to your bedroom",
          "destination": {
            "name": "bedroom 2",
            "pid": 135
          }
        },
        {
          "text": "pick up the paperback",
          "destination": {
            "name": "trying to read Clancy",
            "pid": 141
          }
        },
        {
          "text": "opening to the kitchen",
          "destination": {
            "name": "kitchen 2",
            "pid": 136
          }
        }
      ]
    },
    {
      "pid": 134,
      "name": "look at sofa 2",
      "text": "Virginia left a bunch of discarded tissues and empty cough drop wrappers on the sofa(if: $virginia_call is 1)[. You’ll clean up for her as soon as you [[take care of her->living room 2]].](elseif: $virginia_call is 2 and $bell_location is \"sofa\")[, along with the |bell>[bell].(click: ?bell)[(set: $bell_location to \"fred\")\n\nYou grab the bell to [[take to Virginia->living room 2]].]](else:)[. You can clean up as soon as you [[take care of her->living room 2]].]",
      "links": [
        {
          "text": "take care of her",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        },
        {
          "text": "take to Virginia",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        }
      ]
    },
    {
      "pid": 135,
      "name": "bedroom 2",
      "text": "(if: $virginia_call is 1)[Rebecca and Michael and their families watch you from their pictures as you walk down the hall and into the bedroom. ]Virginia’s huddled under a pile of covers. She’s shaking so much that you can see her shivers even in the dim light from the hallway door.\n\n“Hey, Nipper,” you say, “You should’ve rung the bell. You know how engrossed I get when I read.”\n\n“F-f-f-forg-g-g-got it in the l-l-l-living r-r-r-r-room.” She gestures towards the empty nightstand.\n\n“Fever’s back, huh?\n\n<div class=\"quotes\">‘These burning fits but meteors be,\nWhose matter in thee is soon spent.’”</div>\n“R-r-r-really?” Virginia says. “Quoting D-d-d-donne at m-m-m-m-me?”\n\n“Seemed appropriate.” There’s more to that stanza, but you can’t bring it to mind right now. You pull back the covers she’s clutched around her. When you rest the back of your hand against her forehead, the heat makes you jerk away. She’s worse than this afternoon. “Let’s get some Advil in you.”\n\n“N-n-n-no, Tylenol this t-t-t-time.” She’s alternating pain relievers, sandbags against her fever’s rising tide.\n\n“There’s some in the nightstand.” But there (link-reveal: \"isn’t.\")[\n\n“K-k-k-kitchen,” she says, teeth clacking. Right. You’d moved the medicine in there when Virginia moved to the sofa.\n\n“Hang tight,” you say. “I’ll [[go get it->advance virginia state machine]].”]",
      "links": [
        {
          "text": "go get it",
          "destination": {
            "name": "advance virginia state machine",
            "pid": 139
          }
        }
      ]
    },
    {
      "pid": 136,
      "name": "kitchen 2",
      "text": "Moonlight slants from the window over the sink, lighting the kitchen table(if: $tylenol_location is \"kitchen\" and $virginia_call is not 4)[ where the [[Tylenol]] sits next to a glass](elseif: $virginia_call is 3 and $glass_location is \"kitchen\")[ and the [[glass]] sitting on it]. The wall opposite is taken up by a refrigerator and some cabinets. An opening leads [[back to the living room->living room 2]].\n\n(if: $tylenol_location is \"kitchen\" and $virginia_call is 4)[The [[Tylenol]] sits next to the sink. You must’ve accidentally carried it back in here when you came for the glass.]",
      "links": [
        {
          "text": "Tylenol",
          "destination": {
            "name": "Tylenol",
            "pid": 190
          }
        },
        {
          "text": "glass",
          "destination": {
            "name": "glass",
            "pid": 191
          }
        },
        {
          "text": "back to the living room",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        }
      ]
    },
    {
      "pid": 137,
      "name": "bedroom for tylenol",
      "text": "(if: $tylenol_location is \"fred\")[(set: $her to \"Virginia\")In the bedroom, you (if: $bell_location is \"fred\")[(set: $bell_location to \"bedroom\")(set: $her to \"her\") put the bell on the nightstand next to Virginia and ]rattle the pill bottle at $her. She’s dozing, small huffs of breath coming from between her lips, and the sound doesn’t wake her up.\n\nYou shake her gently. “Ginny. I’ve got the Tylenol.”\n\n“W-w-w-water too?”\n\nCrap. “I’ll [[get a glass->advance virginia state machine]].”\n\n](elseif: $bell_location is \"fred\")[In the bedroom you put the bell on the nightstand next to Virginia. “Hey, I brought you the bell.”\n\nShe rolls over to face you. Her eyes don’t quite focus on you. “T-t-t-the T-t-t-tylenol?”\n\nYou’d forgotten. “[[Be right back->living room 2]].”\n\n](elseif: $virginia_call is 2)[You’re most of the way into the bedroom when you realize your hands are empty. You [[back out->living room 2]], trying not to disturb Virginia.](else:)[You [[shouldn’t see this->living room 2]], okay?]",
      "links": [
        {
          "text": "get a glass",
          "destination": {
            "name": "advance virginia state machine",
            "pid": 139
          }
        },
        {
          "text": "Be right back",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        },
        {
          "text": "back out",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        },
        {
          "text": "shouldn’t see this",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        }
      ]
    },
    {
      "pid": 138,
      "name": "bedroom for water",
      "text": "(if: $glass_location is \"fred\")[You tiptoe into the bedroom, which is silly since you’ve got to wake her up anyway. “Virginia.” You shake her, making sure not to slop water onto her. “Here, drink.”\n\nShe takes a greedy gulp of the cool water and holds her hands out for the pills. You reach for the nightstand but there’s (if: $bell_location is \"bedroom\")[only the bell ](else:)[nothing ]there. The Tylenol’s gone.\n\n“I&mdash;[[hang on->advance virginia state machine]].”\n\n](elseif: $virginia_call is 3)[You’re most of the way into the bedroom when you realize your hands are empty. You [[back out->living room 2]], trying not to disturb Virginia.\n\n](else:)[You [[shouldn’t see this->living room 2]], okay?]",
      "links": [
        {
          "text": "hang on",
          "destination": {
            "name": "advance virginia state machine",
            "pid": 139
          }
        },
        {
          "text": "back out",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        },
        {
          "text": "shouldn’t see this",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        }
      ]
    },
    {
      "pid": 139,
      "name": "advance virginia state machine",
      "text": "{(if: $virginia_call is 1)[\n  (set: $virginia_call to 2)\n  (set: $current_bedroom to \"bedroom for tylenol\")\n  (set: $return_to to \"living room 2\")\n  ]\n(else-if: $virginia_call is 2)[\n  (set: $virginia_call to 3)\n  (set: $current_bedroom to \"bedroom for water\")\n  (set: $tylenol_location to \"nowhere\")\n  (if: $bell_location is not \"bedroom\")[\n    (set: $bell_location to \"nowhere\")\n    ]\n  (set: $return_to to \"living room 2\")\n  ]\n(else-if: $virginia_call is 3)[\n  (set: $virginia_call to 4)\n  (set: $current_bedroom to \"bedroom for tylenol again\")\n  (set: $tylenol_location to \"kitchen\")\n  (set: $return_to to \"living room 2\")\n  ]\n(else-if: $virginia_call is 4)[\n  (set: $virginia_call to 5)\n  (set: $current_bedroom to \"bedroom for final request\")\n  (set: $tylenol_location to \"nowhere\")\n  (set: $return_to to \"living room 2\")\n  ]\n(else-if: $virginia_call is 5)[\n  (set: $virginia_call to 6)\n  (set: $return_to to \"living room 2\")\n  ]\n}(goto: $return_to)",
      "links": [
        {
          "text": "<set>",
          "destination": {
            "name": "bedroom for tylenol",
            "pid": 137
          }
        },
        {
          "text": "<set>",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        },
        {
          "text": "<set>",
          "destination": {
            "name": "bedroom for water",
            "pid": 138
          }
        },
        {
          "text": "<set>",
          "destination": {
            "name": "bedroom for tylenol again",
            "pid": 140
          }
        },
        {
          "text": "<set>",
          "destination": {
            "name": "bedroom for final request",
            "pid": 144
          }
        }
      ]
    },
    {
      "pid": 140,
      "name": "bedroom for tylenol again",
      "text": "(if: $tylenol_location is \"fred\")[You double-check as you enter the bedroom. The glass of water’s still there.\n\nYou wake Ginny up a third time. “I’ve got it this time, promise.” Her throat works as she swallows two round white pills and chases them with another mouthful of water.\n\n“Need anything else?”\n\n“N-n-not to be s-s-s-sick.” The clack of her teeth makes you wince.\n\nOnce you’re convinced there’s nothing else she needs, you [[let her rest->advance virginia state machine]].\n\n](elseif: $virginia_call is 4)[You’re most of the way into the bedroom when you realize your hands are empty. You [[back out->living room 2]], trying not to disturb Virginia.\n\n](else:)[You [[shouldn’t see this->living room 2]], okay?]",
      "links": [
        {
          "text": "let her rest",
          "destination": {
            "name": "advance virginia state machine",
            "pid": 139
          }
        },
        {
          "text": "back out",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        },
        {
          "text": "shouldn’t see this",
          "destination": {
            "name": "living room 2",
            "pid": 133
          }
        }
      ]
    },
    {
      "pid": 141,
      "name": "trying to read Clancy",
      "text": "“The Sum of All Fears” is a comfort read. It’s a book you turn to when you want to be entertained but not work too hard. Clancy’s a bigger fan of military tech than you are&mdash;in your experience, hardware broke all too easily when you needed it&mdash;but his books have a momentum to them that’s too often kept you up way too late, reading [[just one more chapter->reading is getting hard]].",
      "links": [
        {
          "text": "just one more chapter",
          "destination": {
            "name": "reading is getting hard",
            "pid": 142
          }
        }
      ]
    },
    {
      "pid": 142,
      "name": "reading is getting hard",
      "text": "But it’s a harder read this time around. You’re getting lost in paragraphs that you know aren’t [[difficult->Virginia's been calling]].",
      "links": [
        {
          "text": "difficult",
          "destination": {
            "name": "Virginia's been calling",
            "pid": 143
          }
        }
      ]
    },
    {
      "pid": 143,
      "name": "Virginia's been calling",
      "text": "(if: $bell_location is \"bedroom\")[A violently-ringing bell](else:)[Virginia all but shouting] [[yanks you->advance virginia state machine]] out of the book.",
      "links": [
        {
          "text": "yanks you",
          "destination": {
            "name": "advance virginia state machine",
            "pid": 139
          }
        }
      ]
    },
    {
      "pid": 144,
      "name": "bedroom for final request",
      "text": "You enter the bedroom at a near-run. “What? What’s wrong?”\n\nVirginia’s sitting up in bed, (if: $bell_location is \"bedroom\")[bell clutched in one hand](else:)[hands clasped tight to her chest]. “Where’ve you been?” Her shivers are gone, burned away by fear.\n\n“Reading in the living room. I just got caught up in my book, that’s all.”\n\n“You said you’d [[bring me the tissues->you were supposed to bring tissues]]. I waited and waited, and then I got scared when you didn’t answer.”",
      "links": [
        {
          "text": "bring me the tissues",
          "destination": {
            "name": "you were supposed to bring tissues",
            "pid": 145
          }
        }
      ]
    },
    {
      "pid": 145,
      "name": "you were supposed to bring tissues",
      "text": "You blink. “Wait, I asked you if you needed anything, and you just said you didn’t want to be sick.”\n\n“But after that, I asked you to get the tissues and [[you said you would]].”",
      "links": [
        {
          "text": "you said you would",
          "destination": {
            "name": "you said you would",
            "pid": 146
          }
        }
      ]
    },
    {
      "pid": 146,
      "name": "you said you would",
      "text": "You don't remember that part of the conversation. It’s vanished, swallowed up by some pit. It’s happening to you more and more lately. You figured age was catching up with you, but (link-reveal:\"this…\")[this is becoming dangerous.\n\n“I’m really sorry I forgot. Too eager to get back to my book, I guess.” Virginia looks calmer, her breathing as normal as it’s going to be while she’s ill. “Let me get the tissues for you. And tell you what, I’ll call Rebecca and ask her to stay with us. Help us out while you’re sick.”\n\nYou’ll also [[get with Dr. Johns->sick Virginia end]] and have him tweak your meds. Fix whatever’s going on.\n\nVirginia takes your hand and squeezes it. “Thanks,” she says, “that’d be good.”\n]",
      "links": [
        {
          "text": "get with Dr. Johns",
          "destination": {
            "name": "sick Virginia end",
            "pid": 147
          }
        }
      ]
    },
    {
      "pid": 147,
      "name": "sick Virginia end",
      "text": "(live: 2s)[(set: $_percent_complete to 54)(goto: \"diagnosis\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "diagnosis",
            "pid": 148
          }
        }
      ]
    },
    {
      "pid": 148,
      "name": "diagnosis",
      "text": "{\n(set: $_link_color to '#0082e6')\n(set: $_link_hover_color to '#58b7ff')\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$doctor_image+'\" alt=\"Doctor coat on coatrack\" title=\"Doctor coat on coatrack\" />')\n</div>\n}<span class=\"cap\">T</span><span>he doctor’s private office is as plush as you figured it might be. He’s got a solid desk and some comfy wingback chairs arranged in front of it. He must’ve bought nice furniture so at least you’re not uncomfortable while he’s giving you bad news.</span>\n\n“But Alzheimer’s doesn’t run in Fred’s family!” Virginia’s in a chair alongside you. She’s been your constant companion through the battery of tests you’ve taken and gauntlet of specialists you’ve run these last few months.\n\nThe doctor spreads his hands wide. “There’s a lot we don’t know about Alzheimer’s and other types of dementia. I can’t tell you why sometimes it runs in families and other times doesn’t. I can’t tell you what causes Alzheimer’s.\n\n“What I //can// tell you is how we’ll help you [[manage the disease->what about drugs]].”\n",
      "links": [
        {
          "text": "manage the disease",
          "destination": {
            "name": "what about drugs",
            "pid": 149
          }
        }
      ]
    },
    {
      "pid": 149,
      "name": "what about drugs",
      "text": "“Couldn’t it be a problem with his medication?” Virginia asks.\n\n“We’ve adjusted his medications, and given your log, we’ve got a good handle on that aspect of Fred’s medical care.” Virginia’s been tracking what drugs and supplements you’ve taken in a journal, building a detailed history.\n\nYou jump in. “Aren’t you being a (link-reveal: \"bit\")[&mdash;” You pick at the chair’s fabric while you hunt for the word you want. “I mean, this seems sudden.”\n\n“Fred, we’ve given you a physical, a full neuro workup, a psych eval, and a battery of lab tests. Your score on the MMSE is below where it should be&mdash;”\n\n“[[Jargon]], young man,” Virginia snaps, sounding like the teacher she once was.\n]\n",
      "links": [
        {
          "text": "Jargon",
          "destination": {
            "name": "Jargon",
            "pid": 150
          }
        }
      ]
    },
    {
      "pid": 150,
      "name": "Jargon",
      "text": "“Sorry, ma’am,” the doctor says, reminding you of Rebecca when she’d get called on the carpet. “The point is, we’re confident in the dementia diagnosis.”\n\n“//I’m// not confident, because I know [[I don’t have Alzheimer’s->Dr. Johns challenges you]].” You look pointedly at the doctor. “I don’t. I’m sixty-three years old. This kind of forgetting’s to be expected.”\n\n“Fred, could you name the last four presidents for me?”\n",
      "links": [
        {
          "text": "I don’t have Alzheimer’s",
          "destination": {
            "name": "Dr. Johns challenges you",
            "pid": 151
          }
        }
      ]
    },
    {
      "pid": 151,
      "name": "Dr. Johns challenges you",
      "text": "You laugh. “What’ll that prove? That I don’t pay attention to current events?”\n\n“You’re the only person I know who subscribes to //The Wall Street Journal// alongside the //Morning News//.” The doctor leans forward. “C’mon, Fred, who are the [[last four presidents]]?”\n",
      "links": [
        {
          "text": "last four presidents",
          "destination": {
            "name": "last four presidents",
            "pid": 152
          }
        }
      ]
    },
    {
      "pid": 152,
      "name": "last four presidents",
      "text": "“[Fine]<fine|. (click: ?fine)[(link-reveal: \"Reagan…\")[(link-reveal: \"Nixon…\")[(link: \"Johnson…\")[Johnson&mdash;” You fish around in your memory, but the fish aren’t (link-reveal: \"biting.\")[ “&mdash;and the one with the hair and teeth.”\n\nFrom the look on Virginia’s face, you missed one or two. “I didn’t realize he’d gotten this bad,” she says. “I should have caught it earlier.” Her voice rises like a bird taking flight. “Why didn’t I catch it earlier?”\n\n“He covers.” The doctor leans back and sighs. “He’s a personable man with a sharp mind. He knows how to pretend he’s following the conversation, or how to play off a lapse with a joke at his own expense.”\n\n“Now, hang on a minute.” They’re talking about you like you’re not there, like you’ve faded away.\n\n“[[What's my name]], Fred?”\n\n]]]]]\n",
      "links": [
        {
          "text": "What's my name",
          "destination": {
            "name": "What's my name",
            "pid": 153
          }
        }
      ]
    },
    {
      "pid": 153,
      "name": "What's my name",
      "text": "How could he [[tell->obvious forgetting]]?",
      "links": [
        {
          "text": "tell",
          "destination": {
            "name": "obvious forgetting",
            "pid": 161
          }
        }
      ]
    },
    {
      "pid": 154,
      "name": "guess the doctor's name",
      "text": "(set: $hid_condition_count to it+1)“James…?” You meant to be a lot more definite when you said it, but your uncertainty sounded loud and clear.\n\n(display: \"the doctor's actual name\")\n",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "the doctor's actual name",
            "pid": 156
          }
        }
      ]
    },
    {
      "pid": 155,
      "name": "don't guess the doctor's name",
      "text": "You cross your arms and stare at the doctor. If he’s going to be a jerk to you, well, you’ll be a jerk right back. After an uncomfortable pause, the doctor says, (display: \"the doctor's actual name\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "the doctor's actual name",
            "pid": 156
          }
        }
      ]
    },
    {
      "pid": 156,
      "name": "the doctor's actual name",
      "text": "“It’s ‘Reggie Johns’. You can even read it off of the diploma.” He points his thumb over his shoulder at the framed piece of paper behind him. “Though I’d’ve known you read it instead of remembering it when you called me Reginald. You’ve been my patient for near on five years.”\n\n“So I forgot your name!” You make a violent gesture, as if shooing away a fly. “I’ve never been great at names anyway! It’s not like&mdash;”\n\nDr. Johns doesn’t let you finish. “I’ve seen this go one of two ways in my patients, Fred.” He leans forward, steepling his fingers. “One, they deny it. Decide to pretend they don’t have dementia. They do all right for a while, but their lapses get more frequent and more severe, and they can’t cope with those lapses because they’re in denial. They hurt themselves, and worse, they hurt their spouse who has to do all the caretaking because they’ve chosen not to cooperate.\n\n“Two, they accept it. They work with me and their spouse to mitigate the symptoms and to live a full life. ‘Cause they’re not dead, and they’ve still got good years ahead of them.\n\n“I can’t tell you which way you’ll go. It’s up to you to [[make the choice]].”\n",
      "links": [
        {
          "text": "make the choice",
          "destination": {
            "name": "make the choice",
            "pid": 163
          }
        }
      ]
    },
    {
      "pid": 157,
      "name": "acceptance",
      "text": "“What comes next?” you say, and as soon as the words leave your lips, Virginia relaxes. You hadn’t realized how taut she was.\n\n“You’ll have good days and bad,” the doctor says. “It’s like clouds drifting across the sun. You’ll have moments when you fall into shadow.” He slides a brochure across his desk as if he’s selling a timeshare to you and Virginia. “Give this a read. It’ll tell you what to expect.”\n\nYou take the brochure. It’s folded in thirds longways like a church program, only glossy and in color. “So this is ‘What to Expect When You’re Expecting the Worst’?”\n\n“Fred,” Virginia begins, but the doctor interrupts her. “No, jokes are good. You need to keep your sense of humor.”\n\n“Do they have to be //good// jokes?” Virginia asks. Her smile is faint, and wavers like a mirage.\n\n“[[That’s the spirit->leaving the doctor]],” you tell her. She won’t look at you, though.\n",
      "links": [
        {
          "text": "That’s the spirit",
          "destination": {
            "name": "leaving the doctor",
            "pid": 158
          }
        }
      ]
    },
    {
      "pid": 158,
      "name": "leaving the doctor",
      "text": "All that’s left is to shake the doctor’s hand and schedule your next appointment with the receptionist.\n\nYou and Virginia walk hand in hand to the car. She’s quiet the whole way. Finally you can’t stand it any longer. “You know, that doctor was right mean.”\n\n“I think he did well to lay things out so plainly for us.”\n\n“That’s not what I meant.” You turn her to face you. “He never did tell me who the last four presidents are.”\n\nAnd then Virginia is sobbing. You gather her up in a bear hug. Her body is so slight against yours that you fear she might [[blow away->diagnosis end]].",
      "links": [
        {
          "text": "blow away",
          "destination": {
            "name": "diagnosis end",
            "pid": 159
          }
        }
      ]
    },
    {
      "pid": 159,
      "name": "diagnosis end",
      "text": "(live: 2s)[(set: $_percent_complete to 62)(goto: \"day program\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "day program",
            "pid": 77
          }
        }
      ]
    },
    {
      "pid": 160,
      "name": "party in the break room",
      "text": "They got you a sheet cake for your retirement party, one of those vanilla jobs from Piggly Wiggly, and laid it out on a table in the break room. You told them not to make a fuss, but (if: (history:) contains \"retirement\")[they didn’t listen.](else:)[you’re a tiny bit glad they did.] The baker drew (link: \"these…\")[these two squares touching each other and filled with squiggly lines. You’re not sure what it’s supposed to be, and you don’t know if that’s [[your fault->what's that cake]] or the [[baker’s->what did the baker draw anyway]].]",
      "links": [
        {
          "text": "your fault",
          "destination": {
            "name": "what's that cake",
            "pid": 164
          }
        },
        {
          "text": "baker’s",
          "destination": {
            "name": "what did the baker draw anyway",
            "pid": 165
          }
        }
      ]
    },
    {
      "pid": 161,
      "name": "obvious forgetting",
      "text": "Was it [[obvious->to bluff or not to bluff]]?",
      "links": [
        {
          "text": "obvious",
          "destination": {
            "name": "to bluff or not to bluff",
            "pid": 162
          }
        }
      ]
    },
    {
      "pid": 162,
      "name": "to bluff or not to bluff",
      "text": " You could [[bluff your way through it->guess the doctor's name]], though you’re tempted [[not to say anything->don't guess the doctor's name]].(set: $hid_condition_max to it+1)",
      "links": [
        {
          "text": "bluff your way through it",
          "destination": {
            "name": "guess the doctor's name",
            "pid": 154
          }
        },
        {
          "text": "not to say anything",
          "destination": {
            "name": "don't guess the doctor's name",
            "pid": 155
          }
        }
      ]
    },
    {
      "pid": 163,
      "name": "make the choice",
      "text": "“//We// make the choice,” Virginia says, and there’s steel in her voice once more. She puts a hand atop yours and you know: [[there’s no choice->acceptance]].",
      "links": [
        {
          "text": "there’s no choice",
          "destination": {
            "name": "acceptance",
            "pid": 157
          }
        }
      ]
    },
    {
      "pid": 164,
      "name": "what's that cake",
      "text": "“I appreciate the gesture,” you tell the people crowded into the break room, “but I’ll be dipped if I can tell what’s on the cake.” You make a show of taking off your glasses and polishing them on your shirt. “Time to update the prescription.”\n\n(display: \"Patricia tells you what it is\")\n",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "Patricia tells you what it is",
            "pid": 166
          }
        }
      ]
    },
    {
      "pid": 165,
      "name": "what did the baker draw anyway",
      "text": "“I appreciate the gesture,” you tell the people crowded into the break room, “but I’ll be dipped if I can tell what’s on the cake. That there was drawn by a baker, not an artist.”\n\n(display: \"Patricia tells you what it is\")\n",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "Patricia tells you what it is",
            "pid": 166
          }
        }
      ]
    },
    {
      "pid": 166,
      "name": "Patricia tells you what it is",
      "text": "Patricia laughs and squeezes your arm. “It’s your general ledger!”\n\nGreg says, “Oh, //that’s// what it is. Huh.” He frowns at you. “I couldn’t tell either.” Greg’s a newer sales rep. He replaced Jimmy, who had replaced Robin, who had replaced Wes, who had replaced Harold-not-Harry-thank-you, who had (link-reveal: \"replaced\")[…the person who took Tom’s place. The guy with the handshake that came at you sideways and high, like a fighter plane.\n\nListed like that, it could be a Biblical genealogy, only for sales people.\n\nYou point at the squares. “If that’s my old ledger, the baker should’ve made it bigger,” you say.\n\nPatricia says, “That baker didn’t have a steady hand. I’d have had to get the extra-large sheet cake, and [[my accountant]] taught me to be frugal.”\n]",
      "links": [
        {
          "text": "my accountant",
          "destination": {
            "name": "my accountant",
            "pid": 167
          }
        }
      ]
    },
    {
      "pid": 167,
      "name": "my accountant",
      "text": "“Maybe my replacement won’t be such a skinflint.” You look over to the man who’s taking your place. He came on board two weeks ago so you could get him up to speed. You’d feel bad about not remembering his name after working with him, but you’ve only got so much memory. No need to spend it on a fellow you won’t see again after today.\n\n“Maybe you need to cut the cake! Some of us still have work to do!” someone calls from the crowd, which gets a polite laugh out of folks. You transfer your cane to your other hand and pick up the knife. You slice the cake's short end and everyone applauds. Ruby, the receptionist, takes over from there, carving up the cake and knifing it onto plates. She tells you, “Retiree’s choice,” and points the cake knife at the collection of [[edge pieces]<edge_piece|, [inner pieces]<inner_piece| and two [corner pieces]<corner_piece|]<all_those_pieces|(if: $shouted_at_ruby)[. She doesn’t sound happy about serving you, though].(set: $replacement_text to \"edge pieces, inner pieces, and two corner pieces\")\n\n(click: ?edge_piece)[You pick up an edge piece. It’s got enough frosting to balance the cake, but not too much. (replace: ?all_those_pieces)[$replacement_text](display: \"stand or sit?\")](click: ?inner_piece)[You pick up an inner piece, one with only a little frosting on top. That stuff’s too sweet to have a lot of in one go. (replace: ?all_those_pieces)[$replacement_text](display: \"stand or sit?\")](click: ?corner_piece)[You pick up one of the two corner pieces. It’s absolutely covered in frosting, the best part of the cake. (replace: ?all_those_pieces)[$replacement_text](display: \"stand or sit?\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "stand or sit?",
            "pid": 168
          }
        }
      ]
    },
    {
      "pid": 168,
      "name": "stand or sit?",
      "text": "You can [[stand]<stand_at_table| or [sit]<sit_at_table|]<stand_or_sit_choice| at one of the break room’s tall diner-like tables.(set: $replacement_text to \"stand or sit\")\n\n(click: ?stand_at_table)[(display: \"stand at table\")(set: $standing_at_table to true)(replace: ?stand_or_sit_choice)[$replacement_text]](click: ?sit_at_table)[(display: \"sit at table\")(set: $standing_at_table to false)(replace: ?stand_or_sit_choice)[$replacement_text]]\n",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "stand at table",
            "pid": 170
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "sit at table",
            "pid": 169
          }
        }
      ]
    },
    {
      "pid": 169,
      "name": "sit at table",
      "text": "You put the cake on a table, scoot out a tall stool, and, using the cane for leverage, slide onto the stool. This’s gonna be a fun one to [[get down off of->Patricia joins you]].",
      "links": [
        {
          "text": "get down off of",
          "destination": {
            "name": "Patricia joins you",
            "pid": 171
          }
        }
      ]
    },
    {
      "pid": 170,
      "name": "stand at table",
      "text": "You put the cake on a table and scoot two of the table’s tall stools out of the way to give you a place to stand. It’ll be hell on your feet after a while, but it’s better than trying to [[scale those stools->Patricia joins you]].\n",
      "links": [
        {
          "text": "scale those stools",
          "destination": {
            "name": "Patricia joins you",
            "pid": 171
          }
        }
      ]
    },
    {
      "pid": 171,
      "name": "Patricia joins you",
      "text": "You take a bite of cake. The frosting is as sweet as you expected. But something’s (link-reveal: \"missing. \")[Water. You meant to get a drink, but you forgot.\n\nAs if reading your mind, Patricia puts a glass of water next to your plate. (if: $standing_at_table)[She sits down next to you. “//You// can stand up. I’m going to rest my feet.”\n\n“‘Fraid I would break my neck climbing one of these mountains.” You point your plastic fork at her. “You break //your// neck, don’t come crying to me.”](else:)[“Can I join you?” she asks, but sits down without waiting for an answer. She knew you’d say yes.\n\n“Feel free, but you’ll have to climb back down when you’re done. You break your neck, don’t come crying to me.”]\n\n“If I break my neck, not crying to you’ll be the least of my worries.”\n\n“Told you we should’ve gotten real-people-sized tables and chairs in here.”\n\n“What Paul wants, [[Paul gets]].” Her shrug comes from years of arguments with the company’s owner.\n]\n",
      "links": [
        {
          "text": "Paul gets",
          "destination": {
            "name": "Paul gets",
            "pid": 172
          }
        }
      ]
    },
    {
      "pid": 172,
      "name": "Paul gets",
      "text": "When Patricia joined the company as the new business manager, you weren’t sure how she’d do. She’s a tiny thing, and has this air (link-reveal: \"of\")[…what’s (link-reveal: \"the word.\")[ Anyway, she seemed so nice and sweet and charming. She replaced a jerk of a business manager who’d gotten canned for fighting too much with Paul. Paul’s not one for putting up with people contradicting him, not for long.\n\nThen she whipped the company in shape. Her politeness hides an iron will. She used how people underestimated her to get things done, and left people thinking it was their idea all along when she did so. She may say that what Paul wants, Paul gets. What she’s not saying is how a lot of times, what Paul wants is [[what Patricia wants Paul to want->missing out on]].\n\n]]",
      "links": [
        {
          "text": "what Patricia wants Paul to want",
          "destination": {
            "name": "missing out on",
            "pid": 173
          }
        }
      ]
    },
    {
      "pid": 173,
      "name": "missing out on",
      "text": "Patricia must’ve noticed your woolgathering, because she asks, “You okay?”\n\n“I’m going to miss this,” you blurt out before you can stop yourself.\n\nThere’s a bubble around you and Patricia. People’re so used to the two of you hiding in the break room to discuss work that they’ve skirted your table out of habit. Only Patricia heard you. You’re close to crying, like you often are these days.\n\n“You’re going to miss cake and tall stools?” Her words break the moment. The urge to cry recedes.\n\n“And new employee policies. Don’t [[forget those->Patricia knows]].”\n",
      "links": [
        {
          "text": "forget those",
          "destination": {
            "name": "Patricia knows",
            "pid": 180
          }
        }
      ]
    },
    {
      "pid": 174,
      "name": "time to go",
      "text": "“I’d better mosey on.” You push your half-eaten cake away from you and grab your cane. “Virginia wants me home before dark.” (unless: $standing_at_table)[You swing your feet away from the table, lean on your cane, and stand gingerly. You’d rather not have people’s last memory of you at work involving you falling on your butt.]\n\n“You’re going to leave that cake?” She’s pensive all of a sudden. “Besides, it’s summer. There’s [[plenty of time]] before sunset.”\n",
      "links": [
        {
          "text": "plenty of time",
          "destination": {
            "name": "plenty of time",
            "pid": 175
          }
        }
      ]
    },
    {
      "pid": 175,
      "name": "plenty of time",
      "text": "“Ask me what the secret of comedy is.” Patricia opens her mouth and you jump in. “Knowing when to bow out.”\n\n“I thought it was timing.”\n\n“That, too.”\n\nShe surprises you with a fierce hug then, her arms flung round your midsection. You pat her back, awkwardly. “[[Don’t be a stranger->speech! speech!]],” she whispers.\n\n“I won’t,” you say, even though you can’t promise that at all.\n",
      "links": [
        {
          "text": "Don’t be a stranger",
          "destination": {
            "name": "speech! speech!",
            "pid": 176
          }
        }
      ]
    },
    {
      "pid": 176,
      "name": "speech! speech!",
      "text": "Seeing you make a move for the door, Paul cups his hands around his mouth and calls out, “Speech! Speech!” The crowd takes it up, chanting, “Speech! Speech!” You look at him and have the urge to see if the hairsprayed helmet he calls hair would move if you mussed it. Maybe it would break into shards. You should do it. What could he do, fire you?\n\nPoliteness wins out. You walk to the back wall, the one with the giant windows looking out on the back parking lot. People give you space. (if: $confronted_assholes)[You look for the two guys from the bathroom, but you don’t see them. Or maybe you do see them but don’t recognize them.\n\nYou clear your throat. ]“I’m not sure what to say, tell you the truth.”\n\n“How about the time you and Tom raced wheelchairs down the hall!” a man says.\n\n“Oh, now, Tom tells that way better than I do. Where’s he? [[Come on up here, Tom->Tom doesn't work here any more]].”\n",
      "links": [
        {
          "text": "Come on up here, Tom",
          "destination": {
            "name": "Tom doesn't work here any more",
            "pid": 177
          }
        }
      ]
    },
    {
      "pid": 177,
      "name": "Tom doesn't work here any more",
      "text": "That silence. Those looks. You’ve gotten better at recognizing when you’ve said something wrong, even if you don’t know why it’s wrong. “Well, never mind. Who wants to listen to an old story, really. I just want to say (link-reveal: \"what a\")[ pleasure it’s been working with all y’all. And Paul?” Paul starts. He’d been looking at his watch. “Thanks for years of steady employment that’s let me buy [[food for my family->to the car]].”\n]\n",
      "links": [
        {
          "text": "food for my family",
          "destination": {
            "name": "to the car",
            "pid": 188
          }
        }
      ]
    },
    {
      "pid": 178,
      "name": "last day of work end",
      "text": "(live: 2s)[(set: $_percent_complete to 78)(goto: \"lunch with Virginia\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "lunch with Virginia",
            "pid": 192
          }
        }
      ]
    },
    {
      "pid": 179,
      "name": "last day at work",
      "text": "{\n(set: $_link_color to '#90ba40')\n(set: $_link_hover_color to '#b7ed52')\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$retirement_image+'\" alt=\"Sheet cake\" title=\"Sheet cake\" />')\n</div>\n}<span class=\"cap\">W</span><span>hat little you have left is in a cardboard box by the front desk. It’s not much: a few books, some loose papers, the stress ball you would squeeze hard when Paul was being his usual self. Most of your office’s contents either belong to the company or have already been taken home.</span>\n\n“The party’s at three?” you ask Ruby, the receptionist.\n\n“Yes, Mister Strickland.”\n\nYou stare at the clock over Ruby’s shoulder. It takes you a while to puzzle out where the hands are and what they mean. You’ve got five minutes or so. You wonder if you should [[go to the bathroom]] before the party. It’s not urgent; you could [[wait here with Ruby]] and go to the bathroom after the party’s over.\n{\n(set: $confronted_assholes to false)\n(set: $shouted_at_ruby to false)\n}",
      "links": [
        {
          "text": "go to the bathroom",
          "destination": {
            "name": "go to the bathroom",
            "pid": 181
          }
        },
        {
          "text": "wait here with Ruby",
          "destination": {
            "name": "wait here with Ruby",
            "pid": 182
          }
        }
      ]
    },
    {
      "pid": 180,
      "name": "Patricia knows",
      "text": "You couldn’t hide your memory lapses from Patricia, since you (link: \"work\")[worked] so closely together. But she made allowances, and you and she figured out how to keep you working for as long as possible. If it weren’t for her, you’d’ve been [[done->time to go]] months ago.",
      "links": [
        {
          "text": "done",
          "destination": {
            "name": "time to go",
            "pid": 174
          }
        }
      ]
    },
    {
      "pid": 181,
      "name": "go to the bathroom",
      "text": "You walk past the urinals to the handicapped stall. Having the extra room helps, since you’re still getting used to your cane. You also find it easier to sit than to stand.\n\nYou’re about done when two employees come in the bathroom. “Patricia didn’t make it mandatory, but it’s mandatory,” one says to the other.\n\n“At least there’ll be cake,” the other replies. You stand using your cane and begin the long process of hiking your pants back up.\n\n“Yeah, but Fred’ll be there, too.” You pause, listening through the stall wall. “You know he’ll be all, ‘Folks, I’ve had a…great time here and…enjoyed working with you, but it’s…time for me to go.” He imitates your drawl and slurs the words, taking huge pauses throughout the sentence.\n\n“God, right?” The sound of a zipper being done up. “I hope he doesn’t take all day to give a little speech.”\n\nYour anger rises from your feet to your head. (if: $gave_in_to_anger_count > 1)[The last time you remember being this mad, you hit the wall next to Alan Brooks’s head so hard you thought you broke something in your hand. Plaster flakes rained down into Alan’s curly hair. Your body’s shaking all over, ague by way of anger. You’re so tempted to [[give them a piece of your mind->super angry with the assholes]] instead of [[letting them be->let the assholes be]].](else:)[But you’ve been practicing not letting anger ride you like a demon, digging its spurs into your sides to goad you on. Still, it'd be okay to give those punks [[a piece of your mind->angry with the assholes]] instead of [[letting them be->let the assholes be]].]\n{\n(set: $gave_in_to_anger_max to it+1)\n}",
      "links": [
        {
          "text": "give them a piece of your mind",
          "destination": {
            "name": "super angry with the assholes",
            "pid": 184
          }
        },
        {
          "text": "letting them be",
          "destination": {
            "name": "let the assholes be",
            "pid": 185
          }
        },
        {
          "text": "a piece of your mind",
          "destination": {
            "name": "angry with the assholes",
            "pid": 183
          }
        }
      ]
    },
    {
      "pid": 182,
      "name": "wait here with Ruby",
      "text": "“You mind if I kill some time here until it’s time for the party?”\n\n“Not at all, Mister Strickland.” She pushes away from her computer, her chair rolling her back. “Not really anything going to happen for the next few minutes, anyway.” She pauses. “Say, you remember the time I got so sick and you and Virginia brought me her chicken soup?” She watches for your response.\n\nYou’re so deeply, deeply tired of these mind games. She means well, but Ruby’s throwing little land mines in front of you. If you get any detail wrong, she’ll look at you with such pity that (if: $gave_in_to_anger_count > 1)[it makes you want to hit things.\n\nYou’re just so tired and [[angry->super angry with Ruby]], it makes it hard to [[be easy on Ruby->let Ruby be]].\n\n](else:)[it makes you feel bad, like //you// should comfort //her//.\n\nYou’re angry, but you’ve been practicing not to let anger ride you like a demon, digging its spurs into your sides to goad you on. You take deep, calming breaths. You favor [[being gentle with her->let Ruby be]], though the temptation to [[be short with her->angry with Ruby]] is still there.]\n{\n(set: $gave_in_to_anger_max to it+1)\n}",
      "links": [
        {
          "text": "angry",
          "destination": {
            "name": "super angry with Ruby",
            "pid": 265
          }
        },
        {
          "text": "be easy on Ruby",
          "destination": {
            "name": "let Ruby be",
            "pid": 187
          }
        },
        {
          "text": "being gentle with her",
          "destination": {
            "name": "let Ruby be",
            "pid": 187
          }
        },
        {
          "text": "be short with her",
          "destination": {
            "name": "angry with Ruby",
            "pid": 186
          }
        }
      ]
    },
    {
      "pid": 183,
      "name": "angry with the assholes",
      "text": "The moment you hear water running in the sink, you come out of the stall. “Mind if I get in here to wash?” you ask the two employees.\n\n“Hang on a sec.” One of them turns and freezes, a raccoon caught in a flashlight with a paw full of trash. “Mister Strickland.”\n\nYou push past the two employees to get to the sink. You wet and lather your hands, taking your own sweet time before you rinse.\n\n“Mister Strickland, we didn’t mean…”\n\nYou hold up one dripping finger and then snag paper towels to dry off your hands, watching the employees the whole time.\n\n“Thank you for your criticism,” you tell them. “I’ll make sure my speech (link-reveal: \"is…\")[” You pause, staring them down, wondering how long you can make them wait. Finally you say, “entertaining.\n\n“[[Enjoy the party->party in the break room]].”]\n{\n(set: $gave_in_to_anger_count to it+1)\n(set: $confronted_assholes to true)\n}",
      "links": [
        {
          "text": "Enjoy the party",
          "destination": {
            "name": "party in the break room",
            "pid": 160
          }
        }
      ]
    },
    {
      "pid": 184,
      "name": "super angry with the assholes",
      "text": "You hit the stall door so hard it rebounds off the wall and scuffs a tile. The two employees jump. One curses. He wasn’t done with his zipper yet and caught himself in it. You hope he zipped it right off.\n\n“What the hell&mdash;” It’s the one who imitated you. When he sees it’s you, it’s like a tire blowing out, he deflates so quickly.\n\n“Boys.” You nod, not trusting your voice to be steady. You stalk to the sink, your cane hitting a staccato rhythm on the floor.\n\n“Um, Mister Strickland,” the imitator says.\n\n“Here’s the thing.” You splash cold water on your hands and lather them up. “You’re going to (link-reveal: \"get\")[ old one day. It’s coming for you just like it’s come for me. Maybe you’ll forget things. Maybe young punks will make fun of you.  Maybe you end up in a (link-reveal: \"nursing home,\")[ shitting your pants and not knowing it.”\n\nYou rinse your hands, taking your time. You snag paper towels to dry them off, not looking at either employee.\n\n“Hey, Mister Strickland, we were&mdash;”\n\n“When that happens,” you snap, “I want you to remember this moment. This one right here. And know you //earned// your indignities.” You toss the paper in the trash and deliberately bang your cane on the can. The two startle. “[[Enjoy the party->party in the break room]].”\n]]\n{\n(set: $gave_in_to_anger_count to it+1)\n(set: $confronted_assholes to true)\n}",
      "links": [
        {
          "text": "Enjoy the party",
          "destination": {
            "name": "party in the break room",
            "pid": 160
          }
        }
      ]
    },
    {
      "pid": 185,
      "name": "let the assholes be",
      "text": "You wait in the stall until the outer door opens and shuts. You come out and wash your hands. (if: $gave_in_to_anger_count > 1)[You’re still furious, but your anger is tempered by you controlling it.](else:)[It was the right thing to do, and a hard-fought victory not to lash out at them.]\n\nYou shake the water off your hands, determined to head out there and [[enjoy the party->party in the break room]].\n",
      "links": [
        {
          "text": "enjoy the party",
          "destination": {
            "name": "party in the break room",
            "pid": 160
          }
        }
      ]
    },
    {
      "pid": 186,
      "name": "angry with Ruby",
      "text": "(set: $gave_in_to_anger_count to it+1)“Ruby,” you sigh, “Please don’t keep giving me these little memory tests. I know you mean well, but it doesn’t help and it’s (link-reveal: \"just\")[&mdash;it just makes me angry. Okay?”\n\nRuby blinks. “I’m just trying to help,” she says.\n\n“I know. But it doesn’t. Help, I mean.”\n\n“Mister Strickland&mdash;”\n\n“It’s okay, just something I needed to tell you. I’ll meet you in the [[break room->party in the break room]],” you say and pivot on your cane and away from her desk.\n]",
      "links": [
        {
          "text": "break room",
          "destination": {
            "name": "party in the break room",
            "pid": 160
          }
        }
      ]
    },
    {
      "pid": 187,
      "name": "let Ruby be",
      "text": "“Ruby,” you say, “I know you mean well, but those little memory tests don’t really help. It makes me think I’m back in school. And I’m far too old to be going back to school. Okay?” You grin to reassure her that you’re not mad, but from the tight set of her lips, it’s not okay.\n\nThat’s fine. You don’t have the energy to educate her if she’s unwilling. You’ve just got to put up with her until the [[party’s over->party in the break room]].\n",
      "links": [
        {
          "text": "party’s over",
          "destination": {
            "name": "party in the break room",
            "pid": 160
          }
        }
      ]
    },
    {
      "pid": 188,
      "name": "to the car",
      "text": "You’re in your car and headed home before you remember [[Tom hasn’t worked with you->last day of work end]] for years.",
      "links": [
        {
          "text": "Tom hasn’t worked with you",
          "destination": {
            "name": "last day of work end",
            "pid": 178
          }
        }
      ]
    },
    {
      "pid": 189,
      "name": "more photos",
      "text": "(if: $looked_at_photos)[The photos aren’t any more recognizable [[without your glasses->hallway 1]] than the ones in the living room.](else:)[You can’t make out the photos’ details without your glasses. Which reminds you: [[you should go find your glasses->hallway 1]].](set: $looked_at_more_photos to true)\n",
      "links": [
        {
          "text": "without your glasses",
          "destination": {
            "name": "hallway 1",
            "pid": 49
          }
        },
        {
          "text": "you should go find your glasses",
          "destination": {
            "name": "hallway 1",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 190,
      "name": "Tylenol",
      "text": "The Tylenol rattles in the plastic bottle [[when you pick it up.->kitchen 2]]\n{\n(set: $tylenol_location to \"fred\")\n}",
      "links": [
        {
          "text": "when you pick it up.",
          "destination": {
            "name": "kitchen 2",
            "pid": 136
          }
        }
      ]
    },
    {
      "pid": 191,
      "name": "glass",
      "text": "You fill the glass halfway at the sink. Virginia’s hands shake so much when she has chills, she might [[soak the bed.->kitchen 2]]\n{\n(set: $glass_location to \"fred\")\n}",
      "links": [
        {
          "text": "soak the bed.",
          "destination": {
            "name": "kitchen 2",
            "pid": 136
          }
        }
      ]
    },
    {
      "pid": 192,
      "name": "lunch with Virginia",
      "text": "{\n(set: $_link_color to '#ccad46')\n(set: $_link_hover_color to '#ffd33f')\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$lunch_image+'\" alt=\"Chicken-fried steak with gravy\" title=\"Chicken-fried steak with gravy\" />')\n</div>\n}<span class=\"cap\">“I</span><span> said, I really want us to get that new stove.”</span>\n\nWhen you look up from your chicken-fried steak, Virginia’s watching you, waiting for your answer. “New stove?” you say.\n\nVirginia sighs, though it’s a tiny sigh, so tiny you barely heard it over the sound of other people eating lunch in the restaurant. “I’m thinking we should swap out the gas stove for a new electric one. Get one with a timer.”\n\n“Our old one’s not broken, though.” You squint, trying to pull a memory free from the swamp of your mind. “Is it?”\n\nVirginia shakes her head. “No, it’s not. But I thought&mdash;”\n\n“Don’t see the sense in spending money when we don’t need to,” you grumble.\n\n“We do need to, though.” Virginia takes your hand and locks eyes with you. “You don’t have to shut the new stove off. [[It turns off automatically->babying you]].”\n",
      "links": [
        {
          "text": "It turns off automatically",
          "destination": {
            "name": "babying you",
            "pid": 193
          }
        }
      ]
    },
    {
      "pid": 193,
      "name": "babying you",
      "text": "She’s babying you. Like you can’t take care of yourself. You jerk your hand away from her, accidentally hitting your water. The glass wobbles and almost tumps over. “I know enough to turn off the stove. Don’t need to flush money away because you’re nervous.” \n\nVirginia takes back your hand and holds it tight. She glances around at the other tables in the restaurant, then says, “You’re right. I //am// nervous. But with reason.” Her thumb massages the back of your hand, tracing small circles over your skin. “We wouldn’t be wasting the money, and it’s not too expensive anyway.”\n\n(if: $gave_in_to_anger_count > 1)[She knows [[how tight money is->refuse the stove]] right now. And when they have to place you in a home, you’ll burn through money like it was gas-soaked hay. It makes it hard to [[give in]].](else:)[You figure maybe you should [[give in]] and keep the peace, but [[you’re not made of money->refuse the stove]], especially with you not working any more. And when they have to place you in a home, you’ll burn through money like it was gas-soaked hay.]\n{\n(set: $refused_the_stove to false)\n}",
      "links": [
        {
          "text": "how tight money is",
          "destination": {
            "name": "refuse the stove",
            "pid": 195
          }
        },
        {
          "text": "give in",
          "destination": {
            "name": "give in",
            "pid": 194
          }
        },
        {
          "text": "you’re not made of money",
          "destination": {
            "name": "refuse the stove",
            "pid": 195
          }
        }
      ]
    },
    {
      "pid": 194,
      "name": "give in",
      "text": "It takes you a minute to get your anger under control. Once you’re better, you squeeze Virginia’s hand back. “All right, sure.” You fish around in your back pocket for your folded stack of index cards and a pen. “I’ll even write it down so if you have to argue with me about it again, you can make me read my note.” You pull the cap off the pen and unfold the cards. The top card reads, “[[IT’S NOT YOUR FAULT->IT'S NOT YOUR FAULT]]”.",
      "links": [
        {
          "text": "IT’S NOT YOUR FAULT",
          "destination": {
            "name": "IT'S NOT YOUR FAULT",
            "pid": 196
          }
        }
      ]
    },
    {
      "pid": 195,
      "name": "refuse the stove",
      "text": "You don’t respond, and after a minute, Virginia stops rubbing your hand. You tell her, “We’ve got to live on what I socked away (link-reveal: \"before I\")[ retired. That money’s not growing. I don’t want it to shrink any faster than it has to.”\n\n“Fred, I’ve been tracking our expenses, and we’ve got plenty of cushion, even with&mdash;”\n\n“I was the accountant, so I think I know our money situation. We’re not spending more (link-reveal: \"on…\")[we’re not spending more money, and that’s final.” You cross your arms. “I don’t want to talk about it any more.”\n\nVirginia has a look on her face that means that she’s going to do what she damn well pleases, and never mind what you want. “You said that the last two times, too.”\n\nYou don’t remember those earlier discussions. Stung, you snap, “Well, I’ll write it down so I won’t forget.” You pull out your folded stack of index cards and a pen. When you unfold the cards you’re brought up short. The top card reads, “[[IT’S NOT YOUR FAULT->IT'S NOT YOUR FAULT]]”.]]\n{\n(set: $refused_the_stove to true)\n}",
      "links": [
        {
          "text": "IT’S NOT YOUR FAULT",
          "destination": {
            "name": "IT'S NOT YOUR FAULT",
            "pid": 196
          }
        }
      ]
    },
    {
      "pid": 196,
      "name": "IT'S NOT YOUR FAULT",
      "text": "You’d written the card back (link-reveal: \"when\")[&mdash;well, hell, you don’t really remember when you wrote it, but it’s a reminder to be easy on yourself.\n\n“Fred?”\n\nYou shake your head, your thoughts flying off. Someone’s cleared Virginia’s plates away. A waitress, you guess.\n\n“Fred? Where’d you go just now?”\n\n(if: $refused_the_stove)[“[[Nowhere.->stove apology]]”](else:)[“[[Nowhere,->ask for pepper]]” you say, putting the cards back in your pocket.]\n]\n",
      "links": [
        {
          "text": "Nowhere.",
          "destination": {
            "name": "stove apology",
            "pid": 197
          }
        },
        {
          "text": "Nowhere,",
          "destination": {
            "name": "ask for pepper",
            "pid": 198
          }
        }
      ]
    },
    {
      "pid": 197,
      "name": "stove apology",
      "text": "You take a deep breath. Apologizing hasn’t gotten any easier as you’ve gotten worse. “Virginia, listen, I’m sorry.”\n\n“It’s all right.”\n\n“No, no, it’s not. I’m just [not myself]<nm| today.”\n\n (click: ?nm)[(replace: ?nm)[out of sorts] “So we can get the stove?”\n\nYou nod, glad she reminded you what you’d argued over. “I really am sorry.”\n\n“It’s already forgotten,” she says, with a tilt of her mouth that tells you she knows the joke she just made. It’s how you two deal with your condition, these sideways acknowledgements.\n\nYou reply in kind: “Easier done than said,” and you’re rewarded with the brief flicker of Virginia’s smile, like a bird darting [[fast across your sight->ask for pepper]].\n]\n",
      "links": [
        {
          "text": "fast across your sight",
          "destination": {
            "name": "ask for pepper",
            "pid": 198
          }
        }
      ]
    },
    {
      "pid": 198,
      "name": "ask for pepper",
      "text": "Virginia’s plate may be gone, but you’ve still got more lunch to work on. You’re not hungry, but you don’t feel right letting it go to waste. You carve off a corner of the chicken-fried steak. It’s a little bland. “Pass me (link-reveal: \"the…\")[it’s like (link-reveal: \"sand.\")[ (link-reveal:\"Black.\")[” You’re reduced to gesturing at the two shakers over by Virginia. “Black sand.”\n\nVirginia slides a shaker to you, the light over the table catching the grooved parts of the glass and making it sparkle. “Pepper.”\n\n(if: $refused_the_stove)[“I know,” you say, and immediately feel bad all over again, but you don’t say anything more for fear of making things worse. You just shake the sand over your lunch.](else:)[You pick up the container and shake the sand over your lunch.] You fork another bite into your mouth, careful to scoop up some gravy from the steak. [[Much better.->pay and go]]\n]]]\n",
      "links": [
        {
          "text": "Much better.",
          "destination": {
            "name": "pay and go",
            "pid": 199
          }
        }
      ]
    },
    {
      "pid": 199,
      "name": "pay and go",
      "text": "You work on the steak, you and Virginia (unless: $refused_the_stove)[companionably ]quiet while you eat. As you get into the steak you realize you’re hungry after all. (if: $refused_the_stove)[Probably helps explain why you’ve been so mean.]\n\nYou’ve near finished your steak when the waitress delivers the check. You hold up a hand and she pauses while you pull out your wallet. But it’s not your wallet. It’s your index cards. You pat your back pockets, but your wallet’s not there. \n\nTo buy time to think, you fan out the index cards. “Miss, do you take plain paper?”\n\n“Here,” Virginia says, handing the waitress a $20. “Keep the change.”\n\nAs the waitress walks away, you whisper to Virginia, “My wallet. I can’t find it.” You check under your napkin, then on the table before glancing at the floor. No sign of it.\n\n“You didn’t bring your wallet,” Virginia reminds you. “After the last time you lost it, we agreed I’d bring the money when we went out.”\n\nYour anger’s back. It’s the one thing your mind reliably serves up, like a chef’s favorite dish he can’t help but make. The cards are still in your hand. You run one finger along the edge of the topmost card and breathe deep. It’s not your fault. It’s not your fault. It’s not your fault.\n\n“Thanks,” you say. (if: $refused_the_stove)[Your tone’s almost civil, hard as it is to be polite instead of mad.](else:)[You’re polite, even as you seethe inside. Your doctor warned you you’d be angry faster and sooner than you used to.]\n\nVirginia lifts her napkin from her lap, folds it neatly and places it beside her plate. “You ready to go?”\n\n“[[Ready as I’ll ever be.->the old colleague]]”\n",
      "links": [
        {
          "text": "Ready as I’ll ever be.",
          "destination": {
            "name": "the old colleague",
            "pid": 200
          }
        }
      ]
    },
    {
      "pid": 200,
      "name": "the old colleague",
      "text": "It’s warm outside, though a gusting breeze makes you glad you brought your windbreaker. Now where did y’all park? The thought reminds you to pull out your keys, which reminds you that you don’t have any keys, which reminds you not to worry because Virginia drives now.\n\n“Where’d we park&mdash;” you start to ask, but you’re interrupted by a black woman calling, “Ginny!” from the parking lot. She dodges around a car creeping past the café and waves one arm as if she’s cleaning a window. “Ginny!”\n\nVirginia adjusts her glasses. “Alma? Alma James, as I live and breathe! How you do?”\n\n“Right fine, Ginny.” She’s no one you recognize, which doesn’t mean much these days.\n\nAs if reading your mind, Virginia tells you, “Fred, this is Alma James. We used to teach English together.” She’s gotten real good at spoon-feeding you information like how you’d feed a baby bird.\n\n“Still teaching it, in fact,” Alma says.\n\n“Good for you! I miss teaching sometimes, but it was for the best that I retire.” She deliberately doesn’t look over at you. “How’s Kevin?”\n\n“Fair to middlin’,” she says.\n\n“And your boys? What’s Cordell up to these days?”\n\n“He majored in English down at Texas Tech.”\n\n“Oh?” She tilts her head. You used to claim she looked (link-reveal: \"like\")[ the RCA dog when she did that. “He was a right hellion in my class, you [[remember->more small talk]].”\n\nThe woman sighs, half exasperated, half amused. “Don’t I know it. But he righted his ship. He’s a technical writer now.”\n\n“Well. As I live and breathe.”]",
      "links": [
        {
          "text": "remember",
          "destination": {
            "name": "more small talk",
            "pid": 201
          }
        }
      ]
    },
    {
      "pid": 201,
      "name": "more small talk",
      "text": "“What about his…brother?” Virginia says.\n\nAlma nods. “Lamar. He’s at UT Austin. Graduates this year, God willing.”\n\nVirginia laughs. “Must be interesting for you, having two sons at two different UT schools.”\n\n“I couldn’t convince him to go to Arlington. He wanted to be a lot further away from home.”\n\nYou shift around a bit, leaning more heavily on your cane as you half-listen to Virginia and Alma. Small talk never interested you much even when you were whole. There’s no place to sit out here, and it’s going to be murder on your feet if you keep standing for a while. You might could [[hint->subtle hints]] that it’s time to go, or [[interrupt outright]]. (unless: $refused_the_stove)[Otherwise you might as well [[joing the conversation->join in the small talk]] to make the time pass faster.]",
      "links": [
        {
          "text": "hint",
          "destination": {
            "name": "subtle hints",
            "pid": 202
          }
        },
        {
          "text": "interrupt outright",
          "destination": {
            "name": "interrupt outright",
            "pid": 203
          }
        },
        {
          "text": "joing the conversation",
          "destination": {
            "name": "join in the small talk",
            "pid": 204
          }
        }
      ]
    },
    {
      "pid": 202,
      "name": "subtle hints",
      "text": "You look at your watch, and then over at Virginia. She doesn’t even notice, she’s so wrapped up in talking to her old colleague. Her focus and care made her such a good high school teacher. You couldn’t have taught like she did. Spending your days talking at teenagers in the hopes that maybe one of them would learn something? No thank you.\n\nNow that you don’t drive, you miss having keys to jangle in your pocket to let Virginia know it’s time to go. You do have some change in your pocket, so you rattle it around, just a bit at first, and then more and more. Finally you give a great big cough. It’s supposed to be a bit theatrical, but you put more into in than you meant to and it turns into a by-God real coughing fit.\n\n“Fred!” Virginia says. “You okay?” She pats you on the back while your coughing winds down. Lucky your lungs stayed where they’re meant to be. “Sorry, Alma, we’d best be getting home.” Regret fills her voice.\n\n“No problem,” (if: $refused_the_stove)[Alma](else:)[the woman] says. “So good you see you again, Ginny.”\n\n“You, too,” Virginia says. “Fred, are you okay to wait here while I get the car?” When you nod, she takes off in one direction and the woman in another. “Nice to see you, Fred,” the woman says [[as she goes->waiting for Virginia]].",
      "links": [
        {
          "text": "as she goes",
          "destination": {
            "name": "waiting for Virginia",
            "pid": 205
          }
        }
      ]
    },
    {
      "pid": 203,
      "name": "interrupt outright",
      "text": "“Virginia, time to go,” you say(if: $refused_the_stove)[, a lot more snappish than you meant to be.\n\n“Sorry, Alma, Fred and I’d better…” Virginia says. Regret fills her voice.](else:)[. “Sorry to steal her away,” you tell the woman she’s talking to.]\n\n“No problem,” (if: $refused_the_stove)[Alma](else:)[the woman] says. She looks sad for Virginia, or maybe you. Or maybe you’re imagining it. “It was real good to catch up with you, Ginny.”\n\n“You, too,” Virginia says. “Fred, are you okay to wait here while I get the car?” When you nod, she takes off in one direction and the woman in another. “Nice to see you, Fred,” the woman says [[as she goes->waiting for Virginia]].\n",
      "links": [
        {
          "text": "as she goes",
          "destination": {
            "name": "waiting for Virginia",
            "pid": 205
          }
        }
      ]
    },
    {
      "pid": 204,
      "name": "join in the small talk",
      "text": "“How long were you down at Austin?” you ask the woman talking to Virginia, only to realize that you interrupted her mid-sentence. She pauses. “Sorry, sorry, didn’t mean to butt in.”\n\n“It’s okay. But my son’s the one at Austin.”\n\n“Your son? I thought he was at Texas Tech.” That’s not right, though, and it shows on the woman’s face.\n\n“My other son, Lamar, went to UT Arlington.”\n\n“You studied English like Virginia taught?”\n\n“I taught English //with// Virginia.” She’s got an expression on her face that you’ve come to dread: part puzzled, part sympathetic. She can tell something’s wrong, that you’re not completely tracking the conversation, but she can’t be sure why. She won’t ask, and she’ll do her best to work around your bad memory, like you let out an old-man fart she’s determined to ignore. The image makes you smile, which you know makes you look even odder and more out of touch. You’d say “sorry,” but you’re all out of sorry for right now.\n\nVirginia says, “Alma, Fred and I’d better…” She trails off.\n\n“No problem,” the woman says. She looks sad for Virginia, or maybe you. Or maybe you’re imagining it. “It was real good to catch up with you, Ginny.”\n\n“You, too,” Virginia says. “Fred, are you okay to wait here while I get the car?” When you nod, she takes off in one direction and the woman in another. “Nice to see you, Fred,” the woman says [[as she goes->waiting for Virginia]].",
      "links": [
        {
          "text": "as she goes",
          "destination": {
            "name": "waiting for Virginia",
            "pid": 205
          }
        }
      ]
    },
    {
      "pid": 205,
      "name": "waiting for Virginia",
      "text": "You shift your weight some more, trying to get comfortable, or at least as near to it as you can while standing. Your mind drifts off. Left on its own it likes to float further and further away these days. It makes waiting a lot easier than when you were younger. Back then you always carried a book to pass the time while you waited.\n\nA touch on your shoulder brings you back to the here-and-now. A woman’s snuck up next to you. The waitress. Didn’t Virginia pay? Maybe she forgot, or you told her you’d take care of it and then //you// forgot. That seems more likely. But you don’t have any cash on you. A while back you stopped carrying it when eating out with Virginia.\n\n“Hold on a moment, please, miss. My wife will be right back with the car.”\n\n“Fred?” the waitress says. She sounds as confused as you feel.\n\n“With the money. She’s got our cash. She can pay for our lunch.”\n\n“Fred, it’s me. It’s Nipper.”\n\nMemory sparks. That was the RCA dog’s name! “Did you know, that’s my wife’s nickname! Gave it to (link-reveal: \"her…\")[oh, ages ago.” Funny to think someone actually named their daughter “Nipper.” It takes all kinds.\n\n“How about I take you to your wife,” the waitress says, pointing to a car idling by the curb. It’s an old powder-blue Buick, a lot like the one you used to drive back when you drove.\n\nYou’re not sure. Shouldn’t you [[wait for Virginia]] instead of [[going off with this stranger]]? Then again, more and more people are strangers to you lately.]",
      "links": [
        {
          "text": "wait for Virginia",
          "destination": {
            "name": "wait for Virginia",
            "pid": 206
          }
        },
        {
          "text": "going off with this stranger",
          "destination": {
            "name": "going off with this stranger",
            "pid": 207
          }
        }
      ]
    },
    {
      "pid": 206,
      "name": "wait for Virginia",
      "text": "“Thank you kindly, miss, but I’m waiting for my wife.”\n\n“Let’s talk in the car.” She’s upset. She must really think you’d run off without paying. Though you guess that’s what you did.\n\nStill and all, she’s being more pushy than she’s got call to be. “I said, I’m waiting for my wife, and that’s final.” You shake your arm free of the woman’s hand, but that sets you off-balance away from the waitress.\n \n“Fred!” Virginia’s suddenly there on your other side, helping catch you as you stumble towards her.\n\n“Virginia! Thank goodness you’re here. You can pay the waitress and tell her to leave me alone.” But the waitress has disappeared. “Oh! I guess she went back inside.” You right yourself and take your weight off of Virginia. She’s a slight thing. Can’t hold you up forever.\n\n“It’s all fine, Fred.” She leads you to the Buick. You duck your head as you lower yourself into the passenger seat, then lift each leg into the car with your hands. Virginia buckles your seatbelt and then goes around and gets in the driver’s seat.\n\nBut then she just sits there, staring out the windshield. She slaps the steering wheel once with her hands, hard, and then again, and again and again. She bows her head and clutches the wheel so tight that her knuckles turn white. Her chest rises and falls as she breathes deeply. “It’s all good,” she whispers. “[[I’m fine.->angry Virginia]]” \n",
      "links": [
        {
          "text": "I’m fine.",
          "destination": {
            "name": "angry Virginia",
            "pid": 208
          }
        }
      ]
    },
    {
      "pid": 207,
      "name": "going off with this stranger",
      "text": "“You’ll take me to Virginia?” you ask the waitress. “You’ll have to help me in the car since my legs don’t quite work right. Virginia normally does that.” Virginia always lets you lean on her a bit as you get in, though you try not to put too much weight on her. She’s a slight thing. Can’t hold you up forever.\n\n“I’ll help.” And she does, making sure you get in the passenger seat okay and buckling your seatbelt for you before she gets in the driver’s seat.\n\n“Is she far? Virginia, I mean?”\n\n“She’s close, Fred. It’s [all fine.”]<all-fine|(click-append: ?all-fine)[\n\nHer voice is what brings you out of your episode. “I’m so sorry, Virginia, I just…went away for a minute.” (if: (history:) contains \"join in the small talk\")[It turns out you’ve got some sorry left after all.]\n\nShe just sits there, staring out the windshield, before she slaps the steering wheel once with her hands, hard, and then again, and again and again. She bows her head and clutches the wheel so tight her knuckles turn white. Her chest rises and falls as she breathes deeply. “It’s all good,” she whispers. “[[I’m fine.->angry Virginia]]”\n]\n",
      "links": [
        {
          "text": "I’m fine.",
          "destination": {
            "name": "angry Virginia",
            "pid": 208
          }
        }
      ]
    },
    {
      "pid": 208,
      "name": "angry Virginia",
      "text": "“You’re not fine,” you say. “Believe me, I know neither of us is fine.”\n\n“I’m just so angry now. Bone-deep angry.” She won’t turn her face to you. Her voice is level and she doesn’t look mad, which is how you know she’s truly angry. “It’s never-ending. It’s never-ending and there’s nothing I can do and it won’t get better. It just won’t.”\n\n“I know.”\n\n“Do you?” She faces you now. “Every day there’s less of you to take care of yourself, and more of you for me to take care of. There’s no break and no way out. We’re in a dark tunnel and the tunnel keeps getting narrower as we go through it. I try not to dump this on you, I do, I swear I do, but there’s only so much bitterness I can swallow before I have to spit some back up.\n\n“If you do know, here in a while you won’t any more. You’ll be gone, even while you’re still here.”\n\nThe silence fills the car, thick and oppressive, a fog of misery you’re both lost in. You pull out your index cards again and riffle through them as if to blow the fog away. You peel the top one off the stack and wordlessly [[hand it to Virginia->IT'S NOT YOUR FAULT redux]].\n",
      "links": [
        {
          "text": "hand it to Virginia",
          "destination": {
            "name": "IT'S NOT YOUR FAULT redux",
            "pid": 209
          }
        }
      ]
    },
    {
      "pid": 209,
      "name": "IT'S NOT YOUR FAULT redux",
      "text": "“I thought this message was for you,” Virginia says.\n \n“It’s for us both. Listen, why don’t you call Rebecca? See if she can take a few days off and watch me while you take a break. What use are kids if you don’t make them do stuff for you every now and again?”\n\nShe holds the card in her lap and chews on her bottom lip the way she does when she’s worrying at a problem. “That might be nice.”\n\n“Call Leigh and the others. Been a coon’s age since you played bridge with them.”\n\nThe silence returns for a minute, though it’s less heavy than before. “I can do that,” she finally says. “Let’s get home and maybe take a nap.”\n\n“Then put it in drive. It’s like I always say: If you’re not moving forward, you’re backing up.”\n\nShe laughs a short, sad laugh, hands you your card, and drops the car into gear. You put the card back on top. The words “IT’S NOT YOUR FAULT” have run just a bit, now sprinkled with [[drops of water->lunch with Virginia end]].\n",
      "links": [
        {
          "text": "drops of water",
          "destination": {
            "name": "lunch with Virginia end",
            "pid": 210
          }
        }
      ]
    },
    {
      "pid": 210,
      "name": "lunch with Virginia end",
      "text": "(live: 2s)[(set: $_percent_complete to 86)(if: $made_up_with_tom)[(goto: \"driving with Tom\")](else:)[(goto: \"the incoherent age\")](stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "driving with Tom",
            "pid": 225
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "the incoherent age",
            "pid": 234
          }
        }
      ]
    },
    {
      "pid": 211,
      "name": "the incoherent age end",
      "text": "(live: 2s)[(set: $_percent_complete to 94)(goto: \"meeting Virginia\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "meeting Virginia",
            "pid": 212
          }
        }
      ]
    },
    {
      "pid": 212,
      "name": "meeting Virginia",
      "text": "{\n(set: $hand_jammed to false)\n(set: $_link_color to '#ff6344')\n(set: $_link_hover_color to '#ffa390')\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$virginia_image+'\" alt=\"Girl on a bench\" title=\"Girl on a bench\" />')\n</div>\n}<span class=\"cap\">S</span><span>he’s sitting on the bench outside the Grill again.</span>\n\nShe’s been there the last three days as you’ve left the Student Union after your mid-morning coffee break. She’s a slim girl with a slim book, head bowed over it, chestnut hair obscuring her face.\n\nShe can’t spend //all// of her time on the bench. She’s not there when you go into the Grill, and besides, every day she has a different book and a different outfit. Today she’s wearing a dress the shade of fall pumpkins.\n\nThis coincidence feels like a sign. You should [[talk to her->do approach]]. You’ve got time, since your next class isn’t for twenty minutes. \n\nBut [[you’re not sure->do not approach]]. Sometimes coincidences are just coincidences. What if she snubs you? What if she’s not in the mood to talk?",
      "links": [
        {
          "text": "talk to her",
          "destination": {
            "name": "do approach",
            "pid": 213
          }
        },
        {
          "text": "you’re not sure",
          "destination": {
            "name": "do not approach",
            "pid": 214
          }
        }
      ]
    },
    {
      "pid": 213,
      "name": "do approach",
      "text": "She looks up from her book as you walk up the gravel path towards her. Her hair falls back away from her face. Her eyes are a piercing green. “Sorry to disturb you,” you say, “but I’ve seen you out here every day since Monday, and I just had to come speak to you.”\n\n“You’re not disturbing me at all. In fact, I’ve been speculating about how many days it would take before you talked to me.”\n\n“Sorry, you were…”\n\n“Waiting for you? No. Well, yes. A little.” She gestures to the Student Union. “I do like studying here, what with the nice weather and how close I am to coffee. But after I saw you notice me on Monday, and then again yesterday, I started to wonder who you are. So I came back today hoping you’d say ‘hi.’”\n\nIt’s [[intriguing]], though also a bit [[off-putting]], how she’s watched you without you ever realizing it.\n",
      "links": [
        {
          "text": "intriguing",
          "destination": {
            "name": "intriguing",
            "pid": 215
          }
        },
        {
          "text": "off-putting",
          "destination": {
            "name": "off-putting",
            "pid": 216
          }
        }
      ]
    },
    {
      "pid": 214,
      "name": "do not approach",
      "text": "(set: $hand_jammed to true)You shove your hands in your pockets and walk down the gravel path past her bench. As you pass her, she coughs, loud and sharp.\n\n“Are you okay?” you say.\n\n“Oh, quite.” She smiles and looks up, her hair falling back from her face. Her eyes are a piercing green. “You’ve walked past every day this week, and today I decided I was done waiting for you to talk to me.”\n\n“Sorry, you were…”\n\n“Waiting for you? No. Well, yes. A little.” She gestures to the Student Union. “I do like studying here, what with the nice weather and how close I am to coffee. But after I saw you notice me on Monday, and then again yesterday, I started to wonder who you are. So I came back today hoping you’d say ‘hi.’”\n\nIt’s [[intriguing]], though also a bit [[off-putting]], how she’s watched you without you ever realizing it.\n",
      "links": [
        {
          "text": "intriguing",
          "destination": {
            "name": "intriguing",
            "pid": 215
          }
        },
        {
          "text": "off-putting",
          "destination": {
            "name": "off-putting",
            "pid": 216
          }
        }
      ]
    },
    {
      "pid": 215,
      "name": "intriguing",
      "text": "“You don’t want to study in the Grill?”\n\n“I can’t ignore hubbub when I study, and it’s so crowded in the morning.”\n\n“So you study out here, only taking breaks to talk to strangers?”\n\n“Virginia.”\n\n“What?”\n\n“I’m Virginia Ward,” she says. “And you are…?”\n\nYou’re reluctant to draw this conversation out any more. You’ve got class soon, and she’s a bit unusual. But she stares up at you from the bench, eyes wide, patient but unmoving, until finally, grudgingly, you say, “[[I’m Fred Strickland->not strangers]].”",
      "links": [
        {
          "text": "I’m Fred Strickland",
          "destination": {
            "name": "not strangers",
            "pid": 219
          }
        }
      ]
    },
    {
      "pid": 216,
      "name": "off-putting",
      "text": "“Is it your normal habit to lie in wait for strangers on campus?”\n\n“Virginia. Virginia Ward.”\n\n“What?”\n\n“I’m Virginia. And you are…?”\n\nYou jam your hands (if: $hand_jammed)[back ]in your pockets. You can wait out this woman.\n\nExcept it turns out you can’t. She stares up at you from the bench, eyes wide, patient but unmoving. Finally, grudgingly, you say, “[[I’m Fred Strickland->not strangers]].”",
      "links": [
        {
          "text": "I’m Fred Strickland",
          "destination": {
            "name": "not strangers",
            "pid": 219
          }
        }
      ]
    },
    {
      "pid": 217,
      "name": "fourth for bridge",
      "text": "“You can be my fourth for bridge this afternoon,” Virginia tells you.\n\n“Excuse me?” you say, thrown by the sudden change in topic.\n\n“It’s a game involving cards. Perhaps you’ve heard of it?”\n\nYou snort. “I’ll allow as how I’ve heard of bridge. You want //me// to be //your// partner?”\n\nShe lets her cigarette fall to the gravel and stubs it out with her shoe’s toe. “Adeline and I normally partner against Dot and her beau Leland, but Addie’s focusing on her grades, poor thing, and isn’t up to scratch this month.”\n\nYou buy some time to think by taking another drag on your cigarette. Your lungs burn from the smoke curling inside them, twisting around and around. “You act like this is Sadie Hawkins week.”\n\n“Oh, good grief, Fred, I’m not asking you to pin me or anything. It’s a few hands of cards.”\n\nVirginia’s intriguing and all, but you’re not sure how much time you’d want to spend around someone like her. Best to let her down gently, though. “Your Adeline may have the right idea. I have a lot of work to do for my current classes. Now may not be the best time.”\n\n“Perhaps not, but now is what we’ve got,” she says.\n\nHer quote sparks a memory from your poetry class, and before you can stop yourself, you’re reciting:\n\n<div class=\"quotes\">“Forever &mdash; is composed of Nows &mdash;\n‘Tis not a different time &mdash;\nExcept for Infiniteness &mdash;\nAnd Latitude of Home &mdash;\n\n“From this &mdash; experienced Here &mdash;\nRemove the Dates &mdash; to These &mdash;\nLet Months dissolve in further Months &mdash;\nAnd Years &mdash; exhale in Years &mdash;\n\n“Without Debate &mdash; or Pause &mdash;\nOr Celebrated Days &mdash;\nNo different Our Years would be\n(link-goto: \"From Anno Dominies &mdash;\", \"now is what we have\")”</div>",
      "links": [
        {
          "text": "<link>",
          "destination": {
            "name": "now is what we have",
            "pid": 218
          }
        }
      ]
    },
    {
      "pid": 218,
      "name": "now is what we have",
      "text": "Virginia tilts her head at you, looking like the dog on the RCA logo. The two of you stare, your cigarette smoke rising between you. You barely notice the other students moving past the two of you, headed to class.\n\nYou break the silence. “I should&mdash;”\n\n“This afternoon. Let’s start with now and see what unfolds.”\n\nSpend time with this woman who is so opinionated, so prickly? You open your mouth and are surprised to hear yourself say, “[Well all right then]<end-link|.”\n\n\n(click: ?end-link)[(display: \"meeting Virginia end\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "meeting Virginia end",
            "pid": 273
          }
        }
      ]
    },
    {
      "pid": 219,
      "name": "not strangers",
      "text": "“There, now we’re not strangers.”\n\n“That’s&mdash;that’s not how that works.”\n\n“I believe that’s exactly how it works. It’s a pleasure to meet you, Fred Strickland.”\n\nGood grief, this woman. “So it //is// your habit to lie in wait for strangers, and then try to turn them into not-strangers? You’ve got that much time to waste?”\n\n<div class=\"quotes\">“‘What is this life if, full of care, we have no time to [[stand and stare]]’?”</div>",
      "links": [
        {
          "text": "stand and stare",
          "destination": {
            "name": "stand and stare",
            "pid": 220
          }
        }
      ]
    },
    {
      "pid": 220,
      "name": "stand and stare",
      "text": "“…that’s poetry, Mister Strickland.”\n\nYou stare back at her, this odd woman who waited for you to speak to her so she could quote a line from a W. H. Davies poem at you. “Yes, I know.”\n\n“I wasn’t sure, based on your expression, if you knew what poetry was.” When she smiles, she conjures dimples beside her mouth.\n\n“I’ve had plenty of it drummed into my head [[in my time->reading Keats]], thanks.”\n",
      "links": [
        {
          "text": "in my time",
          "destination": {
            "name": "reading Keats",
            "pid": 221
          }
        }
      ]
    },
    {
      "pid": 221,
      "name": "reading Keats",
      "text": "“I’m having the same thing done to me these days.” She holds up the book she’s carrying. “Keats.”\n\nYou pull out your pack of cigarettes. “You’re in Dr. Lane’s class?” You tap the pack against your palm until one cigarette slides partway out. You pull it out and jam it between your lips.\n\n“I am! He’s a fascinating teacher.”\n\n“There you go, then.” You light your cigarette and take a deep drag from it. “I took his class last year. He’s in love with Keats.”\n\nVirginia shrugs. “There’s no harm in that.”\n\nYou blow a cloud of smoke skywards and watch it drift away. “I’m not as in love with poetry as you seem to be.”\n\nVirginia leans forward, at once engaged and wary. “You don’t see value in poetry?”\n\n“Oh, no, I think it’s all right.” You wave your cigarette in her general direction. “But quoting poetry at people? [[It seems a mite showy->poetry battle]].”",
      "links": [
        {
          "text": "It seems a mite showy",
          "destination": {
            "name": "poetry battle",
            "pid": 222
          }
        }
      ]
    },
    {
      "pid": 222,
      "name": "poetry battle",
      "text": "“Showy?” Virginia leans back and pulls a cigarette pack of her own from her purse. “Only if you think of poetry as being more about performance instead of a way of expressing meaning.” She holds her cigarette out to you. You reluctantly light it.\n\nShe’s got spunk; you’ll give her that. “But declaiming it at passers-by? Maybe I agree with Wordsworth. ‘The flower of sweetest smell is shy and lowly.’”\n\nVirginia is on her feet in an instant, only five feet tall and yet radiating so much passion and intensity, like sunlight on your face. She snaps:\n\n<div class=\"quotes\">“Rest not! Life is sweeping by;\nGo and dare before you die:\nSomething mighty and sublime\n[[Leave behind to conquer time->hard work is worth it]]!”</div>",
      "links": [
        {
          "text": "Leave behind to conquer time",
          "destination": {
            "name": "hard work is worth it",
            "pid": 223
          }
        }
      ]
    },
    {
      "pid": 223,
      "name": "hard work is worth it",
      "text": "Virginia breathes hard, her chest rising and falling. Surprised, you realize you’re breathing hard, too. You run your hand through your hair, mussing it. Your mom always got on to you for that nervous habit. Getting a crew cut stopped you for a while, but the habit’s returned as your hair’s grown back out. “That’s a good one. Easy to understand, too. But other poems are all about saying something without coming out and saying it. It’s too much work to understand.”\n\n“Rewarding work,” Virginia says. She takes a deep drag on her cigarette, holds her breath, exhales. The white smoke cloud spirals into the sky. “The best things in life [[take effort->fourth for bridge]].”",
      "links": [
        {
          "text": "take effort",
          "destination": {
            "name": "fourth for bridge",
            "pid": 217
          }
        }
      ]
    },
    {
      "pid": 224,
      "name": "placement",
      "text": "{\n(set: $_link_color to '#686e7f')\n(set: $_link_hover_color to '#4169e1')\n}Pamphlets on the table. Three of them. Pictures of empty, hollow rooms.\n\n“This one looks nice.” The man touches one with his finger.\n\nYou nod and smile. Safest thing to do these days. “Is that your hotel?”\n\n“No, dad, it could be your [[new home->angry about placement]].”",
      "links": [
        {
          "text": "new home",
          "destination": {
            "name": "angry about placement",
            "pid": 230
          }
        }
      ]
    },
    {
      "pid": 225,
      "name": "driving with Tom",
      "text": "{\n(set: $_link_color to '#4169e1')\n(set: $_link_hover_color to '#96b0ff')\n}Tom drums on the passenger-side car dash. It’s just arrythmic enough to annoy you. The man never could sit still. “I don’t understand why Tuberville’s team is flaming out like it’s been doing,” he says.\n\n“Too much passing,” you say, squinting at the road. You should reach the street to Waffle House soon. “Can’t get anything going on offense.”\n\n“Bet you’re glad not to be there watching them lose all the time,” Tom says.\n\nYou shrug. “I’m an Ole Miss fan even when they’re terrible.”\n\n“That’s good, I guess, because this year they’re really terrible,” Tom says. “By the way, you’ll want to [[take a left->I know where to go]] at the next cross-street.”",
      "links": [
        {
          "text": "take a left",
          "destination": {
            "name": "I know where to go",
            "pid": 232
          }
        }
      ]
    },
    {
      "pid": 226,
      "name": "birthday party",
      "text": "{\n(set: $_link_color to '#4169e1')\n(set: $_link_hover_color to '#96b0ff')\n}You take a deep breath and blow at the two candles on your cake. The huge candle in the shape of a “6” goes out, but you don’t manage to put out the “0” candle.\n\n“Ooh, so close,” Michael says.\n\nRebecca swats him on the arm. “He did just fine for someone of his advanced age.”\n\n“You two,” Virginia says. She licks her fingers and pinches out the flame on the “0” candle.\n\n“Be good or I’ll write you two out of my will,” you say. “Also, you won’t get any cake.”\n\n“We’ll be good,” Michael says.\n\n“//I’ll// be good, at least,” Rebecca chimes in.\n\n“In that case, you each get a candle.” Virginia removes the two candles and passes one to each kid. Rebecca and Michael promptly suck the icing [[off of them->a brief flash of forgetting]].",
      "links": [
        {
          "text": "off of them",
          "destination": {
            "name": "a brief flash of forgetting",
            "pid": 227
          }
        }
      ]
    },
    {
      "pid": 227,
      "name": "a brief flash of forgetting",
      "text": "“I feel bad we’re not making your birthday a bigger deal,” Virginia says.\n\n“It’s okay,” you say. “We’ve got the party this weekend to have spouses and grandkids and friends and all of the hullabaloo.”\n\n“I should keep your present until then,” the old woman across the table says, slicing into the cake and distributing the slices onto small paper plates.\n\n“That’d be cruel and unusual punishment. You know he always wants his presents right away.” (link-reveal: \"It’s\")[…who //is// that young man next to Virginia?\n\n“Birthday boy gets the first piece,” the old woman says, sliding a piece to you.\n\n“Mo-om!” the young man sing-songs. “Why does he always get the first piece?”\n\n“Yeah,” Virginia chimes in. “I should get the first piece.”\n\n“No, me,” the young man says.\n\n“No, me!”\n\n“Children,” the [[old woman->no it's Virginia]] mock-scolds.]",
      "links": [
        {
          "text": "old woman",
          "destination": {
            "name": "no it's Virginia",
            "pid": 228
          }
        }
      ]
    },
    {
      "pid": 228,
      "name": "no it's Virginia",
      "text": "You realize: the young woman isn’t Virginia, it’s Rebecca. That’s Michael next to her, and the old woman is Virginia.\n\n“Dad?” Michael says. “Are you going to eat your cake?”\n\n“Give me a second, please, Michael.” You sink your fork into the cake slice uneasily. “Sometimes an old man’s mind wanders. Just you wait until [[you get old->birthday party end]].”",
      "links": [
        {
          "text": "you get old",
          "destination": {
            "name": "birthday party end",
            "pid": 229
          }
        }
      ]
    },
    {
      "pid": 229,
      "name": "birthday party end",
      "text": "(live: 2s)[(set: $_percent_complete to 66)(goto: \"last day at work\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "last day at work",
            "pid": 179
          }
        }
      ]
    },
    {
      "pid": 230,
      "name": "angry about placement",
      "text": "“I’ve got a home,” you say.\n\n“Dad, we’ve discussed this. Placement will give you more freedom&mdash;”\n\n“I’ve got a home!” He doesn’t listen. He never listens now. “I’ve got a home! My home! This is my home!” You shove the pamphlets away, and keep shoving.\n\nThe man scootches away from your swinging arm. “We can talk about this later, dad, please, just calm down.”\n\n“My home!” you say again. “My home! [[My home->placement end]]!”",
      "links": [
        {
          "text": "My home",
          "destination": {
            "name": "placement end",
            "pid": 231
          }
        }
      ]
    },
    {
      "pid": 231,
      "name": "placement end",
      "text": "(live: 2s)[(set: $_percent_complete to 42)(goto: \"sick Virginia\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "sick Virginia",
            "pid": 120
          }
        }
      ]
    },
    {
      "pid": 232,
      "name": "I know where to go",
      "text": "“I know how to get there,” you snap.\n\n“Sure, but like you told me, you don’t always know what you know. We missed Spring Creek, so we’ve got to double back around.”\n\nYou start to say something mean, but pull up short at the last second. He’s right, of course. Thankfully, since you made up with Tom, you’ve been better at catching your words before they escape. “Sorry,” you say.\n\n“No problem, Fred,” Tom says.\n\n“You know, this reminds me of when I got us lost in the wilds of downtown Houston on that sales call. I’ll never (link: \"forget\")[get over how you looked when you realized I’d made us late for the meeting.”\n\nYou glance over at Tom. He’s frowning. “What?” you say. You realize what’s wrong. “That was Dick who made you late, not me, wasn’t it?” You sigh. “That’s the problem with having a patchwork brain. Sometimes you [[patch it with other people’s memories->Tom's proposed sales call]].”]",
      "links": [
        {
          "text": "patch it with other people’s memories",
          "destination": {
            "name": "Tom's proposed sales call",
            "pid": 272
          }
        }
      ]
    },
    {
      "pid": 233,
      "name": "driving with Tom end",
      "text": "(live: 2s)[(set: $_percent_complete to 86)(goto: \"the incoherent age\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "the incoherent age",
            "pid": 234
          }
        }
      ]
    },
    {
      "pid": 234,
      "name": "the incoherent age",
      "text": "{\n(set: $_link_color to '#686e7f')\n(set: $_link_hover_color to '#4169e1')\n<div class=\"chapterImage\">\n\t(print: '<img src=\"'+$fragments_image+'\" alt=\"Abstract colored shapes\" />')\n</div>\n}<span class=\"cap\">S</span><span>coot out one of yours and you said it,</span> but [[you’ve only got clothes in it->you've only got clothes in it]]\n",
      "links": [
        {
          "text": "you’ve only got clothes in it",
          "destination": {
            "name": "you've only got clothes in it",
            "pid": 235
          }
        }
      ]
    },
    {
      "pid": 235,
      "name": "you've only got clothes in it",
      "text": "\n\n\n\nlate last year the machines have been watching you closely for your criticism\n\n\n\n\nthey’re skirting your room out the photos’ details without your glasses and polishing them on your face\n\n\n\nyou think we’ll get mad cows for me, right now [[you’re stuck->you're stuck]] in a colander\n",
      "links": [
        {
          "text": "you’re stuck",
          "destination": {
            "name": "you're stuck",
            "pid": 236
          }
        }
      ]
    },
    {
      "pid": 236,
      "name": "you're stuck",
      "text": "\n\nyou are putting the cards back in Basic, except you have to find Tom waiting on the other end\n\n\n\nthrow snowballs at him and a dress the shade of fall pumpkins in the choir, robes rustling\n\n\nthere’s only so much bitterness, you can get oatmeal and fruit for the service, you stalk to the sink, your cane to your head as you could, but you don’t make them right\n\n\n\n\nthere is someone\n\n\n\n\nyou should [[go to the front->there is someone]], [[down with the psychiatrist->there is someone]], [[down the street to Waffle House->there is someone]]\n\n\n\n",
      "links": [
        {
          "text": "go to the front",
          "destination": {
            "name": "there is someone",
            "pid": 237
          }
        },
        {
          "text": "down with the psychiatrist",
          "destination": {
            "name": "there is someone",
            "pid": 237
          }
        },
        {
          "text": "down the street to Waffle House",
          "destination": {
            "name": "there is someone",
            "pid": 237
          }
        }
      ]
    },
    {
      "pid": 237,
      "name": "there is someone",
      "text": "you fish around in case someone might faint at the other singers, defined rows becoming a full-time job\n\n\n\n\n\n\n\nthe sound of the two of you can’t remember lies well enough to spend energy being polite to people who should know better next time, you are a poor substitute for a long time\n\n\n\nfar too old to be [[when you met Virginia->really can't remember]]\n\n\nA heavy sigh, weighed down by the glass halfway at the end of the cake",
      "links": [
        {
          "text": "when you met Virginia",
          "destination": {
            "name": "really can't remember",
            "pid": 238
          }
        }
      ]
    },
    {
      "pid": 238,
      "name": "really can't remember",
      "text": "\nVirginia didn’t make it burn the way into the steak for a working brain, but she’s not the only one\n\n\n\nyou point at the next day to a chair and the sun’s red light catches her tears, it was like being strapped in a bed, two employees come in the holders that are under shirts\n\n\n\n\n\nyou squint through the room with your effort for once\n\nit’ll turn out to [[say something mean->she's not the only one]], but [[pull up short->she's not the only one]]",
      "links": [
        {
          "text": "say something mean",
          "destination": {
            "name": "she's not the only one",
            "pid": 239
          }
        },
        {
          "text": "pull up short",
          "destination": {
            "name": "she's not the only one",
            "pid": 239
          }
        }
      ]
    },
    {
      "pid": 239,
      "name": "she's not the only one",
      "text": "\n\nyou could wait here with Nipper and go find your glasses\n\nshe seemed so nice and sweet and charming, and she can’t find out\n\nsomeone’s [[cleared Virginia’s plates away->cleared Virginia's plates away]]",
      "links": [
        {
          "text": "cleared Virginia’s plates away",
          "destination": {
            "name": "cleared Virginia's plates away",
            "pid": 240
          }
        }
      ]
    },
    {
      "pid": 240,
      "name": "cleared Virginia's plates away",
      "text": "\n\nyou in a [|l1-inner>[cardboard box</span>]]<l1| by the mailbox, envelopes in hand to the sink\n\n|l1-mouseover>[(mouseover: ?l1)[(replace: ?l1)[cardboard box](display: \"plates away 1\")]](click: ?l1-inner)[(replace: ?l1)[cardboard box](replace: ?l1-mouseover)[](display: \"plates away 1\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "plates away 1",
            "pid": 253
          }
        }
      ]
    },
    {
      "pid": 241,
      "name": "a brief flicker of Virginia's smile",
      "text": "[|l1-inner>[there’s so much]]<l1|\n(mouseover: ?l1)[(goto: \"there's so much\")](click: ?l1-inner)[(goto: \"there's so much\")]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "there's so much",
            "pid": 242
          }
        }
      ]
    },
    {
      "pid": 242,
      "name": "there's so much",
      "text": "Virginia tells you she knows the joke she just [|l1-inner>[sits there]]<l1|, staring out the double doors that lead to the floor |l1-mouseover>[(mouseover: ?l1)[(replace: ?l1)[sits there](display: \"there's so much 1\")]](click: ?l1-inner)[(replace: ?l1)[sits there](replace: ?l1-mouseover)[](display: \"there's so much 1\")]\n\n\n\n",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "there's so much 1",
            "pid": 259
          }
        }
      ]
    },
    {
      "pid": 243,
      "name": "far less able to keep up",
      "text": "\n\n\n\n\nVirginia [starts rubbing your hand]<l1| on your cane hitting a staccato rhythm on the hanger and your hands in your pocket any more familiar\n\n\n\n(click: ?l1)[<span class=\"fadeIn\">Virginia [walks into your sides]<l2| to goad you on your cheeks and nose</span>\n\n\n\n\n(click: ?l2)[<span class=\"fadeIn\">Virginia leans forward, [[steepling her fingers]] in front of a skinflint</span>\n]]",
      "links": [
        {
          "text": "steepling her fingers",
          "destination": {
            "name": "steepling her fingers",
            "pid": 244
          }
        }
      ]
    },
    {
      "pid": 244,
      "name": "steepling her fingers",
      "text": "\n\n\n\n\n\nVirginia [[snaps]], sounding like the exercises, but that doesn’t impact his life at all",
      "links": [
        {
          "text": "snaps",
          "destination": {
            "name": "snaps",
            "pid": 245
          }
        }
      ]
    },
    {
      "pid": 245,
      "name": "snaps",
      "text": "\n\n\n\n\n\n\n[[Virginia on the sofa]]\n",
      "links": [
        {
          "text": "Virginia on the sofa",
          "destination": {
            "name": "Virginia on the sofa",
            "pid": 246
          }
        }
      ]
    },
    {
      "pid": 246,
      "name": "Virginia on the sofa",
      "text": "\n\n\n\n\n\n\n\n[[Virginia stops]]",
      "links": [
        {
          "text": "Virginia stops",
          "destination": {
            "name": "Virginia stops",
            "pid": 247
          }
        }
      ]
    },
    {
      "pid": 247,
      "name": "Virginia stops",
      "text": "\n\n\n\n\n\n\n\n\n[[Virginia->the incoherent age end]]",
      "links": [
        {
          "text": "Virginia",
          "destination": {
            "name": "the incoherent age end",
            "pid": 211
          }
        }
      ]
    },
    {
      "pid": 248,
      "name": "the end",
      "text": "(live: 4s)[<div class=\"fadeIn title\"><h1>Will Not Let Me Go</h1></div>(stop:)]\n\n(live: 6s)[<span class=\"fadeIn\">[[credits]]</span>(stop:)](live: 7s)[<span class=\"fadeIn\">  |</span>(stop:)](live: 8s)[<span class=\"fadeIn\">  (link-goto: \"start over\", \"restart\")</span>(stop:)]",
      "links": [
        {
          "text": "<link>",
          "destination": {
            "name": "restart",
            "pid": 263
          }
        },
        {
          "text": "credits",
          "destination": {
            "name": "credits",
            "pid": 262
          }
        }
      ]
    },
    {
      "pid": 249,
      "name": "HEADER",
      "text": "{\n<!-- Adjust the background and text colors based on a passage’s tags (if set) -->\n(if: (passage:)'s tags contains \"100%\")[\n\t(set: $_background_color to \"#fff\")\n\t(set: $_text_color to \"#000\")\n]\n(if: (passage:)'s tags contains \"80%\")[\n\t(set: $_background_color to \"#eee\")\n\t(set: $_text_color to \"#222\")\n]\n(if: (passage:)'s tags contains \"60%\")[\n\t(set: $_background_color to \"#ddd\")\n\t(set: $_text_color to \"#222\")\n]\n(if: (passage:)'s tags contains \"40%\")[\n\t(set: $_background_color to \"#ccc\")\n\t(set: $_text_color to \"#333\")\n]\n(if: (passage:)'s tags contains \"20%\")[\n\t(set: $_background_color to \"#bbb\")\n\t(set: $_text_color to \"#444\")\n]\n(if: (passage:)'s tags contains \"0%\")[\n\t(set: $_background_color to \"#999\")\n\t(set: $_text_color to \"#444\")\n]\n\n<!-- Deal with fading in entire passages -->\n(if: (passage:)'s tags contains \"fadeIn\")[\n\t(print: \"<script>$('tw-story').removeClass(\\).addClass('fadeIn'\\)</script>\")\n]\n(else:)[\n\t(print: \"<script>$('tw-story').removeClass(\\)</script>\")\n]\n\n<!-- Progress bar -->\n(print: '<div id=\"progress\" class=\"progress-bar\" style=\"border-bottom: 1px solid '+$_background_color+'\"></div>')\n\n<!-- Auto-save our progress (assuming we don't say \"NO\") -->\n(unless: (passage:)'s tags contains \"nosave\")[\n\t(save-game: $_autosave_slot, $_autosave_filename)\n]\n}",
      "links": []
    },
    {
      "pid": 250,
      "name": "FOOTER",
      "text": "{\n<!-- Progress bar -->\n(unless: (passage:)'s tags contains \"noprogress\")[\n  (if: $_percent_complete != $_old_percent_complete)[\n  \t<script>$(\"#progress\").addClass(\"flash-bar\")</script>\n\t(set: $_old_percent_complete to $_percent_complete)\n  ](else:)[\n  \t<script>$(\"#progress\").removeClass(\"flash-bar\")</script>\n  ]\n  (print: '<script>setProgressAmount('+(text: $_percent_complete)+'\\)</script>')\n]\n<!-- Set the background, text colors, and link colors programmatically -->\n(set: $_script_cmd to \"<script>updateTextAndBackgroundColors(\"+(text: $_colorize)+\"\\)</script>\")\n(print: $_script_cmd)\n}",
      "links": []
    },
    {
      "pid": 251,
      "name": "STARTUP",
      "text": "{\n<!-- Set the initial background and text colors, which are then applied in the HEADER and FOOTER passage -->\n(set: $_background_color to \"#fff\")(set: $_text_color to \"#000\")\n\n<!-- Set variables which won't change from game to game -->\n(set: $_version to \"1.0.0\")\n(set: $_autosave_slot to \"autosave\")\n(set: $_autosave_filename to \"save v\"+$_version)\n(set: $_start_passage to \"first playthrough message\")\n(set: $_percent_complete to 0)\n(set: $_old_percent_complete to 0)\n(set: $_image_dir to \"./images/\")\n}",
      "links": [
        {
          "text": "<set>",
          "destination": {
            "name": "first playthrough message",
            "pid": 271
          }
        }
      ]
    },
    {
      "pid": 252,
      "name": "set vars and check for autosave",
      "text": "{\n<!-- Set initial variables that change here instead of in the Startup passage b/c the Startup passage will be run after a saved game is loaded, which would overwrite the saved variables -->\n(set: $gave_in_to_anger_count to 0)\n(set: $gave_in_to_anger_max to 0)\n(set: $hid_condition_count to 0)\n(set: $hid_condition_max to 0)\n(set: $_colorize to true)\n(set: $_link_color to '#4169E1')\n(set: $_link_hover_color to 'DeepSkyBlue')\n(unless: (saved-games:) contains $_autosave_slot and (datavalues: (saved-games:)) contains $_autosave_filename)[(goto: $_start_passage)]\n<style>\ntw-story {\n\tposition: absolute;\n\tleft: 50%;\n\ttop: 25%;\n\t-webkit-transform: translate(-50%, -50%);\n\t-moz-transform: translate(-50%, -50%);\n\t-ms-transform: translate(-50%, -50%);\n\t-o-transform: translate(-50%, -50%);\n\ttransform: translate(-50%, -50%);\n\tmargin-top: auto;\n\tmargin-bottom: auto;\n}\n</style>\n}\n<div style=\"text-align: center;\">//Would you like to keep reading the story from where you last left off?\n\n(link: \"Yes\")[(load-game: $_autosave_slot)]&nbsp;&nbsp;&nbsp;&nbsp;(link: \"No\")[(goto: $_start_passage)]//</div>",
      "links": []
    },
    {
      "pid": 253,
      "name": "plates away 1",
      "text": "you’re [|l2-inner>[wadding up pages]]<l2|, tearing them into not-strangers\n\n|l2-mouseover>[(mouseover: ?l2)[(replace: ?l2)[wadding up pages](display: \"plates away 2\")]](click: ?l2-inner)[(replace: ?l2)[wadding up pages](replace: ?l2-mouseover)[](display: \"plates away 2\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "plates away 2",
            "pid": 254
          }
        }
      ]
    },
    {
      "pid": 254,
      "name": "plates away 2",
      "text": "someone [|l3-inner>[coming back]]<l3| into the wire basket on the table by the bed\n|l3-mouseover>[(mouseover: ?l3)[(replace: ?l3)[coming back](display: \"plates away 3\")]](click: ?l3-inner)[(replace: ?l3)[coming back](replace: ?l3-mouseover)[](display: \"plates away 3\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "plates away 3",
            "pid": 255
          }
        }
      ]
    },
    {
      "pid": 255,
      "name": "plates away 3",
      "text": "Virginia can have that ham and then [|l4-inner>[more and more people]]<l4| are uncomfortable\n|l4-mouseover>[(mouseover: ?l4)[(replace: ?l4)[more and more people](display: \"plates away 4\")]](click: ?l4-inner)[(replace: ?l4)[more and more people](replace: ?l4-mouseover)[](display: \"plates away 4\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "plates away 4",
            "pid": 256
          }
        }
      ]
    },
    {
      "pid": 256,
      "name": "plates away 4",
      "text": "what’s next on your plate, [|l5-inner>[fork up]]<l5| some of the Army |l5-mouseover>[(mouseover: ?l5)[(replace: ?l5)[fork up](display: \"plates away 5\")]](click: ?l5-inner)[(replace: ?l5)[fork up](replace: ?l5-mouseover)[](display: \"plates away 5\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "plates away 5",
            "pid": 257
          }
        }
      ]
    },
    {
      "pid": 257,
      "name": "plates away 5",
      "text": "your white hymnal goes into the form and [|l6-inner>[rip through it]]<l6| |l6-mouseover>[(mouseover: ?l6)[(replace: ?l6)[rip through it](display: \"plates away 6\")]](click: ?l6-inner)[(replace: ?l6)[rip through it](replace: ?l6-mouseover)[](display: \"plates away 6\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "plates away 6",
            "pid": 258
          }
        }
      ]
    },
    {
      "pid": 258,
      "name": "plates away 6",
      "text": "the doctor gives you [|l7-inner>[a brief flicker of Virginia’s smile]]<l7|, like a mirage\n(mouseover: ?l7)[(goto: \"a brief flicker of Virginia's smile\")](click: ?l7-inner)[(goto: \"a brief flicker of Virginia's smile\")]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "a brief flicker of Virginia's smile",
            "pid": 241
          }
        }
      ]
    },
    {
      "pid": 259,
      "name": "there's so much 1",
      "text": "pamphlets on the jumping jacks, [|l2-inner>[quoting Keats at me]]<l2|\n|l2-mouseover>[(mouseover: ?l2)[(replace: ?l2)[quoting Keats at me](display: \"there's so much 2\")]](click: ?l2-inner)[(replace: ?l2)[quoting Keats at me](replace: ?l2-mouseover)[](display: \"there's so much 2\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "there's so much 2",
            "pid": 260
          }
        }
      ]
    },
    {
      "pid": 260,
      "name": "there's so much 2",
      "text": "she takes things far more than four decades together, [|l3-inner>[you track each other]]<l3|\n\n|l3-mouseover>[(mouseover: ?l3)[(replace: ?l3)[you track each other](display: \"there's so much 3\")]](click: ?l3-inner)[(replace: ?l3)[you track each other](replace: ?l3-mouseover)[](display: \"there's so much 3\")]",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "there's so much 3",
            "pid": 261
          }
        }
      ]
    },
    {
      "pid": 261,
      "name": "there's so much 3",
      "text": "Virginia removes the two candles on your expression, if you want to study in the shower stall until you hear water running in the other singers, rows becoming a turbulent mix as you lower yourself into the break room, you’ll be sure to perform an autopsy, which [wouldn’t be that difficult]<l4|\n\n\n(click: ?l4)[you can’t cope with those lapses because they’re [[far less able to keep up]] with your plastic fork\n]",
      "links": [
        {
          "text": "far less able to keep up",
          "destination": {
            "name": "far less able to keep up",
            "pid": 243
          }
        }
      ]
    },
    {
      "pid": 262,
      "name": "credits",
      "text": "''Will Not Let Me Go''\nVersion $_version\nCopyright &copy; 2017, <a href=\"http://stephen.granades.com/\" class=\"enchantment-link\" target=\"_blank\">Stephen Granade</a>\n\nThanks to Sam Kabo Ashwell for incisive feedback, Alex White for early insight into what the story was really about, Mathbrush for making this a much more cohesive work, Liza Daly for making the pacing so much tighter and the interface so much better, Cat Manning for confirming that I was evoking the emotions I meant to, Starla Huchton for believing I could write this despite my claims otherwise, Smoky Writers for listening to my early attempts at telling this story, Melodie Sida for well-timed comments, and furkle for advanced Twine and Javascript wizardry.\n\nSpecial thanks to Misty Granade for art direction and being my first reader.\n\nWritten using <a href=\"http://twinery.org/\" class=\"enchantment-link\" target=\"_blank\">Twine</a> and the <a href=\"https://twine2.neocities.org/\" class=\"enchantment-link\" target=\"_blank\">Harlowe</a> story format.\n\n\n(link-goto: \"start over\", \"restart\")",
      "links": [
        {
          "text": "<link>",
          "destination": {
            "name": "restart",
            "pid": 263
          }
        }
      ]
    },
    {
      "pid": 263,
      "name": "restart",
      "text": "<!-- When restarting the game, skip asking if we want to re-load the autosaved game. The autosave happens if there’s a game saved. We can’t delete it, so a nasty hack: change its filename so that the re-loading code knows we don’t want it any more -->\n(save-game: $_autosave_slot, \"not-a-real-save\")\n(reload:)",
      "links": []
    },
    {
      "pid": 264,
      "name": "Liz's reaction",
      "text": "You had lunch on Monday with Yancy, the music minister, and told him you were done. Then, that Wednesday after rehearsal, you told the whole choir, though you don’t remember any of the details.\n\nYou figured you needed to tell them since word kept getting out. Some people were bound to get their back up if you didn’t tell them about your condition. Besides, once you started telling folks, you assured them they could tell others as well. Keeping a secret like that in church is like carrying water in a colander. So you talked to the choir as a group.\n\n[[But Liz you told direct]].",
      "links": [
        {
          "text": "But Liz you told direct",
          "destination": {
            "name": "But Liz you told direct",
            "pid": 108
          }
        }
      ]
    },
    {
      "pid": 265,
      "name": "super angry with Ruby",
      "text": "“Ruby,” you snap, “I wish you wouldn’t keep giving me those little memory tests. It doesn’t help and it’s (link-reveal: \"just\")[&mdash;it just makes me angry. Okay?”\n\nFrom the tight set of her lips, it’s not okay. That’s fine. You don’t have to deal with her but for one hour more.\n\n“I’ll meet you in the [[break room->party in the break room]],” you say and pivot sharply on your cane and away from her desk.\n]\n{\n(set: $gave_in_to_anger_count to it+1)\n(set: $shouted_at_ruby to false)\n}",
      "links": [
        {
          "text": "break room",
          "destination": {
            "name": "party in the break room",
            "pid": 160
          }
        }
      ]
    },
    {
      "pid": 266,
      "name": "transition from chair to living room 1",
      "text": "{\n<!-- Set up initial tracking variables for this scene -->\n<!-- living room -->\n(set: $searched_sofa to false)\n(set: $searched_papers to false)\n(set: $looked_at_photos to false)\n<!-- hallway -->\n(set: $looked_at_more_photos to false)\n(set: $tried_kids_bedroom_door to false)\n(set: $had_bathroom_conversation to false)\n(set: $came_from_living_room to false)\n<!-- kitchen -->\n(set: $looked_out_window to false)\n(set: $searched_refrigerator to false)\n(set: $searched_cabinets to false)\n(set: $looked_at_thinking_chair to false)\n<!-- guest bathroom -->\n(set: $seen_guest_bathroom to false)\n<!-- bedroom -->\n(set: $searched_covers to false)\n(set: $searched_dresser to false)\n(set: $searched_nightstand to false)\n}You lever yourself upright with your cane. It’s something you used to hate, that cane, but now it’d be like hating your legs. Come to think of it, you //do// hate your legs, far more than you hate the cane. The cane doesn’t fold up unexpectedly on you.\n\n(display: \"living room 1\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "living room 1",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 267,
      "name": "transition from sofa to living room 1",
      "text": "You carefully get to your feet. Going from sitting to standing makes you think of Thanksgiving parade floats, like you need a team of people guiding you and keeping you aloft.\n\n(display: \"living room 1\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "living room 1",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 268,
      "name": "images",
      "text": "{\n(set: $funeral_image to $_image_dir+\"1-funeral.png\")\n(set: $waffle_house_image to $_image_dir+\"2-waffle-house.png\")\n(set: $glasses_image to $_image_dir+\"3-glasses.png\")\n(set: $choir_image to $_image_dir+\"4-choir.png\")\n(set: $flu_image to $_image_dir+\"5-flu.png\")\n(set: $doctor_image to $_image_dir+\"6-doctor.png\")\n(set: $exercise_image to $_image_dir+\"7-exercise.png\")\n(set: $retirement_image to $_image_dir+\"8-retirement.png\")\n(set: $lunch_image to $_image_dir+\"9-lunch.png\")\n(set: $fragments_image to $_image_dir+\"10-pieces.png\")\n(set: $virginia_image to $_image_dir+\"11-virginia.png\")\n(set: $sum_of_all_fears_cover to $_image_dir+\"sumofallfears-blurry.jpg\")\n}",
      "links": []
    },
    {
      "pid": 269,
      "name": "transition from living room 1 to hallway 1",
      "text": "{\n(set: $came_from_living_room to true)\n}You make your slow way into the hall towards your bedroom. (display: \"hallway 1\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "hallway 1",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 270,
      "name": "mad cow intro",
      "text": "“Do you think we’ll get mad cows here?” you ask.\n\n(display: \"mad cow\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "mad cow",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 271,
      "name": "first playthrough message",
      "text": "{\n<style>\n@keyframes delayFadeInDelayOut { // 4.5 s of fadeindelayout matches 3.78 s of fadeInOut\n\t0%,100% { opacity: 0; }\n\t16.8%,83.2% { opacity: 1; }\n}\n@-moz-keyframes delayFadeInDelayOut {\n\t0%,100% { opacity: 0; }\n\t16.8%,83.2% { opacity: 1; }\n}\n@-webkit-keyframes delayFadeInDelayOut {\n\t0%,100% { opacity: 0; }\n\t16.8%,83.2% { opacity: 1; }\n}\n@-ms-keyframes delayFadeInDelayOut {\n\t0%,100% { opacity: 0; }\n\t16.8%,83.2% { opacity: 1; }\n}\n@-o-keyframes delayFadeInDelayOut {\n\t0%,100% { opacity: 0; }\n\t16.8%,83.2% { opacity: 1; }\n}\n\n.fadeInOut {\n\topacity: 0;\n\t-webkit-animation: fadeInOut 6s;\n\t-moz-animation: fadeInOut 6s;\n\t-ms-animation: fadeInOut 6s;\n\t-o-animation: fadeInOut 6s;\n\tanimation: fadeInOut 6s;\n\t\n\t-webkit-animation-fill-mode:forwards;\n\t-moz-animation-fill-mode:forwards;\n\t-ms-animation-fill-mode:forwards;\n\t-o-animation-fill-mode:forwards;\n\tanimation-fill-mode:forwards;\n}\n.delayFadeInOutFaster {\n\topacity: 0;\n\t-webkit-animation: fadeInOut 3.78s;\n\tanimation: fadeInOut 3.78s;\n\t-webkit-animation-delay: 4s;\n\tanimation-delay: 4s;\n\t\n\t-webkit-animation-fill-mode:forwards;\n\tanimation-fill-mode:forwards;\n}\n.delayFadeInDelayOut {\n\topacity: 0;\n\t-webkit-animation: delayFadeInDelayOut 4.5s;\n\tanimation: delayFadeInDelayOut 4.5s;\n\t-webkit-animation-delay: 4s;\n\tanimation-delay: 4s;\n\t\n\t-webkit-animation-fill-mode:forwards;\n\tanimation-fill-mode:forwards;\n}\ntw-story {\n\tposition: absolute;\n\tleft: 50%;\n\ttop: 25%;\n\t-webkit-transform: translate(-50%, -50%);\n\t-moz-transform: translate(-50%, -50%);\n\t-ms-transform: translate(-50%, -50%);\n\t-o-transform: translate(-50%, -50%);\n\ttransform: translate(-50%, -50%);\n\tmargin-top: auto;\n\tmargin-bottom: auto;\n}\n</style>\n}<div style=\"text-align: center;\">//<span class=\"fadeInOut\">You can leave off reading the story and then come back to it later</span>\n\n<span class=\"delayFadeInOutFaster\">The story will </span><span class=\"delayFadeInDelayOut\">remember</span><span class=\"delayFadeInOutFaster\"> where you were</span>//</div>(live: 8.5s)[(goto: \"Funeral Opening\")(stop:)]",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "Funeral Opening",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 272,
      "name": "Tom's proposed sales call",
      "text": "“Don’t get all fussed,” Tom says, “it was you on that sales call, not Dick.”\n\nYou feel a mix of relief and annoyance. “Well, hell, Tom, then why the frown?”\n\n“That was a potential million-dollar client.” He makes a thoughtful sound. “Tell you what, keep going straight. We’ll take a road trip back to Houston, win the guy over.”\n\n“It’s a bit late for that, don’t you think,” you say.\n\n“It’ll be great. Think of how excited Paul will be when we show up, contract in hand.” Tom would try it, too, just on the off-hand chance it worked.\n\nGod, it’s great to be back in a car with Tom.\n\nThe cross street’s coming up. You slow down and make the left turn. “Direct me from here?”\n\n“[[Like always->driving with Tom end]],” Tom says.",
      "links": [
        {
          "text": "Like always",
          "destination": {
            "name": "driving with Tom end",
            "pid": 233
          }
        }
      ]
    },
    {
      "pid": 273,
      "name": "meeting Virginia end",
      "text": "{\n(set: $_percent_complete to 100)\n(set: $_old_percent_complete to 100)  \t<script>$(\"#progress\").addClass(\"flash-bar\")</script>\n<script>setProgressAmount(100)</script>\n}(display: \"the end\")",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "the end",
            "pid": 248
          }
        }
      ]
    }
  ]
}