{
  "passages": [
    {
      "pid": 1,
      "name": "Splash Screen",
      "text": "<div class=\"chapterScreen\">\n<img src=\"images/cover.png\" id=\"coverImage\"/>\n<br>\n[[Start!->1.1]]</div>",
      "links": [
        {
          "text": "Start!",
          "destination": {
            "name": "1.1",
            "pid": 2
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "1.1",
      "text": "<div class=\"chapterScreen\"><div class=\"title\">Chapter One: The Legend of the King</div></div>\n<img src=\"images/chapter1.png\"/>\n\n\"Once, if memory serves me well, I sat in front of the fire and listened to my father tell the story of the King. Today, I am the one telling it to you.\"\n\nTwo boys with flinty eyes sat and listened to the old man.\n\n\"At the beginning of the world, mortals found three magical stones. One to command the sea, one to command the earth, and one to command the sky. The stones were so powerful that they were almost unbearable to use.\"\n\n[[Continue.->1.2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.2",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "1.2",
      "text": "\"Each magical stone was the seed of a great civilisation. They were called the Family of the Sea, the Free Cities of the Earth, and the Empire of the Sky. For many years the three coexisted in a balance of power, sometimes cooperating, sometimes conflicting with one another. This went on until a warlord arose and conquered all three civilisations. The warlord claimed all three magical stones for himself.\"\n\n[[Continue.->1.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.3",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "1.3",
      "text": "\"The warlord commanded his courtiers to forge a crown that could hold the power of all three stones. After many failed attempts, a suitable crown was finally made. The warlord became the King of the World, the most powerful man to ever live.\"\n\n[[Continue.->1.4]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.4",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "1.4",
      "text": "\"The King of the World ended all war and violence. He commanded his three separate peoples to be one united people. He performed miracles, and he created a perfect Kingdom where every flower flourished, every wine flowed, and no one would ever die.\"\n\n\"Wow,\" whispered the younger boy.\n\n\"Then what happened?\" asked the older boy.\n\n\"There were many people who coveted the crown. The King's jester, a foolish boy named Joby, was influenced to betray the King in the moment of his greatest weakness. The King was floating in the air using all of his power to create a stairway between the sea, the land, and the sky. Joby hurled a rock and knocked the crown off the King's head. The King, and his work, collapsed into ruin.\"\n\n[[Continue.->1.5]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.5",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "1.5",
      "text": "\"What about the crown?\" asked the younger boy.\n\n\"Many men demanded that they be crowned the new King. But no new King was ever named. Each civilisation took back its magical stone, and the three civilisations fell into mean squabbles and bloody warfare, a time we call the War of Succession. The crown was lost during the war, no one really knows where it might be. But some say that, one day, the next King of the World will find the crown, claim the stones, and herald the return of paradise.\"\n\n[[Continue.->1.6]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.6",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "1.6",
      "text": "\"What happened to Joby?\" asked the younger boy. \n\n\"He was killed,\" replied their father.\n\n\"Who won the War of Succession?\" asked the older boy.\n\n\"No one. Now, it's time to go to sleep. Tomorrow is a big day for you.\"\n\n[[Continue.->1.7]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.7",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "1.14",
      "text": "Meanwhile, somewhere deep in the ocean, inside a city of glowing bubbles, there was a young girl playing with the world's largest collection of dolls.\n\nWhen a woman entered the room, the girl put down her doll and looked up with sadness. \n\n\"Sister,\" she started. \"Do you ever feel lonely?\"\n\nThe woman shook her head. \"No one in the Family should ever feel lonely, sweet oracle. But listen, we can talk about this later. The Great Mother has requested you, Kari.\" \n\n\"Oh. I will go straight away!\" she cried.\n\n[[Continue.->1.15]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.15",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "1.15",
      "text": "With barely another thought, Kari rushed off. She ran through the city of bubbles and dived into the ocean water. She swam among fish, across reefs, and through a forest of kelp, until she found the palace of the Great Mother.\n\n\"She is waiting for you, sister,\" said the hulking guardian of the gate.\n\nKari passed through. She wandered through the coral gardens and the palace chambers, wondering what the Great Mother wanted from her.\n\nThen she was in the throne room standing in front of a huge old woman. The Great Mother was covered in shells and weeds. Her eyes were the colour of pearls, and her thick fingers carefully clutched a glowing blue stone the size of Kari's fist. \n\n[[Continue.->1.16]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.16",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "1.16",
      "text": "Whenever she visited the Great Mother, Kari felt overwhelming feelings of warmth, love and belonging. She walked closer, unable to speak. She could only smile and feel the tears coming to her eyes.\n\n\"Mommy,\" she said softly.\n\n\"Oh, my child,\" said the Great Mother. \"Oh child, come here. I have such worries.\"\n\n\"What is it, mommy? What's wrong?\"\n\nDeep inside, Kari was shocked at her own squirming, sugary words. But up on the surface, she could not be any other way when talking to the Great Mother.\n\n[[Continue.->1.17]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.17",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "1.17",
      "text": "\"Today the Richest Man on Earth gave the stone to his eldest son.\"\n\n\"What does that mean, mommy?\"\n\n\"Oh dearie,\" said the Great Mother. \"It means that we are in peril. The Free Cities of the Earth are ruled by a new stone bearer, and he will be hungry to prove himself.\" \n\n\"What can I do to help?\"\n\n[[Continue.->1.19]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.19",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "1.19",
      "text": "\"You are my most talented little oracle,\" said the Great Mother. \"I need to know what we can do to... keep our family safe.\"\n\n\"Keep our family safe?\"\n\n\"Well,\" said the Great Mother. \"Right now, the Free Cities are happy that they have a new leader. They all agree that they want to cause trouble for us, or for the Empire of the Sky. But what if there was a way to make them argue amongst themselves? That way, we wouldn't have to worry about them being cruel to us.\"\n\n[[Continue.->1.20]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.20",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "1.20",
      "text": "\"Mommy,\" said Kari. \"I understand. I promise you, I will find a way.\"\n\nFirst, Kari decided, she needed to know her enemy. She descended to the deepest, darkest waters of the sea. There she consulted her dreams about the Free Cities of the Earth.\n\n[[Continue.->1.21]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.21",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "1.7",
      "text": "The two boys retired to their bedchambers. \n\nThe older boy, Idris, thought about the day to come. He was filled with excitement. The next day his father had arranged for him to be given the Earth Stone. He would learn how to wield its awesome power. Their family would begin their dynasty, and their power and wealth would grow like never before.\n\nThe younger boy, Andras, lay awake for a long time. He thought about the story of the King of the World, and he wondered what it would be like once his brother received the Earth Stone. Andras tried not to feel jealous, but it was no use. \n\n[[Continue.->1.8]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.8",
            "pid": 15
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "1.8",
      "text": "\"Father,\" he had asked once. \"Why does Idris get to have the Earth Stone?\"\n\nHis father smiled a patient sort of smile. \"Don't worry about that. When you are older, you will understand that so much power is not a gift, but a burden. Idris is going to need your help.\"\n\n\"But what if we shared it? Then it wouldn't be so much of a burden.\" he said. \n\nHis father laughed.\n\nWhen Andras thought about the future, he realised that he didn't really know what awaited him. When he grew up, what was he going to do? What was going to happen to him? He did not want to be his brother's butler for the rest of his life.\n\n[[Continue.->1.9]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.9",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "1.9",
      "text": "The next morning, everyone was in a rush. The servants swarmed Idris, making sure he was fed, bathed, dressed, and perfectly groomed for the ceremony that day. They had last minute arguments over the jewels and expensive clothes that he would wear. \n\nAndras watched from a distance. Dressed in his night gown, and with hair fresh from bed, he went downstairs to the dining hall. All alone he ate a bowl of porridge, and wondered if anyone would remember him.\n\nA hand tapped him on the shoulder. \n\n\"You should go and get ready,\" said his father. \"You need to look your best today.\"\n\n\"Fine,\" he said.\n\n[[Continue.->1.10]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.10",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "1.10",
      "text": "Andras climbed back up to his chambers. On his way up, Idris was parading the other way.\n\nWas Idris cruel or kind to Andras?\n\n<a href=\"javascript:void(0)\" data-passage=\"1.10.Cruel\" onclick=\"story.state.idris_temperament = 'Cruel';\">Cruel.</a>\n\n<a href=\"javascript:void(0)\" data-passage=\"1.10.Kind\" onclick=\"story.state.idris_temperament = 'Kind';\">Kind.</a>",
      "links": []
    },
    {
      "pid": 18,
      "name": "1.11",
      "text": "Andras got ready for the ceremony half-heartedly and made his way outside. He followed the torrent of servants to the central park where the ceremony would take place.\n\n\"Andras,\" someone said. \"You're meant to be on stage. Where have you been?\"\n\nHe felt himself being pushed and shoved and guided through the ever denser throngs of people. Crowds had been gathering for days. Soon he was on stage, standing to one side and staring out at a sea of people that extended as far as he could see.\n\n[[Continue.->1.12]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.12",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "1.12",
      "text": "Andras watched as Idris played his role perfectly. It was all a blur. Idris removed the jewels and the gold he wore, and threw them into a huge fire. Idris was blessed by the coloured dusts, all thrown upon him by the Mayor of each Free City. Idris did not sneeze.\n\nWhen all the ceremony was done, the Richest Man on Earth, their father, took the Earth Stone and bestowed it upon Idris. Tremors rippled across the land. The people cheered so loudly that Andras' ears were ringing. Andras saw that Idris was laughing. Idris used the Earth Stone to reform the melted gold and jewels into a beautiful scarf. He pinned the Earth Stone into the scarf like an amulet.\n\n\"Today, all debts are cleared! Today, all soldiers will have a bonus of gold or land! The Free Cities of the Earth shall have a vast army, stronger than any other in the world, and we will reclaim the sunken cities and raise our mountains higher into the sky!\" he cried.\n\nThe people cheered.\n\n[[Continue.->1.13]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.13",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "1.13",
      "text": "After the ceremony, Andras slipped away. They would feast and drink all day, but he could not take it. He made way to the beach and stared out to the horizon where the sea and sky met. There he wept.\n\n\"It's not fair,\" he cried. \"He has the Earth Stone, everybody loves him! I don't have anything. No one notices me. No one cares.\"\n\nAndras wallowed by the shore all day, skipping rocks across the water. \n\n[[Continue.->1.14]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.14",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "4.1",
      "text": "<div class=\"chapterScreen\"><div class=\"title\">Chapter Four: The Coronation</div></div>\n\nAndras stood in the middle of the battlefield. Ripples of energy from the newly assembled crown froze fights, turned heads, and slackened jaws.\n\nThe crown loomed in front of Andras, throbbing with heat and light. The stones sent tremors through the earth and winds through the air. Streams of water flowed upward toward the new King of the World.\n\nAs Andras looked upon the crown, his journey flashed before him.\n\n[[Continue.->4.2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "4.2",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "4.2",
      "text": "<%\n$(function () {\nif(story.state.stairway == 'yes'){ \n\n$('#stairpassage').append(Passage.render(\"<p class='becauseHeader'>Because you visited the stairway:<\\/p>\\n <div class='becauseText'>He saw the incomplete stairway between sea, earth, and sky.<\\/div>\"));\n}\n\nif(story.state.oubliette == 'yes'){ \n\n$('#oubpassage').append(Passage.render(\"<p class='becauseHeader'>Because you stayed in the oubliette:<\\/p>\\n <div class='becauseText'>He saw a horrible prison full of tortured souls.<\\/div>\"));\n}\n\nif(story.state.deadscout == 'yes'){ \n\n$('#scoutpassage').append(Passage.render(\"<p class='becauseHeader'>Because your faithful scout perished in the War with Water:<\\/p>\\n <div class='becauseText'>He saw his faithful scout washed away by a wave.<\\/div>\"));\n}\n\n\n})\n%>\n\nHe saw his brother Idris, his jealousy, and the day he found the crown.\n\nHe saw the giant forest, and its wretched crossbreeds.\n<div id=\"oubpassage\"></div><div id=\"stairpassage\"></div><div id=\"scoutpassage\"></div>\n\nHe saw soldiers dying in battle, women and children struggling to make a living.\n\nHe saw the skeleton in the library, still serving its King.\n\n[[Continue.->4.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "4.3",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "4.3",
      "text": "Did Andras put on the crown?\n\n[[Yes.->4.4.1.1]]\n\n[[No.->4.4.2.1]]",
      "links": [
        {
          "text": "Yes.",
          "destination": {
            "name": "4.4.1.1",
            "pid": 24
          }
        },
        {
          "text": "No.",
          "destination": {
            "name": "4.4.2.1",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "4.4.1.1",
      "text": "Andras clutched the crown, thrust it into the air above him, and brought it down upon his head. \n\nUltimate power coursed through Andras. He could feel the entire world and everything in it like it was all a part of him.\n\nHe remembered the story his father had told him, so long ago. \n\n\"Today,\" he said. \"Paradise is come again. I command an end to all war and violence. The whole world shall live as one. And we shall enjoy a Kingdom where every flower flourishes, every wine flows, and no one shall ever die.\"\n\nThe sun set over the old world. The peoples of sea, earth, and sky all looked to their King. He, and his mighty army, descended from the heavens like angels, with plans for a perfect world.\n\nWhen they reached the ground, they all hugged, and wept, and celebrated. \n\nCries rose up. \"Long live the King! Long live the King!\" \n\n[[Continue.->Epilogue]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "Epilogue",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "4.4.2.1",
      "text": "Andras looked around him, dismayed. He saw the excited, expectant faces of his comrades. He saw the fear in the eyes of his enemies. \n\nHe saw his brother Idris. He saw Kari.\n\nHe grasped the crown with both hands. \n\nCries rose up. \"Long live the King! Long live the King!\" \n\n\"No,\" he said. \"No!\"\n\n\"I can't be the King of the World,\" he said solemnly. \"No one can. I have seen too much to put on this evil crown. This much power should never be given to one man. I won't let it happen again.\"\n\n[[Continue.->4.4.2.2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "4.4.2.2",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "4.4.2.2",
      "text": "He looked down at the people around him with tearful eyes.\n\n\"There are no Kings among men!\" he cried. \"Only brothers.\"\n\nWith both hands on the tender crown, Andras tore it apart. The gold and the magical stones whirled around him like stars, and then they shot away to the ends of the earth.\n\n[[Continue.->Epilogue2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "Epilogue2",
            "pid": 118
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "Epilogue",
      "text": "So ends the story of the King of the World. \n\nAndras and Kari were wed the next day on the beach where they first met. King Andras reigned over the whole world, and used his powers to recreate it in a new and brilliant way.\n\nIdris was given high offices in the military, and helped to keep the peace throughout the sea, earth, and sky.\n\nAnd many terrible and wondrous things came to pass, wrought by the ultimate power of the King of the World.\n\n<div class=\"chapterScreen\"><div class=\"title\">The End</div></div>",
      "links": []
    },
    {
      "pid": 28,
      "name": "1.10.Cruel",
      "text": "<p class='becauseHeader'>Because you chose Cruel Idris:</p> <div class='becauseText'>\"What are you doing?\" asked Idris. \"You are supposed to be ready for today, idiot. Go and get dressed or you're going to be late.\"\n\n\"Don't call me an idiot.\"\n\n\"I'll call you what I want,\" said Idris. \"You do understand that after today, I'm the boss, don't you?\"\n\n\"You're not the boss of me,\" said Andras.\n\n\"We'll see about that,\" sneered Idris. \"When I have the Earth Stone, things are going to change around here.\"</div>\n\n[[Continue.->1.11]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.11",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "1.10.Kind",
      "text": "<p class='becauseHeader'>Because you chose Kind Idris:</p> <div class='becauseText'>\"Andy!\" he cried. \"Look at me!\"\n\nAndras smiled weakly. \"Looking good.\"\n\nIdris looked at him oddly. \"Are you alright? You look sick.\"\n\n\"I'm fine,\" he said. \n\n\"Then cheer up, Andy,\" he said. \"Today is going to be so much fun. Now, I order you to go and get dressed!\"</div>\n\n[[Continue.->1.11]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.11",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "1.26",
      "text": "There stood a boy, sword in hand, training upon the sands. Kari could see clearly his dark curls, his grey eyes, and the terrifying determination on his face. For a long time she watched him from afar.\n\nHe practiced his bladework against wooden dummies set up on the beach.\n\nHe ran barefoot for miles along the coast.\n\nHe sang songs she had never heard before as he dawdled and fished along the rock pools.\n\nAnd as twilight fell, he tended to a campsite surrounded by a wall of wooden stakes. \n\n[[Continue.->1.27]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.27",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "1.27",
      "text": "Kari could not stop herself. She had to meet him. Striding out of the water, she craned her neck to look into the campsite. He lay by the fire under an old blanket. She stepped closer, but something caught on her leg, and an almighty clang went out into the night. The boy leapt up and grabbed his sword.\n\n\"Who goes there!\" he yelled. \n\nShe tried to look composed. \n\n\"Traps,\" she said, trying to sound offended. \"Is that any way to treat your guests?\"\n\nHe relaxed a little. \"Wasn't really expecting visitors. It's not every day a girl tries to sneak into your campsite.\"\n\n\"I am Kari,\" she replied. \"Who are you?\"\n\n\"Andras,\" he said.\n\n[[Continue.->1.28]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.28",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "1.28",
      "text": "As twilight disappeared, and the embers of the campfire danced into the night, the boy and the girl talked and talked. \n\nHe told her of his brother, and the Earth Stone. \n\n\"Because I am unworthy of it,\" he said sadly. \"I will become a great warrior, and I will make my father proud.\"\n\nShe told him of her mother, her life under the sea, and how she felt so lonely. \n\n\"I want her to be happy,\" she said. \"I am her favourite daughter, and I am a talented oracle. I have to obey her and do what's right for the Family. But sometimes, I want to leave, and see the world. Maybe there is more to life.\"\n\n\"There is,\" he said, and kissed her.\n\n[[Continue->1.29]]",
      "links": [
        {
          "text": "Continue",
          "destination": {
            "name": "1.29",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "1.29",
      "text": "It all came so naturally. It was one of those rare times in life that felt simple and right, elevated above all worldly concern. It was impossible that they do anything else but fall in love.\n\nWhen Kari began to feel the guilt of her absence, she reluctantly parted with Andras.\n\n\"Don't go,\" he said. \"Please don't go.\"\n\n\"We will meet again,\" she assured him.\n\n\"Do you promise? When are you coming back?\"\n\n\"I promise,\" she said. \"Goodbye for now, Andras.\"\n\nAnd she left.\n\n[[Continue.->1.30]]\n",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.30",
            "pid": 76
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "1.Crown.1",
      "text": "As the predawn light stripped the night away and revealed the naked blue world, Andras strolled along the beach to the rocks. Hefting his fishing rod, he cast a line into the sea, and sighed. \n\n\"That was the longest I ever talked to a girl,\" he said to his fishing rod. \"But they always get away from me, huh.\"\n\nHe spent a long while on the rocks, but came back empty handed. As he was walking back to camp, his stomach aching with hunger, Andras tripped over.\n\n\"Oww,\" he groaned.\n\nHe looked down in the sand, scanning for whatever tripped him. There was something sticking out of the sand.\n\n\"What the-?\"\n\nHe picked up the object, and studied it.\n\n[[Continue.->1.Crown.2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.2",
            "pid": 35
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "1.Crown.2",
      "text": "It was a crown. The crown was made of gold, and its peaks and troughs were crafted in the shapes of legendary beasts of the earth, the sea, and the sky. But most telling of all, the crown had three large hollow sockets where three large stones must have fit.\n\nAs he studied the crown, Andras' hands began to shake, and his eyes widened. He forgot all about the girl from the sea.\n\n\"This is the King's Crown!\" he cried.\n\nClouds gathered and rain began to fall over the stupefied Andras. For a while he just stood on the rocks and studied the crown in disbelief. Then he took up his fishing rod and the crown and ran back to his camp. In a few short moments, he prepared himself for the journey home.\n\n[[Continue.->1.Crown.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.3",
            "pid": 36
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "1.Crown.3",
      "text": "<div id=\"custompassage\"></div>\n<%\n$(function () {\n\nif(story.state.idris_temperament == 'Cruel'){ \n\n$('#custompassage').append(Passage.render(\"<p class='becauseHeader'>Because you chose Cruel Idris:<\\/p>\\n <div class='becauseText'>The lands had prospered under Idris' rule. The people were richer, the lands were more fertile, and the Free Cities were full of pride and joy and expectation. Everyone was preparing for war, but with a fervor and excitement of supernatural certainty in their victory - and even faith in the virtue of the bloodshed.\\n\\nBut wherever Andras went, he was ignored at best. Some villages refused him hospitality, calling him a traitor. He quickly learned rumours saying that he had abandoned the war effort and fled like a coward to lands unknown. The people otherwise talked only of Idris, whose grand deeds and plans were going to accomplish extraordinary things and make them all rich.\\n\\nFor his part, Andras said all the right words, smiled and nodded, and passed through with as little fanfare as he could. He kept the crown carefully wrapped up in his backpack where no one would see it. \\n\\nBut when he arrived at the pitiless wastes, where Idris and his generals had congregated, Andras was greeted by a cadre of mercenaries.<\\/div>\\n\\n[[Continue.->1.Crown.Cruel.1]]\"));\n\n}\nelse{\n\n$('#custompassage').append(Passage.render(\"<p class='becauseHeader'>Because you chose Kind Idris:<\\/p>\\n <div class='becauseText'>The lands had prospered under Idris' rule. The people were richer, the lands were more fertile, and the Free Cities were full of pride and joy and expectation. Everyone was preparing for war, but with a fervor and excitement of supernatural certainty in their victory - and even faith in the virtue of the bloodshed. Wherever Andras passed through, he was greeted with enthusiasm. The people lauded his brother's latest deeds and spoke of old friends whose lives were lost when the sunken cities were claimed by the Family of the Sea.\\n\\nFor his part, Andras said all the right words, smiled and nodded, and passed through with as little fanfare as he could. He kept the crown carefully wrapped up in his backpack where no one would see it. When he arrived at the pitiless wastes, where Idris and his generals had congregated, Andras was greeted by none other than Idris himself.<\\/div> \\n\\n[[Continue.->1.Crown.Kind.1]]\"));\n\n}\n})\n%>",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Cruel.1",
            "pid": 37
          }
        },
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Kind.1",
            "pid": 38
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "1.Crown.Cruel.1",
      "text": "<p class='becauseHeader'>Because you chose Cruel Idris:</p> <div class='becauseText'>\"The traitor returns,\" said the mercenary captain. \"This is sure to lighten up the stonebearer's day.\"\n\n\"I'm no traitor. I want to see Idris, and my father.\"\n\n\"You're the boss,\" he replied.\n\nMercenaries surrounded Andras, grabbed him, and dragged him away.</div>\n\n[[Continue.->1.Crown.Cruel.2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Cruel.2",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "1.Crown.Kind.1",
      "text": "<p class='becauseHeader'>Because you chose Kind Idris:</p> <div class='becauseText'>\"Andras,\" said Idris, surprised. \"I heard you were on your way. Come, rest, and we'll eat together.\"\n\n\"What are you doing all the way out here?\"\n\n\"We are training for combat out of sight of the Family of the Sea's spies. You would be hard pressed to find any body of water out here, except somewhere deep underground.\"\n\n\"Idris, I need to talk to you and father. It's very important.\"</div>\n\n[[Continue.->1.Crown.Kind.2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Kind.2",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "1.Crown.Cruel.2",
      "text": "<p class='becauseHeader'>Because you chose Cruel Idris:</p> <div class='becauseText'>Andras had been waiting alone in a cell for hours, when his father and Idris arrived.\n\n\"What is going on with you, Andras?\" asked his father. \"Where have you been?\"\n\n\"You have heard the tales, father.\" asked Idris. \"They say he is a traitor. They say he ran away when the war was announced.\"\n\nThere was such venom in Idris' words.\n\n\"I have to show you something,\" said Andras. \"It's important.\"</div>\n\n[[Continue.->1.Crown.Cruel.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Cruel.3",
            "pid": 81
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "1.Crown.Kind.2",
      "text": "<p class='becauseHeader'>Because you chose Kind Idris:</p> <div class='becauseText'>\"There will be time enough for that later,\" smiled Idris. \"You have to tell us what you've been doing. You've missed a lot.\"\n\nSo Andras humoured his brother and father for a while. He tried to pick a moment, but he never seemed to find a good opportunity to reveal what he had found.\n\nBut keeping the bundle so close to him drew the attention of a maid. \n\n\"Sir, I will gladly take that to your tent if it is bothering you to carry it around.\"\n\n\"No thank you, it's fine,\" said Andras.\n\n\"What's that you have there?\" asked his father.</div>\n\n[[Continue.->1.Crown.Kind.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Kind.3",
            "pid": 77
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "2.1",
      "text": "<div class=\"chapterScreen\"><div class=\"title\">Chapter Two: The War with Water</div></div>\n<img src=\"images/chapter2.png\"/>\n\nWhen they arrived in Earth's Heart, Andras oversaw swift preparations for the war effort. The army Idris had gathered was provisioned for the first leg of the journey, and they planned to stop at several settlements along the way to stock up. The mercenary leaders assured Andras that the battle plans were hammered out during Idris' rule, and they would counsel him on his role.\n\nIt did not take long. Only days passed, and everything was in place. They began the march. Coloured flags fluttered in the wind, flanking the soldiers and earthbeasts as they travelled along the road. There were flags for mercenary companies. There were flags for market towns which had contributed this or that, or sent their best sons and daughters to aid the war effort. There were personal flags, comedic flags, and flags already announcing \"VICTORY\" or \"KING ANDRAS\". It was like a huge parade.\n\n[[Continue.->2.1.1]]\n<%\n$(function () {\nstory.state.food = 14;\nstory.state.morale = 0;\nstory.state.days = 0;\nstory.state.winbattle = 0;\nstory.state.ateforest = '';\nstory.state.oubliette = '';\nstory.state.deadscout = '';\n})\n%>",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.1.1",
            "pid": 85
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "1.21",
      "text": "The depths were cold and quiet. \n\nKari knew that contemplating the Free Cities of the Earth in the depths would grant her wisdom about what to do next. Dreams and visions were at their most potent here. \n\nShe swam down, down, down, until she lost herself in the darkness. It was unnerving. She knew the stories of brothers and sisters who stayed too long in the depths and never returned from their visions. But she had to help her mommy. She closed her eyes and let go of her thoughts, soon enough she drifted off into meditation.\n\n[[Continue.->1.22]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.22",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "1.22",
      "text": "She saw a boy with bronze skin, dark curls, and flinty eyes. She saw that there were two of him, fighting over something. \n\n\"The Earth Brothers...\" she murmured.\n\nShe saw the crown. The boy was standing upon a precipice, holding the crown in his hands. \n\n\"Wh- What... ?\"\n\nThen a flood of visions overwhelmed her. An army marching across the land, a library at the bottom of the sea, a wedding on the beach, people fighting on the clouds, three stones...\n\n[[Continue.->1.23]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.23",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "1.23",
      "text": "Kari opened her eyes. It was just darkness, but the visions kept coming.\n\nShe swam away. Up, and away. \n\nMonsters grasped after her. A skeleton, twisted crossbred animals, a cruel looking man flying in the sky, and... \n\n\"Mommy?\" \n\nShe kept swimming. But it was no use. She was losing herself, falling into the fear...\n\n[[Continue.->1.24]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.24",
            "pid": 45
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "1.24",
      "text": "...\n\n[[Continue.->1.25]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.25",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "1.25",
      "text": "When Kari woke up she was no longer in the dark depths. The visions burned in her mind. The waters she found herself in were unfamiliar, but she felt strangely at peace, and she allowed the tides take her where they willed.\n\nEventually Kari floated to the borderlands between Earth and Sea. She swam up and peered above the waters.\n\n[[Continue.->1.26]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.26",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "2.2",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food-7;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+7;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAfter the first week of travel, a scout visited Andras.\n\n\"My King,\" he said. \"I bring grim news. The river valley ahead of us has flooded. The waters will soon pass, but we won't be able to restock our supplies.\"\n\n\"This could be the work of the Family of the Sea,\" said Gargull, one of the mercenary captains.\n\n\"The people of the valley will need help,\" said the scout.\n\nHow did Andras respond?\n\n[[\"We will do everything we can.\" ->2.2.1]]\n\n[[\"We can't afford to slow the march. We will help those in crisis, and then move on.\"->2.2.2]]\n\n[[\"It is my army that needs help. We will take whatever supplies they have, as well as any men that can fight, and then we will leave.\"->2.2.3]]",
      "links": [
        {
          "text": "\"We will do everything we can.\" ",
          "destination": {
            "name": "2.2.1",
            "pid": 48
          }
        },
        {
          "text": "\"We can't afford to slow the march. We will help those in crisis, and then move on.\"",
          "destination": {
            "name": "2.2.2",
            "pid": 49
          }
        },
        {
          "text": "\"It is my army that needs help. We will take whatever supplies they have, as well as any men that can fight, and then we will leave.\"",
          "destination": {
            "name": "2.2.3",
            "pid": 50
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "2.2.1",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food+1;\nstory.state.morale = story.state.morale+1;\nstory.state.days = story.state.days+2;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAndras stopped his army in the hills overlooking the river valley.\n\n\"In my Kingdom,\" cried Andras. \"No one will be left behind. Do whatever you can to help and clean up the damage. And remember, when you see the destruction and death in the days ahead, that this is what the Family of the Sea has done to these innocent people.\"\n\nThe army cheered. With the army employed to rescue folk and clean up the valley, it took two days to make things right. Grateful farmers gave whatever they had, mourning families offered hospitality and weaponry, and a few more angry men joined the ranks of the army.\n\n[[Continue.->2.2.1.Song]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.2.1.Song",
            "pid": 87
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "2.2.2",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+1;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nOn their way through, the army aided the farmers of the valley as best they could. But they left the place as quickly as they came, having rescued a few souls and received a few thanks.\n\n[[Continue.->2.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.3",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "2.2.3",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food+2;\nstory.state.morale = story.state.morale+1;\nstory.state.days = story.state.days+1;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAs they descended the hills into the valley, Andras stopped at the head of the army.\n\n\"Listen to me now,\" he said. \"Take everything that is of any use. Any scrap of food, any family sword, any sharpened tool. And anyone in the vale that can wield a weapon marches with us.\"\n\nIt was madness. The army descended on the valley like a stampede, leaving no house untouched. \n\nThe scout from before approached Andras again, all pale and sad.\n\n\"My King,\" he said. \"The people of the vale are angry. They say that the mercenaries have been taking everything, even their money, and... they have been doing unspeakable things.\"\n\nWhat does Andras do?\n\n[[Andras punishes the men who went too far, then orders the march to continue.->2.2.3.Punish]]\n\n[[Andras orders the army to depart the vale.->2.2.3.Leave]]",
      "links": [
        {
          "text": "Andras punishes the men who went too far, then orders the march to continue.",
          "destination": {
            "name": "2.2.3.Punish",
            "pid": 52
          }
        },
        {
          "text": "Andras orders the army to depart the vale.",
          "destination": {
            "name": "2.2.3.Leave",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "2.3",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food-2;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+2;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nThe march resumed its pace after the valley, but the army's supplies were getting low and rationing was starting to be more strictly enforced. Andras' advisors kept telling him how unhappy the men were with the situation. And how it would only get worse if the food wasn't restocked soon.\n\nThe King's Forest came into view. The enormous trees and cloud-high canopies could be seen from a great distance away. Andras knew that the first King of the World had created the forest, and he knew that earthbeasts and skybeasts alike dwelt there and grew to huge sizes.\n\n[[Continue.->2.4]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.4",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "2.2.3.Punish",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale-2;\nstory.state.days = story.state.days;\nshowChapterTwoJourneyStatus();\n})\n%>\n\n\"These men,\" said Andras. \"Dishonoured the entire army with their actions. For what they did, they will hang.\"\n\nThe people of the vale clamoured around the gallows and cheered. But the army watched from a greater distance. \n\nAfter the executions, a group of mercenary leaders paid Andras a visit.\n\n\"You can't tell the men to take what they like, then go back on your word.\" they said. \"We are going to have deserters.\"\n\n[[Continue.->2.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.3",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "2.2.3.Leave",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAndras ordered the army to depart, and very soon the march was underway again. Everyone was in high spirits, except for the people of the vale. Families watched the army depart from a distance. No one said anything or caused any trouble, but their humiliation and rage was written on their faces.\n\nAndras caught wind of a rumour that a dead pig was found hanging from a tree branch on the road leaving the vale. Around its neck was a name tag which read \"King Andras\". It was said that the men who cut it down and ate it were found dead the next day.\n\n[[Continue.->2.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.3",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "2.4",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nTwo arguing advisors spoke to Andras about the forest.\n\n\"My King,\" said the royal quartermaster. \"The men are asking if they can hunt in the King's Forest. They are very excited to kill the giant beasts and restock the food supplies.\"\n\n\"It should not be done,\" said a caravan master. \"I have passed through the forest many times, and it is well known that hunting in the King's Forest brings great misfortune. The town of Twigunder lay on the other side of the forest. We can make it there and restock in a few short days.\"\n\nWhat did Andras say?\n\n[[\"There is a new King now. And I say let them hunt and fill their bellies.\"->2.4.1]]\n\n[[\"I forbid hunting in the forest. We will endure until Twigunder.\"->2.4.2]]",
      "links": [
        {
          "text": "\"There is a new King now. And I say let them hunt and fill their bellies.\"",
          "destination": {
            "name": "2.4.1",
            "pid": 55
          }
        },
        {
          "text": "\"I forbid hunting in the forest. We will endure until Twigunder.\"",
          "destination": {
            "name": "2.4.2",
            "pid": 56
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "2.4.1",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = 14;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+1;\nstory.state.ateforest = 'yes';\nshowChapterTwoJourneyStatus();\n})\n%>\n\n\"Hunt, my people, and refill yourselves in my forest!\"\n\nAnd so the army scoured the forest for food. They returned with colourful cornucopias of berries and beasts, they burned huge fires that filled the forest with the most wonderful smells. There was a constant feast along the path that snaked through the forest.\n\nBut all was not well. Men died during the hunts to the rampaging of the huge earthbeasts and skybeasts. Some hunting parties went out into the forest and never returned.\n\nAndras, disturbed by the developments, ordered an end to the hunting. \n\n\"We have more than we need, let us make haste to Twigunder.\"\n\n[[Continue.->2.5]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.5",
            "pid": 57
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "2.4.2",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food-1;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+1;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nGargantuan flowers bloomed to either side of the path, and huge birds and bees flew threateningly overhead.\n\nThe army passed through the King's Forest, marvelling at its various wonders but not daring to touch.\n\n[[Continue.->2.5]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.5",
            "pid": 57
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "2.5",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\n\nif(story.state.ateforest == 'yes'){ \n\n$('#custompassage').append(Passage.render(\"<p class='becauseHeader'>Because you chose to hunt in the forest:<\\/p>\\n <div class='becauseText'>Some of the men who ate berries from the forest have fallen ill. The incident has strained army morale and some food had to be discarded.<\\/div>\"));\nstory.state.morale = story.state.morale-1;\nstory.state.food = story.state.food-1;\n\n}\n\nstory.state.food = story.state.food+5;\nif(story.state.food > 14) story.state.food = 14;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+1;\n\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAs they travelled on, Andras could not help but notice that the forest, despite its wonders, was filled with terrifying beasts. Crossbreeds, and strange sad plants, which made heartbreaking noises. \n\n\"The first King of the World made much of the life in this forest,\" explained one of his advisors. \"Strange designs, aren't they my King? Not quite the perfect Kingdom from the story where every flower flourished. Who knows what he was thinking.\"\n\nThe army finally arrived at Twigunder, a waystop on the edge of the King's Forest. Most of the town was under a ceiling of huge twigs and leaves, shielding it from the deadly falling debris of the King's Forest.\n<div id=\"custompassage\"></div>\n\nThe Mayor of Twigunder held a huge feast in King Andras' honour. The next day, the army departed with all the food and drink that the town could spare.\n\n[[Continue.->2.6]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.6",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "2.6",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAn hour out from Twigunder, dark clouds gathered and a storm began to rage.\n\n\"There are no settlements until we get nearer the coast,\" said the caravan master. \"We should turn back and take refuge at Twigunder until the storm passes.\"\n\n\"Folly,\" said the royal quartermaster. \"It's only a storm, it will pass. We should find refuge somewhere ahead of us so we don't waste time and supplies.\"\n\n\"And what is ahead of us?\" asked the caravan master. \"There are no settlements. The plains are treeless and unforgiving. Let us turn back.\"\n\nJust then, Andras' trusty scout entered.\n\n\"My King,\" he said. \"We may have found a solution to the storm.\"\n\n[[Continue.->2.7]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.7",
            "pid": 59
          }
        }
      ]
    },
    {
      "pid": 59,
      "name": "2.7",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days;\nshowChapterTwoJourneyStatus();\n})\n%>\n\n\"It looks like a solitary hill in the middle of the plains. But when I looked closer, there was a huge hatch on top. My King, it was a ruined oubliette. A dungeon, or prison, of sorts.\"\n\nThe caravan master and the royal quartermaster were stunned. \n\n\"I have never heard of it,\" said the caravan master.\n\n\"It is not on any map I've ever seen,\" said the royal quartermaster. \"But if it would save us returning to Twigunder...\"\n\n\"It is your decision, my King,\" said the scout. \"Speak your will, and it will be done.\"\n\n[[\"Let us take shelter in the ruins and wait out the storm.\"->2.7.1]]\n\n[[\"We return to Twigunder until the storm passes.\"->2.7.2]]\n\n[[\"We ride on. A little bad weather never hurt anyone.\"->2.7.3]]",
      "links": [
        {
          "text": "\"Let us take shelter in the ruins and wait out the storm.\"",
          "destination": {
            "name": "2.7.1",
            "pid": 60
          }
        },
        {
          "text": "\"We return to Twigunder until the storm passes.\"",
          "destination": {
            "name": "2.7.2",
            "pid": 61
          }
        },
        {
          "text": "\"We ride on. A little bad weather never hurt anyone.\"",
          "destination": {
            "name": "2.7.3",
            "pid": 62
          }
        }
      ]
    },
    {
      "pid": 60,
      "name": "2.7.1",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale-1;\nstory.state.days = story.state.days;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAndras' army tied up their earthbeasts and descended into the oubliette with foodstuffs and oil for light.\n\nThen, as night fell, a wild eyed man emerged from the depths of the dungeon. \n\n\"Doom!\" he said. \"Doom! DOOM!\"\n\nAndras himself confronted the madman. \n\n\"Who are you and what do you want?\"\n\n\"Cursed... Ghosts of vengeance come for you, King of the World. You are a fool to return to this place.\"\n\nThose words were the last lucid words spoken by the madman. Nothing more could be gotten out of him. Some of the army is unsettled by the incident.\n\n[[Continue.->2.7.1.2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.7.1.2",
            "pid": 63
          }
        }
      ]
    },
    {
      "pid": 61,
      "name": "2.7.2",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food-1;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+2;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAndras' army turned around and travelled back through the storm to the town of Twigunder. They were welcomed with open arms, and stayed overnight before resuming their journey in the morning.\n\nThough the men grumbled and the supplies dwindled a little, Andras took comfort knowing there was no lasting damage to the war effort.\n\n[[Continue.->2.8]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.8",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 62,
      "name": "2.7.3",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food-4;\nstory.state.morale = story.state.morale-2;\nstory.state.days = story.state.days+1;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nArguments broke out all through the caravan when it was announced that the King's orders were to keep going through the storm. The mercenaries wanted more pay for the hardship, and officials parroted orders but quietly took the side of complaining soldiers.\n\nNevertheless, the army trudged through the storm. Spooked earthbeasts had to be coaxed and whipped through the wind and rain. \n\nThen disaster struck. An earthbeast bolted, and a wagon full of supplies slipped into a ditch and collapsed. Foodstuffs spilled everywhere. People salvaged as much as possible, but the army moved on swiftly.\n\nThe next day, when the storm had well and truly passed, a sickness was already spreading among the troops.\n\nAfter the ordeal, a sarcastic phrase came into use throughout the army whenever someone raised a concern. It went something like: \"Don't worry about that, a little bad weather never hurt anyone.\"\n\n[[Continue.->2.8]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.8",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 63,
      "name": "2.7.1.2",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days;\nshowChapterTwoJourneyStatus();\n})\n%>\n\n\"What shall we do, my King?\" asked the caravan master. \"Do you still want to take refuge here?\"\n\n[[\"Yes. It will take more than the ravings of a madman to alter our course.\"->2.7.1.3]]\n\n[[\"No. Let us return to Twigunder.\"->2.7.2]]",
      "links": [
        {
          "text": "\"Yes. It will take more than the ravings of a madman to alter our course.\"",
          "destination": {
            "name": "2.7.1.3",
            "pid": 64
          }
        },
        {
          "text": "\"No. Let us return to Twigunder.\"",
          "destination": {
            "name": "2.7.2",
            "pid": 61
          }
        }
      ]
    },
    {
      "pid": 64,
      "name": "2.7.1.3",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food-1;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+1;\nstory.state.oubliette = 'yes';\nshowChapterTwoJourneyStatus();\n})\n%>\n\nEveryone settled into the cells of the oubliette. Nothing seemed out of the ordinary until Andras went to sleep. All night he had terrible nightmares.\n\nHe saw the King of the World constructing a prison with the power of the crown.\n\nHe saw prisoners being tortured and weeping in their cells alone.\n\nWhat he saw made him feel sick, and when he woke he was drenched in his own sweat and vomit.\n\n[[Continue.->2.8]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.8",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 65,
      "name": "2.8",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food-3;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+3;\nshowChapterTwoJourneyStatus();\n})\n%>\n\n\"It will not be long now, my King,\" said the caravan master. \"We are closing in on the coast.\"\n\nSince the storm passed, the journey had proceeded smoothly for several days. But that day, the scout arrived, and began with his usual refrain. \n\n\"My King,\" he said.\n\n\"What is it this time?\" asked Andras.\n\n[[Continue.->2.9]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.9",
            "pid": 66
          }
        }
      ]
    },
    {
      "pid": 66,
      "name": "2.9",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days;\nshowChapterTwoJourneyStatus();\n})\n%>\n\n\"Actually,\" he said. \"There is no problem. The road ahead is clear and we will soon be at our destination. I came to tell you that we are about to pass the road to the stairway.\"\n\n\"The stairway?\"\n\n\"Yes, my King. The stairway between the sea, the earth, and the sky, which the first King of the World was building when Joby the Jester knocked off his crown. You know the story?\"\n\n\"Yes,\" he said. \"I know it.\"\n\n\"Do you want to visit it? It would set us back a day, or so.\"\n\n[[\"Yes, let us go and see the stairway.\"-> 2.9.1]]\n\n[[\"No, we march to war.\"->2.10]]",
      "links": [
        {
          "text": "\"Yes, let us go and see the stairway.\"",
          "destination": {
            "name": "2.9.1",
            "pid": 67
          }
        },
        {
          "text": "\"No, we march to war.\"",
          "destination": {
            "name": "2.10",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 67,
      "name": "2.9.1",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food-1;\nstory.state.morale = story.state.morale+2;\nstory.state.days = story.state.days+1;\nstory.state.stairway = 'yes';\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAndras went with his army to visit the stairway. The only part of the stairway that remained was the steps made of solid stone. The stairs of ice and cloud had long ago melted, or evaporated. So it was a strange sight to behold. \n\nFrom land, there were three great bridges that led out to the ruined stairway  beyond the cliffs' edge. The stairway itself looked like a ruined tower suspended over the sea. Here and there it was adorned with bare balconies that baked in the sun and gardens bristling with ferns. But it was totally abandoned, like a monument to a forgotten empire.\n\n\"Today the world is broken in three,\" Andras said. \"Our quest is to mend it. We will make it whole again.\"\n\nThe army cheered, and spent a while walking around the ancient monument in awe.\n\n[[Continue.->2.10]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.10",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 68,
      "name": "2.10",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food-1;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days+1;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAt long last, Andras and his army reached the sandy shore where the sunken cities were claimed by the sea. The mercenaries were all in position for the battle. Flags were plunged into the sands.\n\n\"It's time,\" said Gargull, a mercenary captain. \"Use the stone, my King, and raise the sunken cities. Lets cook some fishies for dinner, shall we?\"\n\nAndras surveyed the ocean. He placed the crown upon his head firmly and the earth stone began to glow.\n\n[[The battle begins.->2.11.Food]]",
      "links": [
        {
          "text": "The battle begins.",
          "destination": {
            "name": "2.11.Food",
            "pid": 69
          }
        }
      ]
    },
    {
      "pid": 69,
      "name": "2.11.Food",
      "text": "<div id=\"foodpassage\"></div>\n<%\n$(function () {\n\nif(story.state.food >= 7){\nstory.state.winbattle = story.state.winbattle + 1;\n$('#foodpassage').append(Passage.render(\"Andras' Army was well supplied when it prepared for battle that day. The mercenaries were fit and healthy despite the long journey, for King Andras had managed the logistics well amidst the pressure to move swiftly. The strength of the men could not be questioned.\\n\\n[[Continue.->2.12.Morale]]\"));\n\n}\nelse if(story.state.food >= 3){\n\nstory.state.winbattle = story.state.winbattle;\n\n$('#foodpassage').append(Passage.render(\"Andras' Army was in reasonable shape when it prepared for battle that day. They had begun to ration food, but the mercenaries were little worse for wear. While they had not benefitted from plenty, they did not suffer from lack.\\n\\n[[Continue.->2.12.Morale]]\"));\n\n}\nelse{\n\nstory.state.winbattle = story.state.winbattle -1;\n\n$('#foodpassage').append(Passage.render(\"Andras' Army was in terrible shape when it prepared for battle that day. Supplies had become scarce, rationing severe. Sickness and feebleness was obvious in some troops. \\n\\n[[Continue.->2.12.Morale]]\"));\n\n}\n})\n%>",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.12.Morale",
            "pid": 70
          }
        }
      ]
    },
    {
      "pid": 70,
      "name": "2.12.Morale",
      "text": "<div id=\"moralepassage\"></div>\n<%\n$(function () {\n\nif(story.state.morale > 0){\nstory.state.winbattle = story.state.winbattle + 1;\n$('#moralepassage').append(Passage.render(\"The spirits of the troops were high. Whatever their physical state, their hearts were raging. The seas before them rumbled, and slowly the sunken cities rose to the surface. An enemy army came into view - they had been waiting beneath the waves - but Andras' Army charged into battle.\\n\\n[[Continue.->2.13.Days]]\"));\n\n}\nelse if(story.state.morale < 0){\nstory.state.winbattle = story.state.winbattle -1;\n$('#moralepassage').append(Passage.render(\"Andras' Army was frightened. Their flags were slumped, their weapons and armor dirty from the trek. The seas before them rumbled, and slowly the sunken cities rose to the surface. An enemy army came into view - they had been waiting beneath the waves - but Andras' Army hesitated. It took several speeches from the mercenary leaders, and the King himself, to inspire them to charge into battle.\\n\\n[[Continue.->2.13.Days]]\"));\n\n}\nelse if(story.state.morale == 0){\nstory.state.winbattle = story.state.winbattle;\n$('#moralepassage').append(Passage.render(\"The troops were nervous, but ready. The seas before them rumbled, and slowly the sunken cities rose to the surface. An enemy army came into view - they had been waiting beneath the waves - but Andras' Army charged into battle.\\n\\n[[Continue.->2.13.Days]]\"));\n\n}\n})\n%>",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.13.Days",
            "pid": 71
          }
        }
      ]
    },
    {
      "pid": 71,
      "name": "2.13.Days",
      "text": "<div id=\"daypassage\"></div>\n<%\n$(function () {\n\nif(story.state.days == 17){\nstory.state.winbattle = story.state.winbattle + 1;\n$('#daypassage').append(Passage.render(\"The enemy fought predictably. Surveying the battlefield, Andras nodded to himself. \\n\\n\\\"They have not had time to prepare,\\\" said his faithful scout. \\\"We made good time on our journey, my King.\\\"\\n\\n[[Continue.->2.14.Mother]]\"));\n\n}\nelse if(story.state.days > 18){\nstory.state.winbattle = story.state.winbattle -1;\nstory.state.deadscout = 'yes';\n$('#daypassage').append(Passage.render(\"Surveying the battlefield, Andras was pulling at his hair. Was the enemy winning? He couldn't tell.\\n\\n\\\"My King!\\\" cried his faithful scout. \\\"They have been preparing for days. We have come far too late, it was a trap. The Great Mother is-\\\"\\n\\nBefore he could finish his words, a huge wave of water swept the scout away. Andras used the Earth Stone to raise the ground higher, just in time, and he glanced over the battlefield frantically.\\n\\n[[Continue.->2.14.Mother]]\"));\n\n}\nelse if(story.state.days > 17){\n\nstory.state.winbattle = story.state.winbattle;\n$('#daypassage').append(Passage.render(\"The enemy fought fiercely. Surveying the battlefield, Andras frowned to himself. \\n\\n\\\"Seems like they have had a little time to prepare\\\" said his faithful scout. \\\"It's a pity we didn't get here sooner, but all isn't lost. You can see though, where they set up traps. Those pitfalls full of water - they look like puddles but they are deep, and the men report that there are seabeasts in them, with teeth and tentacles. The Family of the Sea knew we were going to raise the cities.\\\"\\n\\n\\\"Of course they knew,\\\" said Andras. \\\"We are only taking back what is ours.\\\"\\n\\n[[Continue.->2.14.Mother]]\"));\n\n}\n\n})\n%>",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.14.Mother",
            "pid": 72
          }
        }
      ]
    },
    {
      "pid": 72,
      "name": "2.14.Mother",
      "text": "Then Andras saw her. An enormous woman, wielding a brilliant blue stone.\n\n\"The Great Mother,\" he whispered.\n\nHe forgot the rest of the battle, and plunged toward her on a platform of rock.\n\nUsing the Earth Stone, he sent spikes and boulders after the old woman.\n\n\"Surrender!\" he cried. \"And all of this bloodshed will end.\"\n\n\"Never,\" came the resonant reply, like a ripple from the ocean itself.\n\nThe voice intensified, and it seemed to carry with it hundreds - no, thousands, of defiant chants. \"We will never surrender. We are the Family of the Sea, and we serve no King.\"\n\nThe blue stone shone like a blue sun, and a tidal wave rose up over the battlefield.\n\n[[Continue.-> 2.15.BuildWall]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.15.BuildWall",
            "pid": 73
          }
        }
      ]
    },
    {
      "pid": 73,
      "name": "2.15.BuildWall",
      "text": "<div id=\"winpassage\"></div>\n<%\n$(function () {\n\nif(story.state.winbattle > -2){\n\n$('#winpassage').append(Passage.render(\"Andras drew on the Earth Stone, willing all of its power to raise a wall of rock to block the massive wave. His body tensed up, his eyes shut tight, the crown grew hot on his head. Everything went dark, there was screaming and clamouring, and an almighty crash.\\n\\nWhen Andras awoke, he rose groggily from the mud. All around him, there were mercenaries of the Free Cities of the Earth. They helped him to his feet. He picked up his crown, and glanced around. Then he saw the Great Mother lying in the mud, weeping. But she did not hold the Sea Stone.\\n\\nA short distance away stood Kari, the girl from the beach, holding the stone in her slender hands.\\n\\n\\\"She saved us,\\\" murmured Gargull, the mercenary captain. \\\"You and the mother both used yourselves up. But the mother was still trying to blast us from the mud. That one snuck up and took the stone.\\\"\\n\\nKari stared into Andras' eyes.\\n\\n\\\"My King,\\\" she said, and offered him the Sea Stone. \\n\\n[[Continue.->2.16]]\"));\n\n}\nelse {\n$('#winpassage').append(Passage.render(\"Andras drew on the Earth Stone, willing all of its power to raise a wall of rock to block the massive wave. His body tensed up, his eyes shut tight, the crown grew hot on his head. Everything went dark, there was screaming and clamouring, and an almighty crash.\\n\\nWhen Andras awoke, he rose groggily from the mud. His heart sank. All around him, there were burly soldiers from the Family of the Sea.\\n\\n\\\"You have lost, Earth Boy,\\\" taunted the Great Mother.\\n\\nAndras' eyes widened when he saw that the old woman was wearing the crown. The Earth Stone and the Sea Stone gleamed in its sockets.\\n\\nThey had lost the battle, and the war, in one fell swoop.\\n\\n<div class=\\\"chapterScreen\\\"><div class=\\\"title\\\">The End<\\/div><\\/div>\\n\\n[[Restart from the beginning of Chapter 2. The War with Water->2.1]]\"));\n\n}\n})\n%>",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.16",
            "pid": 74
          }
        },
        {
          "text": "Restart from the beginning of Chapter 2. The War with Water",
          "destination": {
            "name": "2.1",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 74,
      "name": "2.16",
      "text": "Andras blushed and took the stone from Kari. He held the Sea Stone in his hands for a moment. He felt strange ripples coursing through him, and through the stone he saw - all over the world - wobbling vistas. It was as if he was looking up out of every puddle, pond, lake, river, and ocean, all at once.\n\nThen he pushed the stone into a spare socket in the crown, and looked around at his people - of the Free Cities, and of the Family.\n\n\"The War with Water is over,\" said Andras. \"Now it is time for the Conquest of the Clouds.\"\n\n\"Long live the King!\" they cried. \"Long live the King!\"\n\n[[Next Chapter.->3.1]]",
      "links": [
        {
          "text": "Next Chapter.",
          "destination": {
            "name": "3.1",
            "pid": 75
          }
        }
      ]
    },
    {
      "pid": 75,
      "name": "3.1",
      "text": "<div class=\"chapterScreen\"><div class=\"title\">Chapter Three: The Conquest of the Clouds</div></div>\n<img src=\"images/chapter3.png\"/>\n\nThe Conquest of the Clouds, as Andras had called it that day, sounded less and less inspirational as it turned into a quagmire of frustrated sieges and failed strategies. Invading the sky was proving to be more difficult than anyone imagined.\n\n\"We asked every damned singer and *book reader* on land and sea,\" said Gargull. \"No one can tell us a thing about how he did it. They all just say the King's armies 'rose up' and invaded the sky.\" \n\n\"The clouds keep moving, my King,\" said his faithful scout. \"They have the advantage. We can't move the mountains so easily.\"\n\nAndras rubbed his temples. \"Does anyone have any good news?\"\n\n[[Continue.->3.2]]\n\n<%\n$(function () {\nstory.state.galleryseen = '';\n})\n%>",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.2",
            "pid": 88
          }
        }
      ]
    },
    {
      "pid": 76,
      "name": "1.30",
      "text": "When Kari returned to the Great Mother, she entered shyly.\n\n\"So, my little oracle,\" said the Great Mother. \"What have you seen?\"\n\n\"I...\" said Kari. \"I need more time, Great Mother. I can't make sense of any of it.\"\n\n\"Come back tomorrow, and the day after that, and the day after that,\" smiled the Great Mother queasily. \"Maybe you will remember something.\"\n\n[[Continue.->1.31]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.31",
            "pid": 84
          }
        }
      ]
    },
    {
      "pid": 77,
      "name": "1.Crown.Kind.3",
      "text": "<p class='becauseHeader'>Because you chose Kind Idris:</p> <div class='becauseText'>Andras sighed.\n\n\"Listen, everyone, I have to tell you something,\" he said.\n\nThe tent fell silent. Mercenary captains, generals, his father, Idris, and a host of servants all stared.\n\nHe unwrapped the crown, and held it up.\n\n\"I found the crown. The one that belonged to the King of the World,\" he said.\n\nEveryone watching Andras burst into laughter.</div>\n\n[[Continue.->1.Crown.Kind.4]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Kind.4",
            "pid": 78
          }
        }
      ]
    },
    {
      "pid": 78,
      "name": "1.Crown.Kind.4",
      "text": "<p class='becauseHeader'>Because you chose Kind Idris:</p> <div class='becauseText'>The laughter did not last long, though. The longer they looked, the more intrigued they became. Men gathered around the crown.\n\n\"Can this be?\" asked Andras' father. \"Idris, you must try the Earth Stone in this socket. If this is truly the crown, then this is a momentous day.\"\n\nReluctantly, Idris took the Earth Stone and placed it into the crown. It was a perfect fit for the socket.\n\nEveryone stared at Andras again.</div>\n\n[[Continue.->1.Crown.Kind.5]]\n\n",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Kind.5",
            "pid": 79
          }
        }
      ]
    },
    {
      "pid": 79,
      "name": "1.Crown.Kind.5",
      "text": "<p class='becauseHeader'>Because you chose Kind Idris:</p> <div class='becauseText'>\"That means he's the next King of the World!\" cried the servant maid.\n\nShe had said what all the men were thinking. Attention turned to Idris.\n\nIdris looked forlorn. \n\n\"It seems fate has called for you, brother,\" he said. \"I will not stand in the way.\"\n\nIdris presented the crown to Andras, and left. </div>\n\n[[Continue.->1.Crown.Kind.IdrisGiveUp]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Kind.IdrisGiveUp",
            "pid": 80
          }
        }
      ]
    },
    {
      "pid": 80,
      "name": "1.Crown.Kind.IdrisGiveUp",
      "text": "<p class='becauseHeader'>Because you chose Kind Idris:</p> <div class='becauseText'>\"It seems we have a new war leader,\" said Andras' father. \"Let it be known through all the lands that a new King is come to the world.\"\n\nAndras looked through the camps in the wastes, and asked everyone, but no one could tell him where Idris had gone.\n\nThe next day they packed up the military training camps and made way to the fertile lands of Earth's Heart, where they would begin preparations for the War with Water.</div>\n\n[[Next Chapter.->2.1]]",
      "links": [
        {
          "text": "Next Chapter.",
          "destination": {
            "name": "2.1",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 81,
      "name": "1.Crown.Cruel.3",
      "text": "<p class='becauseHeader'>Because you chose Cruel Idris:</p> <div class='becauseText'>He unwrapped the crown.\n\n\"I found the crown. The one that belonged to the King of the World.\"\n\nHis father and brother examined the crown, then stood back in awe.\n\n\"Give it to me,\" said Idris. \"Let me try the Earth Stone in it. Give it to me!\"\n\nIdris grasped for the crown, and Andras kicked himself away desperately.\n\nIn that moment, Andras peered around and saw his father lunge at Idris from behind.\n\n\"What are you- agghhh!\"\n\nThe old man grasped the Earth Stone and tore it from the golden scarf. With a flash of golden light, the floor underneath Idris engulfed him completely.</div>\n\n[[Continue.->1.Crown.Cruel.4]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Cruel.4",
            "pid": 82
          }
        }
      ]
    },
    {
      "pid": 82,
      "name": "1.Crown.Cruel.4",
      "text": "<p class='becauseHeader'>Because you chose Cruel Idris:</p> <div class='becauseText'>\"Let me out, you bastard! LET ME OUT! Give me the stone back. Give me the crown!\"\n\n\"I am sorry, Idris,\" said their father. \"But do not take me for a fool. I know that it was you who spread the rumours about Andras. And I cannot stand by and watch you, in your maniacal hubris, destroy what I have spent my entire life building. Besides, the legend is clear. It is the one who found the crown who shall be the next King of the World.\"\n\nIdris screamed and wailed. His head was the only part of him above floor level, but he made such a huge ruckus that the cell guards entered to check on the situation.\n\nBut before they could react, The Richest Man on Earth boomed a command at them. \"Let it be known through all the lands that a new King is come to the world.\"</div>\n\n[[Continue.->1.Crown.Cruel.5]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.Cruel.5",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 83,
      "name": "1.Crown.Cruel.5",
      "text": "<p class='becauseHeader'>Because you chose Cruel Idris:</p> <div class='becauseText'>The next day Andras sat through meetings. He explained himself and listened to reports of what had occurred in his absence. With his father by his side, and Idris out of the picture, Andras' name was swiftly cleared. His claim as King of the World spread fast and strong, overwriting the mere tale of succession that Idris had represented.\n\n\"I cannot join you for the campaign,\" said his father. \"And I am sorry for what you went through. Your brother went mad with power after a single taste. I will do what I can to reform him, but I know that you will do me proud.\"\n\nWith those words, his father bestowed the Earth Stone upon Andras. It fit perfectly in one of the three sockets of the crown.\n\nThey packed up the military training camps and made way to the fertile lands of Earth's Heart, where they would begin preparations for the War with Water.</div>\n\n[[Next Chapter.->2.1]]",
      "links": [
        {
          "text": "Next Chapter.",
          "destination": {
            "name": "2.1",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 84,
      "name": "1.31",
      "text": "Early the next morning, Andras was in a foul mood. \n\n\"How could she just leave like that? We only just met.\"\n\nHe talked to the wooden dummy as he practiced his bladework.\n\n\"I mean, what the heck was that? I didn't even get an explanation.\"\n\nHe exercised harder than usual, and then he slumped down in the sand huffing and puffing.\n\n\"Is there something wrong with me?\"\n\nHe looked up at a nearby dummy, groping for an answer.\n\n\"Grr. Who cares,\" he said sullenly. \"I'm not here for girls... Hmph. I'm hungry.\"\n\n[[Continue.->1.Crown.1]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "1.Crown.1",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 85,
      "name": "2.1.1",
      "text": "First, Andras' Army made way out of the estates and plantations of Earth's Heart. The towns and cities they passed through welcomed them as heroes, and their ranks expanded. Eager youths snuck away from their homes late at night, or early in the morning, to join the war. \n\nSometimes mothers wandered through the camps, screaming and weeping, but the spectacle of boys being dragged back home by the ear was a rare one. More often, there was a kind of quiet approval that passed between mother and son. They would all do their part for the Free Cities.\n\nAndras had no time for these daily dramas though, his mind was caught up in logistics. His advisors reminded him constantly about the importance of three factors. \n\n[[Continue.->2.1.Factors]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.1.Factors",
            "pid": 86
          }
        }
      ]
    },
    {
      "pid": 86,
      "name": "2.1.Factors",
      "text": "SUPPLIES: The army needed to remain well supplied, chiefly with food and drink. But they were relying heavily on the land and the settlements to sustain them.\n\nMORALE: The army had to remain happy and confident if it was to maintain a firm belief in its oncoming victory. \n\nTIME: The longer it took them to get to the coasts and reclaim the sunken cities stolen by the Family of the Sea, the more time the Family would have to prepare for their arrival.\n\n[[Continue.->2.2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.2",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 87,
      "name": "2.2.1.Song",
      "text": "<div id=\"statusbar\"></div>\n<%\n$(function () {\nstory.state.food = story.state.food;\nstory.state.morale = story.state.morale;\nstory.state.days = story.state.days;\nshowChapterTwoJourneyStatus();\n})\n%>\n\nAnd all through the camps, variations of a rhyme were spreading, uplifting everyone's spirits. It went something like this:\n\n\"They think that mud and corpses <br>Send our stomachs to the pail<br>But our stomachs are'a grumblin'<br>*We will not forget the vale!*\n\nFor justice, King, and golden earth<br>Across the sea we'll sail<br>Roaring all our lungs are worth<br>*We won't forget the vale!*\"\n\n[[Continue.->2.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "2.3",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 88,
      "name": "3.2",
      "text": "At that moment, Kari walked into the room.\n\n\"I do,\" she said. \"In the middle of the sea, there is a library which was created by the King.\"\n\n\"A library? Underwater?\" asked Andras, baffled. \"Wouldn't that ruin the books?\"\n\n\"Yes,\" she replied. \"But it's one of the only places that we haven't looked.\"\n\n\"Then lets go,\" said Andras.\n\n[[Continue.->3.3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.3",
            "pid": 89
          }
        }
      ]
    },
    {
      "pid": 89,
      "name": "3.3",
      "text": "Andras and Kari dived into the sea and swam with currents made by the Sea Stone.\n\n\"There it is,\" said Kari.\n\nIt was an ancient domed building on the sea floor, encrusted with green sludge and little sea creatures. They swam inside and upstairs until they surfaced into the air pocket. The light of the crown's two shining stones helped them navigate the dark interior.\n\n[[They entered the Library.->3.Lib.Start]]",
      "links": [
        {
          "text": "They entered the Library.",
          "destination": {
            "name": "3.Lib.Start",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 90,
      "name": "3.Lib.Start",
      "text": "The austere library entrance was almost entirely featureless except for the stairs Andras and Kari climbed up. However, there were doorways to the east and west.\n\n[[Go east.->3.Lib.OtherCorridor1]]\n\n[[Go west.->3.Lib.Corridor1]]",
      "links": [
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.OtherCorridor1",
            "pid": 104
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.Corridor1",
            "pid": 93
          }
        }
      ]
    },
    {
      "pid": 91,
      "name": "3.Lib.GalleryEntrance",
      "text": "<div id=\"custompassage\"></div>\n<%\n$(function () {\n\nif(story.state.galleryseen  == 'yes'){ \n\n$('#custompassage').append(Passage.render(\"<p class='becauseHeader'>Because you already busted through the door:<\\/p>\\n <div class='becauseText'>Andras and Kari pass the open doorway of the gallery.<\\/div> \\n\\n[[Continue into the gallery.->3.Lib.GalleryOpenAlready]]\\n\\n[[Go west back into the library proper.->3.Lib.OtherCorridor6]]\\n\"));\n\n}\nelse{\n\n$('#custompassage').append(Passage.render(\"Andras and Kari found themselves in front of a large door which was locked and barred.\\n\\n[[They knocked on the door.->3.Lib.GalleryKnock]]\\n\\n<a href=\\\"javascript:void(0)\\\" data-passage=\\\"3.Lib.GalleryBustOpen\\\" onclick=\\\"story.state.galleryseen = 'yes';\\\">Andras used the power of the Earth Stone to simply loosen the door from the stone frame.<\\/a>\\n\\n[[Go west.->3.Lib.OtherCorridor6]]\\n\"));\n\n}\n})\n%>\n\n",
      "links": [
        {
          "text": "Continue into the gallery.",
          "destination": {
            "name": "3.Lib.GalleryOpenAlready",
            "pid": 119
          }
        },
        {
          "text": "Go west back into the library proper.",
          "destination": {
            "name": "3.Lib.OtherCorridor6",
            "pid": 110
          }
        },
        {
          "text": "They knocked on the door.",
          "destination": {
            "name": "3.Lib.GalleryKnock",
            "pid": 111
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.OtherCorridor6",
            "pid": 110
          }
        }
      ]
    },
    {
      "pid": 92,
      "name": "3.Lib.LibrarianOffices",
      "text": "This section of the library contains a number of offices, all well appointed with ancient furniture and writing implements. There is a door leading back to the east.\n\n[[Go east.->3.Lib.Start]]",
      "links": [
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.Start",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 93,
      "name": "3.Lib.Corridor1",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go north.->3.Lib.Corridor2]]\n\n[[Go east.->3.Lib.Start]]",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.Corridor2",
            "pid": 94
          }
        },
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.Start",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 94,
      "name": "3.Lib.Corridor2",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go north.->3.Lib.Corridor3]]\n\n[[Go south.->3.Lib.Corridor1]]",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.Corridor3",
            "pid": 95
          }
        },
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.Corridor1",
            "pid": 93
          }
        }
      ]
    },
    {
      "pid": 95,
      "name": "3.Lib.Corridor3",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go north.->3.Lib.ReadingRoom]]\n\n[[Go south.->3.Lib.Corridor2]]",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.ReadingRoom",
            "pid": 96
          }
        },
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.Corridor2",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 96,
      "name": "3.Lib.ReadingRoom",
      "text": "The main reading room was a plain chamber filled with desks, but there was no one around. Andras and Kari found nothing of interest there. The eerie quiet of the library was more disturbing in a larger room such as this. It seemed to surround them, and watch them. \n\n[[Go north.->3.Lib.Corridor6]]\n\n[[Go south.->3.Lib.Corridor3]]\n\n[[Go east.->3.Lib.Corridor5]]\n\n[[Go west.->3.Lib.StorageRoom]]",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.Corridor6",
            "pid": 98
          }
        },
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.Corridor3",
            "pid": 95
          }
        },
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.Corridor5",
            "pid": 97
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.StorageRoom",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 97,
      "name": "3.Lib.Corridor5",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go east.->3.Lib.Corridor11]]\n\n[[Go west.->3.Lib.ReadingRoom]]",
      "links": [
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.Corridor11",
            "pid": 103
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.ReadingRoom",
            "pid": 96
          }
        }
      ]
    },
    {
      "pid": 98,
      "name": "3.Lib.Corridor6",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go north.->3.Lib.Corridor7]]\n\n[[Go south.->3.Lib.ReadingRoom]]",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.Corridor7",
            "pid": 99
          }
        },
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.ReadingRoom",
            "pid": 96
          }
        }
      ]
    },
    {
      "pid": 99,
      "name": "3.Lib.Corridor7",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go south.->3.Lib.Corridor6]]\n\n[[Go east.->3.Lib.Corridor8]]",
      "links": [
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.Corridor6",
            "pid": 98
          }
        },
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.Corridor8",
            "pid": 100
          }
        }
      ]
    },
    {
      "pid": 100,
      "name": "3.Lib.Corridor8",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go east.->3.Lib.Corridor9]]\n\n[[Go west.->3.Lib.Corridor7]]",
      "links": [
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.Corridor9",
            "pid": 101
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.Corridor7",
            "pid": 99
          }
        }
      ]
    },
    {
      "pid": 101,
      "name": "3.Lib.Corridor9",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go south.->3.Lib.Corridor10]]\n\n[[Go west.->3.Lib.Corridor8]]",
      "links": [
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.Corridor10",
            "pid": 102
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.Corridor8",
            "pid": 100
          }
        }
      ]
    },
    {
      "pid": 102,
      "name": "3.Lib.Corridor10",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go north.->3.Lib.Corridor9]]\n\n[[Go south.->3.Lib.Corridor11]]",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.Corridor9",
            "pid": 101
          }
        },
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.Corridor11",
            "pid": 103
          }
        }
      ]
    },
    {
      "pid": 103,
      "name": "3.Lib.Corridor11",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go north.->3.Lib.Corridor10]]\n\n[[Go east.->3.Lib.OtherCorridor5]]\n\n[[Go west.->3.Lib.Corridor5]]",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.Corridor10",
            "pid": 102
          }
        },
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.OtherCorridor5",
            "pid": 109
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.Corridor5",
            "pid": 97
          }
        }
      ]
    },
    {
      "pid": 104,
      "name": "3.Lib.OtherCorridor1",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go east.->3.Lib.OtherCorridor2]]\n\n[[Go west.->3.Lib.Start]]",
      "links": [
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.OtherCorridor2",
            "pid": 106
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.Start",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 105,
      "name": "3.Lib.StorageRoom",
      "text": "<div id=\"custompassage\"></div>\n<%\n$(function () {\n\nif(story.state.galleryseen  == 'yes'){ \n\n$('#custompassage').append(Passage.render(\"<p class='becauseHeader'>Because you are looking for the memory jar:<\\/p>\\n <div class='becauseText'>Andras and Kari looked through the storage room's odds and ends, until they found a jar filled with mist and ashes.\\n\\n \\\"This is it,\\\" said Kari. \\\"I am sure of it.\\\"<\\/div>\\n\\n[[They returned to the gallery to restore the skeleton's memories.->3.Lib.RestoreSkelly]]\"));\n\n}\nelse{\n\n$('#custompassage').append(Passage.render(\"Andras and Kari looked through the storage rooms, but found a dazzling array of odds and ends of which they could make little sense. There were globes depicting the world in unusual ways they had never seen before. There were old bookshelves and chairs. There were ornaments and there was a lot of stationery. Mostly though, there were just more worthless and soggy books.\\n\\n[[Go east.->3.Lib.ReadingRoom]]\"));\n\n}\n})\n%>\n\n",
      "links": [
        {
          "text": "They returned to the gallery to restore the skeleton's memories.",
          "destination": {
            "name": "3.Lib.RestoreSkelly",
            "pid": 120
          }
        },
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.ReadingRoom",
            "pid": 96
          }
        }
      ]
    },
    {
      "pid": 106,
      "name": "3.Lib.OtherCorridor2",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go north.->3.Lib.OtherCorridor3]]\n\n[[Go west.->3.Lib.OtherCorridor1]]\n",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.OtherCorridor3",
            "pid": 107
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.OtherCorridor1",
            "pid": 104
          }
        }
      ]
    },
    {
      "pid": 107,
      "name": "3.Lib.OtherCorridor3",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go north.->3.Lib.OtherCorridor4]]\n\n[[Go south.->3.Lib.OtherCorridor2]]\n",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.OtherCorridor4",
            "pid": 108
          }
        },
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.OtherCorridor2",
            "pid": 106
          }
        }
      ]
    },
    {
      "pid": 108,
      "name": "3.Lib.OtherCorridor4",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go north.->3.Lib.OtherCorridor5]]\n\n[[Go south.->3.Lib.OtherCorridor3]]\n",
      "links": [
        {
          "text": "Go north.",
          "destination": {
            "name": "3.Lib.OtherCorridor5",
            "pid": 109
          }
        },
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.OtherCorridor3",
            "pid": 107
          }
        }
      ]
    },
    {
      "pid": 109,
      "name": "3.Lib.OtherCorridor5",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go south.->3.Lib.OtherCorridor4]]\n\n[[Go west.->3.Lib.Corridor11]]\n\n[[Go east.->3.Lib.OtherCorridor6]]\n",
      "links": [
        {
          "text": "Go south.",
          "destination": {
            "name": "3.Lib.OtherCorridor4",
            "pid": 108
          }
        },
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.Corridor11",
            "pid": 103
          }
        },
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.OtherCorridor6",
            "pid": 110
          }
        }
      ]
    },
    {
      "pid": 110,
      "name": "3.Lib.OtherCorridor6",
      "text": "Andras and Kari explored the nearly identical library corridors. They scanned the bookshelves that flanked their path, and sometimes pulled out a book and examined it briefly. But the works were always soggy, or off-topic. Nothing about the invasion of the sky.\n\n[[Go west.->3.Lib.OtherCorridor5]]\n\n[[Go east.->3.Lib.GalleryEntrance]]\n",
      "links": [
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.OtherCorridor5",
            "pid": 109
          }
        },
        {
          "text": "Go east.",
          "destination": {
            "name": "3.Lib.GalleryEntrance",
            "pid": 91
          }
        }
      ]
    },
    {
      "pid": 111,
      "name": "3.Lib.GalleryKnock",
      "text": "Andras and Kari knocked on the door, but there was no response.\n\n<a href=\"javascript:void(0)\" data-passage=\"3.Lib.GalleryBustOpen\" onclick=\"story.state.galleryseen = 'yes';\">Andras used the power of the Earth Stone to simply loosen the door from the stone frame.</a>\n\n[[Go west.->3.Lib.OtherCorridor6]]\n",
      "links": [
        {
          "text": "Go west.",
          "destination": {
            "name": "3.Lib.OtherCorridor6",
            "pid": 110
          }
        }
      ]
    },
    {
      "pid": 112,
      "name": "3.Lib.GalleryBustOpen",
      "text": "The Earth Stone glowed, and the masonry loosened easily. Andras pushed the door gently, and it collapsed into the room beyond.\n\nIt was a room of high ceilings, a gallery filled with paintings depicting all kinds of royal scenes and battles.\n\nA voice full of confusion came from somewhere inside the room.\n\n\"Huh? Who's there?\"\n\n[[Continue.->3.Lib.Gallery2]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.Lib.Gallery2",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 113,
      "name": "3.Lib.Gallery2",
      "text": "It was a skeleton in old robes.\n\n\"I am Andras. Who are you?\" asked Andras uneasily.\n\n\"I don't remember...\" it says. \"The King doesn't let me know things when he isn't here.\"\n\nAndras and Kari exchanged glances.\n\n\"How do we help you know things again?\" asked Kari.\n\n\"The King keeps my memories in a jar and stores it somewhere in the library. I don't know where he puts them exactly. Sorry.\"\n\n[[They returned to the library to search for the jar.->3.Lib.GalleryEntrance]]\n\n[[They searched the gallery for pictures of the invasion of the sky.->3.Lib.Gallery3]]",
      "links": [
        {
          "text": "They returned to the library to search for the jar.",
          "destination": {
            "name": "3.Lib.GalleryEntrance",
            "pid": 91
          }
        },
        {
          "text": "They searched the gallery for pictures of the invasion of the sky.",
          "destination": {
            "name": "3.Lib.Gallery3",
            "pid": 114
          }
        }
      ]
    },
    {
      "pid": 114,
      "name": "3.Lib.Gallery3",
      "text": "Andras and Kari explored the gallery. There were vast canvases that depicted awesome battles and miracles from ancient times. \n\nThey knew when they found what they were looking for. It was one of the largest pictures. It showed a battle in the middle of a storm, filled with lightning, fire and steel. Andras and Kari stared at it with expressions of astonishment.\n\n\"It is beautiful,\" said Kari.\n\n\"It was so simple,\" whispered Andras.\n\nAll over the canvas were huge shimmering bubbles rising majestically into the sky. All filled with soldiers.\n\n[[They left the library and went to start a battle using the newly discovered strategy.->3.5]]\n\n[[They returned to seek the skeleton's memory jar.->3.Lib.GalleryEntrance]]",
      "links": [
        {
          "text": "They left the library and went to start a battle using the newly discovered strategy.",
          "destination": {
            "name": "3.5",
            "pid": 115
          }
        },
        {
          "text": "They returned to seek the skeleton's memory jar.",
          "destination": {
            "name": "3.Lib.GalleryEntrance",
            "pid": 91
          }
        }
      ]
    },
    {
      "pid": 115,
      "name": "3.5",
      "text": "Armed with new knowledge, Kari and Andras made haste to the surface and gave immediate orders to prepare Andras' Army for battle.\n\n[[Continue.->3.6]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.6",
            "pid": 116
          }
        }
      ]
    },
    {
      "pid": 116,
      "name": "3.6",
      "text": "The Empire of the Sky had long thwarted and evaded assaults, but they seemed no match now for the combined might of the Sea and the Earth. In the minds of Andras' followers, victory seemed assured now that they had found the secret to doing battle with the Empire. \n\nSoon enough, bubbles rose serenely to the clouds filled with troops, storms raged, and battles ensued all over the world. \n\n<div id=\"custompassage\"></div>\n<%\n$(function () {\n\nif(story.state.skysecret  == 'yes'){ \n\n$('#custompassage').append(Passage.render(\"<p class='becauseHeader'>Because the skeleton told you to arm yourself with water and stone:<\\/p>\\n <div class='becauseText'>The bubbles near Andras also carried water, sand, and rock. Andras was ready for combat with the Emperor of the Sky.<\\/div>\\n\\n[[Continue.->3.7.1]]\"));\n\n}\nelse{\n\n$('#custompassage').append(Passage.render(\"[[Continue.->3.7.2]]\"));\n\n}\n})\n%>\n",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.7.1",
            "pid": 127
          }
        },
        {
          "text": "Continue.",
          "destination": {
            "name": "3.7.2",
            "pid": 126
          }
        }
      ]
    },
    {
      "pid": 117,
      "name": "3.9",
      "text": "<p class='becauseHeader'>Because the skeleton told you to arm yourself with water and stone:</p><div class='becauseText'>Just when he could take no more, and was about to let go, Andras saw bubbles rising up around the Emperor. \n\nAndras brought his own onslaught against the Emperor. A barrage of rock, waves of water, and lashings of sand. The Earth Stone and the Sea Stone glowed with malice, and the crown grew hot. Still, neither of them let go.\n\nOne last bubble rose up behind the Emperor. There, inside the bubble, he saw his brother Idris drawing a sword.\n\nIdris threw himself at the Emperor of the Sky, roared, and plunged a blade into his back. The Emperor fell into a heap on the cloud.\n\nAndras tugged the crown free and took the Sky Stone. He looked at his brother Idris, who just nodded at him.\n\n\"Do it,\" he said.\n\nHe pushed the Sky Stone into the last empty socket.\n\n[[Next Chapter.->4.1]]</div>",
      "links": [
        {
          "text": "Next Chapter.",
          "destination": {
            "name": "4.1",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 118,
      "name": "Epilogue2",
      "text": "So ends the story of the King of the World. With the crown destroyed and the stones scattered, Andras had cast away the terrible power of the King of the World for another age.\n\nAmong many people of the world, Andras was a figure of infamy for throwing away the power that so much blood and sweat was spilled over. Scholars and drinkers alike ridiculed him, calling him a slayer of utopias, the king of idiots, and many other unkind names. But life went on.\n\nAndras and Kari were wed the next day, on the beach where they first met. They assumed control over his father's fortune, and did all they could to keep a peace in the world, and improve the lot of the less fortunate.\n\nIdris sought to find the Earth Stone once more. He was angry with Andras, but they were closer than they were during the contests of their youth.\n\nAnd the years of conflict and cooperation between the Sea, Earth, and Sky continued. No one power rising above the rest... \n\n<div class=\"chapterScreen\"><div class=\"title\">The End</div></div>",
      "links": []
    },
    {
      "pid": 119,
      "name": "3.Lib.GalleryOpenAlready",
      "text": "Andras and Kari found the skeleton in the gallery. It waved at them.\n\n\"Did you find my memory jar? Sorry I don't remember where the King put it.\"\n\n[[\"No.\" They go back to the gallery entrance.->3.Lib.GalleryEntrance]]\n\n[[They searched the gallery for pictures of the invasion of the sky.->3.Lib.Gallery3]]",
      "links": [
        {
          "text": "\"No.\" They go back to the gallery entrance.",
          "destination": {
            "name": "3.Lib.GalleryEntrance",
            "pid": 91
          }
        },
        {
          "text": "They searched the gallery for pictures of the invasion of the sky.",
          "destination": {
            "name": "3.Lib.Gallery3",
            "pid": 114
          }
        }
      ]
    },
    {
      "pid": 120,
      "name": "3.Lib.RestoreSkelly",
      "text": "Back in the gallery, they opened the jar at the feet of the skeleton. The mist and the ash swirled around it, and into its empty eye sockets.\n\n\"You... You are not my King,\" it said. \"Has it been that long?\"\n\nIt looked at its hands, and jumped with alarm.\n\n\"Am I dead!?\" it shrieked. \"I... I feel so...\" \n\nThe skeleton began to cry. Or at least, to make crying noises.\n\n[[Continue.->3.Lib.RestoreSkelly2]]\n\n",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.Lib.RestoreSkelly2",
            "pid": 121
          }
        }
      ]
    },
    {
      "pid": 121,
      "name": "3.Lib.RestoreSkelly2",
      "text": "Andras and Kari waited in silence as the skeleton regained its memory and came to terms with its existence. After a few moments, it calmed down.\n\n\"You must be wondering what is going on here.\" it said, growing more and more lucid. \"I was his Majesty's curator. I lived only to serve him. For a select few, the King banished death and enabled us to continue fulfilling his purpose forever.\"\n\n\"A perfect kingdom where no one would ever die...\" murmured Andras, his eyes widening with some private realisation.\n\n\"But I see plainly enough that you are not my King,\" said the skeleton. \"In which case, I would beg you- please, let me die.\"\n\n\"We will let you die,\" said Andras. \"But we need your help.\"\n\n[[Continue.->3.Lib.RestoreSkelly3]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.Lib.RestoreSkelly3",
            "pid": 122
          }
        }
      ]
    },
    {
      "pid": 122,
      "name": "3.Lib.RestoreSkelly3",
      "text": "Andras and Kari explained the situation to the skeleton, and asked it for its advice.\n\n\"There were two parts to the victory of the first King of the World over the Empire of the Sky,\" said the skeleton. \"I will tell you one part, and the second part you can see for yourself in the gallery.\"\n\n\"Fine.\"\n\n\"The King of the World had great troubles when he invaded the sky. The Sky Stone is very powerful, and fighting in the clouds will make you vulnerable. You will be very far away from the earth and the sea. Therefore, you need to take some with you. Water, sand, soil, rocks. Something that you can use to surprise your foe. Without this, you may find yourself completely naked and helpless against the power of the sky.\"\n\n[[Continue.->3.Lib.RestoreSkelly4]]\n<%\n$(function () {\nstory.state.skysecret = 'yes';\n})\n%>",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.Lib.RestoreSkelly4",
            "pid": 123
          }
        }
      ]
    },
    {
      "pid": 123,
      "name": "3.Lib.RestoreSkelly4",
      "text": "\"Thank you,\" said Andras. \n\n\"Will you release me from my service now?\" asked the Skeleton.\n\n[[\"Yes. I release you from your service.\"->3.Lib.RestoreSkelly4.2]]\n\n[[\"No. I think I will keep you around for the future. Your memories may come in handy.\"->3.Lib.RestoreSkelly4.1]]",
      "links": [
        {
          "text": "\"Yes. I release you from your service.\"",
          "destination": {
            "name": "3.Lib.RestoreSkelly4.2",
            "pid": 124
          }
        },
        {
          "text": "\"No. I think I will keep you around for the future. Your memories may come in handy.\"",
          "destination": {
            "name": "3.Lib.RestoreSkelly4.1",
            "pid": 125
          }
        }
      ]
    },
    {
      "pid": 124,
      "name": "3.Lib.RestoreSkelly4.2",
      "text": "\"Thank you!\" it said, its cold voice curdling thick with emotion. \"You are a good man. You will be a greater King than my master.\"\n\nIt hugged Andras, and with this last gesture, its ancient skeletal body fell to pieces.\n\nAndras and Kari moved on.\n\n[[Continue.->3.Lib.Gallery3.NoBacksies]]\n",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.Lib.Gallery3.NoBacksies",
            "pid": 131
          }
        }
      ]
    },
    {
      "pid": 125,
      "name": "3.Lib.RestoreSkelly4.1",
      "text": "\"Oh,\" it said. \"But... you said you...\"\n\nIt looked down, dejectedly. \n\n\"I see. You are just like him. All that you care about is how you may use others. And I have aided you, great fool that I am.\"\n\nKari frowned at Andras, but kept quiet.\n\nThey moved on, and left the skeleton to its sobbing.\n\n[[Continue.->3.Lib.Gallery3.NoBacksies]]\n",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.Lib.Gallery3.NoBacksies",
            "pid": 131
          }
        }
      ]
    },
    {
      "pid": 126,
      "name": "3.7.2",
      "text": "Andras went straight for the Emperor.\n\n\"Give up the stone,\" he said. \"And let us end this madness.\"\n\n\"I could say the same to you,\" said the flying Emperor. \"You have not seen what the Sky Stone is capable of, have you? Allow me to demonstrate.\"\n\nThe sun wheeled out of sight, and night fell abruptly over the battlefield. \n\nThe Emperor lunged at Andras, burst through his bubble, and snatched at the crown. Andras was just in time enough to keep hold of it. He plummeted through the air, and fell into another bubble rising upward into the night.\n\n[[Continue->3.8.2]]",
      "links": [
        {
          "text": "Continue",
          "destination": {
            "name": "3.8.2",
            "pid": 129
          }
        }
      ]
    },
    {
      "pid": 127,
      "name": "3.7.1",
      "text": "Andras went straight for the Emperor.\n\n\"Give up the stone,\" he said. \"And let us end this madness.\"\n\n\"I could say the same to you,\" said the flying Emperor. \"You have not seen what the Sky Stone is capable of, have you? Allow me to demonstrate.\"\n\nThe sun wheeled out of sight, and night fell abruptly over the battlefield. \n\nThe Emperor lunged at Andras, burst through his bubble, and snatched at the crown. Andras was just in time enough to keep hold of it. He plummeted through the air, and fell into another bubble rising upward into the night.\n\n[[Continue->3.8.1]]",
      "links": [
        {
          "text": "Continue",
          "destination": {
            "name": "3.8.1",
            "pid": 128
          }
        }
      ]
    },
    {
      "pid": 128,
      "name": "3.8.1",
      "text": "But the Emperor struck at him again and again, like lightning. He fell onto a cloud, struggling to keep hold of the crown, almost helpless in the domain of the Emperor of the Sky.\n\nThe Emperor flew toward Andras, hand outstratched. This time he didn't try to snatch the crown, he grabbed hold of it.\n\n\"You did well,\" he said. \"For a boy. But you are not a King. Maybe I will allow you to be my jester!\"\n\n\"I'd make you my jester,\" grunted Andras. \"But I already know enough fart jokes.\"\n\nThe Emperor howled with rage and his grip hardened on the crown. His long white hair lashed at Andras again and again. \n\nAndras was disoriented. There were gusts of wind, flashes of day and night, crackles of electricity. He held onto the crown for dear life, but the Emperor's onslaught was loosening his grip. \n\n[[Continue.->3.9]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.9",
            "pid": 117
          }
        }
      ]
    },
    {
      "pid": 129,
      "name": "3.8.2",
      "text": "But the Emperor struck at him again and again, like lightning. He fell onto a cloud, struggling to keep hold of the crown, almost helpless in the domain of the Emperor of the Sky.\n\nThe Emperor flew toward Andras, hand outstratched. This time he didn't try to snatch the crown, he grabbed hold of it.\n\n\"You did well,\" he said. \"For a boy. But you are not a King. Maybe I will allow you to be my jester!\"\n\n\"I'd make you my jester,\" grunted Andras. \"But I already know enough fart jokes.\"\n\nThe Emperor howled with rage and his grip hardened on the crown. His long white hair lashed at Andras again and again. \n\nAndras was disoriented. There were gusts of wind, flashes of day and night, crackles of electricity. He held onto the crown for dear life, but the Emperor's onslaught was loosening his grip. \n\n[[Continue.->3.9.1]]",
      "links": [
        {
          "text": "Continue.",
          "destination": {
            "name": "3.9.1",
            "pid": 130
          }
        }
      ]
    },
    {
      "pid": 130,
      "name": "3.9.1",
      "text": "Andras could take no more. He let go.\n\nThe Emperor of the Sky thrust the crown onto his head, and plunged the Sky Stone into the last socket. \n\n\"I am King of the World!\" he cried, madly. \"And you... You are dead.\" \n\n<div class=\"chapterScreen\"><div class=\"title\">The End</div></div>\n\n[[Restart from the beginning of Chapter 3. Conquest of the Clouds->3.1]]",
      "links": [
        {
          "text": "Restart from the beginning of Chapter 3. Conquest of the Clouds",
          "destination": {
            "name": "3.1",
            "pid": 75
          }
        }
      ]
    },
    {
      "pid": 131,
      "name": "3.Lib.Gallery3.NoBacksies",
      "text": "Andras and Kari explored the gallery. There were vast canvases that depicted awesome battles and miracles from ancient times. \n\nThey knew when they found what they were looking for. It was one of the largest pictures. It showed a battle in the middle of a storm, filled with lightning, fire and steel. Andras and Kari stared at it with expressions of astonishment.\n\n\"It is beautiful,\" said Kari.\n\n\"It was so simple,\" whispered Andras.\n\nAll over the canvas were huge shimmering bubbles rising majestically into the sky. All filled with soldiers.\n\n[[They left the library and went to start a battle using the newly discovered strategy.->3.5]]",
      "links": [
        {
          "text": "They left the library and went to start a battle using the newly discovered strategy.",
          "destination": {
            "name": "3.5",
            "pid": 115
          }
        }
      ]
    }
  ]
}