{
  "passages": [
    {
      "pid": 1,
      "name": "listen",
      "text": "How can I listen to my divine higher self?\\n\\nA: Have you noticed that you are already listening? Your [[thoughts]] are communicating already with this higher self. Ask your higher self for guidance by practicing stillness, going within and asking for more of that which you like to know.\\n\\nB: Notice your thoughts. Your thoughts are communication already with the Divine higher self. Notice your thoughts by going within and practice deep meditation or stillness until you know how to listen. Advice or communication is given to you from the cosmic higher self in the form of inner images, sounds, words, or [[emotions]].",
      "links": [
        {
          "text": "thoughts",
          "destination": {
            "name": "thoughts",
            "pid": 33
          }
        },
        {
          "text": "emotions",
          "destination": {
            "name": "emotions",
            "pid": 15
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "share",
      "text": "What does it mean to share this inner light?\\n\\nA: It means that you have arrived. You have fulfilled your destiny, which is to become who you truly are. Now you know. Again.\\n\\nB: It means that there is more, not less. You will shine your light onto any path you choose. As you have become enlightened, you will be able to sow the seeds that will help change the future for you and humanity to come. You, as an enlightened being, was meant to do, be and have it all. And now you have it. Enjoy it. It is your divine cosmic gift. There is nothing else for you to do, except to share the experience and share a little light.\\n\\nYOU HAVE REACHED YOUR DESTINATION.\\n\\nYOUR DESTINY IS FULFILLED.\\n\\n''REJOICE! A NEW KING IS BORN!''",
      "links": []
    },
    {
      "pid": 3,
      "name": "STYLE",
      "text": "body {\\n\\tfont: \"Geordia\", Georgia, serif;\\n\\tfont-size: 1.1em;\\n}\\n\\n.passage {\\n\\tcolor: #e7e7d5;\\n}\\n\\na.internalLink {\\n\\tcolor: #8bbebe;\\n\\tweight: bold;\\n}\\n\\na.internalLink:hover {\\n\\tcolor: white;\\n\\ttext-decoration: none;\\n}\\n\\n#sidebar #title, #sidebar #title:hover {\\n\\tcolor: #8bbebe;\\n}",
      "links": []
    },
    {
      "pid": 4,
      "name": "ideas",
      "text": "What are ideas? How are they different than my thoughts?\\n\\nA: An idea is simply something which you have asked for, at some time or another. The opportunity for [[asking]] for ideas is one of your divine gifts. Ideas may also have been offered to you from your external experience. Thoughts are that which makes ideas come to life.\\n\\nB: An idea is a role model or blueprint for something to happen or be created. An idea might be imprinted from an outside source, yet ideas are nothing but a universal catalogue of knowledge. All ideas already exist in the unseen. All you have to do, is to ask for the ideas you need. There are more ways to do this, yet the best is to simple ask \"how\". The [[creative process]] will help you produce that which you desire.",
      "links": [
        {
          "text": "asking",
          "destination": {
            "name": "asking",
            "pid": 17
          }
        },
        {
          "text": "creative process",
          "destination": {
            "name": "creative process",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "brought",
      "text": "What does it mean to bring this idea or inner experience of being one with all there is out into the physical world?\\n\\nA: It means that you are ready to truly receive the divine gift of [[enlightenment]]. Share it with everyone you meet and ask for it.\\n\\nB: You are only allowed one thing in this life. To have and share your experiences with others, to truly expand and share all of life's truly divine gifts. You are allowed to receive all of these gifts. You simply must accept them as such, and then see what happens. The inner experience is best shared and brought out into the physical realm by allowing your inner experience to become a true part of all there is. Then, you'll experience Nirvana, heaven on earth and divine and everlasting [[inner peace]].",
      "links": [
        {
          "text": "enlightenment",
          "destination": {
            "name": "enlightenment",
            "pid": 23
          }
        },
        {
          "text": "inner peace",
          "destination": {
            "name": "inner peace",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "Start",
      "text": "Soft music is playing in the background, shielding you from the outside world in this otherwise quiet place. As you seat yourself and close your eyes, focusing on that inner light, a burning question arises from within.\\n\\n\"What is laterna magica?\" you ask.\\n\\nA: Laterna magica is the idea that we as enlightened human beings are allowed to have a divine [[cosmic experience]].\\n\\nB: Laterna magica is not an idea. It's a device in the physical sense which allows us to have an [[illusion of movement]].",
      "links": [
        {
          "text": "cosmic experience",
          "destination": {
            "name": "cosmic experience",
            "pid": 41
          }
        },
        {
          "text": "illusion of movement",
          "destination": {
            "name": "illusion of movement",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "illusion of movement",
      "text": "What is this illusion of movement? What is an illusion and what is movement?\\n\\nA: An illusion is not the same as a delusion. The illusion of movement is simply the illusion of not [[being present]] in the \"here and now\", which is impossible if we focus our attention on the outer world.\\n\\nB: We're all illusive or delusive. The idea of movement and the passage of time are perhaps the most [[persistent delusions]] we have.",
      "links": [
        {
          "text": "being present",
          "destination": {
            "name": "being present",
            "pid": 36
          }
        },
        {
          "text": "persistent delusions",
          "destination": {
            "name": "persistent delusions",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "need",
      "text": "What is this need to be more? Why is it so important anyway?\\n\\nA: The need to become, the divine urge to expand is born from within the fabric of that which is, which is all there is. In fact, that is all there is; the urge to expand and become more. To ask what \"all there is\" is does not make sense, because there is nothing else. Please [[accept it]].\\n\\nB: All there is, is this divine urge to be or become more. You are a divine being having a cosmic experience. So start to feel at home. You are allowed to have any experience you [[desire]]. Now, go practice. Then become more than you are, or think you are.",
      "links": [
        {
          "text": "accept it",
          "destination": {
            "name": "accept it",
            "pid": 43
          }
        },
        {
          "text": "desire",
          "destination": {
            "name": "desire",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "worry",
      "text": "How can I stop worrying and doubting? Doubt and worry seems only to stop me from attracting good things into my life. How can I stop this?\\n\\nA: Doubt is best released by letting it go. Whenever you find yourself in doubt, simply let it go. There is no reason to doubt anything. Ask yourself, perhaps, what is it that you're so doubtful about? Then notice your dilemma. Ask yourself for the source of this dilemma. When you find the source of your doubt, which is always internal, simply let it go. Don't hold on to that which keeps doubt in place. Ask your divine inner guidance how to let go of that which keeps doubt in place. Then [[let it go]] and have your doubt removed. Then see what happens.\\n\\nB: Worry and doubt only serves to hold you in that place where you are and probably do not wan't to be. Simply let go of your doubt by [[asking]] how.",
      "links": [
        {
          "text": "let it go",
          "destination": {
            "name": "let it go",
            "pid": 12
          }
        },
        {
          "text": "asking",
          "destination": {
            "name": "asking",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "the dream",
      "text": "What is this dream about being whole again? What is a dream anyway?\\n\\nA: A dream is simply a very good idea, or an idea to which we attach an emotion of [[longing]].\\n\\nB: A dream is a lot more than simply an idea. An idea exists in the mind, and is held within a complicated pattern of inner images and thoughts. This complex inner pattern known to us as ideas, might be simple, as a wheel or a chair, born out of our most basic needs. Our ideas are born out of the [[desire]] for experiencing more or being creative and expansive.",
      "links": [
        {
          "text": "longing",
          "destination": {
            "name": "longing",
            "pid": 35
          }
        },
        {
          "text": "desire",
          "destination": {
            "name": "desire",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "destiny",
      "text": "What is my destiny?\\n\\nA: Your destiny is to chose any path you wish. Any path is offered if you keep asking and keep following your inner guidance. To fulfill your destiny, all you have to do is to keep following your path. Only doubt and [[worry]] will keep you from following your path.\\n\\nB: Your path, or your destiny is not for you to chose. You may have any kind of experience you desire, yet everything was pre-planned, which means that you are now where you were meant to be, and that in the future you will be where you were meant to be as well. Is there a destiny? As always, [[the answer]] is up to you. What do you choose?",
      "links": [
        {
          "text": "worry",
          "destination": {
            "name": "worry",
            "pid": 9
          }
        },
        {
          "text": "the answer",
          "destination": {
            "name": "the answer",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "let it go",
      "text": "How can I let go of worry and doubt?\\n\\nA: You let go, by noticing your worry or doubt or even fear. They're basically all the same. Simply let go of all, by [[asking]] your divine higher self how.\\n\\nB: Doubt is best released by going within. Practice [[stillness]] or deep meditation. Then ask for further guidance from within. All is given in the divine inner realm. All it takes is asking your divine higher self how you can release your fear or doubt or worry, or simply let it go by releasing all that which you do no longer want to hold onto, like releasing a hot piece of coal or anything you do no longer want to hold on to. Release everything by letting it go an drop to the center of the Earth.",
      "links": [
        {
          "text": "asking",
          "destination": {
            "name": "asking",
            "pid": 17
          }
        },
        {
          "text": "stillness",
          "destination": {
            "name": "stillness",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "the answer",
      "text": "What does it mean, \"You are the answer\"?\\n\\nA: It means that whatever \"you\" think \"you\" are, you're not. You are more than \"you\". You have to realize that there is no \"you\" in the cosmic experience of all there is. \"You are the answer\" simply means that there is only you, and that \"you\" is all there is. You are not more and not less. You are [[all there is]]. The answer is you.\\n\\nB: All there is is more than whatever you think you are. You are more than you think. You are not able to think yourself into who you are. You are more, and to experience more, you have to [[turn inward]] and start to experience more of that which is truly you.",
      "links": [
        {
          "text": "all there is",
          "destination": {
            "name": "all there is",
            "pid": 25
          }
        },
        {
          "text": "turn inward",
          "destination": {
            "name": "turn inward",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "forgive yourself",
      "text": "How do I achieve inner peace? How do I forgive myself?\\n\\nA: You forgive yourself by being aware of all which you think is you. Then, bring it all into the experience of being one, whole and complete once again. You do this by asking yourself \"Who am I\"? Notice the kind of answer you get, and then release any resistance to that which you think you are. Release all inner resistance between the many different parts of you who think they are you, which they are not. Become aware of all that you are, and bring inner peace by [[releasing]] any tension between your inner parts or ideas. Notice any internal struggle by going inside in prayer or meditation or stillness.\\n\\nB: You forgive yourself by releasing any resistance to that which you think you are and to any idea or belief which you hold as the truth. The truth which we all seek, is the truth of inner peace, also known as [[enlightenment]].",
      "links": [
        {
          "text": "releasing",
          "destination": {
            "name": "releasing",
            "pid": 27
          }
        },
        {
          "text": "enlightenment",
          "destination": {
            "name": "enlightenment",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "emotions",
      "text": "What are emotions?\\n\\nA: Emotions are always from within, where as your feelings are based on your physical experience. Learn to differentiate between internal emotions and physical feelings. Internal emotions are not physical, but only ideas that manifest as feelings or emotional pain in your body. To let go of your physical pain, simply let go of your internal or mental ideas given to you as emotions. If you notice any emotional pain, simply let it go by noticing that it is not real or physical. The pain is caused by the experience of ideas not wanting to let go of that which is not you. Let go of the ideas causing emotional pain by practicing stillness. If you notice emotional pain, simply [[let it go]].\\n\\nB: Emotions are best avoided. Emotions are simply ideas which manifest as physical pain. If you notice emotional pain, simply let it go by practicing [[stillness]] and asking you divine higher self for guidance. ",
      "links": [
        {
          "text": "let it go",
          "destination": {
            "name": "let it go",
            "pid": 12
          }
        },
        {
          "text": "stillness",
          "destination": {
            "name": "stillness",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "how",
      "text": "How can I get better at following my inner guidance? How may I become a better servant of the divine?\\n\\nA: As you do. Simply by [[asking]] how you might serve or how you might serve better or how you might become a better listener. It is all given in the asking of the \"how\".\\n\\nB: Asking is all that it takes. Ask how you may become better at listening to your cosmic intelligence. Ask your higher self how to [[listen]]. Then be still. Be quiet and listen for a while and all will be revealed.",
      "links": [
        {
          "text": "asking",
          "destination": {
            "name": "asking",
            "pid": 17
          }
        },
        {
          "text": "listen",
          "destination": {
            "name": "listen",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "asking",
      "text": "What does it mean to ask? How do I ask?\\n\\nA: Ask the divine cosmic intelligence by simply closing your eyes and start to feel how you want to feel. Make it a habit to ask your higher self for guidance in this process. Guidance is always given if you know how to [[listen]].\\n\\nB: There are more than one way to ask, but all includes a [[need]] for something. You need to feel a desire. So, you might say that it all starts with a feeling, a need or desire. The stronger the need or desire, the stronger the asking and the stronger the message. Make sure always to be in a state of allowing yourself to receive. Then start receiving.",
      "links": [
        {
          "text": "listen",
          "destination": {
            "name": "listen",
            "pid": 1
          }
        },
        {
          "text": "need",
          "destination": {
            "name": "need",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "creative process",
      "text": "What is the creative process? How can I use it?\\n\\nA: The creative process is the process you use to create anything you want in your life, or physical reality. You use the creative process by simply starting out with a [[desire]] for an idea.\\n\\nB: Ideas are what makes the creative process happen. The creative process is fueled by pure desire and takes ideas and turns them into [[physical reality]]. There are many, many ways to be creative. You were meant to be create, divine and truly cosmic beings and the creative process is what makes it all happen. Now you know.",
      "links": [
        {
          "text": "desire",
          "destination": {
            "name": "desire",
            "pid": 34
          }
        },
        {
          "text": "physical reality",
          "destination": {
            "name": "physical reality",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "change the world",
      "text": "What is the best way to change the world? What does it mean to truly change the world?\\n\\nA: The best way is simply to do nothing, or only that which you feel you must, or are compelled to do. There is no reason to reject anyone, expect perhaps to protect yourself or others from harm. To change the world from within takes a lot of skill and practice, but why [[worry]]? You have all the time in the world.\\n\\nB: The world is best changed from within. That is true, or as true as we are allowed to express these ideas in mere words. Words doesn't explain what you must do, only how. Ask only [[how]]. Not why or when or where or whom. There are no questions needed except the \"how\". Ask \"how may I serve?\" and receive the answers from the divine. This is how it has always been. Never ask \"why\" of anyone, because you will never get a true answer. The only truth lies only in the \"how\", not the \"why\".",
      "links": [
        {
          "text": "worry",
          "destination": {
            "name": "worry",
            "pid": 9
          }
        },
        {
          "text": "how",
          "destination": {
            "name": "how",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "brought2",
      "text": "What is this \"projection\" of the seen into the unseen, and the unseen into the seen?\\n\\nA: That, my friend, is that point through which time and dreams and realms of the unseen exist. This inner light is what truly enlightens each and everyone who notices it, hidden deep within. Find it, and share the [[inner peace|share]] of your light.\\n\\nB: You seem eager to know the truth. The truth is, that you are enlightened. Each and everyone of you. Ask for your [[enlightenment]] to receive it, and don't hesitate to share it with everyone who asks for it.",
      "links": [
        {
          "text": "inner peace",
          "destination": {
            "name": "share",
            "pid": 2
          }
        },
        {
          "text": "enlightenment",
          "destination": {
            "name": "enlightenment",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "StoryTitle",
      "text": "Laterna Magica",
      "links": []
    },
    {
      "pid": 22,
      "name": "you",
      "text": "What is this \"you\" or \"I\" or \"me\", who's having this experience right now?\\n\\nA: Ask [[who]] is this \"I\" or \"me\" who's asking this question in the first place. Is that also you or someone or something else?\\n\\nB: We couldn't agree more. You are also this \"I\". Yet, the \"I\" that you experience is not you. It is simply an idea of that which is not you. Realize that this \"I\" is simply also an idea, or illusion. There is only you. You are [[the answer]]!",
      "links": [
        {
          "text": "who",
          "destination": {
            "name": "who",
            "pid": 28
          }
        },
        {
          "text": "the answer",
          "destination": {
            "name": "the answer",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "enlightenment",
      "text": "What is enlightenment?\\n\\nA: My friend, it seems you are asking the wrong questions. Please allow yourself to reflect on that which has been presented, and return when you are ready again.\\n\\nB: Don't you think that your understanding is a bit premature for you to proceed? Please rethink and return. Peace.\\n\\n[[Start]] again, or keep [[asking]]?\\n\\n<<set $flag = 1>>",
      "links": [
        {
          "text": "Start",
          "destination": {
            "name": "Start",
            "pid": 6
          }
        },
        {
          "text": "asking",
          "destination": {
            "name": "asking",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "the only idea",
      "text": "What is this \"the only idea\"?\\n\\nA: The idea of \"the only idea\" is to allow you to focus on being ne, whole and complete. As you focus on that idea, start to notice ideas that are not part of the idea of being one. Notice what it means to you that you really are not one until you release all ideas that are not you. By [[releasing]] all that which is not you, you will set foot onto the path to human enlightenment.\\n\\nB: \"The only idea\" is simply another idea, but an idea which allows you to bring inner peace to your mind. As you practice the idea of this \"you\" or cosmic mind within you, you'll notice that all you are is truly you. You are the answer to human [[enlightenment]].",
      "links": [
        {
          "text": "releasing",
          "destination": {
            "name": "releasing",
            "pid": 27
          }
        },
        {
          "text": "enlightenment",
          "destination": {
            "name": "enlightenment",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "all there is",
      "text": "How can I experience this \"all there is\"?\\n\\nA: By simply guiding yourself into a peaceful state of allowing everything. Resist nothing, and simply ask your higher self to let go of all that which is not you. Then simply [[let it go]].\\n\\nB: You can experience \"all there is\" by simply [[asking]] your higher self for guidance. Ask your higher self, \"How may I know this higher state of awareness?\" Notice the answers you get and see what happens.",
      "links": [
        {
          "text": "let it go",
          "destination": {
            "name": "let it go",
            "pid": 12
          }
        },
        {
          "text": "asking",
          "destination": {
            "name": "asking",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "healing",
      "text": "What is healing? How can we heal while being in this state of experiencing the present, or \"now\"?\\n\\nA: Healing is a divine gift. You simply release your inner resistance to allow the divine healing to enter your body and mind. Then you will experience true healing from within, not without. Pray for it or ask for it and then just allow it all to happen. Allow yourself to receive all of the divine gifts you were meant to have. Share them in any way you like. Then be kind and gentle and start [[asking]] for more of that which you love.\\n\\nB: Healing takes place within, and is always allowed and accepted to flow from the divine and into your body and mind. Accept and allow it all to truly transform and change your body, mind and [[soul]], which are all interconnected.",
      "links": [
        {
          "text": "asking",
          "destination": {
            "name": "asking",
            "pid": 17
          }
        },
        {
          "text": "soul",
          "destination": {
            "name": "soul",
            "pid": 38
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "releasing",
      "text": "What does it mean to release all that which is not me? How can I do that?\\n\\nA: To release all that which is not you, simply focus upon that which you think you are. Then notice the one noticing the one you think you are and keep asking \"who are you?\" and notice the kind of answers you get. You are more than you think you are, so release that which you are not and keep [[asking]] for inner guidance on how to do this.\\n\\nB: Notice your thoughts. Who are having these thoughts? Is that you? Who is this you anyway? Do you know? If you think you know who \"you\" are, simply let that idea go. Let it dissolve and become more of that which you truly are. A divine being having a [[cosmic experience]].",
      "links": [
        {
          "text": "asking",
          "destination": {
            "name": "asking",
            "pid": 17
          }
        },
        {
          "text": "cosmic experience",
          "destination": {
            "name": "cosmic experience",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "who",
      "text": "What is this \"who\" that is observing \"me\"?\\n\\nA: There is no \"who\" or \"why\" or anything. All there is is all there is. This is the truth. The truth is experienced from the within. The inner world will give you all the answers you need, as well as the answers you don't need. Ask only \"[[how]] may I serve this whole, this cosmic experience of all there is\".\\n\\nB: The \"who\" and the \"me\" are the same. Both are illusions. Let go of all inner voices or entities or ideas. In the end, there is no knowledge. Nothing to be learned. Just practice stillness for a while, and notice what it all means. Accept everything. Resist nothing. Accepting and allowing are the two keywords, if any. Accept and allow everything within, and you'll soon get to know this experience of [[inner peace]] which you so truly long for.",
      "links": [
        {
          "text": "how",
          "destination": {
            "name": "how",
            "pid": 16
          }
        },
        {
          "text": "inner peace",
          "destination": {
            "name": "inner peace",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "aware",
      "text": "What is awareness? What does it mean to be aware?\\n\\nA: Awareness means the experience of you being an observer observing yourself. So awareness is an experience which gives you the experience of [[being one]] with all there is.\\n\\nB: Awareness is more than simply being aware of all there is. Your experience, which is all that you were meant to have, is more and not less of the same as what you have experienced in the past. The past is that place or inner experience of you having been somewhere else. Evolution is also the evolution of the mind, and the ultimate goal of evolution is to grow, expand and to ask for more of [[all there is]]. All there is is all there is. Nothing more and nothing less.",
      "links": [
        {
          "text": "being one",
          "destination": {
            "name": "being one",
            "pid": 37
          }
        },
        {
          "text": "all there is",
          "destination": {
            "name": "all there is",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "turn inward",
      "text": "What does it mean, to turn inward?\\n\\nA: Turning inward simply means closing your eyes, your physical eyes, and focusing on your internal eyes, or third, inner eye. It all comes down to being able to truly [[listen]] to your divine inner guidance.\\n\\nB: To turn inward means to be still. Practice [[stillness]] and be quiet for a while, and then start to notice more of that which you ask for. Turn your inner eyes towards that which you desire. Then practice, and follow your guidance. It is all given, from within. Always.",
      "links": [
        {
          "text": "listen",
          "destination": {
            "name": "listen",
            "pid": 1
          }
        },
        {
          "text": "stillness",
          "destination": {
            "name": "stillness",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "inner peace",
      "text": "What is inner peace?\\n\\nA: Inner peace is all you were meant to have, and all that you were meant to have was an experience of who you are. The purpose of life is to have this experience. That is the ultimate goal of being human, also known as [[enlightenment]].\\n\\nB: Having inner peace is all there is to being enlightened. Inner peace is the experience of being one with all there is, as well as sharing this inner peace with all parts of that which you are or think you are. Inner peace is more than simply knowing that you are one with all there is. Inner peace exists only when you are at peace internally. To experience inner peace means to [[forgive yourself]], and to forgive yourself you must be at peace with all that is you.",
      "links": [
        {
          "text": "enlightenment",
          "destination": {
            "name": "enlightenment",
            "pid": 23
          }
        },
        {
          "text": "forgive yourself",
          "destination": {
            "name": "forgive yourself",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "physical reality",
      "text": "How do I turn an idea into physical reality?\\n\\nA: An idea is best forgotten if it does not serve you or the rest of your shared physical environment, including yourself. To take an idea and turning it into a real physical object takes some time. Yet, time is an illusion only in the internal or unseen, non-physical. Turning an idea from the non physical into the physical only takes a little action. Take whatever action you feel guided to. Overcome any fear or doubt or [[worry]], which is all that is truly blocking you from that which you want.\\n\\nB: Some ideas are born out of the non-physical. Those ideas are best forgotten, unless you want to truly become a magician and master creator of your shared physical experience. Become a magician only if you truly want to. The [[path of the magician]] is best trodden by the few who are truly dedicated to the arts of becoming creators.",
      "links": [
        {
          "text": "worry",
          "destination": {
            "name": "worry",
            "pid": 9
          }
        },
        {
          "text": "path of the magician",
          "destination": {
            "name": "path of the magician",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "thoughts",
      "text": "What are thoughts?\\n\\nA: Your thoughts are that part of your inner being which you notice as guidance and suggestions offered to you by your internal being. All thoughts originate from your divine higher self. Yet, some thoughts also manifest as [[ideas]] held into place through a combination of thoughts and ideas and emotions. Let go of all thoughts that do not serve you by simply letting them go.\\n\\nB: Thoughts are offered to you from the divine higher self as inner guidance, ideas, pictures, words, movies or even sounds. Do not attach yourself from ideas or thoughts that do not serve you or feel good. If you notice a thought which does not feel good, simply ask your divine higher self of how to [[let it go]].",
      "links": [
        {
          "text": "ideas",
          "destination": {
            "name": "ideas",
            "pid": 4
          }
        },
        {
          "text": "let it go",
          "destination": {
            "name": "let it go",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "desire",
      "text": "What is desire? How is desire different from a dream?\\n\\nA: A dream is a lot more complex than a mere desire. Yet, desire is what fuels us and the universe. Desire is the everlasting power of everything, our interconnectedness to the whole, [[being one]] with all there is.\\n\\nB: A desire is born out of the [[need]] to be more. To expand.",
      "links": [
        {
          "text": "being one",
          "destination": {
            "name": "being one",
            "pid": 37
          }
        },
        {
          "text": "need",
          "destination": {
            "name": "need",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "longing",
      "text": "What is this emotion of longing? Why do we long for anything?\\n\\nA: The emotion of longing is based on the inner experience of [[desire]]; to expand and become more.\\n\\nB: The longing or yearning for that which we desire is born out of the idea that we are not whole or complete. That what we truly desire, all of us, to become whole, complete, and experiencing [[being one]] with all there is.",
      "links": [
        {
          "text": "desire",
          "destination": {
            "name": "desire",
            "pid": 34
          }
        },
        {
          "text": "being one",
          "destination": {
            "name": "being one",
            "pid": 37
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "being present",
      "text": "What does it mean to be present, in the \"now\"? What is the \"power of now\"?\\n\\nA: The \"power of now\" is simply an idea- The idea is that you are allowed to share deep inner enlightenment from simply being aware and present and still while experiencing this \"now\". Yet, being in this \"now\" does not allow you to heal. The idea of \"now\" is simply a technique for experiencing being whole and complete. While you are having this experience, you might allow yourself to heal, but [[healing]] always takes place within the \"now\", not without.\\n\\nB: The \"power of now\" is a true universal power, and if you practice stillness and guided meditation, you'll start to experience this power as all there is. Yet, this experience of \"all there is\" is an inner experience, and not an experience in the outer world. The experience of being whole and complete is not brought out into the physical realm without a lot of practice. A single individual being present and aware might [[change the world]], and more people being present and aware will only bring more change like that.",
      "links": [
        {
          "text": "healing",
          "destination": {
            "name": "healing",
            "pid": 26
          }
        },
        {
          "text": "change the world",
          "destination": {
            "name": "change the world",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "being one",
      "text": "<<if $flag eq 0>>\\nWhat is this idea of \"all there is\"?\\n\\nA: The idea of everything, being one with all there is, is [[the only idea]] that is not delusional.\\n\\nB: There is nothing else, everything is included in this idea of \"everything\". The idea of everything is an inner experience which might be [[brought]] out into the physical realm of the shared outer world.\\n<<elseif>>\\nWhat is this idea of \"all there is\"?\\n\\nA: The idea of everything, being one with all there is, is [[the only idea]] that is not delusional.\\n\\nB: The idea of all there is, is the idea that your inner world is simply projected from the non-manifest, non-physical into the real, manifested world. Also, this \"all there is\" simply means that whatever you project outward, is [[brought|brought2]] back into your inner, non-physical world. This idea, is what will bring you enlightenment, once you get it.\\n<<endif>>\\n",
      "links": [
        {
          "text": "the only idea",
          "destination": {
            "name": "the only idea",
            "pid": 24
          }
        },
        {
          "text": "brought",
          "destination": {
            "name": "brought",
            "pid": 5
          }
        },
        {
          "text": "brought",
          "destination": {
            "name": "brought2",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "soul",
      "text": "What is my soul?\\n\\nA: Your soul is connected to the same source as the soul of everyone else. Let go of the idea of your soul and do not become a part of anything except your divine higher being. Your soul only serves the purpose of connecting you to the divine higher source of [[all there is]].\\n\\nB: Your soul is best described as that part of your which functions as the communication center from which all communication with the unknown takes place. Awaken yourself to this inner experience of you noticing your inner self, and awaken yourself to exploring the depths of your soul and its divine source of [[all there is]].\\n\\n",
      "links": [
        {
          "text": "all there is",
          "destination": {
            "name": "all there is",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "stillness",
      "text": "How do I practice stillness?\\n\\nA: You practice stillness by being peaceful and quiet for as long as you wish. Don't do anything except breathing and observing all there is. Then, notice that you are the observer and then ask yourself \"[[who]] am I?\"\\n\\nB: Stillness is best practiced alone or together with others who also practice stillness. Stillness is practiced by sitting or by simply allowing yourself to do nothing. Do nothing and release all that which is not you. Let go of any resistance by simply [[asking]] your higher self for guidance. Ask the universe how to let go.",
      "links": [
        {
          "text": "who",
          "destination": {
            "name": "who",
            "pid": 28
          }
        },
        {
          "text": "asking",
          "destination": {
            "name": "asking",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "StoryAuthor",
      "text": "Jens Byriel",
      "links": []
    },
    {
      "pid": 41,
      "name": "cosmic experience",
      "text": "What is a \"cosmic experience\"?\\n\\nA: A cosmic experience is the experience you're having right now, as we speak. You're having a cosmic experience. In fact, you're not able to not have a cosmic experience. Ask perhaps instead who is this [[you]] who's having this cosmic experience?\\n\\nB: The cosmic experience as we have come to understand it, is that we are one with all there is, and that we are [[aware]] that this is so, and that the cosmic experience is truly all there is.",
      "links": [
        {
          "text": "you",
          "destination": {
            "name": "you",
            "pid": 22
          }
        },
        {
          "text": "aware",
          "destination": {
            "name": "aware",
            "pid": 29
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "path of the magician",
      "text": "What is a magician?\\n\\nA: A magician is a master creator. As a magician, you're able to create anything in your physical or non-physical experience. Any creation starts from within. All magicians know this, and now you know too. To become a magician, start to [[turn inward]].\\n\\nB: You're a magician in the moment you become aware of how to truly create. To become a magician, keep inquiring, keep asking and keep practicing. The arts of the magician are forgotten by the few, who are not allowed such fantasies. If you're a magician, you know what it takes. It takes more than most are willing to give. If you want to become a magician, you are also meant to fulfill your [[destiny]], which will be shown if you keep asking.",
      "links": [
        {
          "text": "turn inward",
          "destination": {
            "name": "turn inward",
            "pid": 30
          }
        },
        {
          "text": "destiny",
          "destination": {
            "name": "destiny",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "accept it",
      "text": "What does it mean, to accept this \"all there is\"?\\n\\nA: You have to let go. Trust the universe. Have faith. Faith means accepting your [[destiny]]. You can have any destiny you chose, yet nothing is preplanned, except the idea that you were given free choice. The universe, life, is a miraculous place. Enjoy your stay.\\n\\nB: To accept the idea of all there is, is not a good way to start practicing the concept or the experience of all there is. Follow the path of your inner guidance, and you will be shown this \"[[all there is]]\".",
      "links": [
        {
          "text": "destiny",
          "destination": {
            "name": "destiny",
            "pid": 11
          }
        },
        {
          "text": "all there is",
          "destination": {
            "name": "all there is",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "persistent delusions",
      "text": "What does it mean that the experience of movement is an illusion?\\n\\nA: It simply means that we are not at all well. Human beings share the idea of being separated from the whole. We share also [[the dream]] of becoming whole once again.\\n\\nB: Movement is a lot more than what we perceive as change. The real change which is happening all over the place all at once, is the experience of being alive, complete, and whole in our [[cosmic experience]].",
      "links": [
        {
          "text": "the dream",
          "destination": {
            "name": "the dream",
            "pid": 10
          }
        },
        {
          "text": "cosmic experience",
          "destination": {
            "name": "cosmic experience",
            "pid": 41
          }
        }
      ]
    }
  ]
}