{
  "passages": [
    {
      "pid": 1,
      "name": "...",
      "text": "This is written from memory, [[unfortunately.|If]]",
      "links": [
        {
          "text": "unfortunately.",
          "destination": {
            "name": "If",
            "pid": 2
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "If",
      "text": "If I could have brought with me the material I so carefully prepared, this would be a very different [[story.|Three...]]",
      "links": [
        {
          "text": "story.",
          "destination": {
            "name": "Three...",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "Three...",
      "text": "There were three of us, classmates and friends — [[Terry O. Nicholson|Terry]] (we used to call her Old Nicole, with good reason), [[Jen Margrave,|Jen]] and your humble narrator, [[Vanessa Jennings|Vanessa]].\n\nWe had known each other years and years, and in spite of our differences we had a good deal in common. All of us were interested in [[science.|Science]]\n",
      "links": [
        {
          "text": "Terry O. Nicholson",
          "destination": {
            "name": "Terry",
            "pid": 4
          }
        },
        {
          "text": "Jen Margrave,",
          "destination": {
            "name": "Jen",
            "pid": 5
          }
        },
        {
          "text": "Vanessa Jennings",
          "destination": {
            "name": "Vanessa",
            "pid": 6
          }
        },
        {
          "text": "science.",
          "destination": {
            "name": "Science",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "Terry",
      "text": "Terry was rich enough to do as she pleased. Her great aim was exploration. She used to make all kinds of a row because there was nothing left to explore now, only patchwork and filling in, she said. She filled in well enough — she had a lot of talents — great on mechanics and electricity. Had all kinds of boats and motorcars, and was one of the best of our aviatrices.\n\nWe never could have done [[the thing|Science]] at all without Terry.",
      "links": [
        {
          "text": "the thing",
          "destination": {
            "name": "Science",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "Jen",
      "text": "Jen Margrave was born to be a poet, a botanist — or both — but her folks persuaded her to be a doctor instead. She was a good one, for her age, but her real interest was in what she loved to call “the wonders of [[science.|Science]]”",
      "links": [
        {
          "text": "science.",
          "destination": {
            "name": "Science",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "Vanessa",
      "text": "As for me, sociology’s my major. You have to back that up with a lot of other sciences, of course. I’m interested in them all.\n\nTerry was strong on facts — geography and meteorology and those; Jen could beat her any time on biology, and I didn’t care what it was they talked about, so long as it connected with [[human life,|Science]] somehow. There are few things that don’t.",
      "links": [
        {
          "text": "human life,",
          "destination": {
            "name": "Science",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "Science",
      "text": "We three had a chance to join a big scientific expedition. They needed a doctor, and that gave Jen an excuse for dropping her just opening practice; they needed Terry’s experience, her machine, and her money; and as for me, I got in through Terry’s influence.\n\nThe expedition was up among the thousand tributaries and enormous hinterland of a great river, up where the maps had to be made, savage dialects studied, and all manner of strange flora and fauna expected.\n\nBut this story is not about that expedition. That was only the merest starter for ours.\n\nAnd as we got farther and farther upstream, in a dark tangle of rivers, lakes, morasses, and dense forests, with here and there an unexpected long spur running out from the big mountains beyond, I noticed that more and more of these savages had a story about a strange and terrible Man Land in the high [[distance.|Distance]]",
      "links": [
        {
          "text": "distance.",
          "destination": {
            "name": "Distance",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "Distance",
      "text": "All agreed on the main point — that there was this strange country where no women lived — only men and boy children.\n\nNone of them had ever seen it. It was dangerous, deadly, they said, for any woman to go there. But there were tales of long ago, when some brave investigator had seen it — a Big Country, Big Houses, Plenty People — All Men.\n\nHad no one else gone? Yes — a good many — but they never came back. It was no place for women — of that they seemed sure.\n\nI told the girls about these stories, and they laughed at them. Naturally I did myself. [[And then...|The Bank]]",
      "links": [
        {
          "text": "And then...",
          "destination": {
            "name": "The Bank",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "The Bank",
      "text": "Our guide stood serenely on the bank as we looked at the running water. “Man Country — up there,” she said, pointing to the cataract.\n\nThen we were interested. We had our rest and lunch right there and pumped the woman for further information. She could tell us only what the others had — a land of men — no women — babies, but all boys. No place for women — dangerous. Some had gone to see — none had come back.\n\nI could see Terry’s jaw set at that. No place for women? Dangerous? She looked as if she might shin up the waterfall on the spot. “Look here, girls,” Terry said. “This is our find. Let’s not tell those cocky old professors. Let’s go on home and then come back — just us.”\n\nThere was something attractive to a bunch of unattached young women in finding an undiscovered country of a strictly stag nature. Of course we didn’t [[believe|Believe]] the story — [[but yet!|To the Air]]",
      "links": [
        {
          "text": "believe",
          "destination": {
            "name": "Believe",
            "pid": 10
          }
        },
        {
          "text": "but yet!",
          "destination": {
            "name": "To the Air",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "Believe",
      "text": "Terry, in her secret heart, had visions of a sort of sublimated summer resort — just Boys and Boys and Boys — and that she was going to be — well, [[Terry was popular among men|Ideas]] even when there were other women around, and it’s not to be wondered at that she had pleasant dreams of what might happen. I could see it in her eyes as she lay there, fingering those impressive locks of hers.\n\nBut I thought — then — that I could form a far clearer idea of what was before us than either of them.\n\n“If there is such a place — and there does seem some foundation for believing it — you’ll find it’s built on a sort of patriarchal principle, that’s all. The women have a separate cult of their own, less socially developed than the men, and make them an annual visit — a sort of wedding call. This is a condition known to have existed — here’s just a survival. They’ve got some peculiarly isolated valley or tableland up there, and their primeval customs have survived. That’s all there is to it.”",
      "links": [
        {
          "text": "Terry was popular among men",
          "destination": {
            "name": "Ideas",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "Ideas",
      "text": "Jen’s ideas and Terry’s were so far apart that sometimes it was all I could do to keep the peace between them. Jen idealized men in the best Northern style. She was full of chivalry and sentiment, and all that. And she was a good girl; she lived up to her ideals.\n\nYou might say Terry did, too, if you can call her views about men anything so polite as ideals. I always liked Terry. She was a woman’s woman, very much so, generous and brave and clever; but I don’t think any of us in college days was quite pleased to have her with our brothers. Terry was “the limit.” Later on — why, of course a woman’s life is her own, we held, and asked no questions.\n\nBut barring a possible exception in favor of a not impossible husband, or of her father, or, of course, the husky relatives of her friends, Terry’s idea seemed to be that hunky men were just so much game and nerdly ones not worth considering.\n\nIt was really unpleasant sometimes to see the [[notions|Notions]] she had.",
      "links": [
        {
          "text": "notions",
          "destination": {
            "name": "Notions",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "Notions",
      "text": "But I got out of patience with Jen, too. She had such rose-colored halos on her menfolks. I held a middle ground, highly scientific, of course, and used to argue learnedly about the physiological limitations of the sex.\n\nWe were not in the least “advanced” on the man question, [[any of us, then.|To the Air]]",
      "links": [
        {
          "text": "any of us, then.",
          "destination": {
            "name": "To the Air",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "To the Air",
      "text": "We got the big biplane together and loaded it with our scientifically compressed baggage: the camera, of course; the glasses; a supply of concentrated food. Our pockets were magazines of small necessities, and we had our guns, of course — there was no knowing what might happen.\n\nOut of that dark green sea of crowding forest this high-standing spur rose steeply. It ran back on either side, apparently, to the far-off white-crowned peaks in the distance, themselves probably inaccessible.\n\n“Let’s make the first trip geographical,” I suggested. “There’s sense in that,” Terry agreed. “I’ll put off being queen of Sirland for one more day.”\n\nSo we made a long skirting voyage, turned the point of the cape which was close by, ran up one side of the triangle at our best speed, crossed over the base where it left the higher mountains, and so back to our lake by [[moonlight.|Not bad...]]",
      "links": [
        {
          "text": "moonlight.",
          "destination": {
            "name": "Not bad...",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "Not bad...",
      "text": "“That’s not a bad little kingdom,” we agreed when it was roughly drawn and measured. So we sailed low, crossing back and forth, quartering the country as we went, and studying it. I confess that we paid small attention to the clean, well-built roads, to the attractive architecture, to the ordered beauty of the little town.\n\n“Only men there — and children,” Jen urged excitedly. “But they look — why, this is a CIVILIZED country!” I protested. “There must be women.” “Of course,” said Terry. “Come on, let’s find ’em.”\n\n“There’s a fine landing place right there where we came over,” she insisted, and it was an excellent one — a wide, flat-topped rock, overlooking the lake, and quite out of sight from the interior. “They won’t find this in a hurry,” she asserted, as we scrambled with the utmost difficulty down to safer footing. “Come on, girls — there were some good lookers in that bunch.”\n\n“Come on!” cried Terry, pushing forward. “Here goes for [[Manlandia!”|MANLANDIA]]",
      "links": [
        {
          "text": "Manlandia!”",
          "destination": {
            "name": "MANLANDIA",
            "pid": 60
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "Here goes...",
      "text": "“I always liked that Arab saying, ‘First tie your camel and then trust in the Lord,’” Jen murmured; so we all had our weapons in hand, and stole cautiously through the forest. Terry studied it as we progressed.\n\n“Talk of civilization,” she cried softly in restrained enthusiasm. “I never saw a forest so petted, even in Germany. Look, there’s not a dead bough — the vines are trained — actually! And see here” — she stopped and looked about her, calling Jen’s attention to the kinds of trees.\n\nThey left me for a landmark and made a limited excursion on [[either side.|A side expedition]]\n\nAll we found moving in those woods, as we started through them, were birds, some gorgeous, some musical, all so [[tame.|The boughs]]\n",
      "links": [
        {
          "text": "either side.",
          "destination": {
            "name": "A side expedition",
            "pid": 16
          }
        },
        {
          "text": "tame.",
          "destination": {
            "name": "The boughs",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "A side expedition",
      "text": "“Food-bearing, practically all of them,” they announced returning. “The rest, splendid hardwood. Call this a forest? It’s a truck farm!”\n\n“Good thing to have a botanist on hand,” I agreed. “Sure there are no medicinal ones? Or any for pure ornament?”\n\nAs a matter of fact they were quite right. These towering trees were under as careful cultivation as so many cabbages. In other conditions we should have found those woods full of fair foresters and fruit gatherers; but an aeroplane is a conspicuous object, and by no means quiet — and men are [[cautious.|The boughs]]",
      "links": [
        {
          "text": "cautious.",
          "destination": {
            "name": "The boughs",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "The boughs",
      "text": "There among the boughs overhead was something — more than one something — that clung motionless, close to the great trunk at first, and then, as one and all we started up the tree, separated into three swift-moving figures and fled upward. As we climbed we could catch glimpses of them scattering above us. By the time we had reached about as far as three women together dared push, they had left the main trunk and moved [[outward.|Boys!]]",
      "links": [
        {
          "text": "outward.",
          "destination": {
            "name": "Boys!",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "Boys!",
      "text": "“Boys!” whispered Jen, under her breath, as if they might fly if she spoke aloud.\n\n“Bananas!” added Terry, scarcely louder. “Bananarinos — apricot-nectarines! Whew!”\n\nThey were boys, of course, no girls could ever have shown that sparkling handsomeness, and yet none of us was certain at first.\n\nWe saw long hair, hatless, loose, and shining; a suit of some light firm stuff, the closest of tunics and kneebreeches, covered by chaps. As bright and smooth as parrots and as unaware of danger, they swung there before us, wholly at ease, staring as we stared, till first one, and then all of them burst into peals of delighted laughter, and then clear musical fluent speech.\n\nWe met their laughter cordially, and courtesyed to them, at which they laughed again, [[delightedly.|Introductions]]",
      "links": [
        {
          "text": "delightedly.",
          "destination": {
            "name": "Introductions",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "Introductions",
      "text": "Then Terry, wholly in her element, made a polite speech, with explanatory gestures, and proceeded to introduce us, with pointing finger. “Ms. Jen Margrave,” she said clearly; Jen courtseyed as gracefully as a woman could in the fork of a great limb. “Ms. Vanessa Jennings” — I also tried to make an effective salute and nearly lost my balance.\n\nThen Terry laid her hand upon her bosom — a fine bosom she had, too — and introduced herself; she was braced carefully for the occasion and achieved an excellent obeisance.\n\nAgain they laughed delightedly, and the one nearest me followed her [[tactics.|Further introductions]]\n",
      "links": [
        {
          "text": "tactics.",
          "destination": {
            "name": "Further introductions",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "Further introductions",
      "text": "“Celis,” he said distinctly, pointing to the one in blue; “Shiner” — the one in rose; then, with a vivid imitation of Terry’s impressive manner, he laid a firm delicate hand on his gold-green jerkin — “Pearl.” This was pleasant, but we got no nearer.\n\nPearl clearly indicated that we should go down, pointing to each and all of us, with unmistakable firmness; and further seeming to imply by the sweep of a robust arm that we not only go downward, but go away altogether — at which we shook our heads [[in turn.|Bait]]\n",
      "links": [
        {
          "text": "in turn.",
          "destination": {
            "name": "Bait",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "Bait",
      "text": "“Have to use bait,” grinned Terry. “I don’t know about you girls, but I came prepared.” She produced from an inner pocket a little box of purple velvet, that opened with a snap — and out of it she drew a round sparkling thing, a chunky Rolex that would have been worth thousands if it were real. She held it up, swung it, glittering in the sun, offered it first to one, then to another, holding it out as far as she could reach toward the boy nearest her. She stood braced in the fork, held firmly by one hand — the other, swinging her bright temptation, reached far out along the bough, but not quite to her full [[stretch.|Interest]]\n",
      "links": [
        {
          "text": "stretch.",
          "destination": {
            "name": "Interest",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "Interest",
      "text": "He was visibly moved, I noted, hesitated, spoke to his companions. They chattered softly together, one evidently warning him, the other encouraging. Then, softly and slowly, he drew nearer. This was Shiner, a tall long-limbed lad, well-knit and evidently both strong and agile. His eyes were splendid, wide, fearless, as free from suspicion as a child’s who has never been rebuked. His interest was more that of an intent girl playing a fascinating game than of a boy lured by gold.\n\nThe others moved a bit farther out, holding firmly, watching. Terry’s smile was irreproachable, but I did not like the look in her eyes — it was like a creature about to spring. I could already see it happen — the dropped watch, the sudden clutching hand, the boy’s sharp cry as she seized him and [[drew him in.|Reaching]]",
      "links": [
        {
          "text": "drew him in.",
          "destination": {
            "name": "Reaching",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "Reaching",
      "text": "But it didn’t happen. He made a timid reach with his right hand for the gay swinging thing — she held it a little nearer — then, swift as light, he seized it from her with his left, and dropped on the instant to the bough below.\n\nShe made her snatch, quite vainly, almost losing her position as her hand clutched only air; and then, with inconceivable rapidity, the three bright creatures were gone. They dropped from the ends of the big boughs to those below, fairly pouring themselves off the tree, while we climbed downward as swiftly as we could. We heard their vanishing gay laughter, we saw them fleeting away in the wide open reaches of the forest, and gave chase, but we might as well have chased wild antelopes; so we stopped at length somewhat breathless.\n\n“No use,” gasped Terry. “They got away with it. My word! The men of this country must be [[good sprinters!|Arboreal]]”\n",
      "links": [
        {
          "text": "good sprinters!",
          "destination": {
            "name": "Arboreal",
            "pid": 24
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "Arboreal",
      "text": "“Inhabitants evidently arboreal,” I grimly suggested. “Civilized and still arboreal — peculiar people.”\n\n“You shouldn’t have tried that way,” Jen protested. “They were perfectly friendly; now we’ve scared them.” But it was no use grumbling, and Terry refused to admit any mistake. “Nonsense,” she said. “They expected it. Men like to be run after. Come on, let’s get to that town; maybe we’ll find them there. Let’s see, it was in this direction and not far from the woods, as I remember.”\n\nWhen we reached the edge of the open country we reconnoitered with our field glasses. There it was, about four miles off, the same town, we concluded, unless, as Jen ventured, they all had blue houses. The broad green fields and closely cultivated gardens sloped away at our feet, a long easy slant, with good roads winding pleasantly here and there, and narrower paths besides.\n\n“Look at that!” cried Jen suddenly. [[“There they go!”|Go!]] ",
      "links": [
        {
          "text": "“There they go!”",
          "destination": {
            "name": "Go!",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "Go!",
      "text": "Sure enough, close to the town, across a wide meadow, three bright-hued figures were running swiftly.\n\n“How could they have got that far in this time? It can’t be the same ones,” I urged. But through the glasses we could identify our pretty tree-climbers quite plainly, at least by costume.\n\nTerry watched them, we all did for that matter, till they disappeared among the houses. Then she put down her glass and turned to us, drawing a long breath. “Father of Fred, boys — what Gorgeous Guys! To climb like that! to run like that! and afraid of nothing. This country suits me all right. Let’s get ahead.”\n\n[[“Nothing venture, nothing have,”]] I suggested, but Terry preferred [[“Faint heart ne’er won fair sir.”|“Faint heart...”]] ",
      "links": [
        {
          "text": "“Nothing venture, nothing have,”",
          "destination": {
            "name": "“Nothing venture, nothing have,”",
            "pid": 26
          }
        },
        {
          "text": "“Faint heart ne’er won fair sir.”",
          "destination": {
            "name": "“Faint heart...”",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "“Nothing venture, nothing have,”",
      "text": "We set forth in the open, walking briskly. “If there are any men, we’d better keep an eye out,” I suggested, but Jen seemed lost in heavenly dreams, and Terry in highly practical plans.\n\n“What a perfect road! What a heavenly country! See the flowers, will you?”\n\nThis was Jen, always an enthusiast; but [[we could agree with her fully.]]",
      "links": [
        {
          "text": "we could agree with her fully.",
          "destination": {
            "name": "we could agree with her fully.",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "“Faint heart...”",
      "text": "Here was evidently a people highly skilled, efficient, caring for their country as a florist cares for her costliest orchids. Under the soft brilliant blue of that clear sky, in the pleasant shade of those endless rows of trees, we walked unharmed, the placid silence broken only by the birds.\n\nPresently there lay before us at the foot of a long hill the town or village we were aiming for. We stopped and studied it.\n\nJen drew a long breath. “I wouldn’t have believed a collection of houses could look [[so lovely,]]” she said. ",
      "links": [
        {
          "text": "so lovely,",
          "destination": {
            "name": "so lovely,",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "we could agree with her fully.",
      "text": "The road was some sort of hard manufactured stuff, sloped slightly to shed rain, with every curve and grade and gutter as perfect as if it were Europe’s best. “No women, eh?” sneered Terry. On either side a double row of trees shaded the footpaths; between the trees bushes or vines, all fruit-bearing, now and then seats and little wayside fountains; everywhere flowers.\n\n“We’d better import some of these fellows and set ’em to parking the United States,” I suggested. “Mighty nice place they’ve got here.” We rested a few moments by one of the fountains, tested the fruit that looked ripe, and went on, impressed, for all our gay bravado by the [[sense of quiet potency which lay about us.|An odd look]]",
      "links": [
        {
          "text": "sense of quiet potency which lay about us.",
          "destination": {
            "name": "An odd look",
            "pid": 29
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "An odd look",
      "text": "The place had an odd look, more impressive as we approached. “It’s like an exposition.” “It’s too pretty to be true.” “Plenty of palaces, but where are the homes?” “Oh there are little ones enough — but ...” It certainly was different from any towns we had ever seen.\n\n“There’s no dirt,” said Jen suddenly. “There’s no smoke,” she added after a little.\n\n“There’s no noise,” I offered; but Terry snubbed me — “That’s because they are laying low for us; we’d better be careful how we go in there.”\n\nNothing could induce her to stay out, however, so [[we walked on.]]",
      "links": [
        {
          "text": "we walked on.",
          "destination": {
            "name": "we walked on.",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "so lovely,",
      "text": "“They’ve got architects and landscape gardeners in plenty, that’s sure,” agreed Terry.\n\nI was astonished myself. You see, I come from California, and there’s no country lovelier, but when it comes to towns — ! I have often groaned at home to see the offensive mess woman made in the face of nature, even though I’m no art sharp, like Jen. But this place! It was built mostly of a sort of dull rose-colored stone, with here and there some clear white houses; and it lay abroad among the green groves and gardens like a broken rosary of pink coral.\n\n“Those big white ones are public buildings evidently,” Terry declared. “This is no savage country, my friend. But no women? Girls, it behooves us to [[go forward most politely.|An odd look]]”",
      "links": [
        {
          "text": "go forward most politely.",
          "destination": {
            "name": "An odd look",
            "pid": 29
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "we walked on.",
      "text": "Everything was beauty, order, perfect cleanness, and the pleasantest sense of home over it all. As we neared the center of the town the houses stood thicker, ran together as it were, grew into rambling palaces grouped among parks and open squares, something as college buildings stand in their quiet greens.\n\nAnd then, turning a corner, we came into a broad paved space and saw before us [[a band of men standing close together]] in even order, [[evidently waiting for us.]]",
      "links": [
        {
          "text": "a band of men standing close together",
          "destination": {
            "name": "a band of men standing close together",
            "pid": 32
          }
        },
        {
          "text": "evidently waiting for us.",
          "destination": {
            "name": "evidently waiting for us.",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "a band of men standing close together",
      "text": "We stopped a moment and looked back. The street behind was closed by another band, marching steadily, shoulder to shoulder. We went on — there seemed no other way to go — and presently found ourselves quite surrounded by this close-massed multitude, men, all of them, but —\n\nThey were not young. They were not old. They were not, in the boy sense, handsome. They were not in the least ferocious. And yet, as I looked from face to face, calm, grave, wise, wholly unafraid, evidently assured and determined, I had the funniest feeling — a very early feeling — a feeling that I traced back and back in memory until I caught up with it at last. It was that sense of being hopelessly in the wrong that I had so often felt in early youth when my short legs’ utmost effort failed to overcome the fact that I was late to school.\n\nJen felt it too; [[I could see she did.]]",
      "links": [
        {
          "text": "I could see she did.",
          "destination": {
            "name": "I could see she did.",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "evidently waiting for us.",
      "text": "We felt like little, very little, little girls, caught doing mischief in some gracious gentleman’s house. But Terry showed no such consciousness. I saw her quick eyes darting here and there, estimating numbers, measuring distances, judging chances of escape. She examined the close ranks about us, reaching back far on every side, and murmured softly to me, “Every one of ’em over forty as I’m a sinner.”\n\nYet they were not old men. Each was in the full bloom of rosy health, erect, serene, standing sure-footed and light as any ballerina. They had no weapons, and we had, but we had no wish to shoot.\n\n“I’d as soon shoot my uncles,” muttered Terry. “What do they want with us anyhow? They seem to mean business.” But in spite of that businesslike aspect, Terry had come armed with a theory, and [[she determined to try her favorite tactics.|I could see she did.]]",
      "links": [
        {
          "text": "she determined to try her favorite tactics.",
          "destination": {
            "name": "I could see she did.",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "I could see she did.",
      "text": "Terry stepped forward, with her brilliant ingratiating smile, and made low obeisance to the men before him. Then she produced another tribute, a broad soft necktie of filmy texture, rich in color and pattern, a lovely thing, even to my eye, and offered it with a deep bow to the tall unsmiling man who seemed to head the ranks before him. He took it with a gracious nod of acknowledgment, and passed it on to those behind him.\n\nShe tried again, this time bringing out cufflinnks of rhinestones, a glittering pair that should have pleased any man on earth. She made a brief address, including Jen and me as partners in her enterprise, and with another bow presented this. Again his gift was accepted and, as before, passed out of sight.\n\n“If they were only younger,” she muttered between her teeth. “What on earth is a fellow to say to a regiment of old Colonels like this, [[full birds?]]”\n",
      "links": [
        {
          "text": "full birds?",
          "destination": {
            "name": "full birds?",
            "pid": 35
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "full birds?",
      "text": "In all our discussions and speculations we had always unconsciously assumed that the men, whatever else they might be, would be young. [[Most women do think that way, I fancy.]]\n",
      "links": [
        {
          "text": "Most women do think that way, I fancy.",
          "destination": {
            "name": "Most women do think that way, I fancy.",
            "pid": 36
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "Most women do think that way, I fancy.",
      "text": "“Man” in the abstract is young, and, we assume, dashing. As they get older they pass off the stage, somehow, into their caves, mostly. But these good fellows were very much on the stage, and yet any one of them might have been a grandfather.\n\nWe looked for nervousness — there was none.\n\nFor terror, perhaps — [[there was none.]]\n",
      "links": [
        {
          "text": "there was none.",
          "destination": {
            "name": "there was none.",
            "pid": 37
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "there was none.",
      "text": "Six of them stepped forward now, one on either side of each of us, and indicated that we were to go with them. We thought it best to accede, at first anyway, and marched along, one of these close at each elbow, and the others in close masses before, behind, on both sides.\n\n[[A large building opened before us,|Borne inside]] a very heavy thick-walled impressive place, big, and old-looking; of gray stone, not like the rest of the town.\n\n“This won’t do!” said Terry to us, quickly. “We mustn’t let them get us in this, boys. [[All together, now —|All together]]” ",
      "links": [
        {
          "text": "A large building opened before us,",
          "destination": {
            "name": "Borne inside",
            "pid": 38
          }
        },
        {
          "text": "All together, now —",
          "destination": {
            "name": "All together",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "Borne inside",
      "text": "Instantly each of us was seized by five men, each holding arm or leg or head; we were lifted like children, straddling helpless children, and borne onward, wriggling indeed, but most ineffectually.\n\nWe were borne inside, struggling womanfully, but held secure most manfully, in spite of our best endeavors.\n\nSo carried and so held, we came into a high inner hall, gray and bare, and were brought before a majestic gray-haired man who seemed to hold a judicial position.\n\nThere was some talk, not much, among them, and then suddenly there fell upon each of us at once a firm hand holding a wetted cloth before mouth and nose — an order of swimming sweetness — [[anesthesia.]]",
      "links": [
        {
          "text": "anesthesia.",
          "destination": {
            "name": "anesthesia.",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "All together",
      "text": "We stopped in our tracks. We began to explain, to make signs pointing away toward the big forest — indicating that we would go back to it — at once.\n\nIt makes me laugh, knowing all I do now, to think of us three girls — nothing else; three audacious impertinent girls — butting into an unknown country without any sort of a guard or defense. We seemed to think that if there were women we could fight them, and if there were only men — why, they would be no obstacles at all.\n\nJen, with her gentle romantic old-fashioned notions of men as clinging vines. Terry, with her clear decided practical theories that there were two kinds of men — those she wanted and those she didn’t; Desirable and Undesirable was her demarcation. The latter as a large class, but negligible — [[she had never thought about them at all.]] ",
      "links": [
        {
          "text": "she had never thought about them at all.",
          "destination": {
            "name": "she had never thought about them at all.",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "she had never thought about them at all.",
      "text": "And now here they were, in great numbers, evidently indifferent to what she might think, evidently determined on some purpose of their own regarding her, and apparently well able to enforce their purpose.\n\nWe all thought hard just then. It had not seemed wise to object to going with them, even if we could have; our one chance was friendliness — a civilized attitude on both sides.\n\nBut once inside that building, there was no knowing what these determined fellows might do to us. Even a peaceful detention was not to our minds, and when we named it imprisonment [[it looked even worse.]]",
      "links": [
        {
          "text": "it looked even worse.",
          "destination": {
            "name": "it looked even worse.",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "it looked even worse.",
      "text": "So we made a stand, trying to make clear that we preferred the open country.\n\n“I never fought with women in my life,” said Terry, greatly perturbed, “but I’m not going in there. I’m not going to be — herded in — as if we were in a cattle chute.”\n\n“We can’t fight them, of course,” Jen urged. “It wouldn’t be right. They’re all men, in spite of their nondescript clothes; nice men, too; good strong sensible faces. I guess we’ll have to go in.”\n\n“We may never get out, if we do,” I told them. “Strong and sensible, yes; but I’m not so sure about the good. [[Look at those faces!]]”",
      "links": [
        {
          "text": "Look at those faces!",
          "destination": {
            "name": "Look at those faces!",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "anesthesia.",
      "text": "A big room, high and wide, with many lofty windows whose closed blinds let through soft green-lit air; a beautiful room, in proportion, in color, in smooth simplicity; a scent of blossoming gardens outside.\n\nI lay perfectly still, quite happy, quite conscious, and yet not actively realizing what had happened till I heard Terry.\n\n[[“Gosh!”|Gosh]] was what she said. ",
      "links": [
        {
          "text": "“Gosh!”",
          "destination": {
            "name": "Gosh",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "Look at those faces!",
      "text": "Never, anywhere before, had I seen men of precisely this quality. Hunters and lumberjacks might show similar strength, but coarse and heavy. These were merely athletic — light and powerful. College professors, teachers, writers — many men showed similar intelligence but often wore a strained nervous look, while these were as calm as capybaras, for all their evident intellect.\n\nWe observed pretty closely just then, for all of us felt that it was a crucial moment. “We’ve got to decide quick,” said Terry.\n\nThen we found ourselves much in the position of the man trying to [[tipoe past|Borne inside]] a fervent coven or an assembly of Bacchic women.",
      "links": [
        {
          "text": "tipoe past",
          "destination": {
            "name": "Borne inside",
            "pid": 38
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "Gosh",
      "text": "I turned my head. There were three beds in this chamber, and plenty of room for them.\n\nTerry was sitting up, looking about her, alert as ever. Her remark, though not loud, roused Jen also. We all sat up.\n\nTerry swung her legs out of bed, stood up, stretched herself mightily. She was in a long nightrobe, a sort of seamless garment, undoubtedly comfortable — we all found ourselves so covered. Shoes were beside each bed, also quite comfortable and goodlooking though by no means like our own. [[Our clothes were not there.]]",
      "links": [
        {
          "text": "Our clothes were not there.",
          "destination": {
            "name": "Our clothes were not there.",
            "pid": 45
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "Our clothes were not there.",
      "text": "“They haven’t hurt us in the least!” she said. “They could have killed us — or — or anything — and I never felt better in my life.”\n\n“That argues that they are all men,” I suggested, “and highly civilized. You know you hit one in the last scrimmage — I heard him sing out — and we kicked awfully.”\n\nTerry was grinning at us. “So you realize what these gents have done to us?” she pleasantly inquired. “They have taken away all our possessions, all our clothes — every stitch. We have been stripped and washed and put to bed like so many yearling babies — [[by these highly civilized men.”|Civilized men]]",
      "links": [
        {
          "text": "by these highly civilized men.”",
          "destination": {
            "name": "Civilized men",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "Civilized men",
      "text": "Jen actually blushed. She had a [[poetic imagination.]]",
      "links": [
        {
          "text": "poetic imagination.",
          "destination": {
            "name": "poetic imagination.",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "poetic imagination.",
      "text": "We knocked, whereupon the door opened.\n\nOutside was another large room, furnished with a great table at one end, long benches or couches against the wall, some smaller tables and chairs. All these were solid, strong, simple in structure, and comfortable in use — also, incidentally, beautiful.\n\nThis room was occupied by a number of men, eighteen to be exact, some of whom we distinctly recalled.\n\nBy each of our plates was a little book. With reference to these, and the ones we had brought, we were to [[learn their langauge]] and teach our own. Terry joked that the book she was given, an early schoolbook of sorts, might be called “To Serve Man.” But that did little to help us start [[our dinner-time conversation.]]",
      "links": [
        {
          "text": "learn their langauge",
          "destination": {
            "name": "learn their langauge",
            "pid": 49
          }
        },
        {
          "text": "our dinner-time conversation.",
          "destination": {
            "name": "our dinner-time conversation.",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "our dinner-time conversation.",
      "text": "“I’m sick and tired of being educated,” Terry protested soon after. “Fancy going to some school for boys — and at our age. I want to Get Out!”\n\n“I’m sick of it!” she said again. “Sick of the whole thing. Here we are cooped up as helpless as a bunch of three-year-old orphans, and [[being taught]] what they think is necessary — whether we like it or not. Confound their bachelor impudence!”",
      "links": [
        {
          "text": "being taught",
          "destination": {
            "name": "being taught",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "learn their langauge",
      "text": "Personally, I was tremendously interested in that language, and seeing they had books, was eager to get at them, to dig into their history, if they had one.\n\nIt was not hard to speak, smooth and pleasant to the ear, and so easy to read and write that I marveled at it. They had an absolutely phonetic system, the whole thing was as scientific as Esparanto yet bore all the marks of [[an old and rich civilization.]]",
      "links": [
        {
          "text": "an old and rich civilization.",
          "destination": {
            "name": "an old and rich civilization.",
            "pid": 50
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "an old and rich civilization.",
      "text": "They brought pictures, not only the engravings in the books but colored studies of plants and trees and flowers and birds. They brought tools and various small objects — we had plenty of “material” in our school.\n\nIf it had not been for Terry we would have been much more contented, but as the weeks ran into months she grew more and more irritable. She finally persuaded us to consider a plan of escape. It was difficult, it was highly dangerous, but she declared that she’d go alone if we wouldn’t go with her, and of course we couldn’t think of that.\n\nJen and I, not without a joyous sense of recovered freedom, successfully [[followed our leader.|in the garden]]",
      "links": [
        {
          "text": "followed our leader.",
          "destination": {
            "name": "in the garden",
            "pid": 52
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "being taught",
      "text": "So we waited for full moon, retired early, and spent an anxious hour or two in the unskilled manufacture of woman-strong ropes.\n\nTo retire into the depths of the closet, muffle a glass in thick cloth, and break it without noise was not difficult, and broken glass will cut, though not as deftly as the boot knife of one’s every day carry.\n\nThe broad moonlight streamed in through four of our windows — we had not dared leave our lights on too long — and we worked hard and fast at our task of destruction.\n\nHangings, rugs, robes, towels, as well as bed-furniture — even the mattress covers — we left not one stitch upon another, as Jen put it.\n\nI slipped down first, and stood, well braced against the wall; then Jen on my shoulders, then Terry, who shook us a little as she sawed through the cord above her head. Then I slowly dropped to the ground, Jen following, and at last we all three stood safe [[in the garden,|in the garden]] with most of our rope with us. ",
      "links": [
        {
          "text": "in the garden,",
          "destination": {
            "name": "in the garden",
            "pid": 52
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "in the garden",
      "text": "We found a friendly nut-tree, those large, satisfying, soft-shelled nuts we already knew so well, and filled our pockets.\n\nI see that I have not remarked that these men had pockets in surprising number and variety. They were in all their garments, and the middle one in particular was shingled with them, making a separate man-bag quite unnecessary. So we stocked up with nuts till we bulged like Prussian privates in marching order, drank all we could hold.\n\nStealing along among the rocks and trees like so many creeping savages, we came to that flat space where we had landed; and there, in unbelievable good fortune, [[we found our machine.]]",
      "links": [
        {
          "text": "we found our machine.",
          "destination": {
            "name": "we found our machine.",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "we found our machine.",
      "text": "As we tugged and pulled at that tough cloth that covered it, we heard a sound that made Terry lift her head like a war horse — the sound of an unmistakable snort, yes — three snorts.\n\nThere they were — Celis, Shiner, Pearl — looking just as they had when we first saw them, standing a little way off from us, as interested, as mischievous as three schoolgirls.\n\nI shook my head like a lobster. [[“It’s a trap!”|Trap]]",
      "links": [
        {
          "text": "“It’s a trap!”",
          "destination": {
            "name": "Trap",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "Trap",
      "text": "After they brought us back, they brought us books, in greater numbers, and I began to study them seriously.\n\n“Pretty punk literature,” Terry burst forth one day, when we were in the privacy of our own room. “Of course one expects to begin on child-stories, but I would like something more interesting now.”\n\n“Can’t expect stirring romance and wild adventure without women, can you?” I asked. Nothing irritated Terry more than to have us assume that there were no women; but there were no signs of them in the books they gave us, or the pictures.\n\n“Shut up!” she growled. “What infernal nonsense you talk! I’m going to ask ’em outright — we know enough now.”\n\nIn truth we had been using our best efforts to master the language, and were able to read fluently and to [[discuss what we read]] with considerable ease. ",
      "links": [
        {
          "text": "discuss what we read",
          "destination": {
            "name": "discuss what we read",
            "pid": 55
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "discuss what we read",
      "text": "“No,” answered Star, sitting alone, as always. “There are no women in this country. There has not been a woman among us for two thousand years.”\n\n“But — the people — the children,” Terry protested, not believing him in the least, but not wishing to say so.\n\n“Oh yes,” he smiled. “I do not wonder you are puzzled. We are fathers — all of us — but there are no mothers. We thought you would ask about that long ago — why have you not?” His look was as frankly kind as always, his tone quite simple.\n\n“You should have our full history to read — do not be alarmed — it has been made clear and short. It took us a long time to learn how to [[write history.]] Oh, how I should love to read yours!”",
      "links": [
        {
          "text": "write history.",
          "destination": {
            "name": "write history.",
            "pid": 56
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "write history.",
      "text": "Well, they had a history all right, hefty books that would be even heftier if wrapped up with twine. Suffice it to say that they had waged war, practiced polygamy, owned slaves, and learned nothing of evolution, even without the full two sexes.\n\nIt took me a long time to realize — Terry never did realize — how little the absence of women meant to them. When we say WOMEN, WOMAN, WOMANLY, GIRLY, FEMININE, GRRRL, and all the other words indicative of our female nature, we have in the background of our minds a huge vague crowded picture of the world and all its activities. To grow up and “be a woman,” to “act like a woman” — the meaning and connotation is wide indeed. That vast background is full of marching columns of women, of changing tables of women, of long processions of women; of women steering their ships into new seas, exploring unknown mountains, breaking horses, herding cattle, ploughing and sowing and reaping, toiling at the forge and furnace, digging in the mine, building roads and bridges and high cathedrals, managing great businesses, teaching in all the colleges, preaching in all the churches; of women everywhere, doing everything — [[“the world.”|The world.]]",
      "links": [
        {
          "text": "“the world.”",
          "destination": {
            "name": "The world.",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "this two-thousand-year-old masculine civilization,",
      "text": "After our studies of language, our discussions of histories, we asked to finally be allowed to return. We promised not to betray the location of this strange Dada-Land. (You will notice that nothing in my tale has revealed it.) This settled, [[they let us go.|They let us go.]]",
      "links": [
        {
          "text": "they let us go.",
          "destination": {
            "name": "They let us go.",
            "pid": 59
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "The world.",
      "text": "But to these men, in the unbroken sweep of [[this two-thousand-year-old masculine civilization,]] the word MAN called up all that big background, so far as they had gone in social development; and the word WOMAN meant to them only FEMALE — the sex.",
      "links": [
        {
          "text": "this two-thousand-year-old masculine civilization,",
          "destination": {
            "name": "this two-thousand-year-old masculine civilization,",
            "pid": 57
          }
        }
      ]
    },
    {
      "pid": 59,
      "name": "They let us go.",
      "text": "And you, dear reader, I also let you go.\n\nIf you found something to amuse or edify you in this tale of MANLANDIA, you might wish to also read <a href=\"http://en.wikipedia.org/wiki/Herland_(novel)\">this,</a> or, perchance, <a href=\"http://www.twoseriousladies.org/boycott-project-13-by-vanessa-place/\">this.</a>",
      "links": []
    },
    {
      "pid": 60,
      "name": "MANLANDIA",
      "text": "[[MANLANDIA!|Here goes...]]",
      "links": [
        {
          "text": "MANLANDIA!",
          "destination": {
            "name": "Here goes...",
            "pid": 15
          }
        }
      ]
    }
  ]
}