{
  "passages": [
    {
      "pid": 1,
      "name": "Passaggio senza titolo",
      "text": "In a non-specified period of time, once upon a time there were [[a brother and a sister]].",
      "links": [
        {
          "text": "a brother and a sister",
          "destination": {
            "name": "a brother and a sister",
            "pid": 2
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "a brother and a sister",
      "text": "Esmeralda was a brave and tough girl, with a heart made of gold, long black hair and a pair of lustrous green eyes. She was the eldest of the two, and so she had to take care of his younger brother, Ruby. He was a vibrant and a gentle boy, a bit smaller than his sister, blonde like the best wheat, and two big red eyes. Luckily for her, Ruby was even careful not to upset her, helping her when he could, and always behaving.\n\nTheir adventure takes place on ad unknown island, a motley island, [[a magical island]].\n\n<img src=\"http://i.imgur.com/mVcskCE.jpg\"/> <img src=\"https://i.imgur.com/bYoMXVH.jpg\">",
      "links": [
        {
          "text": "a magical island",
          "destination": {
            "name": "a magical island",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "a magical island",
      "text": "The two brothers lived in a house on the beach, a house made of wood and leafs, small but very cozy, With them lived their best friend, the perfect buddy: his name was Sicomore, a fierce and determined wolf, black like the night without any stars, and with orange ears and tail, like he rubbed against a pumpkin.\n\n<img src=\"https://i.imgur.com/xM36Fao.jpg\">\n\nThe days of the three friends passed quietly, among walks, games, and fun.\n\nOne day though, [[something happened]].",
      "links": [
        {
          "text": "something happened",
          "destination": {
            "name": "something happened",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "something happened",
      "text": "In the middle of the night, a night strangely lacking of any wind, a silent night like no other, in which even sea waves couldn't break on the seaside, Sicomore heard something. Something unusual, only he could hear. So, driven by his curiosity, he walked away from home and from the two brothers, [[to check it out]].",
      "links": [
        {
          "text": "to check it out",
          "destination": {
            "name": "to check it out",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "to check it out",
      "text": "The following day, Ruby and Esmeralda, waking up, not seeing their four-legged friend, started asking where he could have been. He wasn't under the bed, he wasn't in the kitchen nor in the living room; maybe [[he was already out]], they tought.",
      "links": [
        {
          "text": "he was already out",
          "destination": {
            "name": "he was already out",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "he was already out",
      "text": "So they opened the door and they started looking for him near the reef, behind the house, maybe he was on the roof. He wasn't on the beach either, so they started to shout his name: \"Sicomore! Sicomore! Sicomore!\". [[No answer]].",
      "links": [
        {
          "text": "No answer",
          "destination": {
            "name": "No answer",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "No answer",
      "text": "Not letting despair overwhelm them, they decided that the only thing to do was to go find him. Where could he have gone? What was that sound he heard? Why he wans't back yet?\n\nMa most importantly, [[where on the island could he have been]]?\n(set: $palude to false)\n(set: $grotta to false)\n(set: $ghiacciaio to false)",
      "links": [
        {
          "text": "where on the island could he have been",
          "destination": {
            "name": "where on the island could he have been",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "where on the island could he have been",
      "text": "The two brothers were ready for the search, but the island was big and it was impossible for them to bring their entire home with them, so they decided to make stages of their journey, so they could prepare themselves better and came back whenever it was necessary. But where to start the [[quest]]?",
      "links": [
        {
          "text": "quest",
          "destination": {
            "name": "quest",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "treachery",
      "text": "\"And this mosquitos? They already bit me like 40 times, if not more!\", argued Ruby, scratching his arms and neck. \"When we go back I'll make something to calm your itching, I promise. But now I need you to stat alert, keep an eye on the surrounding, you'll never know what can [[come out]].”",
      "links": [
        {
          "text": "come out",
          "destination": {
            "name": "come out",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "come out",
      "text": "Continuing searching the swamp, looking for any trace or hint about the finding of their precious friend, Ruby saw some sort of archway between two trees in the distance, maybe an entrance.\n\n\"Hey, Esmeralda! Look over there! What's that eh? I think that's some kind of passage, maybe Sicomore is hiding there\".\n\n\"I don't think I ever saw that passage before. [[Let's check it out]].”",
      "links": [
        {
          "text": "Let's check it out",
          "destination": {
            "name": "Let's check it out",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "Let's check it out",
      "text": "Approaching the opening, they started too see that it was not a passage, but a cave, probably unexplored. Knowing that Sicomore was a curious animal, they thought they probably would find him in there, so they started [[to shout out his name!|a gran voce!]]",
      "links": [
        {
          "text": "to shout out his name!",
          "destination": {
            "name": "a gran voce!",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "a gran voce!",
      "text": "Just before entering the cave though, the ground started to tremble under their feet. Then they heard a moan, and something was beginning to grow and take form in front of their eyes. From the mud, slowly, some kind of boulder was starting to form, a huge block of water and dirt, but then the block took shape: first came up the left arm, then the right one, then the legs and the head.\n\n<img src=\"https://i.imgur.com/MPasnUw.jpg\">\n\nEsmaralda and Ruby, still on the ground, could not believe their eyes: in front of them stood [[a Golem|Golem]].",
      "links": [
        {
          "text": "a Golem",
          "destination": {
            "name": "Golem",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "Golem",
      "text": "\"AAAAAARGHHH! Who dare to enter my master's house?\" thundered the Golem, the sound of his voice deep and evil.\n\nThe first who got up was Esmeralda, helping his brother getting back on his feet, then she said to the Golem: \"I'm Esmeralda, this is my brother Ruby. [[Who are you?|Tu chi sei?]]\"",
      "links": [
        {
          "text": "Who are you?",
          "destination": {
            "name": "Tu chi sei?",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "Tu chi sei?",
      "text": "\"I'm Kuvum of the Mire, and I have been built to stop intruders like you from getting inside my master's house.\"\n\n\"House? That's an awkard looking hou- ouch!\", Ruby was silenced after a nudge on his arm by his sister, \"Shush, you may anger him more! Let's see if there a way to convince him to get us trough\".\n\"Kuvum, we are looking for a friend of ours, it's been a while he disappeared and knowing his curiosity, maybe he's hiding in your master's house, We are asking you only [[to let us in|farci entrare]] for a few seconds.\"",
      "links": [
        {
          "text": "to let us in",
          "destination": {
            "name": "farci entrare",
            "pid": 15
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "farci entrare",
      "text": "\"So even you are looking for something\", said the Golem, \"but my orders are to not let anyone in, so i doubt that your friend is inside my master's house.\"\n\n\"What if your master kidnap him?\", said Ruby.\n\n\"In that case your friend is not yours anymore, but a property of my master, so [[I can't let you in|non posso lasciarvi entrare]] either.”",
      "links": [
        {
          "text": "I can't let you in",
          "destination": {
            "name": "non posso lasciarvi entrare",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "non posso lasciarvi entrare",
      "text": "\"Well, he is a stubborn one, we have to find a way to enter that cave, house, or whatever that is\", said Esmeralda, trying to put together some ideas to pass the big obstacle.\n\nBut Ruby said: \"Hey, before he said he was looking for something too, maybe if we [[help him|aiutiamo]] he can let us pass!\"",
      "links": [
        {
          "text": "help him",
          "destination": {
            "name": "aiutiamo",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "aiutiamo",
      "text": "\"Yeah, you are right. Let's try\", said the green eyed girl, and so she told the Golem: \"Kuvum, you said that you are looking for something too. Maybe we can help you find it, so you can let us in in return, even for a brief period of time\".\n\n\"Yes, little being, my master built me with a goal, to find something. But I'm stuck here, and I can't go find it.\n\n\"Well, we're here to help you find it, we're not stuck and we're REALLY happy to help you!\", said Ruby, disguising his enthusiasm, craving only to enter the cave.\n\"What's that you desire? We will find [[anything|qualsiasi cosa]] you want”.",
      "links": [
        {
          "text": "anything",
          "destination": {
            "name": "qualsiasi cosa",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "qualsiasi cosa",
      "text": "Vukum, with his cavernous voice, said: \"My master didn't tell me what it is, but I know I want it\".\n\n\"Maybe you are looking for happiness, or is it freedom?\", said Esmeralda.\n\n\"No, anything like that\".\n\nSo Ruby started listing anything his mind could think, every object and oddities, but Esmeralda stepped aside [[to consider|riflettere]] the strange request.",
      "links": [
        {
          "text": "to consider",
          "destination": {
            "name": "riflettere",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "riflettere",
      "text": "When all of a sudden, she got close to Vukum: \"You said that you are looking for something, but you din't know what it is. That means that you don't need it, otherwise you would know it, or maybe you already found it or have it, so your search is [[over|terminata]].”",
      "links": [
        {
          "text": "over",
          "destination": {
            "name": "terminata",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "terminata",
      "text": "The words of Esmeralda struck the Golem like a bolt hitting an old tree.\n\n\"I...I'm...Not...Gh...Aah...AAAAARGH!\".\n\nAnd with his last scream, the Golem started to squirm, to struggle, and to bloat. Esmeralda took the hand of his brother saying: \"I've a bad feeling about this, better if we go away!\".\nAnd the Golem swelled up, and swelled up, until...\n\n\n[[BOOOOOOOOOM!]]",
      "links": [
        {
          "text": "BOOOOOOOOOM!",
          "destination": {
            "name": "BOOOOOOOOOM!",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "BOOOOOOOOOM!",
      "text": "Vukum's explosion caused a mud rain all over the swamp, letting the entrance free and our heroes full of dirt.\n\n\"Perfect, now I'm ALSO FILTHY!\", was complaining Ruby, trying to clean himself better than he could.\n\"At least the passage is not blocked anymore, let's see if Sicomore is inside\", she reassured him. So the two got close to the entrance, building up the courage, knowing not what [[awaited them inside|cosa li aspettasse all’interno]].",
      "links": [
        {
          "text": "awaited them inside",
          "destination": {
            "name": "cosa li aspettasse all’interno",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "cosa li aspettasse all’interno",
      "text": "The house, better yet the small cave, had only a table and a chair, nothing more. On the table there was a strange object, something resembling a [[small pink diamond|piccolo diamante di colore rosa]].",
      "links": [
        {
          "text": "small pink diamond",
          "destination": {
            "name": "piccolo diamante di colore rosa",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "piccolo diamante di colore rosa",
      "text": "\"Hey Esmeralda, look! You could use this wonderful jewel to make a very nice necklace\".\n\"For now the necklace is out of the way, but why that Golem was protecting thi thing? Better  [[take it with us|portarlo con noi]]”.",
      "links": [
        {
          "text": "take it with us",
          "destination": {
            "name": "portarlo con noi",
            "pid": 24
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "portarlo con noi",
      "text": "\"You are right, we should also go back home, it's getting dark and this swamp is the last place I want to be during the night\".\n\"Of course, brother, we will go back to our search tomorrow\".\n\nSo, the two brothers, tired, bit and smelly, went back to their [[house|quest]] on the beach, where awaited them a night of well-deserved rest.\n(set: $palude to true)",
      "links": [
        {
          "text": "house",
          "destination": {
            "name": "quest",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "quest",
      "text": "(if: $palude is false)[[[Let's go further into the swamp!|palude]]](else:)[You have explored the swamp.]\n(if: $grotta is false)[[[Let's explore that cave!|grotta]]](else:)[You visited the cave.]\n(if: $ghiacciaio is false)[[[Let's climb that glacier!|ghiacciaio]]](else:)[You have explored the glacier.]\n(if: $palude is true and $grotta is true and $ghiacciaio is true)[[[At home...|home]]]",
      "links": [
        {
          "text": "Let's go further into the swamp!",
          "destination": {
            "name": "palude",
            "pid": 26
          }
        },
        {
          "text": "Let's explore that cave!",
          "destination": {
            "name": "grotta",
            "pid": 27
          }
        },
        {
          "text": "Let's climb that glacier!",
          "destination": {
            "name": "ghiacciaio",
            "pid": 28
          }
        },
        {
          "text": "At home...",
          "destination": {
            "name": "home",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "palude",
      "text": "The trip towards the swamp wasn't an easy one. The path was covered in weeds, vines, natural traps and on top of that a foul smell.\n\n\"Ugh, I knew that the swamp's smell was horrible, but not THIS MUCH!\", said Ruby to his sister. \"Don't brag too much about it, otherwise you'll never get used to it, little brother\", answered Esmeralda, that was more worried about the [[treachery]] that the boggy terrain could hide than the smell.",
      "links": [
        {
          "text": "treachery",
          "destination": {
            "name": "treachery",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "grotta",
      "text": "Skirting alongside the main road, the two spotted a large opening over a hill.\n\n\"Strange, I never noticed that\", said Esmeralda.\n\"Yeah, neither do I. Is it dangerous to go inside?\", asked Ruby, afraid of what could be inside and of the answer.\n\"We have [[to check|check]], what if he's here?\"",
      "links": [
        {
          "text": "to check",
          "destination": {
            "name": "check",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "ghiacciaio",
      "text": "The two brothers decided to climb the glacier at the center of the island, bringing with them some more suitable clothing.\nThe road for the top was strangely easy, some time slippery because of the ice, but it was like a human made path. [[Very strange|strange]].",
      "links": [
        {
          "text": "Very strange",
          "destination": {
            "name": "strange",
            "pid": 29
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "strange",
      "text": "\"You think someone live on top?\", asked Ruby, between a teeth rattle and a shiver.\n\"This path made me think of it... We will find out when we'll reach the summit\", replied Esmeralda, leading his brother trough the trail.\n\nThe more they went up, a cold wind started blowing, and then tiny snowflakes began to fall, and the ground was agetting more and more slippery. At some point the road ended, blocked by a large ice boulder. But, beyond the boulder, the road was still there, becoming [[steeper|steeper]].",
      "links": [
        {
          "text": "steeper",
          "destination": {
            "name": "steeper",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "steeper",
      "text": "\"Great, just what we wanted... Ruby, we have to go on. Can you climb the boulder?\".\n\"I think so, let me try\", he said. \"Let's see if... Ugh... Almost... Uff, made it!\", declared, once on top of the big rock.\n\"Good job, brother! Now, give me a hand\".\nAfter helping his sister, the two brothers continued their journey until their were finally on top, nearby an [[ice-made doorway|doorway]], very well decorated.",
      "links": [
        {
          "text": "ice-made doorway",
          "destination": {
            "name": "doorway",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "doorway",
      "text": "\"It's true, someone is living here\", said Ruby.\n\"It seems so, let's knock on the door, maybe this person welcomed Sicomore!\", and so Esmeralda, eager to find their friend, knocked on.\n\nNo answer, but [[the door was open|open]].",
      "links": [
        {
          "text": "the door was open",
          "destination": {
            "name": "open",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "open",
      "text": "They decided to enter what it seemed to be a well furnished house, with a pair of old couches, a dusty rug, and a very big kitchen and a big boiling cauldron, and a large number of cupboards full of all sort of ingredients.\nThen they saw something, or maybe someone, near the fireplace: a big bird with black and grey feathers, a pair of wrinlky legs, and a bad treated tail.\nWhen the bird turned around, they didn't see a beak as expected, but a human wrinkly face, with small eyes hidden behind a big pair of glasses, on top of a [[long crooked nose|nose]].\n\n<img src=\"https://i.imgur.com/dVOrQ9M.jpg\">",
      "links": [
        {
          "text": "long crooked nose",
          "destination": {
            "name": "nose",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "nose",
      "text": "\"AAHH!\", shouted the bird, and so did the brothers!\n\"Goodness, you startled me\", she said, \"I didn't hear you coming in. Please, please, don't worry\", sniggered.\n\"I am Zenona and, as you can see, I'm an harpy, he he he\".\n\"An harpy? And what exactly do an harpy?\", said Esmeralda, intrigued by the appearence of the [[creature|creature]].",
      "links": [
        {
          "text": "creature",
          "destination": {
            "name": "creature",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "creature",
      "text": "\"Oh a lot of things actually, but I'm very good in the art of alchemy, he he he\".\n\"You are some kind of witch?\", asked Ruby, not thinking twice at what he said.\n\"Almost he he he, I can turn you in a frog, or in a grain of sand if you want he he he\", replied Zenona, rubbing her bony hands.\n\"Oh no thanks, I'm fine!\", promptly said Ruby.\n\"He he he... but tell me, why you came all the way here?\"\n\"Maybe you can help us, we are looking for a friend of ours, maybe [[you saw him|him]]\".",
      "links": [
        {
          "text": "you saw him",
          "destination": {
            "name": "him",
            "pid": 35
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "him",
      "text": "\"A friend you say? He he he, I didn't received many visitors lately, well you were the first in a long time...\", but seeing the long faces of the two brothers, Zenona said: \"Now, now, not everything is lost, you know? I could help you find him, or maybe my art could he he he. But I'm a bit over-the-hill and my back it's not in a good shape, he he he. Let's see here, I should have got a book full of recipes and...\", and so she staarted looking for the book all over the house, and then: \"Ah, here it is, he he he. Well... Ah, there!\"\n\"What is it?\", asked the brothers.\n\"It's all very simple, you just [[follow this recipe|recipe]] and, if you think about your missing friend very deeply while you are preparing it, you will find him he he he\".",
      "links": [
        {
          "text": "follow this recipe",
          "destination": {
            "name": "recipe",
            "pid": 36
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "recipe",
      "text": "The text was:\n\n<center>If his sight makes you happy\n\nAnd you can't wait to give him a hug\n\nBlend everything with two parts of love\n\nAnd again tied together you will be</center>\n\n\"Ok, [[let's start|start]]!\"",
      "links": [
        {
          "text": "let's start",
          "destination": {
            "name": "start",
            "pid": 37
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "start",
      "text": "After messing up a lot with the cupboards, the two brothers took:\n- a pair of gecko's eyes\n- an old pocket watch\n- two red roses\n- a dusty tie\n\nThe they dropped the ingredients into the cauldron, in order, and the slop began to change color.\nFirst it was green, then purple, blue, red and finally yellow. The cauldron then started [[to tremble and boil|boil]].",
      "links": [
        {
          "text": "to tremble and boil",
          "destination": {
            "name": "boil",
            "pid": 38
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "boil",
      "text": "\"Oh oh, maybe we did something wrong. It's going to blow up!\", said Esmeralda, in panic.\n\"He he he! He he he!\", laughed out loud the harpy, while the two brothers were going to hide behind the old couch.\n\nSuddenly, the cauldron settled, and from the soup began to rise a strain of yellow smoke. When the brothers reached the smoke, it started to \"walk\", turned around the house a few times and then entered on a creek of an old closet.\n\n\"It's here then, Sicomore was hiding in [[here|here]]!\"",
      "links": [
        {
          "text": "here",
          "destination": {
            "name": "here",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "here",
      "text": "But when they opened the closet, the smoke was wrapping some kind of blue glass piece.\n\n\"That's not Sicomore... What is it?\", said Ruby.\n\n\"I don't know, some kind of jewel it seems...\"\n\n\"He he he, that is an old crystal, found a very long time ago on this peak. I've never found an use for it, he he he, but it seems that it might be useful for your search. [[Take it|take]] with you he he he, I don't mind\".",
      "links": [
        {
          "text": "Take it",
          "destination": {
            "name": "take",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "take",
      "text": "So Esmeralda took the crystal, they thanked the lady for the help and, since the sun was setting, they decided to head back home.\n\n\"Ruby, we could stayed for the night, don't you think?\".\n\n\"Better not, what if she turned ourselves in some kind of animal?\"\n\n\"Ahahah, ok, better [[leave|quest]] then!\"\n(set: $ghiacciaio to true)",
      "links": [
        {
          "text": "leave",
          "destination": {
            "name": "quest",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "check",
      "text": "The short hallway was dark, but in the distance there was a flimsy orange light. Once they reached the end, they saw that the path was continuing downward, spiraling through the cave walls, where the light was coming from.\nSo they began their descending, with slow and calculated movements, hugging the wall trying not to fall to their doom.\n[[Halfway there|there]], an unbereable heat was rising, along with an awful smell of sulfur that was hurting their nostril.",
      "links": [
        {
          "text": "Halfway there",
          "destination": {
            "name": "there",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "there",
      "text": "What they saw at the end of the spiral path was astonishing.\n\nA huge hall carved into the rock, where lava rivers were continually flowing, magma falls and huge stalactites everywhere, all lit by a reddish light jumping between the walls.\n\nAnd merely at the center of this chamber, [[a huge creature|hugecreature]], red like the fire, covered in scales, two big wings, a pointly tail and two big necks with two big heads.",
      "links": [
        {
          "text": "a huge creature",
          "destination": {
            "name": "hugecreature",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "hugecreature",
      "text": "<img src=\"https://i.imgur.com/Vdtnx29.jpg\">\n\nThe two brothers didn't have the time to open their mouth that the monster started to catch their smell.\n\n\"Sniff... Sniff... Who goes there?\", thundered one of the heads, taking a look at the surrounding.\n\nSo Esmeralda, with a trembling voice, said: \"I am Esmeralda, and this is my brother Ruby. Are you...?\".\n\n\"What, [[a dragon|dragon]]? Yes indeed\", spoke the creature. Meanwhile the other head was waking up.",
      "links": [
        {
          "text": "a dragon",
          "destination": {
            "name": "dragon",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "dragon",
      "text": "\"We are...\", started the two, but something in the second head's voice was not right. His voice was muffled and raspy, so the first head said: \"Let me do the talk this time, would you?\".\n\"As we were saying, we are Tiro Xerxes the Third of the Dual Fire, and you are in our home, not a place for children like you\", giving a better look at the brothers.\n\n\"We...we are l-l-looking for a f-friend...\", said Ruby, clearly afraid of the dragon.\n\n\"A friend? Here?\", said the first head.\n\"The last human we hate was a very long time ago\", said the second head, with his muffled voice. And after a brief pause, just the time to see the scary look on the faces of our two protagonist, he added: \"Not worth it\".\n\"Indeed, even to this day we remember that [[stomachache|stomachache]]\".",
      "links": [
        {
          "text": "stomachache",
          "destination": {
            "name": "stomachache",
            "pid": 45
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "stomachache",
      "text": "Somewhat relevied for their lives, Esmeralda was also afraid of what she was going to ask.\n\n\"Well, our friend is not human, he is a wolf\".\n\n\"That changes everything\", said the first head, follwed by the coughing of the second head, \"this are the kind of food that we like: goats, birds, squirrels for a snack...\".\n\"Maybe he was the one that is still inside our [[throath]]\", said the second head, worrying the two brothers even more!",
      "links": [
        {
          "text": "throath",
          "destination": {
            "name": "throath",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "throath",
      "text": "\"WHAT!? You ate him?\", yelled Ruby, anymore held back by fear.\n\"Hey hey, kid, calm down, we don't know if it was your friend that we ate, it was a night snack so we didn't see very well\".\n\"The only thing we know is that it's stuck here\", said the second head, coughing.\n\"Let's do something better, shall we? You, kid, you are small enough to help us\", said the first head to Ruby, \"enter our throat, so you can see if your friend is there or not, so you can give some relief to us too\".\n\"And don't worry, we don't ate [[humans|humans]]\".",
      "links": [
        {
          "text": "humans",
          "destination": {
            "name": "humans",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "humans",
      "text": "\"Ruby, I know this is crazy but it's the only way to know if Sicomore is out there or not.\"\n\"But what if it's just an excuse to eat me?\"\n\"I don't think so, I mean if he wanted to eat us he could have already done that, don't you think?\"\n\"... Ok, maybe you're right Esmeralda\", and then he said to the dragon: \"Ok, let's see what's blocking your throat, open wide and don't play tricks on me!\"\n\"Excellent! Here...\", so the second head lay down on the ground, opening his [[big maw|maw]], letting enter Ruby.",
      "links": [
        {
          "text": "big maw",
          "destination": {
            "name": "maw",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "maw",
      "text": "Drool and spit surrounded the pointy teeth of the creature, and inside it's mouth was circulating a very bad breath.\nFurther into the cavity, the passage began to narrow, so Ruby had to crawl his way down.\nThe light that was coming behind him started to fade, but not enough to see what was giving so much trouble to the dragon.\nA [[yellow rock|yellow rock]], big enough to stick to the cavity, was there.",
      "links": [
        {
          "text": "yellow rock",
          "destination": {
            "name": "yellow rock",
            "pid": 49
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "yellow rock",
      "text": "Ruby got himself close to the rock, and started to tilt it, itching the dragon's throat... Well, one of the throats.\nThen he tought that was better to grab the rock and pull towards him, scratching the throat even more, tilting and pulling, tilting and pulling, until the rock was loose, finally in his hands.\nThen the [[voice|voice]] of his sister reached his ears.",
      "links": [
        {
          "text": "voice",
          "destination": {
            "name": "voice",
            "pid": 50
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "voice",
      "text": "\"Ruby! Quick! Get out! Get OUT!\"\nThe eyes of the second head were squinted, and the head itself was eager to move.\nSo Ruby crawled quickly outside the cavity, reaching the tongue as fast as possible. Once there, he gave a quick look behind him, seeing an orange light.\nAs soon as he [[jumped out|jump]] of the mouth, the dragon raised his second head, and spit a long stream of liquid fire, melting a couple of the stalactites on the roof!",
      "links": [
        {
          "text": "jumped out",
          "destination": {
            "name": "jump",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "jump",
      "text": "\"Oh man, that was so close!\", exclaimed Ruby, covered in drool and dirt, but safe.\n\"Finally! We are finally free of pain!\", said the two head, speaking in unison once again.\n\"Thank you, kind human. It was your friend the cause of our trouble?\", they asked.\n\"No, it was this piece of rock\", but the cleaning revealed it was not a simple rock, but a strange gem.\n\"Get that out of my sight, I don't want to even look at that\".\n\"The other thing that I saw was some kind of white hide, so fortunately it was not our friend that you ate\".\n\"Maybe a goat, or a sheep. Either way, you should feel relieved too that your friend is still [[out there somewhere|somewhere]].",
      "links": [
        {
          "text": "out there somewhere",
          "destination": {
            "name": "somewhere",
            "pid": 52
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "somewhere",
      "text": "\"Yes, we should look for him somewhere else\", said Esmeralda.\n\"And I need a bath, I'm all sticky!\", replied Ruby.\n\"Ha ha ha, yes, our mouths are not the most cleaned places as you can see, ha ha ha\".\n\nAnd after the big laugh, our heroes greeted the dragon and climbed the spiral path to reach to exit, heading home.\nThe strange gem was with them, but not their friend. Maybe we was elsewhere, in a place yet to [[discover|quest]].\n(set: $grotta to true)",
      "links": [
        {
          "text": "discover",
          "destination": {
            "name": "quest",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "home",
      "text": "The quest seems to have reached an end, and Sicomore is nowhere to be found.\nRuby and Esmeralda were tired and sad, so they decided to rest for the night, and plan a new route the next morning.\nSo they left all their belongings on the table in the living room and went to sleep.\nThey couldn't notice that the three stones that they retrieved in their journey started to [[glow|glow]].",
      "links": [
        {
          "text": "glow",
          "destination": {
            "name": "glow",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "glow",
      "text": "In the morning, when they woke up, they noticed that the crystals where hovering on the table, glowing.\n\"What kind of crystals are these?\", asked Esmeralda, cautiously looking at them.\nOn the other hand, Ruby took them in his hands. Esmeralda couldn't stop him soon enough, but nothing happened.\nUntil Ruby said something: [[\"I know where to go\"|go]].",
      "links": [
        {
          "text": "\"I know where to go\"",
          "destination": {
            "name": "go",
            "pid": 55
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "go",
      "text": "\"What? How? We searched everywhere and we didn't find him!\".\n\"I don't know, but trust me, I know where he is now!\".\n\"Ok, ok, I'll follow you, just be sure this is not some kind of trap\".\n\nThey went outside, with Ruby on the lead. He was in some kind of trance state, he was like a sleepwalker, never leaving the sight of the stones, looking not at the road.\n\n\"You know that you are scaring me, right?\".\n\"Don't worry sis, just [[follow me|follow]]\".",
      "links": [
        {
          "text": "follow me",
          "destination": {
            "name": "follow",
            "pid": 56
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "follow",
      "text": "After a series of strange cuts and turns from the main road, they arrived at what was a small beach hidden by some very thick bushes and big trees.\nOn the seaside, a wrecked galeon from the past sat there.\n\n\"Is he there? Is he inside?\".\n\"I think so, sis. We have [[found him|found]]\".",
      "links": [
        {
          "text": "found him",
          "destination": {
            "name": "found",
            "pid": 57
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "found",
      "text": "Ruby was himself again, as he put back the stones in his pockets.\nTogether they swimmed to the ship and found a way in from the right side of it.\nAs soon as they entered, the hip started to make crackling noises, waving slowly back and forth.\n\"Let's be careful, I don't want to flip this [[wreckage|wreckage]] until we have found him\", said Esmeralda.",
      "links": [
        {
          "text": "wreckage",
          "destination": {
            "name": "wreckage",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "wreckage",
      "text": "The ship had still some of the cargo boxes around, badly rotten by the sea water and full of algae, like the rest of the walls.\nThey carefully advanced when they heard some noises from upstairs. Maybe Sicomore was trapped or blocked by some old planks.\nThey quickly found the stairs leading to the deck, and once outside they opened the door of the [[captain's cabin|cabin]].",
      "links": [
        {
          "text": "captain's cabin",
          "destination": {
            "name": "cabin",
            "pid": 59
          }
        }
      ]
    },
    {
      "pid": 59,
      "name": "cabin",
      "text": "They saw him, Sicomore was there.\nBut he was in some kind of bubble, floating above the floor.\n\nThe two heroes shouted his name from the joy of seeing him, and then he barked back.\n\nBut they were not [[alone|alone]].",
      "links": [
        {
          "text": "alone",
          "destination": {
            "name": "alone",
            "pid": 60
          }
        }
      ]
    },
    {
      "pid": 60,
      "name": "alone",
      "text": "They didn't noticed that on the far right, hidden by a big chair, the captain's chair, was a strange guy, dressed in a purple robe, with a pointy purple hat. Even his eyes were purple, and he had a flaming beard, and in his left hand, a staff with a crow-shaped head.\n\n<img src=\"https://i.imgur.com/zstRlSU.jpg\">\n\n\"Who's interrupting [[my studies|studies]]?\", he shouted.",
      "links": [
        {
          "text": "my studies",
          "destination": {
            "name": "studies",
            "pid": 61
          }
        }
      ]
    },
    {
      "pid": 61,
      "name": "studies",
      "text": "\"What are you doing to Sicomore?\", shouted back Esmeralda.\n\"Ah ah ah, so this is his name then. If you had recognized me, you shouldn't have to make that question\", and after a quick look at the brothers, he continued: \"But I guess you're too young to know me and my history. So it's time for some presentations. I'm Sharkteeth, former captain of this vessel. After the shipwreck I found a magic book on this island that helped me living for [[hundreds|hundreds]] of years\".",
      "links": [
        {
          "text": "hundreds",
          "destination": {
            "name": "hundreds",
            "pid": 62
          }
        }
      ]
    },
    {
      "pid": 62,
      "name": "hundreds",
      "text": "\"But everything has a downside. To live eternally I need someone's life. Of course not every life is good, and the one of your friend here... has something... strange and... beatiful. It isn't easy this time, the old tricks doesn't work with him. He is stubborn, but me too. We'll see who's going [[to win|win]]!\"\n",
      "links": [
        {
          "text": "to win",
          "destination": {
            "name": "win",
            "pid": 63
          }
        }
      ]
    },
    {
      "pid": 63,
      "name": "win",
      "text": "\"You better free him right now, old man!\", shouted Ruby in his anger.\n\"Oh yeah? Or what?\".\nAfter those word Ruby ran towards him, and Esmeralda coudn't catch him in time.\nBut then the wizard, with a movement of his hand, created a magic vortex that trapped the two boys for a pair of second.\n\"You are too weak to do anything!\", and then the vortex flung them outside the cabin.\nAfter the brief [[fall|fall]], Ruby was in the center of the deck, while Esmeralda reached the stern of the ship.",
      "links": [
        {
          "text": "fall",
          "destination": {
            "name": "fall",
            "pid": 64
          }
        }
      ]
    },
    {
      "pid": 64,
      "name": "fall",
      "text": "Inside, while the evil mage laughed at the boys, the bubble that was trapping Sicomore weakened, letting the wolf to briefly move. He tried to bite the mage, but was still to far to even do some damage.\nBut with a whip of his tail, he reached his necklace and ripped it off his neck, throwing it outside the cabin.\n\"You barely hit me, stupid wolf. [[I'll show you]] when I'm finished with this\", and so he returned to his studies.",
      "links": [
        {
          "text": "I'll show you",
          "destination": {
            "name": "I'll show you",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 65,
      "name": "I'll show you",
      "text": "Outside, on the deck, the two boys were still unconscious.\nAfter some time, the ship rumbled for a bit, letting Ruby regain sense: \"Ouch... What was that?\", then the ship rumbled again, and crackling noises came from the cabin.\nOnce Ruby got up, he turned around and saw Esmeralda still out of senses: \"Esmeralda! Wake up!\". He then saw right where his feet were the necklace that was once of the mage.\nAfter he grabbed it, the ship rumbled for one last time, then the cabin's roof blew up, and [[a beam of light]] came out instead.",
      "links": [
        {
          "text": "a beam of light",
          "destination": {
            "name": "a beam of light",
            "pid": 66
          }
        }
      ]
    },
    {
      "pid": 66,
      "name": "a beam of light",
      "text": "Sharkteeth rose in the beam of light with Sicomore still in his bubble, laughing maniacally.\n\"YES! YES! Finally I will live for thousands of years again!\"\n\"Leave him alone!\", shouted Ruby, but it was useless. Then he noticed that the stones in his pockets were shining and vibrating a bit.\n\"What's this now?\"\nWith his free hand took the stones, and saw that only two of them were with him. Nonetheless he moved close the stones with the [[necklace]].",
      "links": [
        {
          "text": "necklace",
          "destination": {
            "name": "necklace",
            "pid": 67
          }
        }
      ]
    },
    {
      "pid": 67,
      "name": "necklace",
      "text": "There were three free slots, and they had the shape of the three stones.\nHe then put the two stones in their slots, and the necklace started vibrating too.\n\"Where is the last one?\", so he looked towards Esmeralda, and saw that the third crystal was near her.\n\"Esmeralda! Come on, wake up!\", he was shouting while walking to where she was.\nSharkteeth saw the kid moving, then he noticed the light that the necklace was emitting.\nWith a small laugh, [[he moved his hand]].",
      "links": [
        {
          "text": "he moved his hand",
          "destination": {
            "name": "he moved his hand",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 68,
      "name": "he moved his hand",
      "text": "He created a bubble around Ruby, and lifted him near Sicomore, many feet above the ground.\n\"What are you trying to do, little pest? You won't ruin my long life experiment! Quit wasting my time, and see what I will become!\"\nIn the meantime, Esmeralda woke up. When she opened her eyes, she saw the sky first, then Ruby, Sicomore and Sharkteeth in the air.\n\"RUBY! SICOMORE! Ouch, my leg!\"\nLooking her leg make her see the third stone, glowing. So she took it, and then slowingly moving [[where the action was]].",
      "links": [
        {
          "text": "where the action was",
          "destination": {
            "name": "where the action was",
            "pid": 69
          }
        }
      ]
    },
    {
      "pid": 69,
      "name": "where the action was",
      "text": "Approaching the scene, she saw the strange light in Ruby's hand: \"Ruby! Can you hear me?\", shouted.\n\"Argh, hey sis! Stand back or he will trap you too! Go back and find the other AAAARGH!\"\n\"Shut up, pest! I'm trying to concentrate here!\".\n\"The other what? What does he want? Oh, [[the stone!]]\"",
      "links": [
        {
          "text": "the stone!",
          "destination": {
            "name": "the stone!",
            "pid": 70
          }
        }
      ]
    },
    {
      "pid": 70,
      "name": "the stone!",
      "text": "\"Ruby! Ruby!\"\n\"What?\"\n\"I have it! Catch!\"\nEsmeralda threw the crystal at Ruby's bubble, and it passed through the shield, right in the hand of Ruby.\nThe mage was too busy to even see that Ruby has finished assembling the necklace. When he turned his look to the boy, [[it was too late]].",
      "links": [
        {
          "text": "it was too late",
          "destination": {
            "name": "it was too late",
            "pid": 71
          }
        }
      ]
    },
    {
      "pid": 71,
      "name": "it was too late",
      "text": "With the completed necklace in his hand, Ruby was again in trance.\n\"What are you going to do, kid? This is none of your business! You can't just play magic not knowing the consequences\".\n\"It doesn't matter. I will free my friend whatever it takes\".\n\"You are a fool! You will be...\", the mage wasn't able to finish his phrase when Ruby trapped him in a bubble smaller than the others, [[muting the mage]], only with a movement of his hand.",
      "links": [
        {
          "text": "muting the mage",
          "destination": {
            "name": "muting the mage",
            "pid": 72
          }
        }
      ]
    },
    {
      "pid": 72,
      "name": "muting the mage",
      "text": "He then freed Sicomore and himself, landing softly on the deck.\nSharkteeth was still in his bubble, trying to speak and to warn the kid.\nBelow, Sicomore ran towards Esmeralda, helping her walk closely to Ruby.\n\"Ruby, what did you do? How did you do it?\"\n\"I don't know, I just wanted to make him shut up and free us, and I did it!\"\n\"What are you going to do with Sharkteeth then? Are you going to leave him just like that?\"\n\"No sis... I think [[I have an idea]]\".",
      "links": [
        {
          "text": "I have an idea",
          "destination": {
            "name": "I have an idea",
            "pid": 73
          }
        }
      ]
    },
    {
      "pid": 73,
      "name": "I have an idea",
      "text": "Pointing the thumb and the index to the mage, framing the picture, Ruby started closing the fingers. The bubble started shrinking too!\nAnd so, he brought his fingers more closely, and more closely, and more closely, until they were united. And the mage [[disappeared]].",
      "links": [
        {
          "text": "disappeared",
          "destination": {
            "name": "disappeared",
            "pid": 74
          }
        }
      ]
    },
    {
      "pid": 74,
      "name": "disappeared",
      "text": "\"Wow, that was... I don't know\", said Ruby. He then looked to the necklace but it wasn't glowing anymore.\nAfter that, with no more dangers around, the boys and their friend finally hugged each other.\nIt was a bit difficult to reach home again, with all the bruises and wounds, but at the night they were safe again, together again, together happy.\n\n[[The End]]",
      "links": [
        {
          "text": "The End",
          "destination": {
            "name": "The End",
            "pid": 75
          }
        }
      ]
    },
    {
      "pid": 75,
      "name": "The End",
      "text": "\nThank you for reading this short story!\n\nA big thank you to Tetta and Gerry for making the wonderful drawings that you saw and for being two lovely children.\n\nA special thank you to Sabry, my muse.\n\n\nIf there's any problem with the text or the images, or anything that you want say to me, feel free to contact me.",
      "links": []
    }
  ]
}