{
  "passages": [
    {
      "pid": 1,
      "name": "fur is soft",
      "text": "As you wake up you realize you're still in the middle of the monsters, a sort of honourary member of their pride.\\n\\nYou stand, hesitantly, trying to make sure the drug is out of your system, and are relieved when you're successful.\\n\\n[[You feel eyes on you]], and turn around. A man sits in the middle of the pride, watching. Waiting. Predatory.\\n\\nYou notice that you still have your knife.",
      "links": [
        {
          "text": "You feel eyes on you",
          "destination": {
            "name": "You feel eyes on you",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "door, light on",
      "text": "You look at the malfunctioning wall and move away from it. With the nanites on the fritz, anything could happen near that wall. It's inevitably safer to continue on through the door.\\n\\nWhen you get through the door slams <b>shut</b> behind you, a clang echoing off throughout the room.\\n\\nThe light turns off. You huddle into yourself a little, cold. A stark light shines into your face, and you look up, realizing that there's been a mistake. Only this time, you made it.\\n\\nYou back at the beginning. The [[Start]] of it all. You hear the voice begin to speak, and try not to let despair crash over you, just as the nanites start to cling to your skin. \\n\\nBrushing them off does nothing, as they melt into you, rewiring your brain, forcing you to forget, to lose everything and return. Back to the [[mistake]].",
      "links": [
        {
          "text": "Start",
          "destination": {
            "name": "Start",
            "pid": 69
          }
        },
        {
          "text": "mistake",
          "destination": {
            "name": "mistake",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "tap it",
      "text": "A chair materializes next to the desk. The glass turns black, turns to static and comes back clear.\\n\\n[[Text appears on the screen]]\\n\\n",
      "links": [
        {
          "text": "Text appears on the screen",
          "destination": {
            "name": "Text appears on the screen",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "paper",
      "text": "You return to the paper, expecting to find it filled with words as before.\\n\\nIt seems to have rewired itself. It simply says [[FLY]] on it, big capital letters highlighted with colour.\\n\\nYou consider, however, the [[box]] again. \\n\\n",
      "links": [
        {
          "text": "FLY",
          "destination": {
            "name": "FLY",
            "pid": 35
          }
        },
        {
          "text": "box",
          "destination": {
            "name": "box",
            "pid": 55
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "sleep",
      "text": "You sense the door open, but it's quiet enough not to bother you.\\n\\nA moment passes as you wake yourself a little. You pause, as you note that there's a weird sort of silence in the room. Obviously someone is in the room, but they're not letting you know that. \\n\\nSuddenly, all you know is [[pain]] as you [[give into darkness]].",
      "links": [
        {
          "text": "pain",
          "destination": {
            "name": "pain",
            "pid": 112
          }
        },
        {
          "text": "give into darkness",
          "destination": {
            "name": "give into darkness",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "ready to go",
      "text": "You stand with a wince, but realize that what the twins gave you actually helped. You walk after them, looking back at what was your home for the last few decades. A sleep POD with tubes hanging out of it and grime everywhere. The other PODs are empty, most have been shattered and some seemed to have failed.\\n\\nYou try not to think of how close you were to that fate.\\n\\n\"Doc, you may want to hurry up a bit. We're on a bit of a deadline here.\"\\n\\nThey usher you outside of the building to the first fresh air you've had in over two decades. Disappointingly, the air is stagnant. You'd hope for something a little more <i>fresh</i> after a few decades of being in a cage.\\n\\nThe girl, <i>Kiara</i> your mind prompts, because it's used to reminding you about names, puts the sphere down.\\n\\n\"And now, doc, is time for the [[fireworks]].\"\\n\\n",
      "links": [
        {
          "text": "fireworks",
          "destination": {
            "name": "fireworks",
            "pid": 86
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "stepping",
      "text": "Stepping out of the way is easier said (or thought) than done. \\n\\nThe Knight, after all, seems keen to eviscerate you. Though, to be honest, there's no real cause for it. You just walked up to their throne room.\\n\\nEvisceration is not about making friends.\\n\\nYou take a step back, and to the side, but the Knight is always there, a swip away, and inches from your face with the sword. This is disconcerting, but you're pretty sure you can hear her laughing.\\n\\nFinally, the Knight pauses, and takes off her helm. \"Ah, Jester. You have appeared. The Queen was right to call for you, you offer much in the way of entertainment.\"\\n\\nIn fact, you are not a jester, obviously. The Knight isn't real, either, but they obviously want you to learn something. You can [[go along with it]] or try and [[dissuade the knight]]. Who knows if she'll believe you though.",
      "links": [
        {
          "text": "go along with it",
          "destination": {
            "name": "go along with it",
            "pid": 83
          }
        },
        {
          "text": "dissuade the knight",
          "destination": {
            "name": "dissuade the knight",
            "pid": 122
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "giant hole",
      "text": "The hole slowly fills itself in, as if the floor was made of a sort of clay-like polymer. As it builds itself up, it also adds a unique feature to the room.\\n\\nA table. With a chest on it.\\n\\nA locked chest, should you be at all discerning.\\n\\nAs you examine the chest you note it is decidedly, well, dull looking. A sleek black box, with lines on it to imitate the lines of an older box, but is primarily very similar to any other box - with with a built in expansion point.\\n\\nIt doesn't, however, have an obvious [[opening]].",
      "links": [
        {
          "text": "opening",
          "destination": {
            "name": "opening",
            "pid": 50
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "new room",
      "text": "Walking into the new room is surreal. The nanites  follow you into the room, and force slow change around you. \\n\\nSteel walls turn from exposed duct with no light (how far underground are you?) to castle walls, turrets, and... grass.\\n\\nKnowing that the nanites can make everything seem real isn't enough to stop you from touching the grass. Yup, feels like some grade-A Earth grass. Good show, nanites.\\n\\nYou pause for a moment, contemplating. If this is rehabilitation it looks like it's going to be easy.\\n\\nYou hear a [[smashing sound]] to the east. Otherwise, you could just [[not move]]. Seems the easiest, really.",
      "links": [
        {
          "text": "smashing sound",
          "destination": {
            "name": "smashing sound",
            "pid": 46
          }
        },
        {
          "text": "not move",
          "destination": {
            "name": "not move",
            "pid": 108
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "another room",
      "text": "You land in the softest floor you have ever been on.\\n\\nYou also land mostly head first, and end with a mouth full of feathers.\\n\\nYou try not to be confused about that. It's obviously an error.\\n\\nAs you stand up, awkwardly, the floor is, after all not entirely stable, you notice words floating in the middle of the room.\\n\\n<s>The Case.</s>\\n<<if visited(\"The Monsters.\")>><s>The Monsters.</s><<else>>[[The Monsters.]]<<endif>>\\n<<if visited(\"The Deal.\")>><s>The Deal.</s><<else>>\\n[[The Deal.]]<<endif>>\\n<<if visited(\"The Castle.\")>><s>The Castle.</s><<else>>[[The Castle.]]<<endif>>\\n\\n<<if visited(\"The Deal.\", \"The Castle.\", \"The Monsters.\", \"The Case.\")>>\\s\\nThis was all a [[mistake]].\\n<<endif>>",
      "links": [
        {
          "text": "The Monsters.",
          "destination": {
            "name": "The Monsters.",
            "pid": 113
          }
        },
        {
          "text": "The Deal.",
          "destination": {
            "name": "The Deal.",
            "pid": 29
          }
        },
        {
          "text": "The Castle.",
          "destination": {
            "name": "The Castle.",
            "pid": 116
          }
        },
        {
          "text": "mistake",
          "destination": {
            "name": "mistake",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "Judgement",
      "text": "You are ushered into an empty space. \\n\\nDead space. Unlike the rest of the facility so far, it is stark. Glass and stainless steel. The smell of antiseptic hits your nose as you walk closer.\\n\\nAs you near the center of the room, a light shines in your eye.\\n\\n<b>\"Prisoner. You have been convicted of crimes against the Republic.\"</b> You attempt to ignore what the voice is saying, and sort out where it is coming from. Perhaps there's someone behind the controls after all.\\n\\nThere's no obvious place for it to be coming from. The empty room is still empty, but the smell of antiseptic is getting stronger.\\n\\nYou sputter a few times, before you finally proclaim your  [[innocence]]. \\n\\nOf course, a ping comes up for you, you could [[agree to be rehabilitated]].",
      "links": [
        {
          "text": "innocence",
          "destination": {
            "name": "innocence",
            "pid": 53
          }
        },
        {
          "text": "agree to be rehabilitated",
          "destination": {
            "name": "agree to be rehabilitated",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "bright light",
      "text": "You raise your hand up a little, trying to mitigate the pain a little, only to discover that, no, that does very little to stop the light from getting into your eyes, thank you very much.\\n\\nYou feel like you should be able to [[complain]] to someone about the conditions here, but the light suddenly switches off, leaving you blinking, and forcing you to realize that you're stuck.\\n\\nIn a [[locked room]].",
      "links": [
        {
          "text": "complain",
          "destination": {
            "name": "complain",
            "pid": 23
          }
        },
        {
          "text": "locked room",
          "destination": {
            "name": "locked room",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "prison",
      "text": "The prison isn't so bad, as prisons go.\\n\\nOr, you think. It's not so easy to tell.\\n\\nThe cell is long and high, with a bunk made of straw. You could [[lie down]], but there's no guarantees there's not bugs - even nanite bugs will bite, and that's not a pleasant thought for anyone.\\n\\nYou try to [[shout for the guard]] but there's no answer right away. \\n\\n",
      "links": [
        {
          "text": "lie down",
          "destination": {
            "name": "lie down",
            "pid": 100
          }
        },
        {
          "text": "shout for the guard",
          "destination": {
            "name": "shout for the guard",
            "pid": 120
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "wake up",
      "text": "You wake, sitting in a room, surrounded by children.\\n\\nNo, not children. The sound of children, but just a slowly pixalating cloud, as if the nanites forgot what they were supposed to be doing.\\n\\nYou hear a hum, and shake your head, but then you realize that there's a woman talking. She is speaking, quickly. Like she only has so much time to get your attention. You [[listen to her]]",
      "links": [
        {
          "text": "listen to her",
          "destination": {
            "name": "listen to her",
            "pid": 110
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "StoryTitle",
      "text": "Unform",
      "links": []
    },
    {
      "pid": 16,
      "name": "green-skinned",
      "text": "<font color=red><font size=7>ERROR</font></font>\\n\\nYou try not to panic. Then, calm as the letters move off.\\n\\n[[Text appears on the screen]].",
      "links": [
        {
          "text": "Text appears on the screen",
          "destination": {
            "name": "Text appears on the screen",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "lure",
      "text": "You consider the room, and look at what could possibly be considered a lure for the keymouse.\\n\\nThe [[box]] may work, but it looks heavy. Otherwise, there's still the [[paper]], which has, oddly, floated towards you.",
      "links": [
        {
          "text": "box",
          "destination": {
            "name": "box",
            "pid": 55
          }
        },
        {
          "text": "paper",
          "destination": {
            "name": "paper",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "stay here",
      "text": "You stay in the room. \\n\\nYou pace around the room. Walk through the light. Walk through the letters, which waver as you move through them.\\n\\n<b>\"Prisoner 11012.\"</b> The Voice says, clearly irritated. It takes a lot to irritate a pre-programmed voice. That's an exciting thing to learn that you <i>still have it</i>. You try not to think of what kind of crime could have landed you wherever you are. You are, quite obviously, irritating.\\n\\n<b>\"You will continue to the [[new room]] or we will assume you wish to face [[Judgement]].\"</b>\\n\\nIt's strange to hear the capitalization as it talks, but you know this would be the end of the line for you. You can play their game, and discover who you were, or you can go out in the flames of Angrial, give the Voice Above a two-fingered salute (the rudest gesture known to Galaxy-kind, though only 2.5% of the Galaxy can actually perform it right, and you're pretty sure you're not one of that percentage. It takes some skill to master the two-fingered salute).",
      "links": [
        {
          "text": "new room",
          "destination": {
            "name": "new room",
            "pid": 9
          }
        },
        {
          "text": "Judgement",
          "destination": {
            "name": "Judgement",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "reject",
      "text": "<b>|Prisoner.\\n\\nYou have rejected rehabilitation. We are sorry for your choice.\\n\\nYou have chosen to be taken to [[Judgement]]. May the gods protect you.\"</b>",
      "links": [
        {
          "text": "Judgement",
          "destination": {
            "name": "Judgement",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "give into darkness",
      "text": "You feel the start of a jolt go into you. \\n\\nThe jolt is <i>searing</i> pain. You pull yourself to your feet, slowly, carefully - every inch a battle, every movement hard won.\\n\\nYou open your eyes and see a humanoid nanite creature above you. It moves its arm and <i>stabs</i> into you, connecting nanite and tissue and for a moment, you are one with it.\\n\\nYou give in to the pain, and accept what it offers.\\n\\nEverything goes dark. Dark, and welcome and part of an ordered whole. You are flying and still. Everything is more clear than before <i><font color=white>but my eyes are closed, there should be something hereherehere</font></i> this all started.\\n\\nYou feel a thump. Everything is muzzy, and hazy. You open your eyes. <i><font color=white>ordidi?<i></font>\\n\\nThe voices are real, and familiar. \"Gave too much of the ol' medicine, I think. Some might call it...\" the voice fades out, like the sea leaving the shore. \"I'd say we made a mistake, right as any ever done...\"\\n\\nYou finally hear the slight <font color=red>beep</font> of the machine. The pain fades and you notice that the beeping is slowing down.\\n\\nIt gets harder and harder to think. A moment goes by. Another. And then, blessed quiet. And nothing at all.\\n\\n<i><font color=white>It was always better alone.</font></i>\\n\\nYou have died.  Re[[Start]]?",
      "links": [
        {
          "text": "Start",
          "destination": {
            "name": "Start",
            "pid": 69
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "shake your head",
      "text": "You shake your head, and he smiles.\\n\\n\"Welcome, friend. I am glad to see you have forgone the path of violence.\" You nod, confused. \\n\\nThe man is outfitted richly, with a form fitting suit, all crisp edges and shining shoes. If you guess correctly they might even be made out of iridiam.\\n\\nHe points to the monsters, and they transform, slowly, into people of all kinds, their eyes and hair all of varying hues. \\nSeeing in each of them the full spectrum of the rainbow - something popular amongst the <i>skirui</i> if you remember correctly - makes you happy. Of course you have no idea who, exactly, the skirui were, so that may not be helpful. They are all in raggedy clothing. They seem happy, but you can see something underlying. A hunger, a wish for connection. The man ignores them.\\n\\n\"Of course, it is best if we keep our people in the right places, is it not so?\" The man offers his [[hand]] to you.  \\n\\nOne of the Monsters, now a young woman, smiles a tentative smile, and [[you go to her]].",
      "links": [
        {
          "text": "hand",
          "destination": {
            "name": "hand",
            "pid": 114
          }
        },
        {
          "text": "you go to her",
          "destination": {
            "name": "you go to her",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "the ground",
      "text": "You wake with a start, a pounding headache and a wish you could get a sympt stick to get rid of the pain.\\n\\nThose, it would seem, are not likely to appear.\\n\\nAs you get up, you realize you're in the middle of the beasts, surrounded on all sides by the monsters. You tremble, confused as to why you're here.\\n\\n[[You feel eyes on you]] and turn around, startled.",
      "links": [
        {
          "text": "You feel eyes on you",
          "destination": {
            "name": "You feel eyes on you",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "complain",
      "text": "\"Oi!\" You call it to the faded ceiling, looking at peeling paint, because, quite honestly, you're not sure where else to yell.\\n\\n\"It'd be a bit nicer if you didn't try to blind me,\" You mutter it, feeling a little foolish.\\n\\nThe ceiling, being indifferent to your suffering, ignores you. \\n\\nAfter a suitable amount of time you realize that, really, you're still in a [[locked room]].",
      "links": [
        {
          "text": "locked room",
          "destination": {
            "name": "locked room",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "No.",
      "text": "Well, if the screen was going to put it that way.\\n\\nYou tap no, decisive, and find a the screen clears. [[Text appears on the screen]].",
      "links": [
        {
          "text": "Text appears on the screen",
          "destination": {
            "name": "Text appears on the screen",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "TestSheet Format",
      "text": "html {\\n  background: [img:[background]] fixed, dodgerblue;\\n  background-size: cover;\\n  min-height: 100%;\\n  height:100%;\\n}\\nbody {\\n  background-color: black;\\n  background-attachment: fixed;\\n  margin: 0;\\n  padding: 0% 15% 0% 5em;\\n  font-size: 100%;\\n  font-family: Oxygen, \"Century Gothic\", sans-serif !important;\\n  font-weight: 300;\\n  min-height: 100%;\\n}\\n#sidebar, #passages {\\n  padding-top: 4em;\\n  padding-bottom: 0em;\\n}\\n#passages {\\n  margin-left: 60%;\\n  width: 50%;\\n  min-height: 100%;\\n  padding-bottom: 0;\\n  margin-bottom: 0;\\n  border: 0;\\n}\\n#passages::before {\\n  border-left: 3px solid rgba(255,255,255,0.2);\\n  position:fixed;\\n  height:100%;\\n  left: 50%;\\n  top:0;\\n  content:'';\\n}\\n.passage {\\n  margin: 0px;\\n  color: white;\\n  opacity: 0.7;\\n  font-size: 100%;\\n  text-align:justify;\\n  margin:auto;\\n  padding: 0px 0px 5em 0px;\\n}\\n.passage a {\\n  color: #blue;\\n  opacity: 1;\\n}\\n.passage a:hover {\\n  color: white;\\n  text-decoration: none;\\n  border-bottom: 1px white solid;\\n}\\n.passage a:visited {\\n  color: #blue;\\n}\\n#sidebar {\\n  left: 1em;\\n  width: 50%;\\n  font-family: \"Alegreya Sans\",\"Century Gothic\",sans-serif !important;\\n}\\n#sidebar li {\\n  color: white !important;\\n  text-align: center;\\n  opacity: 0.3;\\n}\\n#sidebar #storyTitle {\\n  font-size: 4em;\\n  line-height:0.8em;\\n}\\n#sidebar > :not(.storyElement) {\\n  display:none;\\n}\\n/* Shrink the page when viewed on devices with a low screen width */\\n@media screen and (max-width: 1600px) {\\n  .passage, #sidebar { font-size: 90%; }\\n}\\n@media screen and (max-width: 1200px) {\\n  #sidebar { font-size: 70%;}\\n  .passage { font-size: 85%;}\\n}\\n@media screen and (max-width: 960px) {\\n  #passages::before { display:none; }\\n  #sidebar { position: relative; width: 100%;}\\n  #passages { margin: 0; padding: 5%; width: 90%; border: 0; }\\n}\\n\\t\\n}",
      "links": []
    },
    {
      "pid": 26,
      "name": "go back to sleep",
      "text": "It's a lot of effort, remembering. Doing all of these things. It's hard, too, to force yourself to continue the fight.\\n\\nThe rebels didn't exactly recruit you, really. There's only so much that you can do, and it's been a really long day.\\n\\nIt might be better to go back to sleep. [[Start]] over again, and fight another day.\\n\\nNo, you stop yourself. You can still do it. You force yourself to think. To stop. [[Wake up]] and smell reality.",
      "links": [
        {
          "text": "Start",
          "destination": {
            "name": "Start",
            "pid": 69
          }
        },
        {
          "text": "Wake up",
          "destination": {
            "name": "Wake up",
            "pid": 102
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "gender",
      "text": "<font color=red><font size=7>ERROR</font></font>\\n\\nYou try not to panic. Then, calm as the letters move off.\\n\\n[[Text appears on the screen]].",
      "links": [
        {
          "text": "Text appears on the screen",
          "destination": {
            "name": "Text appears on the screen",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "investigate",
      "text": "You rush toward the wall, ignoring the door. The <font color=red>spurtz</font> gives off a few more sparks before dying out completely. The walls fades, turning itself off in a cascade of static.\\n\\nThe wall reveals itself for the first time. Rusted metal shows its age, and the wall itself looks to have been repaired multiple times.\\n\\nA plaque on the wall reads\\n\\n<i>Property of the Republic of Sihiar. Unauthorized access will be severely punished. If this is visible please call for immediate aid. Do not try to escape. We see all, we know all.</i>\\n\\nThe panel, on the other hand, is still on, though the surge seems to have died down. It's obvious that this facility hasn't seen this much use in years.\\n\\nAs you reach in to touch one of the controls a spark hits your hand and you scream out in pain.\\n\\nThen, you [[remember]].\\n\\n \\n\\n",
      "links": [
        {
          "text": "remember",
          "destination": {
            "name": "remember",
            "pid": 119
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "The Deal.",
      "text": "The door opens into a bland room, filled with one desk.\\n\\nYou walk in, looking at the clean white lines and glass desk. \\n\\nYou wander toward the desk and [[tap it]].",
      "links": [
        {
          "text": "tap it",
          "destination": {
            "name": "tap it",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "intent on smashing",
      "text": "You smash the box down, smashing the camera in front of you.\\n\\nYou grimace. The broken camera seems to fall everywhere, with more pieces than you anticipated.\\n\\nYou glare upwards, hoping that whomever might be viewing this charade may be pleased.\\n\\nYou functioned as the lab rat, did you not?\\n\\nA [[hissing]] sound fills the room, and you realize you may have made a grave mistake.",
      "links": [
        {
          "text": "hissing",
          "destination": {
            "name": "hissing",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "night",
      "text": "<font color=red><font size=7>ERROR</font></font>\\n\\nYou try not to panic. Then, calm as the letters move off.\\n\\n[[Text appears on the screen]].",
      "links": [
        {
          "text": "Text appears on the screen",
          "destination": {
            "name": "Text appears on the screen",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "standing still",
      "text": "The knight stops in front of you. You can hear the knight breathing hard.\\n\\nFinally she takes her helmet off, and looks down at you.\\n\\n\"Well done.\" She ushers you toward the far room, where the other Knights stand. \"The Queen will wish an [[audience]].\"",
      "links": [
        {
          "text": "audience",
          "destination": {
            "name": "audience",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "accept the knife",
      "text": "You accept the knife, and the man sighs, patronizingly. Much as one might to a slight child.\\n\\n\"It is sad, I think, when we cannot teach our young properly.\"\\n\\nHe sighs, and touches your forehead, forcing you to the ground, screaming in pain.\\n\\n\"It is especially difficult because you will have to discover it all again.\" You shudder as your mind is wiped, the memories there destroyed. \\n\\n\"Come,\" the man whispers, sadly. \"[[Yes]], you must start again.\"\\n\\nYou shudder, and shake, the man's gentle caress destroying your sense of self, your memories. Your mind rebels, and you collapse against the ground, consciousness fleeing.\\n\\nWhen you wake, you find yourself in an empty room. \"[[Yes]],\" you whisper. Confused, but it is time to discover why you are here. Again.",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "Yes",
            "pid": 118
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "You feel eyes on you",
      "text": "The man stands, walks toward you, smiling.\\n\\nHe reaches out, and grabs the knife from your pocket. \\n\\nHe holds the knife back to you, his smile oddly predatory. You could take and [[accept the knife]], as it is your only weapon. When you move toward the knife, you spot a flicker of disappointment in his eye.\\n\\nThough it might be less safe, you could also [[shake your head]], and give up the knife.",
      "links": [
        {
          "text": "accept the knife",
          "destination": {
            "name": "accept the knife",
            "pid": 33
          }
        },
        {
          "text": "shake your head",
          "destination": {
            "name": "shake your head",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "FLY",
      "text": "You look at the paper for a moment, confused. The word seems raised - a brief moment in time marked, for the moment, with a glowing light.\\n\\nYou gently caress the words. You feel your feet rise off the ground, and pause, for a moment enjoying the sensation.\\n\\nA memory tries to flood back, of the first time you went in space, of the first time you almost threw up in space moments later, but it's like a dream. Indistinct. Not yours. Not unpleasant, but odd. \\n\\nThe moment passes and you realize that the keymouse is beside your head. It attempts to float off, but, not built for a life without gravity it simply floats impotently away, close enough for you to grab it.\\n\\nYou try not to dwell on the obvious metaphor and unlock the box.\\n\\nInside, you see [[another room]], clean, sterile and, oddly, the floor seems to be made out of pillows.\\n\\nThis suddenly makes a lot more sense as you tumble head first toward it.",
      "links": [
        {
          "text": "another room",
          "destination": {
            "name": "another room",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "313",
      "text": "The [[numbers]] reset.",
      "links": [
        {
          "text": "numbers",
          "destination": {
            "name": "numbers",
            "pid": 99
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "StorySubtitle",
      "text": "Find Judgement.",
      "links": []
    },
    {
      "pid": 38,
      "name": "11058",
      "text": "You tap, nervously, on 11058.\\n\\nYou don't really know anything about who, or what 11058, might be, but if it will help you leave the scenario, you are willing to chance it.\\n\\nMore text comes up in front of you. This time, with pictures.\\n\\nThree people, quite distinct, face you. \\n\\nThe text flashes up. \\n\\n<font color=blue> What Does Prisoner 11058 Look Like?</font>\\n\\nNow, you don't know, but that doesn't mean that has to stop you.\\n\\nA [[redhead]], <<print either(\"looks the part of the holoseries heroines, tall, spunky, and ready with a laserpistol at a moment's notice.\", \"sports a mohawk and a lot of piercings.\", \"smartly dressed, and ready for war.\")>>\\n\\nThe other, with hair like [[night]], <<print either(\"his dark skin covered in metallic tattoos.\", \"her almond-shaped eyes glowing with inhuman circuitry.\", \"bored-looking, and easily forgettable.\")>>\\n\\nFinally, a broadly pierced face appears, of indeterminate [[gender]]. <<print either(\"The teeth, however, are cruely sharpened.\", \"You count over sixty types of studs and are thankful for your lack of augmentation.\", \"The rainbow eyebrows were a nice touch.\")>> ",
      "links": [
        {
          "text": "redhead",
          "destination": {
            "name": "redhead",
            "pid": 89
          }
        },
        {
          "text": "night",
          "destination": {
            "name": "night",
            "pid": 31
          }
        },
        {
          "text": "gender",
          "destination": {
            "name": "gender",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "Amuse me.",
      "text": "You take a breath, and really take in the Queen. For a nanite creation she really is quite beautiful. A work of art, one might say - flawless skin, and eyes like gems. Multi-coloured gems, which might throw some off, but she's supposed to represent, if the flash of memory is correct, the royalty of Arzon IV.\\n\\nA fine time for history, if you liked colonialism.\\n\\nYou smile, baring your teeth. \"Why, your majesty, I would love to amuse you. But, tell me, how much amusement can I truly do with such a large [[audience]]?\" Arzon IV was known for its hedonistic pleasures. Also its slaves, but you were never one to judge success.\\n<<if visited(\"mrthalis\")>><br><<else>>\"Of course, one might like a running of the [[mrthalis]] instead?\"<<endif>>\\n",
      "links": [
        {
          "text": "audience",
          "destination": {
            "name": "audience",
            "pid": 48
          }
        },
        {
          "text": "mrthalis",
          "destination": {
            "name": "mrthalis",
            "pid": 70
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "run",
      "text": "You run off, in a direction you think you heard the scream came from.\\n\\nRunning in sand is not as easy as you thought it might be, or you aren't as in shape as you once thought. \\n\\nYou hear the scream again, and [[run off]], haring into the desert. \\n\\nAs you run, you pause, and realize that maybe it would be better to just stop. [[Standing here]] isn't so bad, and maybe this one will end faster.",
      "links": [
        {
          "text": "run off",
          "destination": {
            "name": "run off",
            "pid": 95
          }
        },
        {
          "text": "Standing here",
          "destination": {
            "name": "Standing here",
            "pid": 85
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "hissing",
      "text": "The hissing sound gets louder, and you detect a slight smell in the air - acrid, with the hint of jasmines.\\n\\nIt's weirdly pleasant, and you find yourself breathing deeper, taking it in.\\n\\nAfter another moment, you find yourself wanting to sleep. You lie down on the ground, which is now so <i>comfortable</i>.\\n\\nYou [[close your eyes]].",
      "links": [
        {
          "text": "close your eyes",
          "destination": {
            "name": "close your eyes",
            "pid": 97
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "locked room",
      "text": "You look around the room, and notice two things.\\n\\nOne, there's a piece of paper on a table, with, what appears to have some words, though you can't quite [[read it]] from here.\\n\\nOtherwise, you notice that there's a combination of [[numbers]] along the wall.",
      "links": [
        {
          "text": "read it",
          "destination": {
            "name": "read it",
            "pid": 117
          }
        },
        {
          "text": "numbers",
          "destination": {
            "name": "numbers",
            "pid": 99
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "nothing",
      "text": "You offer nothing, and sit back, certain of your choice.\\n\\nSlowly the words fade off the screen.\\n\\nAre you certain of your choice?\\n\\n[[Yes.]]\\n[[No.]]",
      "links": [
        {
          "text": "Yes.",
          "destination": {
            "name": "Yes.",
            "pid": 64
          }
        },
        {
          "text": "No.",
          "destination": {
            "name": "No.",
            "pid": 24
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "run away",
      "text": "You keep running, the sounds of the breaths behind you coming faster, and faster. You're not sure how much longer you can [[keep running]].\\n\\nYou notice a torch hanging, near a cave. As you near the entrance to a cave, you realize you could hide in there, just as easily as running. You stop and [[hide]], hoping the monsters have backed off enough to lose your scent.\\n\\n",
      "links": [
        {
          "text": "keep running",
          "destination": {
            "name": "keep running",
            "pid": 61
          }
        },
        {
          "text": "hide",
          "destination": {
            "name": "hide",
            "pid": 45
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "hide",
      "text": "Hiding seems like the best option. You find a rock and push yourself against it. The warmth of the sand is oddly inviting, leaving you considering sleep...\\n\\nYou rock yourself awake after a moment, feeling nanites swarming against you, like little grains of sand. You try and stop them, but they'll have none of it. They slowly lull you back to sleep, forcing your eyes to shut. \\n\\nYou hear murmuring around you. You slowly open your eyes and [[wake up]].",
      "links": [
        {
          "text": "wake up",
          "destination": {
            "name": "wake up",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "smashing sound",
      "text": "Going toward danger always did seem the best option. Every single time.\\n\\nYou rush off down the corridor, trying not to rationalize how the small room turned into a large castle, and find yourself in the middle of the throne room.\\n\\nDecadent can't cover what the throne room actually looks like. You know it's not real, but that doesn't stop the temptation to [[take]] a piece or two. Maybe sticky fingers is what got you into this mess, but execution-by-nanite isn't exactly a normal response to petty theft.\\n\\nOr regular old theft for that matter.\\n\\nIn the back of your mind you realize you [[shouldn't know that]], but there's only so much thinking you can do, because there's a man in armour, and a sword (<i>a knight</i> a vague part of your brain reminds you, the sense of a quiet classroom coming with it) is rushing at you, and [[stepping]] out of the way may be the best plan.\\n\\n\\n<font color=\"f8f8f8\">Or maybe, it's all a mistake.</font>\\n\\n",
      "links": [
        {
          "text": "take",
          "destination": {
            "name": "take",
            "pid": 107
          }
        },
        {
          "text": "shouldn't know that",
          "destination": {
            "name": "shouldn't know that",
            "pid": 71
          }
        },
        {
          "text": "stepping",
          "destination": {
            "name": "stepping",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "839",
      "text": "The [[numbers]] reset.",
      "links": [
        {
          "text": "numbers",
          "destination": {
            "name": "numbers",
            "pid": 99
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "audience",
      "text": "The Queen looks you up and down. She seems to find you wanting, but appreciates the gall.\\n\\n\"Good Knight?\"\\n\\nThe Knight goes down on her knees. \"Yes, my Queen?\"\\n\\n\"Would you be interested in this <<print either(\"agrashi\",\"myopic\",\"tuanshi\")>> <<print either(\"nard\", \"lakar\", \"tikar\")>>?\" The Queen seems judging, and for a moment she is beautiful.\\n\\nThat is what can be accomplished with nanites, after all. You would commend the realism if you weren't entirely sure there was someone to commend.\\n\\nThe Knight stands, looks you over. \"No, my Queen.\"\\n\\n\"Neither would I. Fool,\" the Queen pauses, looking to the rest of her Court. The Court look on, curious and cruel, happy and antagonistic. \"You have been found wanting. You will know be offered to the Court as is correct.\"\\n\\nYou wrack your brain for a moment, knowing this would not end well. Surely there must be some sort of [[challenge]] you could offer, or, perhaps, it is best to [[bow down]] to the Queen.",
      "links": [
        {
          "text": "challenge",
          "destination": {
            "name": "challenge",
            "pid": 91
          }
        },
        {
          "text": "bow down",
          "destination": {
            "name": "bow down",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "Who we are",
      "text": "<<if visited(\"how long\")>>They look at you, askance. \"I'm Kiar,\" the man starts, a little hesitant. If you didn't know better you'd think it was hero worship in his eyes. \"And this is my twin sister Kiara. Our ma was one of yours, doc. After the Great Rebellion.\"<<else>> <<endif>>\\n\\nYou recall, fuzzily, that there was a rising up of the people. A time when the prison was full, and they wanted you to process them faster, call them unforms quicker. You shudder. It wasn't a good time. You had to be careful. You... helped because you couldn't not. You hardly considered yourself a revolutionary, but it was a start.\\n\\n\"And ma, uh, she said you may not remember her.\"\\n\\nYou pause, flashing through faces. No names, none that would lead to the two you have in front of you, the obvious caste-mixing, the not-quite skin tone. They're beautiful in a way the Republic never allowed within its own people.\\n\\n\"No, there were...many.\" Kiara grabs a MRES, and sticks it into you before you can move. It hurts, but everything hurts, but after a moment things become clearer and you can move more easily. The \"stick\" as they're known on the street seemed to have a bunch of nutrients in it.\\n\\n\"That'll help you. We made them for all of the others that had to deal with the same thing. And, well, Liara thanks you.\" You're stuck for a second, a face appears, not beautiful in any traditional sense, but strong, then disappears quickly.\\n\\nA shudder passes through the building. You almost fall but Kiar grabs you, steadies you. Kiara readies a sphere. It blinks green and red.\\n\\n\"Time to go little brother.\" She grins as she says it. He shakes his head. You try not to throw up.\\n\\n\"You trust us, yet, Doc?,\" Kiar intercedes. \"If you want to know more, we can tell you [[how long]] it has been.\"\\n\\n\"Otherwise,\" Kiara smiles. \"You [[ready to go]]? We're not likely to see this place again.\"\\n",
      "links": [
        {
          "text": "how long",
          "destination": {
            "name": "how long",
            "pid": 87
          }
        },
        {
          "text": "ready to go",
          "destination": {
            "name": "ready to go",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "opening",
      "text": "Slowly, as you watch, a hole appears on the box. It takes you a moment to realize that this is what was once called a <i>key</i> hole. \\n\\nThis is most irregular. The last time anyone used a key of all things, was...\\n\\nYou're actually not sure you remember. It seems to be unnecessary. You consider, however, that for whatever reason you will need to perhaps [[find this key]] to leave the room.\\n\\nThere seems to be [[more than meets]] the eye, here.",
      "links": [
        {
          "text": "find this key",
          "destination": {
            "name": "find this key",
            "pid": 98
          }
        },
        {
          "text": "more than meets",
          "destination": {
            "name": "more than meets",
            "pid": 79
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "bow down",
      "text": "You have one chance to get out of here, if this is truly the only way out. You bow. The Queen is suddenly beside you, placing her hand at your neck. You try and jerk away, but the Knight holds you still.\\n\\n\"You may call us cruel, Fool. I follow the Old Ways. You have broken our code.\"\\n\\n\"I...\" It's hard, in a way, to speak clearly. The Queenleaves a line of sparks everywhere she touches. \"I could change.\"\\n\\n\"We don't allow failure.\" The Queen smiles, cruel and confident. \"And I don't allow insubordination in my court.\" The Queen pulls out a sword and lays it on your chest.\\n\\n\"You, Fool, are absolved of your sins.\"\\n\\n\"We can talk about this!\"\\n\\nThe Queen smirks. \"No,\" she thrusts her arm forward, digging the sword into your chest. \"We can't.\"\\n\\nIt shockingly painless, the sword entering your chest. Until it's much more painful than anything else in your life. Anything that should be felt. The sword crushes your chest, your throat, your vocal cords.\\n\\nEverything is pain.\\n\\nThe world fades away, and you take a moment when you come back to yourself, where this could almost be normal.\\n\\nThen you realize you're on your back and all you can see are some [[flashing words]].",
      "links": [
        {
          "text": "flashing words",
          "destination": {
            "name": "flashing words",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "offer your hand",
      "text": "The monster butts its head against your hand, wanting a scratch. You realize that these must be a form of the genrigs that were made to protect the Republic.\\n\\nProtecting them from what, however, still remains strangely elusive. As you continue to scratch the one creature, the others all come over and head butt you, leaving their weird ichor-filled saliva on you.\\n\\nYou suddenly become drowsy. You realize that the monsters must have a sort of sedative in their saliva and as you pass out you realize that maybe you're in a little over your head.\\n\\nAt least their [[fur is soft]].",
      "links": [
        {
          "text": "fur is soft",
          "destination": {
            "name": "fur is soft",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "innocence",
      "text": "You look up, because really, if there's no one around the camera is always <i>up</i>.\\n\\n\"I caused no crime!\" You yell it, though in the room it doesn't feel true.\\n\\nIt doesn't mean it's not true. You just woke up here, after all, no memory of a <i>before</i>, and definitely not one of now.\\n\\nThe voice comes back, filled with contempt.<b> \"You have failed to be rehabilitated, Prisoner 11012. This is a crime under Code 6-12-221-C. You will find we are not kind to those who do not help themselves.\"</b>\\n\\nA gas fills the room, that antiseptic smell getting closer and closer. As it fills your lungs you realize you know this smell.\\n\\nYou used to use it on others. But that was in <i>before</i>. And now is <i>now</i> and leaving slowly.\\n\\nYou feel the nanites clear you, the bits of you left, away, horrifyingly step, by step, taking the parts of you off and away somewhere else until all that was left was something that used to have a <i>before</i> but never really had a chance to get a <i>now</i>.\\n\\nYou awake, slowly. Your mind once more, gone. You find yourself, like many things, at the [[Start]].",
      "links": [
        {
          "text": "Start",
          "destination": {
            "name": "Start",
            "pid": 69
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "flashing words",
      "text": "The words look familiar. And the pounding gets through your headache, somehow. You blink once, and again.\\n\\nA hissing sound comes through the vents, and your headache goes away. You see nothing in the room beyond the words, blinking forever.\\n\\nYou shakily reach out, and choose.\\n\\n\\n<<if visited(\"The Castle.\")>><s>The Castle</s><<else>>[[The Castle.]]<<endif>>\\n<<if visited(\"The Deal.\")>><s>The Deal</s><<else>>[[The Deal.]]<<endif>>\\n<<if visited(\"The Monsters.\")>><s>The Monsters.</s><<else>>\\n[[The Monsters.]]<<endif>>\\n<<if visited(\"The Case.\")>><s>The Case.</s><<else>>[[The Case.]]<<endif>>\\n\\n<<if visited(\"The Deal.\", \"The Castle.\", \"The Monsters.\", \"The Case.\")>>\\nThis was all a [[mistake]].\\n<<endif>>\\n\\n\\n\\n\\n\\n\\n",
      "links": [
        {
          "text": "The Castle.",
          "destination": {
            "name": "The Castle.",
            "pid": 116
          }
        },
        {
          "text": "The Deal.",
          "destination": {
            "name": "The Deal.",
            "pid": 29
          }
        },
        {
          "text": "The Monsters.",
          "destination": {
            "name": "The Monsters.",
            "pid": 113
          }
        },
        {
          "text": "The Case.",
          "destination": {
            "name": "The Case.",
            "pid": 111
          }
        },
        {
          "text": "mistake",
          "destination": {
            "name": "mistake",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "box",
      "text": "You heave the box up, toward the hole in the wall. It's remarkably heavy, this box, and you struggle to get it near the wall.\\n\\nYou accidentally drop it, and it <b>thuds</b> aggressively to the floor. \\n\\nYou wait, hopeful. The keymouse does edge its head out, and toward the box, before finally scurrying toward the door and under the doorframe.\\n\\nYou rush after it, only to hear the doorway open. \\n\\n<i>Success</i>, you think, happy to be out of this room.\\n\\nYou walk through it and find yourself covering your eyes from a [[bright light]].",
      "links": [
        {
          "text": "bright light",
          "destination": {
            "name": "bright light",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "connection",
      "text": "You remember, finally, the reason you changed. They brought a woman in, one who -\\n\\n- who was in <i>here</i> with you. \\n\\n<font color=white>Notenoughwhyisntthememoryenough</font>\\n\\nYou catch a face, one you saw in the crowd in the castle. One that reached out in the den. One that you saw in the reflection of the box, for a moment.\\n\\nShe's the connection, for you. She's why you're here today, she opened your eyes to what the Republic was doing. What they did to you. She told you what it was like on the Outside.\\n\\nAnother connection is made, not to her, but because of her. She taught you what the Republic...did. What they wanted from the Prison. They wanted something that was beyond possibility.\\n\\nThey wanted something that made the citizens feel safe, and something that made the criminals feel pain. The Republic wanted you to fix citizens at the earliest ages - those young ones who spoke out, naively, at a young age were taken to you. Those who had committed no crimes but of asking questions.\\n\\nNaturally, you balked at this. Even more naturally, the Republic made an [[example]] of you. You [[fought back]], but it didn't change much.\\n\\nEnemies of the state were, by their very nature, non-entities. The Republic didn't want them reformed, unless they could display them as grotesque dolls. Servants at functions. Once terrorists, now ready with your bisque, Minister.\\n\\nIt would be laughable, had your work not been the basis for all of it.",
      "links": [
        {
          "text": "example",
          "destination": {
            "name": "example",
            "pid": 93
          }
        },
        {
          "text": "fought back",
          "destination": {
            "name": "fought back",
            "pid": 75
          }
        }
      ]
    },
    {
      "pid": 57,
      "name": "listen to it",
      "text": "You finally get your eyes all the way open, and focus in front of you. You seem to be inside of a tube, with a clear panel over your face. The panel is blurred, partially by your breath and partially by... debris?\\n\\nIt gets wiped off and you realize it was just dust. You were here longer than you thought. That's the Republic for you. Easier to forget about people, than to deal with them.\\n\\nThe panel swings open, and your saviour grabs your arm. You fall against her, and realize there's another pair of arms beside you. He helps to haul you up, and the two bring you to a chair. They start to look over you, carefully.\\n\\n\"Who are you?\" You ask, innocently. The two look at each other, and now that you have the time you notice there's a family resemblance between them. Twins, if you are correct. If anything you know is correct. You're not sure anymore.\\n\\n\"Hey there doc, maybe you should just chill. After all we did just pull you out of the deep freeze.\"\\n\\nYou wave them away. \"How do I know you're real, or who you are?\"\\n\\nThey nod at each other sagely, as if they expected this. Or something. Then they pull out a picture - it's of a woman, serene-looking in the holo-shot. The holo is a bit fractured as if it's old. <i>Oldoldoldoldoldold</i>.\\n\\n\"How long?\" You finally demand it.\\n\\nThey turn to you. \"What do you want to know first, doc? [[Who we are]] or [[how long]] it has been.\"\\n",
      "links": [
        {
          "text": "Who we are",
          "destination": {
            "name": "Who we are",
            "pid": 49
          }
        },
        {
          "text": "how long",
          "destination": {
            "name": "how long",
            "pid": 87
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "you go to her",
      "text": "You move toward her, and the man shakes his head.\\n\\nShe sighs, sad, waving forlornly as if this is, indeed, her reward. She turns back into a beast. \\n\\nThe man grabs your face, and turns it towards his, and for a moment he is preternaturally beautiful, a terrifically terrifying creature - not a man.\\n\\nHe smiles then, with your attention. \"Remember, we have a world out there for us, but only if we adhere to the rules. We have a fate, a form of <i>adrsta</i>, a word that we must live in. If we cause some discord, we have caused all discord.\"\\n\\nA beat, and the people slowly merge back into beasts, this time kept - beautiful in their own way, their wonderful variations all part of their fur.\\n\\nA part of you is saddened that you can't join them.\\n\\nThe man nods, satisfied. \"It is so, now, you must join us.\" Sadly you take his offered [[hand]].",
      "links": [
        {
          "text": "hand",
          "destination": {
            "name": "hand",
            "pid": 114
          }
        }
      ]
    },
    {
      "pid": 59,
      "name": "439",
      "text": "The [[numbers]] reset.",
      "links": [
        {
          "text": "numbers",
          "destination": {
            "name": "numbers",
            "pid": 99
          }
        }
      ]
    },
    {
      "pid": 60,
      "name": "StoryAuthor",
      "text": "Elize Morgan",
      "links": []
    },
    {
      "pid": 61,
      "name": "keep running",
      "text": "As you continue to run, you realize the darkness is lightening, imperceptibly. The pitch black is becoming less pitch, and more bright.\\n\\nYou barely stop yourself before you fall off the ridge. But notice that you've run out of places to run. You pause as you consider your options but realize you really only have one.\\n\\nYou must [[hide]].",
      "links": [
        {
          "text": "hide",
          "destination": {
            "name": "hide",
            "pid": 45
          }
        }
      ]
    },
    {
      "pid": 62,
      "name": "disappears",
      "text": "The castle starts to disappear, the nanites reassembling themselves, slowly disappearing into the walls.\\n\\nA door opens in the back of the room, leading back to the holding room.\\n\\nThe sterile smell comes flooding back in. You try and stop the shudder that comes with it, but aren't quite successful.\\n\\nSomething holds you [[back here]] though. Something about the empty room leaves a question. Something offers a choice.\\n\\n\\n",
      "links": [
        {
          "text": "back here",
          "destination": {
            "name": "back here",
            "pid": 96
          }
        }
      ]
    },
    {
      "pid": 63,
      "name": "rehabilitated",
      "text": "<b>\"Prisoner.\"</b> The Voice pauses.<b>\"Taking the proper precautions, and ideas, you have the chance to go back to society. We welcome your efforts, Prisoner.\"</b>\\n\\nA beat. You could say no, but you've gone this far with it.\\n\\n\"[[Yes]].\" You whisper it. The final word.\\n\\n",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "Yes",
            "pid": 118
          }
        }
      ]
    },
    {
      "pid": 64,
      "name": "Yes.",
      "text": "In for a parthing, in for a kathora, right?\\n\\nOr something to that effect.\\n\\nThe room dissolves around you, and slowly you are returned to a blank room.\\n\\nA door opens.\\n\\n\"Welcome, Prisoner. This is [[Judgement]].\"",
      "links": [
        {
          "text": "Judgement",
          "destination": {
            "name": "Judgement",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 65,
      "name": "No",
      "text": "<b>\"Prisoner 11012. You have one opportunity for rehabilitation. Most would have been incinerated. You have been saved. Salvaged from the bottom.\"</b>\\n\\nYou notice that the boom to the voice has a slight crack in it, evenly, as if it was sampled.\\n\\n<b>\"You have the choice, Prisoner, to be [[rehabilitated]]. If you choose to [[reject]] this, we will not be responsible for your fate.\"</b>",
      "links": [
        {
          "text": "rehabilitated",
          "destination": {
            "name": "rehabilitated",
            "pid": 63
          }
        },
        {
          "text": "reject",
          "destination": {
            "name": "reject",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 66,
      "name": "571",
      "text": "The [[numbers]] reset.",
      "links": [
        {
          "text": "numbers",
          "destination": {
            "name": "numbers",
            "pid": 99
          }
        }
      ]
    },
    {
      "pid": 67,
      "name": "grab it",
      "text": "Easier said than done. Grabbing the mouse seems not likely to happen, as it keeps bouncing out of your way.\\n\\nYou make a note to give the creator of the keymouse some pointed words in the future.\\n\\nOr at least, consult the current patent holder and discuss their ongoing treatment of the creatures.\\n\\nPerhaps you can [[lure]] the silly thing out. ",
      "links": [
        {
          "text": "lure",
          "destination": {
            "name": "lure",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 68,
      "name": "agree to be rehabilitated",
      "text": "You notice the smell is getting worse, and it's getting hard to breathe. It's easier to agree, maybe, to choke out a yes than to die, here. Die with nothing left but a vague understanding of what might have happened.\\n\\n\"Rehabilitation\", the voice says, \"is still an option.\"\\n\\nYou choke a bit, the first time, but you finally get it out. \"[[Yes]].\" You spit a little as the air gets thicker, then a hissing fills the air.\\n\\n\\n",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "Yes",
            "pid": 118
          }
        }
      ]
    },
    {
      "pid": 69,
      "name": "Start",
      "text": "<b>\"Welcome Prisoner.\"</b> The voice booms across the empty room.\\n\\nYou try and get your bearings, you think back to how you found yourself here - and find nothing but blankness. Thoughts smash toward you, confusing and abstract, then flit away before you can fully connect.\\n\\nYou jump as the Voice comes back, shaking the room. \"You have come to the Rehabilitation Center for a reason. You will replay the scenarios until you have been suitably rehabilitated.\"\\n\\n\"Do you agree to these terms?\" The Voice seems to be waiting for you to say something, but you see words materialize in the middle of the empty room.\\n\\n[[Yes]].\\n[[No]].",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "Yes",
            "pid": 118
          }
        },
        {
          "text": "No",
          "destination": {
            "name": "No",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 70,
      "name": "mrthalis",
      "text": "The Queen looks happy for a moment. \"Ah, a true Fool, then. It has been a while. We shall release the mrthalis for you.\"\\n\\nYou take a small gasp. The Queen notices. \"You may still find the ability to offer another choice. [[Amuse me.]] As only a Fool can.\"",
      "links": [
        {
          "text": "Amuse me.",
          "destination": {
            "name": "Amuse me.",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 71,
      "name": "shouldn't know that",
      "text": "But what is <i>knowing</i> other than a pile of broken synapses. As you consider that for a moment, you realize that the nanites seem to be crawling toward you. \\n\\nThey seem to be herding you toward the door, forcing you to be the one to choose to be [[stepping]] through.\\n\\nOf course, you know they can't hurt you, right? Those synapses seem to tell you that's true. <font color=white><i>You think</i>.</font>\\n\\nYou [[stand your ground]], expecting nothing to happen.",
      "links": [
        {
          "text": "stepping",
          "destination": {
            "name": "stepping",
            "pid": 7
          }
        },
        {
          "text": "stand your ground",
          "destination": {
            "name": "stand your ground",
            "pid": 109
          }
        }
      ]
    },
    {
      "pid": 72,
      "name": "blonde",
      "text": "<font color=red><font size=7>ERROR</font></font>\\n\\nYou try not to panic. Then, calm as the letters move off.\\n\\n[[Text appears on the screen]].",
      "links": [
        {
          "text": "Text appears on the screen",
          "destination": {
            "name": "Text appears on the screen",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 73,
      "name": "257",
      "text": "The rest of the numbers fade away, leaving you looking at a blank wall. You hear a grinding coming from the floor.\\n\\nYou walk toward the center of the room and feel a shifting below you. You pause, and wait as a [[giant hole]] takes over the room. ",
      "links": [
        {
          "text": "giant hole",
          "destination": {
            "name": "giant hole",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 74,
      "name": "isn't real",
      "text": "You laugh at the knight. A good, solid forced laugh. It's cathartic. Laughing flat out at this apparition.\\n\\nThe Knight's face hardens. She takes your arm and slams you to the ground.\\n\\nWhen she drags you up you realize your nose is bleeding. <i>That shouldn't happen</i>, the thought runs through, a feeling of despair running through you. It's terrifically terrifying, what these constructs can do. And if someone took the failsafe off, that means that there's a lot of bad that can happen, to you, specifically.\\n\\nYou spare a thought for the Voice of Judgement above, the team that must be watching something happen. They must be, right?\\n\\nIt seems like maybe they're not. And you're going to have to make this work. From the [[prison]] they seem to be leading you to.",
      "links": [
        {
          "text": "prison",
          "destination": {
            "name": "prison",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 75,
      "name": "fought back",
      "text": "Fighting against the Republic wasn't the easiest path to take. There were only so many nanites that could be rewritten to help prisoners, and only so many \"criminals\", some only children, that could be helped to escape.\\n\\nOnce the public became aware of these \"break outs\", the Republic was incensed. They started to send <i>more</i> prisoners to the colony, hoping to catch the <i>Rebmol</i> in the act. You might have been surprised to find even more people escaping, many of them not even the ones you chose to help.\\n\\nEventually, the Republic stopped sending guards, stopped their investigations. They said they couldn't find the Rebmol, and that was that. They would be forced to close down the colony. After all, even if the prisoners were escaping to the stars, and not to Vergana IV, they were still out there. Still being Rebels, still planning treachery against the Republic, or, at worst, joining the Empire of the Solria.\\n\\nIt was shocking how little the Republic liked democracy for a government based on it.\\n\\nDuring the evacuation, the guards were asked to leave and the Secret Police entered. One last job, they said, with one final prisoner.\\n\\nYou should have caught on, by then. The last prisoner had been executed days ago for being a <i>unform</i>, the Republics word for the unreformable.\\n\\nThe guards grabbed you, and put you into the [[system]]. One last prisoner that would never leave.",
      "links": [
        {
          "text": "system",
          "destination": {
            "name": "system",
            "pid": 78
          }
        }
      ]
    },
    {
      "pid": 76,
      "name": "empty room",
      "text": "As you step into the room, the computer room behind you shimmers out of existence.\\n\\nYou turn back and discover words hovering in mid air. A choice must be made.\\n\\n<s>The Deal</s>\\n<<if visited(\"The Castle.\")>><s>The Castle.</s><<else>>[[The Castle.]]<<endif>><<if visited(\"The Case.\")>><s>The Case.</s><<else>>\\n[[The Case.]]<<endif>>\\n<<if visited(\"The Monsters.\")>><s>The Monsters.</s><<else>>[[The Monsters.]]<<endif>>\\n\\n<<if visited(\"The Deal.\", \"The Castle.\", \"The Monsters.\", \"The Case.\")>>\\s\\nThis was all a [[mistake]].\\n<<endif>>",
      "links": [
        {
          "text": "The Castle.",
          "destination": {
            "name": "The Castle.",
            "pid": 116
          }
        },
        {
          "text": "The Case.",
          "destination": {
            "name": "The Case.",
            "pid": 111
          }
        },
        {
          "text": "The Monsters.",
          "destination": {
            "name": "The Monsters.",
            "pid": 113
          }
        },
        {
          "text": "mistake",
          "destination": {
            "name": "mistake",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 77,
      "name": "run fiercely",
      "text": "You continue to run, the sound of whatever those creatures are getting further and further behind.\\n\\nWith an extra burst of speed you know you can probably [[run away]] from the lot.\\n\\nBut you can feel a difference in the ground here. A sort of hollowness to the ground. You [[grind to a halt]], determined to deal with whatever has been thrown at you.",
      "links": [
        {
          "text": "run away",
          "destination": {
            "name": "run away",
            "pid": 44
          }
        },
        {
          "text": "grind to a halt",
          "destination": {
            "name": "grind to a halt",
            "pid": 103
          }
        }
      ]
    },
    {
      "pid": 78,
      "name": "system",
      "text": "The system was a fail safe. A way to integrate the person into the REPRISE system, the penal system you had a hand in designing, and maintaining for so many years.\\n\\nThe system kept the body alive, and placed the person in the virtual space that was REPRISE. It kept the body alive, and as young, or old, as they were when they went in. It wasn't unheard of to have the most hardened criminals reformed... generations later. Of course, these \"reforms\" were the ones that were generally brain damaged by the end of the process.\\n\\nThe Republic didn't really care about that. They had their puppets.\\n\\nIt meant that unforms could be reformed through repeated visits. And it meant they could block the memories of the crime, to force the person to be reeducated <i>appropriately</i>.\\n\\nThere was no telling how long you'd been there. Lulled by REPRISE, by the very system you created.\\n\\nNow would be the time to break free. You built the system, after all, and taught the other prisoners how to escape with your nanites.\\n\\nIt was time to find your [[own escape]].",
      "links": [
        {
          "text": "own escape",
          "destination": {
            "name": "own escape",
            "pid": 84
          }
        }
      ]
    },
    {
      "pid": 79,
      "name": "more than meets",
      "text": "Examining the box further leads to more questions than answers. While it attempts to pose as a simple box, it obviously has other purposes. A moment and you notice what appears to be a [[camera]] on top of the box, whizzing and watching you.\\n\\nYou drop the box.",
      "links": [
        {
          "text": "camera",
          "destination": {
            "name": "camera",
            "pid": 81
          }
        }
      ]
    },
    {
      "pid": 80,
      "name": "numbers closely",
      "text": "[[257]] [[839]] [[439]] <<print either (\"[[313]]\",\"[[571]]\",\"[[1277]]\")>> ",
      "links": [
        {
          "text": "257",
          "destination": {
            "name": "257",
            "pid": 73
          }
        },
        {
          "text": "839",
          "destination": {
            "name": "839",
            "pid": 47
          }
        },
        {
          "text": "439",
          "destination": {
            "name": "439",
            "pid": 59
          }
        },
        {
          "text": "313",
          "destination": {
            "name": "313",
            "pid": 36
          }
        },
        {
          "text": "571",
          "destination": {
            "name": "571",
            "pid": 66
          }
        },
        {
          "text": "1277",
          "destination": {
            "name": "1277",
            "pid": 115
          }
        }
      ]
    },
    {
      "pid": 81,
      "name": "camera",
      "text": "The camera continues to watch you, ignoring, perhaps, that fact that you seem disturbed.\\n\\nYou run your hands along the surface of the camera and find that, surprisingly, the camera is not coated with the Mawglass so common on these - it would take very little to destroy it.\\n\\nYou pick up the box and bring it above your head [[intent on smashing]] the little camera.\\n\\nA tiny [[squeak]] from the corner of the room makes you pause. You are committed, though, aren't you?",
      "links": [
        {
          "text": "intent on smashing",
          "destination": {
            "name": "intent on smashing",
            "pid": 30
          }
        },
        {
          "text": "squeak",
          "destination": {
            "name": "squeak",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 82,
      "name": "23015",
      "text": "You tap on Prisoner 23015.\\n\\nThree sentient AIs, or SCAIs, appear. They are quite modern-looking, with their bright eyes and flawless skin.\\n\\nA part of you truly appreciates the effort that went into the SCAIs, and for a moment you feel pride.\\n\\nAfter a time, you realize the monitor is attempting to get your attention.\\n\\n<font color=blue> What Does Prisoner 23015 Look Like?</font>\\n\\nAs you have no idea who 23015 is, you take a guess.\\n\\nA [[blonde]] SCAI, one of the earlier models if you are not mistaken. <<print either(\"She smiles, docile, but smart.\", \"Looks to have survived a few rough fights, if the tearing is any indication.\", \"Grins, imprudently.\")>>\\n\\nA [[tall]] SCAI, perhaps a fighting unit, leans in his shot. <<print either(\"He's roguish, even for a bot made in that image.\", \"He seems world-weary, and tired.\", \"Sports a bright and shining plarimond earring. Not cheap, especially for a SCAI.\")>>\\n\\nA [[green-skinned]] SCAI with bright blue eyes stares you down in the last shot. <<print either(\"She's obviously used to the camera.\", \"He definitely isn't ready for the shot, with one eye closed.\", \"It gamely offers a wink.\")>>\\n\\n\\n",
      "links": [
        {
          "text": "blonde",
          "destination": {
            "name": "blonde",
            "pid": 72
          }
        },
        {
          "text": "tall",
          "destination": {
            "name": "tall",
            "pid": 123
          }
        },
        {
          "text": "green-skinned",
          "destination": {
            "name": "green-skinned",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 83,
      "name": "go along with it",
      "text": "You eye the Knight, and realize there's a chance she's really not going to take no for an answer.\\n\\nYou follow her to the throne room. A little behind, but never so far back.\\n\\nYou move toward the throne room, slightly wary, when you find you are standing in front of the Queen.\\n\\nShe's regal, as one might guess. A lot of pomp and circumstance. You don't [[really go for that]], which might show on your face if you're not careful.\\n\\nThe Knight pushes you to the ground, and forces you to bow.\\n\\n\"You Majesty. The Fool, you requested.\"\\n\\nThe Queen nods her head, bored. \"Alright, Fool. [[Amuse me.]]\"",
      "links": [
        {
          "text": "really go for that",
          "destination": {
            "name": "really go for that",
            "pid": 92
          }
        },
        {
          "text": "Amuse me.",
          "destination": {
            "name": "Amuse me.",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 84,
      "name": "own escape",
      "text": "You start the process to send the right signals to the processor. These were machines, after all, and a combination of <i>guiltsympathylongingbrokenbrainrepairedloveRepublicRepublicRepublic</i> will allow you to leave the machine.\\n\\nHopefully the nanites did their job and managed to get you out before they rebuilt too many of your memories.\\n\\nThere's no way to tell, though. And it seems like you've been here far longer than you should have been.\\n\\n[[Wake up]], the voice is insistent. Angry.\\n\\nIt's much easier to just [[go back to sleep]].\\n",
      "links": [
        {
          "text": "Wake up",
          "destination": {
            "name": "Wake up",
            "pid": 102
          }
        },
        {
          "text": "go back to sleep",
          "destination": {
            "name": "go back to sleep",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 85,
      "name": "Standing here",
      "text": "The sand still radiates heat, as you slow down, finding a good place to stand.\\n\\nAfter a moment, and nothing happening, you decide to sit. The heat envelopes you, relaxing your sore muscles, pulling you deeper, and deeper into the sand, until you're all but covered.\\n\\nSlowly you realize the warmth is coming from a glowing inside of you, the nanites deconstructing you, and remaking you, placing you right into a dark room.\\n\\n\"No,\" you whisper to yourself.\\n\\n\"Yes,\" says the voice, and slowly, you forget, again, what this is. \\n\\nYou [[wake up]].\\n\\n\\n\\n",
      "links": [
        {
          "text": "wake up",
          "destination": {
            "name": "wake up",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 86,
      "name": "fireworks",
      "text": "The twins hustle you to their ship - a lithe creature, capable and sleek. Kiar presses a button on the hull, and you're inside and away in moments.\\n\\nThe twins turn the ship back, to face the prison moon.\\n\\n\"You ready to see it go, doc?\"\\n\\n\"I'd be happy if we left as quickly as possible.\" You mutter, but are happy to see your little rock one last time. A moment later and the <font color=red>boom</font> rocks the ship, the twins high-five each other, triumphant.\\n\\n\"C'mon, doc. There's a lot more in this great old Galaxy than the Republic ever wants anyone to know about. Let's go [[home]].\"\\n\\n\\n",
      "links": [
        {
          "text": "home",
          "destination": {
            "name": "home",
            "pid": 101
          }
        }
      ]
    },
    {
      "pid": 87,
      "name": "how long",
      "text": "You cough, a little. The man offers a bottle. You almost spit it out - that's definitely not water. It does make it easier to focus.\\n\\n<<if visited(\"Who we are\")>>\"I'm Kiar,\" the man says, hesitant. \"This is my sister Kiara.\"<<else>> <<endif>>\\n\\n\"Relax,\" he says. \"You'll need something to deal with the Sickness. Ma claimed it took her for almost a week after she got out. After you got her out.\"\\n\\nWell, that didn't help the timing much, for you. There's no telling what's happened since.\\n\\n\"You've been here a while, Doc.\" She says it, then. She's a bit less kind than her twin, a bit more focused on the task at hand. \"Twenty years. They kept this place guarded constantly, this has been the only time we could get in. The Rebels have been looking to get you out for a while. We wouldn't be here without you.\"\\n\\nYou cough a little on the fluid. Kiar pats you on the back. \"Not so long, old man. Think of it this way, now the Republic won't really be looking for you. They'll think your dead after we activate this.\"\\n\\nHe holds up a small sphere. It <font color=red>blinks</font> on and off. Enough to make you nervous.\\n\\n\"Well, a few decades is nothing to most of the resistance. We just get bigger and bigger. But you're the last. It's time to blow this penal colony. Finally send the message we meant to years back. And  we're finally ready to go.\"\\n\\n\"You trust us, yet, Doc?,\" Kiar intercedes. \"If you want to know more, we can tell you more. [[Who we are]], I guess.\"\\n\\n\"Otherwise,\" Kiara smiles. \"If you're [[ready to go]] we should get. We're not likely to see this place again.\"",
      "links": [
        {
          "text": "Who we are",
          "destination": {
            "name": "Who we are",
            "pid": 49
          }
        },
        {
          "text": "ready to go",
          "destination": {
            "name": "ready to go",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 88,
      "name": "cooperate",
      "text": "You examine the options and realize something is amiss.\\n\\nYou know nothing of any other prisoners, of course, you haven't seen any indication there are any other prisoners.\\n\\nYou tap the word COOPERATE, expecting nothing, but a door slides open in front of you, bringing you to and [[empty room]].",
      "links": [
        {
          "text": "empty room",
          "destination": {
            "name": "empty room",
            "pid": 76
          }
        }
      ]
    },
    {
      "pid": 89,
      "name": "redhead",
      "text": "<font color=red><font size=7>ERROR</font></font>\\n\\nYou try not to panic. Then, calm as the letters move off.\\n\\n[[Text appears on the screen]].",
      "links": [
        {
          "text": "Text appears on the screen",
          "destination": {
            "name": "Text appears on the screen",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 90,
      "name": "squeak",
      "text": "The tiny sound reverberates across the silent room, causing you to jump.\\n\\nAs you stride to the opposite wall you look down and see a <i>key</i>.\\n\\nBut it's not quite a key, a keymouse. Rare to see those wandering around in general, but to see one so close to this box.\\n\\nYou [[rush the keymouse]], hoping to grab it.",
      "links": [
        {
          "text": "rush the keymouse",
          "destination": {
            "name": "rush the keymouse",
            "pid": 104
          }
        }
      ]
    },
    {
      "pid": 91,
      "name": "challenge",
      "text": "You pause. \"A challenge.\"\\n\\nThe Queen, intrigued by the concept, nods. \"Fine. My champion is my Knight. You will be your own.\"\\n\\n\"I have the option to choose a Champion\"\\n\\n\"I have the option to deny your choice. And I do, Fool. Prepare yourself!\" The Queen returns to her throne to watch.\\n\\nThe Knight makes short work of preparation, and no one offers you a sword, or any other weapon.\\n\\n\"Don't I get a weapon?\"\\n\\n\"You fight as you are, Fool. Fight with your words.\"\\nAnnoyingly, this is when the Knight chooses to run you through. \\n\\nYou are pretty sure your last word is <i>Glrglfrap</i>, but there was no one taking notes.\\n\\nThe world fades away, leaving you in darkness.\\n\\nYou blink your eyes. Weird feeling, having eyes when you're dead. You move to get up and realize that everything hurts. \\n\\nAll you can see are some [[flashing words]].\\n\\n\\n",
      "links": [
        {
          "text": "flashing words",
          "destination": {
            "name": "flashing words",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 92,
      "name": "really go for that",
      "text": "\"I'd, personally, rather not.\" You say it with astonishing lack of concern.\\n\\nOne day, you might even pat yourself on your back for that control. \\n\\nToday may not be that day. The Queen stands, slowly. The Court lets out a small gasp. \"Very well, Fool, you may face our [[audience]]. Perhaps they will be happier with you.\"",
      "links": [
        {
          "text": "audience",
          "destination": {
            "name": "audience",
            "pid": 48
          }
        }
      ]
    },
    {
      "pid": 93,
      "name": "example",
      "text": "The Republic was always big on what they considered to be irony.\\n\\nTheir irony could be slapped upside the head with a dictionary definition and they'd still say, with a straight face, it was irony.\\n\\nYou expected to be found out. Possibly even earlier than you did. You didn't expect them to hide you entirely. The prison doctor who went rogue wasn't part of their narrative.\\n\\nBest to hide you, leave you to your own devices. Literally.\\n\\nYou expected something would happen so prepared accordingly. Prepared the nanites to protect you, and give you a fail safe. They caught them. But that doesn't mean you weren't smarter. It's time to figure out how to make good on your [[own escape]].",
      "links": [
        {
          "text": "own escape",
          "destination": {
            "name": "own escape",
            "pid": 84
          }
        }
      ]
    },
    {
      "pid": 94,
      "name": "mistake",
      "text": "This isn't real.\\n\\nYou know it's not real, but that doesn't stop the fact that this is a mistake.\\n\\nThis can't be happening because you're the one who built this. You're the one who made all of these things happen.\\n\\nYou are the reason these miserable little helliodacks can have a job and poke their buttons. So you know the truth.\\n\\nA <font color=red>SPURTZ</font> grabs your attention. The wall, once perfectly smooth, the facade of a millenia of sanding, seems to open up in front of you.\\n\\nPausing to [[investigate]] might give you the chance to discover something about whoever has you captured, but a <font color=green>whoosh</font> to your side and you notice a door opening.\\n\\nThe [[door, light on]] is welcoming, but which direction is freedom?\\n\\n",
      "links": [
        {
          "text": "investigate",
          "destination": {
            "name": "investigate",
            "pid": 28
          }
        },
        {
          "text": "door, light on",
          "destination": {
            "name": "door, light on",
            "pid": 2
          }
        }
      ]
    },
    {
      "pid": 95,
      "name": "run off",
      "text": "It's getting harder to keep running, but you hear a deep, guttural panting behind you. When you turn, the foetid breath washes over you and you consider throwing up.\\n\\nIt shouldn't be possible to replicate that kind of smell, nanites or none.\\n\\nYou get caught, a sharp hiss coming out of your mouth as you feel the acidic saliva leak onto your arm, burning away the little coverage the plain shirt was giving you.\\n\\nYou wrench your arm away, and continue to [[run fiercely]].\\n\\nThe urge to stop is there. [[Standing here]] might be a good way to deal with this. If it keeps up much longer.",
      "links": [
        {
          "text": "run fiercely",
          "destination": {
            "name": "run fiercely",
            "pid": 77
          }
        },
        {
          "text": "Standing here",
          "destination": {
            "name": "Standing here",
            "pid": 85
          }
        }
      ]
    },
    {
      "pid": 96,
      "name": "back here",
      "text": "You pause, staying in the room.\\n\\nYou wait. A moment goes by. Another moment goes by. It's hard to know how long goes by.\\n\\n\"Hello?\" You try, it's a little meeker than you want it to be.\\n\\nAnother pause. You try again. \"Hello!\" A bit more authoritative. Good job.\\n\\nStill nothing.\\n\\nA list comes up in front of you. Castle slowly dissolves.\\n\\nThe rest stay. You can feel the demand to choose.\\n\\nThe need to choose.\\n\\n<s>The Castle</s>\\n<<if visited(\"The Deal.\")>><s>The Deal</s><<else>>[[The Deal.]]<<endif>><<if visited(\"The Monsters.\")>><s>The Monsters.</s><<else>>\\n[[The Monsters.]]<<endif>>\\n<<if visited(\"The Case.\")>><s>The Case.</s><<else>>[[The Case.]]<<endif>>\\n\\n<<if visited(\"The Deal.\", \"The Castle.\", \"The Monsters.\", \"The Case.\")>>\\s\\nThis was all a [[mistake]].\\n<<endif>>\\s\\n\\n",
      "links": [
        {
          "text": "The Deal.",
          "destination": {
            "name": "The Deal.",
            "pid": 29
          }
        },
        {
          "text": "The Monsters.",
          "destination": {
            "name": "The Monsters.",
            "pid": 113
          }
        },
        {
          "text": "The Case.",
          "destination": {
            "name": "The Case.",
            "pid": 111
          }
        },
        {
          "text": "mistake",
          "destination": {
            "name": "mistake",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 97,
      "name": "close your eyes",
      "text": "You wake, finding yourself face down on a grotty floor, dirt smushed into your face.\\n\\nYou get up, quickly, attempting to clean the dirt off your face.\\n\\nYou slowly turn around and realize you are in a [[locked room]]. It reminds you of something, but it's like a dream passing away and you set about discovering this room anew.",
      "links": [
        {
          "text": "locked room",
          "destination": {
            "name": "locked room",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 98,
      "name": "find this key",
      "text": "Examining the room leads to you being covered in peeling paint. It's disgusting more because you know it's not actually paint that's flaked all over your clothing.\\n\\nAs you continue your second sweep of the room, however, you notice that the dimensions of the room are...subtly off. You walk toward the wrong end, the left side of the room.\\n\\n<i>Sinistra</i> pops into your mind, for a second, a word that seems to have meaning, but you can only equate with party games and trivia.\\n\\nAs you wander over you hear a [[squeak]] from the other side of the room, and glance over.\\n\\n",
      "links": [
        {
          "text": "squeak",
          "destination": {
            "name": "squeak",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 99,
      "name": "numbers",
      "text": "You see that there are five batches of numbers around the room. Each of them has three numbers marked on them.\\n\\nAs you walk around the room you notice that one set is written in blue paint, not red. \\n\\nIf there's somewhere you should start, it seems that might be the place.\\n\\nYou walk over and realize the numbers aren't painted on. They're holos, floating over the white painted wall.\\n\\nYou notice they flow over the paint, jittery as you stand near it.\\n\\nEach of the numbers flashes into another, slowly, causing you to question what, exactly, it is this room wants from you.\\n\\nYou look at the [[numbers closely]].\\n\\n\\n\\n",
      "links": [
        {
          "text": "numbers closely",
          "destination": {
            "name": "numbers closely",
            "pid": 80
          }
        }
      ]
    },
    {
      "pid": 100,
      "name": "lie down",
      "text": "The floor is spare, but the ground did have a light covering of straw.\\n\\nProbably considered the height of prisoner relations for the time. You pause, checking that there's nothing in the straw.\\n\\nYou consider just staying there for a moment. You can always [[shout for the guard]], but that seems like cheating.\\n\\nYou finally sigh, and lie down in the straw.\\n\\nTaking a moment for yourself you try and figure out what you know, but little comes to mind. As you drift off to [[sleep]], you consider your other options.\\n\\nNo matter, truly. It's all, after all, just a game.",
      "links": [
        {
          "text": "shout for the guard",
          "destination": {
            "name": "shout for the guard",
            "pid": 120
          }
        },
        {
          "text": "sleep",
          "destination": {
            "name": "sleep",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 101,
      "name": "home",
      "text": "You nod, agreeing. Trying not to pause for a second as you sense the connections snapping into place, the last job the nanites had to do complete. It's painful, but you only grunt a little, trying not to scare the twins.\\n\\n\"How long until we get... home?\"\\n\\nThe twins grin. \"Oh, don't you worry.\" Kiar says it, punching a button that throws them into slipspace, knocking you back. Suddenly, a thought comes, pain inducing.\\n\\n\"What if there's something in me? The Republic can't track -\"\\n\\nKiara stops you from getting up. \"Don't worry, doc. We've done this before.\"\\n\\nYou do cry out, then, as the final synapse snaps back.\\n\\n\"Doc?\"\\n\\nYou pant, but wave them away. \"I'm fine.\" And you are, you realize, looking down on a planet. On...<i>Earth</i> if the coordinates are right, and seeing a thriving world.\\n\\nYou remember, now, who Liara was, and why you joined the Rebels. Liara, who broke all your machines and told you about the outside world for the first time. Liara, whose only crime had been to love outside of caste, had, it seemed survived to create her world.\\n\\n\"Welcome home, doc.\" Kiara says, pride on her beaming face.\\n\\nYou smile to yourself. \\n\\nIt was all worth it, after all.\\n\\n<font color=white>Wasn't it?</font>\\n\\n<font size=7>The End</font>\\n\\n[[Credits]]\\n\\n\\n",
      "links": [
        {
          "text": "Credits",
          "destination": {
            "name": "Credits",
            "pid": 106
          }
        }
      ]
    },
    {
      "pid": 102,
      "name": "Wake up",
      "text": "You force yourself to open your eyes. It hurts. The connections in your brain must still be rewiring themselves because your eyes refuse to do anything you tell them.\\n\\nSo do your legs, but then, it's obviously been a while. It's a good thing that the system also keeps your muscles from atrophy (you try to remember how it works, but that part seems to be permanently gone).\\n\\nThe voice from before becomes clear, still insistent. \"Wake. Up Professor.\"\\n\\nA moment passes, is that supposed to be you the voice is referencing? Oh, yes, you did have some sort of doctorate. Some sort of long term education that must have made you the right person to reform the unreformable.\\n\\n\"If you don't wake up, I'll have to zap you again.\" That voice seems rather irritated. You decide to [[listen to it]]. You're awake now, after all.",
      "links": [
        {
          "text": "listen to it",
          "destination": {
            "name": "listen to it",
            "pid": 57
          }
        }
      ]
    },
    {
      "pid": 103,
      "name": "grind to a halt",
      "text": "You grind to a halt and turn toward the monsters streaming behind you. \\n\\nGrotesque and slobbering from their mouths, they shake their heads, spraying you with ichor. You wipe it off, leaving a black mark on your paper-thin pants.\\n\\nThe stand off continues, until, finally, one of the monsters walks over to you, with feline grace, and nudges your hand.\\n\\nWith trepidation you [[offer your hand]] trying not to breath in their foetic scent.\\n\\nYour other hand [[tightens on the knife]].",
      "links": [
        {
          "text": "offer your hand",
          "destination": {
            "name": "offer your hand",
            "pid": 52
          }
        },
        {
          "text": "tightens on the knife",
          "destination": {
            "name": "tightens on the knife",
            "pid": 121
          }
        }
      ]
    },
    {
      "pid": 104,
      "name": "rush the keymouse",
      "text": "Spry buggers, keymice. They were initially created to help run programs in labs.\\n\\nWhat this one is doing here, however, seems a little more involved.\\n\\nYou pause, trying to figure out the best approach. As you run after the keymouse it rushes toward a hole in the wall.\\n\\nAnd stays there, just out of reach of you hands.\\n\\nYou pause, staring at it. The keymouse, more key, really, but all electric impulses and little tiny legs. \\n\\nYou try and [[grab it]], by pushing your hands through the hole in the wall.",
      "links": [
        {
          "text": "grab it",
          "destination": {
            "name": "grab it",
            "pid": 67
          }
        }
      ]
    },
    {
      "pid": 105,
      "name": "Text appears on the screen",
      "text": "Welcome Prisoner. \\n\\nYou, Prisoner 11012, have information that could indict Prisoner 23015 and Prisoner 11058. Both for separate crimes. Both Prisoner 23015 and Prisoner 11058 have information that can idict you as well. \\n\\nShould you cooperate with us, we will allow you the option of freedom. However, should Prisoner 23015 or Prisoner 11058 assist first, you will be left here for an extended period of time.\\n\\nWhat do you choose?\\n\\nYou see great glowing buttons on the screen.\\n\\nOffer information on Prisoner [[23015]]\\nOffer information on Prisoner [[11058]]\\nOffer [[nothing]]\\n\\n<font color=4d6ad8><b>Prisoner, you have to [[cooperate]].</b></font>\\n\\n<font color=\"f8f8f8\">We're looking for you, we can find you and help you out, we just need to discover your position, professor.</font>",
      "links": [
        {
          "text": "23015",
          "destination": {
            "name": "23015",
            "pid": 82
          }
        },
        {
          "text": "11058",
          "destination": {
            "name": "11058",
            "pid": 38
          }
        },
        {
          "text": "nothing",
          "destination": {
            "name": "nothing",
            "pid": 43
          }
        },
        {
          "text": "cooperate",
          "destination": {
            "name": "cooperate",
            "pid": 88
          }
        }
      ]
    },
    {
      "pid": 106,
      "name": "Credits",
      "text": "<b>Unform</b>\\n\\nWritten and Created by\\n\\n<a href=\"http://www.elizemorgan.com\">Elize Morgan</a>\\n\\nProduced by\\n\\n<a href=\"http://www.alpacavsllama.com\"><img src=\"http://www.alpacavsllama.com/wp-content/uploads/2014/09/AvL_thumb.png\"></a>\\n\\n<b>Connect</b>\\n<a href=\"http://www.twitter.com/elizemorgan\">Twitter</a>\\n\\nSpecial Thanks\\n\\nNatalia Lopez-Woodside\\nFraser Mills\\n\\nCreated with\\n<a href=\"http://twinery.org/\">Twine</a>\\nPowered by <a href=\"http://tiddlywiki.com/\">TiddlyWiki</a>\\n\\nCover art from\\nPixaby\\n\\nTwine Model from\\n<a href=\"http://www.glorioustrainwrecks.com/\">Leon</a>\\n",
      "links": []
    },
    {
      "pid": 107,
      "name": "take",
      "text": "You grab for what looks to be a weird sort of sword, only to nick yourself in the process. The nanites take their time transforming back from sword form to cover your hand, cover the wound, healing it, slowly.\\n\\nThere's still a giant Knight attempted to kill you.\\n\\nYou might try [[stepping]] aside. But then, [[standing still]] might work just as well.",
      "links": [
        {
          "text": "stepping",
          "destination": {
            "name": "stepping",
            "pid": 7
          }
        },
        {
          "text": "standing still",
          "destination": {
            "name": "standing still",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 108,
      "name": "not move",
      "text": "You hear the [[smashing sound]] get louder. Obviously following that would be playing into their game.\\n\\nWhoever <i>they</i> are.\\n\\nYou've decided to not move, after all. It's your turn to [[stand your ground]].",
      "links": [
        {
          "text": "smashing sound",
          "destination": {
            "name": "smashing sound",
            "pid": 46
          }
        },
        {
          "text": "stand your ground",
          "destination": {
            "name": "stand your ground",
            "pid": 109
          }
        }
      ]
    },
    {
      "pid": 109,
      "name": "stand your ground",
      "text": "Apparently expecting nothing to happen wasn't the smartest play.\\n\\nYou have seconds to realize this before you are engulfed by the tiny little manic bugmites.\\n\\nYou feel them crawling into your skin, into your blood stream, and have enough time to gasp out \"That's impossible\" before they're in your lungs.\\n\\nYou hear, but maybe it's more a feeling as the nanites vibrate in response, a voice. The Voice. The judgement.\\n\\n\"You have been found wanting, prisoner.\"\\n\\nAs you are deconstructed, you feel yourself melting away. A mote on the wind.\\n\\nUntil, you're not. You're just a mote put together. Piece by piece. A freak of nature, but back at the [[Start]].",
      "links": [
        {
          "text": "Start",
          "destination": {
            "name": "Start",
            "pid": 69
          }
        }
      ]
    },
    {
      "pid": 110,
      "name": "listen to her",
      "text": "You pause, to listen to the story. \\n\\n\"The tale of the brothers says that one should always stop after three times. Never four, and probably not five. The creatures of the night know where you are, and parlay is given if the sacred trust is kept. Go forth thrice, then find your bearings. The brothers were always fighting, but in the most important of times they learned what they could do to make themselves strong.\"\\n\\nAs you go nearer to her she, and her audience, fritz out, turning to nothing.\\n\\nYou hear the [[scream]] again.",
      "links": [
        {
          "text": "scream",
          "destination": {
            "name": "scream",
            "pid": 124
          }
        }
      ]
    },
    {
      "pid": 111,
      "name": "The Case.",
      "text": "As the words fade behind you, a door opens in front of you, beckoning you in.\\n\\nYou balk for a moment, then move forward. This isn't the game you wanted to play, but it's what is happening, no turning back now.\\n\\nYou step through the door, a [[bright light]] blinding you, momentarily. \\n\\n\\n\\n",
      "links": [
        {
          "text": "bright light",
          "destination": {
            "name": "bright light",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 112,
      "name": "pain",
      "text": "It's agonizing. A rod stabs into your stomach, causing rolling spikes of pain.\\n\\nYou try and grab the staff, unclenching your eyes for a moment.\\n\\nAll you see is a mass of nanites - turning over and over into themselves and exploding out - exploding you.\\n\\nWracking pain through your arms, your hands, down into your guts and your heart.\\n\\nIt stops.\\n\\nYou flail, trying to grab a hold onto something in the world. But there's nothing to grab.\\n<br> \\n<br> \\n<br> \\n<br> \\n<br> \\n<br><br> \\n<br> \\n<br><br> \\n<br> \\n<br><br> \\n<br> \\n<br><br> \\n<br> \\n<br><br> \\n<br> \\n<br><br> \\n<br> \\n<br>\\nYour heart starts.\\n\\nThe beating of it, a long standing feeling of relief.\\n\\nBut the world isn't broken. You see the room, empty. As you stand, you pull a piece of straw off you. \\n\\n<font color=white>that shouldn't be there, you shouldn't be there, there's nothingnothingnothing</font>\\n\\nYou note, through the clanging in your head, that there's something you should do.\\n\\nYou seeing [[flashing words]] in front of your face. They seem insistent about something.",
      "links": [
        {
          "text": "flashing words",
          "destination": {
            "name": "flashing words",
            "pid": 54
          }
        }
      ]
    },
    {
      "pid": 113,
      "name": "The Monsters.",
      "text": "You make your choice, pressing your hand over monsters with some sort of trepidation. You hope that there's nothing overly complex about this.\\n\\nWhatever this is.\\n\\nSlowly, the black fades away, letting in a slight dawn light. Heat starts to emanate. The ground is sand. You stand up, to see a woman, in a tent, telling a story. Her audience is formless, colours shifting as she continues. Her skin is the light purple of the Effisyis, her eyes the colour of corn. \\n\\nHer voice is low, and she flickers in and out of focus. A hologram inside of a recreation. She shouldn't exist. The Effisyis have been dead for centuries, their peace-focused peoples destroyed in the war between the Empire and the Republic. When you think about either of those peoples more, the thoughts flit away. An understanding there and gone within a second.\\n\\nShe is telling a story, beckoning you to [[listen to her]]. Outside you can hear a [[scream]], broken and lasting.",
      "links": [
        {
          "text": "listen to her",
          "destination": {
            "name": "listen to her",
            "pid": 110
          }
        },
        {
          "text": "scream",
          "destination": {
            "name": "scream",
            "pid": 124
          }
        }
      ]
    },
    {
      "pid": 114,
      "name": "hand",
      "text": "You take it, and a searing pain crushes your skull for a moment. You're not sure what it meant, but you're certain it was important. \\n\\nThe entire world disappears, the nanites flowing back into the floor. You're left alone in the middle of the room, lost.\\n\\nSuddenly you feel compelled to the middle of the room. A list slowly materializes. You feel a compulsion. The need to choose.\\n\\n\\n<<if visited(\"The Castle.\")>><s>The Castle</s><<else>>[[The Castle.]]<<endif>>\\n<<if visited(\"The Deal.\")>><s>The Deal</s><<else>>[[The Deal.]]<<endif>>\\n<<if visited(\"The Monsters.\")>><s>The Monsters.</s><<else>>\\n[[The Monsters.]]<<endif>>\\n<<if visited(\"The Case.\")>><s>The Case.</s><<else>>[[The Case.]]<<endif>>\\n\\n<<if visited(\"The Deal.\", \"The Castle.\", \"The Monsters.\", \"The Case.\")>>\\nThis was all a [[mistake]].\\n<<endif>>\\n\\n",
      "links": [
        {
          "text": "The Castle.",
          "destination": {
            "name": "The Castle.",
            "pid": 116
          }
        },
        {
          "text": "The Deal.",
          "destination": {
            "name": "The Deal.",
            "pid": 29
          }
        },
        {
          "text": "The Monsters.",
          "destination": {
            "name": "The Monsters.",
            "pid": 113
          }
        },
        {
          "text": "The Case.",
          "destination": {
            "name": "The Case.",
            "pid": 111
          }
        },
        {
          "text": "mistake",
          "destination": {
            "name": "mistake",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 115,
      "name": "1277",
      "text": "The [[numbers]] reset.",
      "links": [
        {
          "text": "numbers",
          "destination": {
            "name": "numbers",
            "pid": 99
          }
        }
      ]
    },
    {
      "pid": 116,
      "name": "The Castle.",
      "text": "Another door opens. It beckons. You could [[stay here]] but the Voice Above, as you've taken to calling it, probably won't like that. \\n\\nYou walk forward, into the [[new room]].\\n",
      "links": [
        {
          "text": "stay here",
          "destination": {
            "name": "stay here",
            "pid": 18
          }
        },
        {
          "text": "new room",
          "destination": {
            "name": "new room",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 117,
      "name": "read it",
      "text": "You wander over to the table, looking around you as you do so.\\n\\nOther than this table, there's a few chairs scattered around the room, and the floor itself is scuffed.\\n\\nThis is not a room you want to spend any more time than you have to in.\\n\\nThe paper sits, innocent, words scanning over the surface. \\n\\n<i>Once prime, ever low,\\nBest open, never slow,\\nCare will give, least you fear the blow,\\nFloating still, will let you go.</i>\\n<<print either(\"Careful, doctor, least you find woe.\",\"More shall be discovered about the crow.\",\"You would be best to remember the status quo.\")>> \\n\\nObvious gibberish, whatever monkeys may exist in the system, this seems to be one of the least comprehensible.\\n\\nYou turn to the [[numbers]], hoping for more sense.\\n",
      "links": [
        {
          "text": "numbers",
          "destination": {
            "name": "numbers",
            "pid": 99
          }
        }
      ]
    },
    {
      "pid": 118,
      "name": "Yes",
      "text": "A door opens in the wall. You are obviously meant to walk forward. You do so, cautiously. The next room is stark, empty. \\n\\nA bright light shines into the middle of it. You get flashes of a similar experience, but the memory flits away. In fact, when you start to consider any memories, who you are, where you are it all... flits away.\\n\\nYour head aches, slightly, but you ignore it.\\n\\nThe room slowly melts away. The nanites in the walls rearrange themselves fluidly. The room, while still small, now has words floating in the middle of it. This does not surprise you. This is commonplace. Frankly, that little bit of you that's still inside you, you've seen it all before. This is nothing new.\\n\\n\"Prisoner\" The Voice continues. You try to ignore it, but it is a trifle loud. \"You have come for Judgement. You must pass our tests before we deem you to be rehabilitated. All Choices are evaluated, and weighed, and measured. You will make your choice.\"\\n\\n<<if visited(\"The Deal.\")>><s>The Deal</s><<else>>[[The Deal.]]<<endif>><<if visited(\"The Monsters.\")>><s>The Monsters.</s><<else>>\\n[[The Monsters.]]<<endif>>\\n<<if visited(\"The Case.\")>><s>The Case.</s><<else>>[[The Case.]]<<endif>>\\n<<if visited(\"The Castle.\")>><s>The Castle.</s><<else>>[[The Castle.]]<<endif>>\\n\\n<<if visited(\"The Deal.\", \"The Castle.\", \"The Monsters.\", \"The Case.\")>>\\s\\nSomething is wrong. You know it. Your mind screams it. This is all a [[mistake]].\\n<<endif>>\\s\\n\\n\\n",
      "links": [
        {
          "text": "The Deal.",
          "destination": {
            "name": "The Deal.",
            "pid": 29
          }
        },
        {
          "text": "The Monsters.",
          "destination": {
            "name": "The Monsters.",
            "pid": 113
          }
        },
        {
          "text": "The Case.",
          "destination": {
            "name": "The Case.",
            "pid": 111
          }
        },
        {
          "text": "The Castle.",
          "destination": {
            "name": "The Castle.",
            "pid": 116
          }
        },
        {
          "text": "mistake",
          "destination": {
            "name": "mistake",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 119,
      "name": "remember",
      "text": "Your synapses start to bridge, the nanites that you placed there finally getting a the jump they needed to actually do their job.\\n\\nIt hurts. It hurts like nothing you've ever felt before. But you did it to <i>yourself</i>, you remember. There had to be a reason.\\n\\nScreaming through the pain, you force yourself to think of the past, of the you that is left, taking the bits of pieces of personality that you remember - sometimes prickly, sometimes sweet, always brilliant - and putting them together. Remembering putting on a lab coat for the first time, remember your first (disastrous) marriage, and finally remembering where you are.\\n\\nThis isn't just a penitentiary. This was The Penitentiary. A place to reform the most hardened criminals, a place for peace, for some. The end for others. A place that was a success.\\n\\nToo much of a success, it seemed. The Republic started to question the work that we did, the work that they'd commissioned. As the head of Psychiatry, it seemed, your work was the most scrutinized. Even with stark successes, they wanted something else. \\n\\nYou whimper a little as a [[connection]] is made. The final piece of the puzzle.\\n\\n",
      "links": [
        {
          "text": "connection",
          "destination": {
            "name": "connection",
            "pid": 56
          }
        }
      ]
    },
    {
      "pid": 120,
      "name": "shout for the guard",
      "text": "You shout for the guard, pausing for a moment.\\n\\nYou wait, with no response.\\n\\nEventually, you hear a stomping sound coming up to your cell, and the door slams open.\\n\\nThe Knight walks towards you, belting you in the face. You try to fend off her blows, but she eventually stops hitting you, only to throw a blanket on your face.\\n\\nYou feel the blanket deconstruct itself, slowly, leaving you with bits on top of your face.\\n\\nWhen you try and move the blanket off, you realize that the blanket no longer exists. That what you're pushing off of your skin, is stuck, little bits of silver, slowly leaking into your skin.\\n\\nThe nanites are much stronger than you expected, and they rewire your brain, taking away your thoughts, you pass out.\\n\\nWhen you wake up, you're in a [[new room]].",
      "links": [
        {
          "text": "new room",
          "destination": {
            "name": "new room",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 121,
      "name": "tightens on the knife",
      "text": "You pull out your knife, and place it against the beast's throat. \\n\\nA deep growl starts all around you, and you slowly count the amount of the enemy you have around you. One after another the animals pounce, landing on you and smashing you to the ground, time, after time, after time until you can't take it anymore.\\n\\nWhich is when the the lead bats you to [[the ground]]. Everything goes black.",
      "links": [
        {
          "text": "the ground",
          "destination": {
            "name": "the ground",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 122,
      "name": "dissuade the knight",
      "text": "You look the knight up and down. For a creation of nanites, a volatile AI, she looks exceptionally realistic. \\n\\nYou are sure they weren't supposed to be this realistic, deep down, but maybe things have been updated. A tweak to a server, and you could easily start to think this is real. All you'd need is enough time and the feeling would be complete.\\n\\nYou should consider that, the implications of that, far reaching and probably negative in the wrong hands. For a moment you remember <i>something</i> about that, but it flits away like any other thought before it.\\n\\nBut the Knight is a waiting, and she's starting to look impatient.\\n\\n\"Uh, I'm really not here to be a jester, whatever that happens to be.\"\\n\\nHer face hardens. \"Well, then, imposter, I am the Captain of the Queen's Guard and I am forced to imprison you for treason.\" She looks deadly serious, and her sword comes right back out.\\n\\nYou could always try and make a joke, to [[go along with it]], if you recall correctly a jester made <i>jokes</i>, this could be a joke... right?\\n\\nOn the flip side, you do nothing for anyone's amusement and this [[isn't real]] after all. Time to force this puerile process to its inevitable conclusion.",
      "links": [
        {
          "text": "go along with it",
          "destination": {
            "name": "go along with it",
            "pid": 83
          }
        },
        {
          "text": "isn't real",
          "destination": {
            "name": "isn't real",
            "pid": 74
          }
        }
      ]
    },
    {
      "pid": 123,
      "name": "tall",
      "text": "<font color=red><font size=7>ERROR</font></font>\\n\\nYou try not to panic. Then, calm as the letters move off.\\n\\n[[Text appears on the screen]].",
      "links": [
        {
          "text": "Text appears on the screen",
          "destination": {
            "name": "Text appears on the screen",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 124,
      "name": "scream",
      "text": "As you step outside, the world shifts from day to night. Looking behind you, the tent disappears, slowly fading into the background, until it disappears. You pat your pocket and realize you have a knife in there. You take it out of its sheath, and accidentally knicking your finger on it. You promise yourself that you won't do that again.\\n\\nProbably.\\n\\nAs you let the curtains close on the tent, you realize that it is pitch black.\\n\\nYou can still hear the scream, and you pause, for a moment, considering. You can [[run]], but you don't know which direction to go in. [[Standing here]] may not be any safer, and you're not sure what they are hoping for.",
      "links": [
        {
          "text": "run",
          "destination": {
            "name": "run",
            "pid": 40
          }
        },
        {
          "text": "Standing here",
          "destination": {
            "name": "Standing here",
            "pid": 85
          }
        }
      ]
    }
  ]
}