{
  "passages": [
    {
      "pid": 1,
      "name": "Unit 322 (Disambiguation)",
      "text": "<h1>Unit 322 (Disambiguation)</h1>\n\n<p>Unit 322 may refer to:\n\n[[The Unit 322 Murder]], an unsolved murder in Adelaide, Australia.\n\n[[Unit 322]], a covert German research unit active during World War II.\n\n[[\"3:22\"]], a song by American psychadelic rock band [[Unit]].\n\n[[\"Reflection\" (Unity)]], often referred to as \"Unit 3x22\", an episode of the TV series [[Unity]].\n\n[[Back|Start]]\n\n</p>\n\n\n",
      "links": [
        {
          "text": "The Unit 322 Murder",
          "destination": {
            "name": "The Unit 322 Murder",
            "pid": 2
          }
        },
        {
          "text": "Unit 322",
          "destination": {
            "name": "Unit 322",
            "pid": 3
          }
        },
        {
          "text": "\"3:22\"",
          "destination": {
            "name": "\"3:22\"",
            "pid": 5
          }
        },
        {
          "text": "Unit",
          "destination": {
            "name": "Unit",
            "pid": 4
          }
        },
        {
          "text": "\"Reflection\" (Unity)",
          "destination": {
            "name": "\"Reflection\" (Unity)",
            "pid": 6
          }
        },
        {
          "text": "Unity",
          "destination": {
            "name": "Unity",
            "pid": 7
          }
        },
        {
          "text": "Back",
          "destination": {
            "name": "Start",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "The Unit 322 Murder",
      "text": "<h1>The Unit 322 Murder</h1>\n\n<p><i>For other uses, see [[Unit 322 (Disambiguation)]].</i>\n\n<p>The <b>Unit 322 Murder</b> is the name given to an unsolved murder that took place at 322 Parkway Drive in Adelaide, Australia. The victim, an unknown male estimated to be in his nineties, was skinned alive.\n\nPolice established that the killer entered the single story home (or unit, as they are known in Australia) through the back door at around 9:30 pm. The victim was subdued with chloroform, tied to a chair, and then his skin was removed with a knife. On the wall, a series of apparently random number and letter pairings were written in the victim's blood. The autopsy showed that morphine and amphetamines had been administered to the victim in order to keep him alive and awake throughout the torture. \n\nPolice efforts to identify the victim were unsuccessful. All teeth were removed from the victim and there was no documentation that the police could use to narrow their search. The property was registered to Paul Michaels, who had died nearly twenty years prior to the murder.\n\nThere are currently no suspects.\n\n(if: (history:) contains \"Code One\")[<p>[[One last thing before you go...|End one]]</p>]\n\n</p>\n\n\n\n",
      "links": [
        {
          "text": "Unit 322 (Disambiguation)",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        },
        {
          "text": "One last thing before you go...",
          "destination": {
            "name": "End one",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "Unit 322",
      "text": "<h1>Unit 322</h2>\n\n<p><i>For other uses, see [[Unit 322 (Disambiguation)]].</i>\n\n<b>Unit 322</b> was a Nazi biological and chemical weapons research and development program carried out in Buchenwald concentration camp during World War II. Between 1944 and 1945, under the command of Doctor [[Stefan Reichardt|The Doctor]], Unit 322 undertook lethal experiments aiming to develop methods to control and influence the actions of enemy combatants against their will.\n\n<b>Experiments</b>\nOver 2,000 prisoners were subjected to experimentation, including women and children. Test subjects were physically and mentally tortured, deprived of sleep, infected with diseases and forcibly addicted to opium in order to study the effects on the body. \n\nMany experiments focused on using music or other audio stimuli to trigger mechanical responses in subjects. Prisoners were forced to repeat actions for days or weeks at a time while listening to short audio loops. Some were even bombarded with high pitch frequencies to see whether they disrupted regular bodily functions.\n\n<b>Conclusion</b>\nThe program was brought to an end by the liberation of Buchenwald by U.S. troops on April 4, 1945. Many of the collaborators were later identified as part of [[Operation Paperclip]] and recruited for similar research programs in the United States, including the CIA's [[Project Ilium|Project Ilium]].</p>",
      "links": [
        {
          "text": "Unit 322 (Disambiguation)",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        },
        {
          "text": "Stefan Reichardt",
          "destination": {
            "name": "The Doctor",
            "pid": 8
          }
        },
        {
          "text": "Operation Paperclip",
          "destination": {
            "name": "Operation Paperclip",
            "pid": 28
          }
        },
        {
          "text": "Project Ilium",
          "destination": {
            "name": "Project Ilium",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "Unit",
      "text": "<h1>Unit (band)</h1>\n\n<p><b>Unit</b> was an American [[psychedelic rock|Psychedelic rock]] band formed in Cambridge, Massachusetts in 1970 by vocalist Reginald Taylor and guitarist Don Ronson. Considered one of the most innovative rock acts of the 1970s, they were noted for their dense, layered songs and use of experimental recording techniques.\n\n<b>Formation</b>\nTaylor and Ronson met in 1968 after participating in a study on the effects of LSD while students at MIT. They bonded over a shared a love of music and started writing songs together in Taylor's dormitory. Ronson, a physicist with a background in jazz music, was interested in how new studio technology could be used to create new kinds of sounds. Taylor was inspired by gospel and other congregational musical traditions, intending to create a form of music that was spiritual and transcendent. \n\n<b>Debut album</b>\nThe band entered the studio to record their first album in August 1971. This was a period of intense creativity, and Taylor and Ronson experimented with a variety of different recording technologies, often rewriting songs entirely to incorporate them. \n\nReleased on March 22, 1972, the untitled album, known as the <i>[[Unit LP|Unit LP (1972)]]</i>, spawned the hit single [[\"3:22\"]]. It was a commercial success, but Unit refused to tour or give any interviews in support of the album. This enigmatic behaviour contributed to the cult following that formed around the band. \n\n<b>Deaths of Taylor and Ronson</b>\nOn January 1, 1973, police responded to a call saying that gunshots had been heard coming from Ronson's home in Cambridge, Massachusetts. Ronson and Taylor were both discovered dead from bullet wounds to the head. Investigators ruled that Ronson had shot Taylor twice in the head with a pistol before turning the gun on himself. A motive for the incident was never established.<sup>[[(1)|Report: Ronson/Taylor]]</sup>\n\nNews of the apparent murder/suicide of Taylor and Ronson saw a spike of sales for the <i>Unit LP</i>. There were rumours that the pair had recorded some songs for a follow-up LP, but no recordings were every located.\n</p>",
      "links": [
        {
          "text": "psychedelic rock",
          "destination": {
            "name": "Psychedelic rock",
            "pid": 29
          }
        },
        {
          "text": "Unit LP",
          "destination": {
            "name": "Unit LP (1972)",
            "pid": 12
          }
        },
        {
          "text": "\"3:22\"",
          "destination": {
            "name": "\"3:22\"",
            "pid": 5
          }
        },
        {
          "text": "(1)",
          "destination": {
            "name": "Report: Ronson/Taylor",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "\"3:22\"",
      "text": "<h1>3:22 (Unit song)</h1>\n\n<p><i>For other uses, see [[Unit 322 (Disambiguation)]].</i>\n\n<b>\"3:22\"</b> is a song by American psychadelic rock band [[Unit]], released on March 22, 1972. It was composed by guitarist Don Ronson and vocalist Reginald Taylor for the band's untitled first studio album, often referred to as the <i>[[Unit LP|Unit LP (1972)]]</i>.\n\nThe song is built around a central bass riff and unconventional drum pattern, with layers of guitar, organ and vocals added to create a dense wall of sound. The lyrics are a series of apparently random letter and number pairings. Numerous theories by music theorists, numerologists and mathematicians have been put forward to explain their significance.\n\n<b>Personnel</b>\nReginald Taylor - Vocals, percussion\nDon Ronson - Guitar, bass, drums, organ\n</p>\n\n\n",
      "links": [
        {
          "text": "Unit 322 (Disambiguation)",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        },
        {
          "text": "Unit",
          "destination": {
            "name": "Unit",
            "pid": 4
          }
        },
        {
          "text": "Unit LP",
          "destination": {
            "name": "Unit LP (1972)",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "\"Reflection\" (Unity)",
      "text": "<h1>Reflection (<i>Unity</i>)</h1>\n\n<p><i>For other uses, see [[Unit 322 (Disambiguation)]].</i>\n\n<b>\"Reflection\"</b> is the unproduced twenty-second episode of the third series of the American science-fiction television series [[Unity]]. It is often referred to by fans as \"Unit 3x22\". Written and directed by show creator [[William Scott]], it was intended to be the series finale, concluding the conflict between the psychic Xar'al and the human crew of the USS Fortitude.\n\nHowever, on April 9, 1978, a fire broke out in the studio where the episode was being filmed. It quickly engulfed the building, killing 21 people, including Scott, stars Rick Costello and Tracey Winters, and many other cast and crew.\n\nIn the aftermath of the fire, the network cancelled Unity, stating that it had no intention of producing the finale with another cast and crew.<sup>[[(1)|Report - After the fire]]</sup> \n\nThe episode has become a source of controversy for Unity fans. In 2001, a fansite released what was alleged to be a genuine copy of the episode's script. In it, Ulysses Black, the last surviving member of the Fortitude, manages to reverse the mind control process of the Xar'al and inhabit the body of their leader. Black comes to realise that the humans were the true aggressors in the conflict and that the Xar'al were only acting to defend their home. The authenticity of the document has been heavily disputed.</p>",
      "links": [
        {
          "text": "Unit 322 (Disambiguation)",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        },
        {
          "text": "Unity",
          "destination": {
            "name": "Unity",
            "pid": 7
          }
        },
        {
          "text": "William Scott",
          "destination": {
            "name": "William Scott",
            "pid": 30
          }
        },
        {
          "text": "(1)",
          "destination": {
            "name": "Report - After the fire",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "Unity",
      "text": "<h1>Unity (TV Series)</h1>\n\n<p><i><b>Unity</b></i> is an American science-fiction television series created by [[William Scott]], airing between 1975 and 1978. The show ran for three seasons, but the final episode never aired. A fire during the filming of the series finale killed many of the cast and production crew, after which <i>Unity</i> was cancelled.\n\n<b>Plot</b>\nSet in the year 3220, the show follows the crew of the starship USS Fortitude after it crash-lands on the planet Ourous. Led by Captain Ulysses Black (Rick Costello), the survivors find themselves in conflict with the Xar'al, an alien race with psychic abilities. With any one of the crew possibly under the control of the Xar'al, the crew work to overcome their distrust of one another and return home.\n\n<b>Production</b>\nIn early 1973, William Scott drafted a proposal for the science-fiction series that would become <i>Unity</i>. Scott intended the show to reflect the unease of the Cold War period, hence the Xar'al's ability to control minds and the paranoia that grips the crew.\n\nThe show was noted for many unconventional and formally ambitious episodes: the first season episode \"See No Evil\" was shot entirely from the first person perspective of one of the characters; the second season finale \"Song of Ilium\" was set entirely to music and contained no dialogue; the season three episode \"Parallels\" played two separate storylines at the same time in split screen. \n\nThe third season episode \"Lights Out\" was notable in that it appeared to predict the [[New York City blackout of 1977|New York Blackout]] a week before it happened. In the episode, the Fortitude suffers a massive power failure and the crew must repel a Xar'al attack in the dark. \n\n<b>Fire and cancellation</b>\nOn April 9, 1978, a fire broke out in the studio where the finale, [[\"Reflection\"|\"Reflection\" (Unity)]], was being filmed. Many of cast and crew, including show creator William Scott, were killed. The network subsequently cancelled the show without producing the episode.\n</p>",
      "links": [
        {
          "text": "William Scott",
          "destination": {
            "name": "William Scott",
            "pid": 30
          }
        },
        {
          "text": "New York City blackout of 1977",
          "destination": {
            "name": "New York Blackout",
            "pid": 37
          }
        },
        {
          "text": "\"Reflection\"",
          "destination": {
            "name": "\"Reflection\" (Unity)",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "The Doctor",
      "text": "<h1>Stefan Reichardt</h1>\n\n<p><b>Stefan Reichardt</b> (October 12, 1912) is a German-American physician and researcher. He was the Chief SS Doctor (SS-Standortarzt) at Buchenwald concentration camp from January 1943 - April 1945, overseeing the infamous [[Unit 322 research programme|Unit 322]] into mind control. After the end of World War II, Reichardt worked as a researcher in the U.S. until his disappearance in 1972.\n\n<b>Early life and education</b>\nReichardt was born the youngest of three children to Dieter and Eva Reichardt in Günzburg, Bavaria, Germany. He excelled at school from a  very young age and developed a keen interest in music. By the age of ten he had become proficient at the piano and regularly sang in school choirs. \n\nReichardt completed high school in 1931 and studied medicine at the Goethe University Frankfurt. In addition, he also studied at the University of Munich, eventually earning a PhD in anthropology. It was there that he became involved in student politics, joining the Nazi party and the <i>Schutzstaffel</i> (SS) in 1937.\n\n<b>Military service and Buchenwald</b>\nAfter the outbreak of World War II in 1939, Reichardt volunteered for medical service in the <i>Waffen-SS</i>. After serving as a battalion medical officer for the 5th SS Panzer Division Wiking, he was posted to Buchenwald concentration camp as chief physician. \n\nIt was here that Reichardt oversaw the infamous [[Unit 322]] research program, performing deadly human experiments on prisoners. In particular, his research focused on using sound and music broadcasts to trigger responses in test subjects.<sup>[[(1)|Doctor's note one]]</sup>\n\n<b>U.S. research and disappearance</b>\nAfter the end of World War II, Reichardt was brought to the U.S. as part of [[Operation Paperclip]]. He worked on a number of projects for the U.S. government departments developing interrogation techniques to be used on foreign spies. He was also a part of the CIA's [[Project Ilium]] researching mind control. After the murder of the project's lead, [[Alison Bloom]], by the serial killer [[Tommy Gibson]], the program was terminated. Reichardt then went into hiding and has never been found.</p>\n",
      "links": [
        {
          "text": "Unit 322 research programme",
          "destination": {
            "name": "Unit 322",
            "pid": 3
          }
        },
        {
          "text": "Unit 322",
          "destination": {
            "name": "Unit 322",
            "pid": 3
          }
        },
        {
          "text": "(1)",
          "destination": {
            "name": "Doctor's note one",
            "pid": 10
          }
        },
        {
          "text": "Operation Paperclip",
          "destination": {
            "name": "Operation Paperclip",
            "pid": 28
          }
        },
        {
          "text": "Project Ilium",
          "destination": {
            "name": "Project Ilium",
            "pid": 9
          }
        },
        {
          "text": "Alison Bloom",
          "destination": {
            "name": "Alison Bloom",
            "pid": 18
          }
        },
        {
          "text": "Tommy Gibson",
          "destination": {
            "name": "Tommy Gibson",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "Project Ilium",
      "text": "<h1>Project Ilium</h1>\n\n<p><b>Project Ilium</b> - sometimes referred to as the CIA's behavior modification program - is the code name given to a series of experiments on human subjects conducted by the United States Central Intelligence Agency and several other agencies operating unknowingly on its behalf.\n\nExperiments on humans were intended to develop audio and visual stimuli containing coded messages that could be deciphered by the brain to trigger certain behaviours. The CIA aimed to remotely brainwash foreign military or civilian personnel into becoming unwitting sleeper agents.\n\n<b>Experiments</b>\nSubjects were administered psychedelic drugs (such as LSD) to place them in a receptive mental state. They would then be subjected to various combinations of sound and imagery containing subliminal messages intended to directly target and stimulate parts of the brains repsonsible for various motor functions. These might often be no more than repeated 30 second loops of music or imagery.\n\nIt was common practice to dose subjects with amphetamines to keep them awake for longer periods of exposure. Researchers regulary kept people awake and subjected to stimuli for periods of 72 continuous hours or more.\n\n<b>Subjects</b>\nThe majority of experiments were carried out on drug addicts, prostitutes, prisoners and mental patients, often without their consent.<sup>[[(1)|Doctor's Note #3]]</sup> These types of subjects were chosen, according to one agency officer, because of their \"inability to refuse participation.\"\n\nOccasionally, students would be recruited from universities to participate in studies. Most notably, Reginald Taylor and Don Ronson, vocalist and guitarist of 70s [[psychadelic rock|Psychedelic rock]] band [[Unit]], took part in studies conducted under Project Ilium while they were both at MIT.\n\n<b>Deaths</b>\nThe project was unofficially brought to an end after several members of the research team, including project lead [[Alison Bloom]], died in mysterious circumstances. CIA Director Richard Helms ordered that all the research materials be destroyed.</p>\n\n\n\n\n",
      "links": [
        {
          "text": "(1)",
          "destination": {
            "name": "Doctor's Note #3",
            "pid": 17
          }
        },
        {
          "text": "psychadelic rock",
          "destination": {
            "name": "Psychedelic rock",
            "pid": 29
          }
        },
        {
          "text": "Unit",
          "destination": {
            "name": "Unit",
            "pid": 4
          }
        },
        {
          "text": "Alison Bloom",
          "destination": {
            "name": "Alison Bloom",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "Doctor's note one",
      "text": "<p2>\nJanuary 14, 1945\n\nThe idea that we have any control over ourselves is a fiction. We are such stupid creatures, so like every other animal, that precious little of the operation of the human machine is left to conscious thought. All of the body's vital mechanisms are regulated by the subconscious. The heart, for example, is an intricate timepiece that keeps us alive without us even having to contemplate it. \n\nEven behaviours we would deem representative of a civilised creature - dressing oneself, riding a bicycle, playing the piano - are quickly memorised and automated by our bodies. We sleepwalk through almost our entire lives.\n\nI believe the human body can be piloted, just like an aircraft or an automobile. One simply has to establish the interface through which to  bypass consciousness and initiate these learned behaviours. \n\nPavlov performed a neat parlour trick, making his dogs salivate with a ringing bell. But what if a sound could make a man lie down in the middle of the road? What if a piece of music could make a soldier turn his weapon on his commanding officer? [[What if a man could be made one's puppet from miles away?|Code One]]\n</p2>",
      "links": [
        {
          "text": "What if a man could be made one's puppet from miles away?",
          "destination": {
            "name": "Code One",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "Tommy Gibson",
      "text": "<h1>Tommy Gibson</h1>\n\n<p><b>Thomas Stanley Gibson</b> (born January 11, 1948 - November 4, 1975) was an American serial killer responsible for three murders between March and April 1972. The brutal nature of Gibson's crimes, in which he would break into his victims' homes and skin them alive, brought a large amount of media attention.\n\n<b>Early life</b>\nGibson was born in San Diego, California to Elizabeth \"Betty\" Gibson, a single mother who worked several jobs to support her son. Gibson never knew his birth father. He had a troubled childhood, spending a lot of time alone at home and regularly getting into fights with other boys at school. \n\nAt age 18, Gibson joined the U.S. Army and served in Vietnam. After an honorable discharge in 1969, Gibson held a series of menial jobs, such as a high school janitor and sorter for the U.S. Postal Service. By 1972, he had moved to New York City and was working as a taxi driver. \n\n<b>Murders</b>\nOn March 22, 1972, Gibson broke into the house of Dr Edward Lee, tied him to a chair and removed his skin with a knife over a period of three hours. He then returned home, burned the blood-stained clothes and disposed of the murder weapon.\n\nOn March 27, 1972, Gibson forced his way into the home of [[Dr Alison Bloom|Alison Bloom]]. As with Lee, Gibson strapped Bloom to a chair and used a knife to take her skin off. Her body was not discovered until two days later.\n\nOn April 3, 1972, Gibson murdered his final victim, Eleanor Jones, a recovering drug addict. She was skinned alive by Gibson while her newborn baby was in the next room.\n\n<b>Arrest</b>\nFollowing the murder of Eleanor Jones, a neighbour spotted Gibson leaving the scene in his car and reported the license plate to the police. On April 5, 1972, Gibson was arrested and his house searched for evidence. Police found the clothes he was wearing during the Jones murder still covered in her blood, as well as the knife used to skin her.\n\nGibson was tried for all three homicides the following year. Despite claiming that he had no memory of committing the murders,<sup>[[(1)|Call #2]]</sup> he was found mentally competent to stand trail. Gibson was convicted of three counts of murder and sentenced to life imprisonment.\n\n<b>Incarceration and death</b>\nUpon sentencing, Gibson was transferred to Columbia Correctional Institution in Portage, Wisconsin. In November 1975, Gibson's throat was cut by another inmate and he bled to death. The attacker was never identified.</p>",
      "links": [
        {
          "text": "Dr Alison Bloom",
          "destination": {
            "name": "Alison Bloom",
            "pid": 18
          }
        },
        {
          "text": "(1)",
          "destination": {
            "name": "Call #2",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "Unit LP (1972)",
      "text": "<h1>Unit LP</h1>\n\n<p>The untitled studio album by American [[psychedelic rock|Psychedelic rock]] band [[Unit]], commonly known as <b><i>the Unit LP</i></b>, was released on March 22, 1972. Produced by guitarist Don Ronson, it was recorded between August and December 1971. \n\n<b>Composition and recording</b>\nMany of the songs started with a single musical idea that repeated over and over, adding more instruments or sounds each time. The aim was to create a transcendent feeling in the listener by slowly overwhelming their senses. \n\nRonson and vocalist Reginald Taylor wrote the album with no intention of reproducing the material live, so they employed a number of innovative recording techniques, such as backwards recordings, tape loops and automatic double tracking to create a hypnotic, otherworldly sound. Ronson, a multi-instrumentalist, played guitar, bass and drums on the album. He also added organ, sitar, cello, banjo and trumpet parts to many tracks. \n\nTaylor, inspired by his background in gospel music, laid multiple takes of his vocals on top of each other to create the impression of a large choir. Different effects, such as reverb, were applied to different vocal takes to give the feeling of many different voices. \n\n<b>Reception</b>\nThe album was a commercial success, and the single [[\"3:22\"]] received significant radio play. Reviews were generally favourable, with many commenting on the sophistcated sound of the album. However, some reviewers wondered how two young students from MIT managed to fund such a technically accomplished album with no major label support.\n\n<b>Track Listing</b>\n<i>All songs written and performed by Taylor/Ronson</i>\n\nSide 1\n1. [[\"3:22\"]]\n2. Metamorphosis\n3. Multiply by Zero\n4. La Belle Epoch\n\nSide 2\n1. Visible Frequencies\n2. Monolith\n3. Oasis\n4. The Song of Ilium</p>",
      "links": [
        {
          "text": "psychedelic rock",
          "destination": {
            "name": "Psychedelic rock",
            "pid": 29
          }
        },
        {
          "text": "Unit",
          "destination": {
            "name": "Unit",
            "pid": 4
          }
        },
        {
          "text": "\"3:22\"",
          "destination": {
            "name": "\"3:22\"",
            "pid": 5
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "Report - After the fire",
      "text": "<p2>Report: [REDACTED]\nDate: [REDACTED]\nFiled by: [REDACTED]\n\nWhat a goddamn mess. The fire was an inelegant solution, sure, but it was the only way to neutralise pretty much everyone involved. \n\nJesus Christ, the scale of this thing. It’s far more sophisticated than anything we were working on with Ilium. Three seasons of television at 50 minutes per episode, that’s over 45 hours of material. There could be hundreds, possibly thousands, of individual commands. I’m going to need to a big team of analysts to decipher everything. We’ll need to press the network to get copies of the episodes, scripts, storyboards, everything.\n\nYou were right, though. From what little I've seen so far, this has Reichardt's stink all over it. It's also looking likely that this was responsible for the riots during the New York blackout last year. But what the fuck's the point? Did he tear up New York just because he could? To show us what he's capable of? \n\nThat fucking kraut. We’ve been after him for years with nothing and it turns out he was hiding in plain sight the whole time. It's unlikey that we'll be able to track down that bastard from this, but at least the intelligence came in time to stop what he was up to. [[Fuck, I used to watch this show|Code Three]]\n</p2>\n",
      "links": [
        {
          "text": "Fuck, I used to watch this show",
          "destination": {
            "name": "Code Three",
            "pid": 24
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "Report: Ronson/Taylor",
      "text": "<p2>\nReport: [REDACTED]\nDate: [REDACTED]\nFiled by: [REDACTED]\n\nWe've been able to piece together what happened from the doctor's diaries and the few files we didn't destory after the termination of the program. Looks like he found these two through one of the LSD studies we ran out of MIT. Seems like they were pretty smart kids, too. \n\nReichardt probably killed them himself. Tying up loose ends. He must have known that we'd eventually find the money he'd been funelling into these guys and connect it to the Gibson stuff. Another one of his fucking suceptibles.\n\nIt'd be impressive if it wasn't such a disaster. Coding commands into music - we thought we were years away from being able to do that. Turns out he was doing it the whole time under our noses. \n\nAnyways, we've contained the crime scene, but I don't think we'll find anything that tells us where Reichardt is or where he's going. We're only here because he led us here. Those diaries he left before he went to ground, he wanted us to find them. He wanted us to know it was him. \n\nI'd recommend that we increase security around the baby. After what happened to her mother there's no guarantee she's safe just yet.\n\n[[That son of a bitch. Always two steps ahead|Code Two]].</p2>\n",
      "links": [
        {
          "text": "That son of a bitch. Always two steps ahead",
          "destination": {
            "name": "Code Two",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "Final note",
      "text": "<p2>I'm sorry that you got mixed up in all this, whoever you are. \n\nI hope by now you'll have seen what a terrible man my father is. You don't really need to know, but I think it's important. You might be ruining your whole life doing this thing for us, you at least deserve to know why.\n\nI never met my real parents. Everything I know about them comes from case files. I'm amazed the agency even let me see them. All the terrible things he did. All the terrible things that had to be done to stop him.\n\nDid I take up his research to get back at him? To get closer to him? I'm not sure I'll ever be able to answer that question. But it's something I'm good at, and we've made so much progress. With the internet, we have access to so many susceptibles, there's no limit to what we could do. My father was so interested in the possibilities of new technology, after all.\n\nSo it felt like fate, when the agency said they'd found him. Hiding out, living a quiet life on the other side of the world. It seemed like the perfect way to test out everything we've been working on. I wouldn't necessarily say it's poetic, but there's something fitting about this being the first test of the new system. \n\nHe's a very old man by now. It hardly seems worth it. But it's worth it.\n\n[[Let's get this over with, shall we?]]</p2>",
      "links": [
        {
          "text": "Let's get this over with, shall we?",
          "destination": {
            "name": "Let's get this over with, shall we?",
            "pid": 22
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "Doctor's Note #2",
      "text": "<p2>\nSeptember 2, 1944\n\nA holy man will deny his fundamental desires in order to please his god. An alcoholic will annihilate himself in service of his addiction. A soldier will walk in the path of a bullet out of duty to his country.\n\nWhy do people do the things that they do not want to do? How can you push a man to act against his own best interests? This has been a fundamental enquiry in our research, and has been the focus of many of our experiments. Fortunately, our circumstances afford us as many test subjects as we need. \n\nIf you starve a man for long enough, he will eat through his own arm to survive. If you put a gun to the head of a child, there is no limit to how much the mother will debase herself to save them.\n\nOthers do not require such persuasive methods. One subject, I merely had to mention she could fuck me to save her life and she opened her legs. I did not even have to produce my pistol. \n\nCertain people are more susceptible to forms of outside control than others. Fanatics, zealots, addicts, they are all looking outside of themselves for something to give them meaning or purpose. If there's one thing the Third Reich has shown the world, it is what can be accomplished when young, impressionable people are given something to die for.\n\nThere must be something about their biology that makes them susceptible to outside influence. Identifying these traits has become the primary focus of our work.\n\n[[BACK|Operation Paperclip]]</p2>",
      "links": [
        {
          "text": "BACK",
          "destination": {
            "name": "Operation Paperclip",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "Doctor's Note #3",
      "text": "<p2>\nJuly 8, 1971\n\nI am no fool. I know that many would consider what we did at Buchenwald monstrous. And history excuses the atrocities of the victors, not the defeated. \n\nSo when the United States government gave me the choice between continuing my research with them or facing trial for my crimes, it was an easy one to make.\n\nI was initially concerned that the Americans, like most small-minded people, would lack the stomach for what must be done in the name of progress. I would very quickly learn that they did not lack an appetite for brutality.\n\nIn many ways, it was like being at Buchenwald again. I had a steady supply of addicts, whores and degenerates for use in my work. What amazed me was the pleasure my CIA colleagues took in mistreating the subjects. We were all but encouraged to have our way with the women, so long as we kept it hidden from Dr Bloom. I indulged, of course. It would be distasteful to refuse such gracious hospitality. \n\nBut when one of the subjects told me that she was pregnant, and that she was certain the child was mine, why did I not dispose of her? Why did I let her carry the child to term? Am I too governed by the same instincts and biological directives as all beasts?\n\nPerhaps I am getting soft in my old age.\n\n[[BACK|Project Ilium]]</p2>",
      "links": [
        {
          "text": "BACK",
          "destination": {
            "name": "Project Ilium",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "Alison Bloom",
      "text": "<h1>Alison Bloom</h2>\n\n<p><b>Alison Bloom</b> (4 December 1927 - 27 March 1972) was an American chemist who conducted research into influencing human behavior. She was director on the CIA's [[Project Ilium]] into brainwashing and mind control. \n\nAfter training as a nurse, Bloom joined the U.S. Army and was deployed to Korea during the Korean War. She served first in combat zones, but was later assigned to a Japanese hospital receiving wounded U.S. soldiers. While in Japan, she volunteered to be part of a CIA program using psychoactive substances to rehabilitate traumatized soldiers. \n\n<b>Further research</b>\nAfter the end of the Korean War, Bloom was recruited by the Scientific Intelligence Division of the CIA. She returned to the U.S. and spent many years developing chemicals to be used in interrogations. It was during this time that she gained a PhD in organic chemistry.\n\nIn 1968, she was placed in charge of the CIA's [[Project Ilium]] into remote brainwashing. It was there that she worked with scientists such as [[Stefan Reichardt|The Doctor]], head of the notorious [[Unit 322]] research program during World War II.<sup>[[(1)|Call #1]]</sup> \n\n<b>Death</b>\nOn March 27, 1972, Bloom was murdered in her home by serial killer [[Tommy Gibson]]. He broke into her home, restrained her and then removed her skin using a kitchen knife. After her death, the CIA cancelled Project Ilium and destroyed all relevant research data.</p> \n\n",
      "links": [
        {
          "text": "Project Ilium",
          "destination": {
            "name": "Project Ilium",
            "pid": 9
          }
        },
        {
          "text": "Stefan Reichardt",
          "destination": {
            "name": "The Doctor",
            "pid": 8
          }
        },
        {
          "text": "Unit 322",
          "destination": {
            "name": "Unit 322",
            "pid": 3
          }
        },
        {
          "text": "(1)",
          "destination": {
            "name": "Call #1",
            "pid": 19
          }
        },
        {
          "text": "Tommy Gibson",
          "destination": {
            "name": "Tommy Gibson",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "Call #1",
      "text": "<p2><i>Transcipt of telephone conversation between BLOOM, DR ALISON and [REDACTED], 09:41, 07/31/70.</i>\n\n[REDACTED]: How's the kraut settling in?\n\nBLOOM: He's been useful. He's helped us refine the criteria for study participants and we're already having quite promising results with the new intake.\n\n[REDACTED]: Good. How's he getting along with the rest of the team?\n\nBLOOM: He isn't. He provokes them. There was a physical altercation between him and Dr Lee last week. \n\n[REDACTED]: (laughs) Well, that's to be expected. Reichardt is a genius but he's still a fucking Nazi.\n\nBLOOM: I'm not sure I quite understand what his clearance is.\n\n[REDACTED]: What do you mean?\n\nBLOOM: Well, it looks like you've assigned him some projects, but I can't get access to any of the files.\n\n[REDACTED]: That's probably because they're classified. \n\nBLOOM: And you didn't think I should be aware of them?\n\n[REDACTED]: I didn't.\n\nBLOOM: He's part of my team. I can't have my researchers working on things I'm unaware of. It's unorthodox.\n\n[REDACTED]: Is that supposed to be a joke?\n\nBLOOM: I just think that I should oversight into-\n\n[REDACTED]: -Dr. Bloom, do you know how many agency research programs have female leads? \n\nBLOOM: No.\n\n[REDACTED]: A small fucking number, I can tell you that. But we wanted the best people working on this thing, regardless of their background. That's why you're leading the research. But you're not in charge. You still take orders from us, and if we say you don't need to know something then you don't need to know it. Is that going to be a problem?\n\nBLOOM: ...\n\n[REDACTED]: Is that going to be a problem?\n\nBLOOM: No.\n\n[REDACTED]: You're doing incredibly important work, Dr Bloom, but there's no rulebook for what we're trying to do. We're off the reservation. Which means we're all going to have to get used to doing things we're not comfortable with.\n\n[[CALL ENDS|Code Five]]</p2>",
      "links": [
        {
          "text": "CALL ENDS",
          "destination": {
            "name": "Code Five",
            "pid": 36
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "Call #2",
      "text": "<p2><i>Transcipt of telephone conversation between BLOOM, DR JULIET and [REDACTED], 19:53, 03/27/72.</i>\n\n[REDACTED]: Calm down, Juliet.\n\nBLOOM: Something's not right [unintelligible] I'm scared.\n\n[REDACTED]: Why don't you just calm down and tell me what happened?\n\nBLOOM: I found out that one of the subjects, her name is, uh, Jones or something, she's pregnant. \n\n[REDACTED]: Ok.\n\nBLOOM: I interviewed her myself and she told me that Reichardt is the father.\n\n[REDACTED]: Do you believe her?\n\nBLOOM: She's definitely pregnant, if that's what you mean. Looks like she'll give birth any day now. \n\n[REDACTED]: Have you spoken to the kraut? Do you know if it's his?\n\nBLOOM: That's the thing, no one knows where he is. I can't find him anywhere. \n\n[REDACTED]: Well, the subjects are mostly crackheads and prostitutes, so I'm not entirely sure they're reliable.\n\nBLOOM: You don't understand. I think something really bad is going on with Reichardt. What happened to Eddie...they were always at each other's throats, and now Eddie's dead. \n\n[REDACTED]: We're aware of the circumstances around Dr Lee's death, and we're certain there's a perfectly reasonable explanation.\n\nBLOOM: He was skinned alive! What's your reasonable fucking explanation for that?\n\n[REDACTED]: Just calm down. \n\nBLOOM: It was Reichardt, I'm sure of it. He's capable of anything. All these secret little projects you've got him working on, you really think he's telling you the truth about what he's doing? Do you even know what the fuck you've been letting him do?\n\n[REDACTED]: What exactly do you want us to do?\n\nBLOOM: Find the son of a bitch. At make sure the girl's safe.\n\n[REDACTED]: Fine, we'll bring her in.\n\nBLOOM: At least until we figure out what the fuck is...[unintelligible]...hang on, there's someone at the door. I'll call you back.\n\n[[CALL ENDS|Code Four]]</p2>",
      "links": [
        {
          "text": "CALL ENDS",
          "destination": {
            "name": "Code Four",
            "pid": 35
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "Code One",
      "text": "<p2>R3 KP PV HB P2\nSW E6 PY W0 OS\n74 32 UC DH X9\nST 1B 5L HJ WM\nAM 34 KO AG DY\n96 RQ JE MU FU\nKK 51 G2 NB X6\nGF UV O3 CY WT\nIY 01 99 QD 8D\nJ2 MD 6J KC NP\n\n[[ACCEPT|Unit 322 (Disambiguation)]]</p2>",
      "links": [
        {
          "text": "ACCEPT",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "Let's get this over with, shall we?",
      "text": "<p2>\n9Q 7G HQ 68 S3\n2H WT DX 6E 2D\nMJ QJ 04 OZ OF\nFH AW IC 2S 2X\nDR QB ZV HJ EK\nP1 UJ CX QI 32\nP7 P1 CK YU W0\n0B M7 D3 1D 6Y\n3F W2 GQ WF ZZ\n08 9M P9 IN PE\n\n[[ACCEPT|The end]]</p2>",
      "links": [
        {
          "text": "ACCEPT",
          "destination": {
            "name": "The end",
            "pid": 25
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "Code Two",
      "text": "<p2>O3 OJ JE 15 GW\nON 9M 98 VP HW\nPP VR QP JI WX\n5P XC 1I EV MG\nXR CE NS 2D TM\nWW LX Z9 OS 37\nWS JS RJ 19 Q5\nL1 L3 MX OF X2\n15 G9 QU MR K9\nF7 I2 00 BC OZ\n\n[[ACCEPT|Unit 322 (Disambiguation)]]</p2>",
      "links": [
        {
          "text": "ACCEPT",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "Code Three",
      "text": "<p2>TA LX 6K Q1 VK\nZW Y9 1R 82 7Q\n0O GT LY YR 9F\nV3 U6 NJ 1O CU\nJL 5Y KD FB ZD\nR3 K2 8J V1 DN\n62 YV SV 1Y FU\nJN 1W Y6 FJ Z6\nW3 QU 5R PS XW\nRK D6 C0 LH 1E\n\n[[ACCEPT|Unit 322 (Disambiguation)]]</p2>\n\n(set: $CodeThree to true)",
      "links": [
        {
          "text": "ACCEPT",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "The end",
      "text": "<h1>The Unit 322 Murder</h1>\n\n<p>The <b>Unit 322 Murder</b> is a murder you will commit at 322 Parkway Drive in Adelaide, Australia. The victim, Stefan Reichardt, will be skinned alive.\n\nYou will enter the single story home through the back door at 9:30 pm. You will subdue the victim with chloroform, tie him to a chair, and then remove his skin with a knife. You will administer morphine and amphetamines in order to keep him alive and awake throughout the procedure. \n\nYou will remove all teeth from the victime and destroy all documentation that could identify him. You will write the previous code sequence on the wall in blood.\n\n[[ACCEPT|The End]]</p>",
      "links": [
        {
          "text": "ACCEPT",
          "destination": {
            "name": "The End",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "Start",
      "text": "<p>[[Unit 322 (Disambiguation)]]\n\nBy Jonny Muir\n\n\n\nClick here if you need [[help]].\n\n[[Testers]]\n\n</p>\n",
      "links": [
        {
          "text": "Unit 322 (Disambiguation)",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        },
        {
          "text": "help",
          "destination": {
            "name": "help",
            "pid": 34
          }
        },
        {
          "text": "Testers",
          "destination": {
            "name": "Testers",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "The End",
      "text": "<p>The End\n\n\n\n\n\n\nGo back to [[the beginning|Start]].</p>",
      "links": [
        {
          "text": "the beginning",
          "destination": {
            "name": "Start",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "Operation Paperclip",
      "text": "<h1>Operation Paperclip</h1>\n\n<p><b>Operation Paperclip</b> was a secret program in which German scientists, engineers, and technicians were recruited by the U.S. government at the end of World War II. The primary objective of Operation Paperclip was to exploit German scientific and technical expertise and give the U.S. military advantage against the Soviet Union in the Cold War. More than 1,600 Germans, many of them members of the Nazi party, were taken to the U.S. as part of the program.\n\n<b>Initiation and evacuation</b>\nThe Joint Chiefs of Staff (JCS) began the first recruitment program, Operation Overcast, on July 20, 1945. It was renamed Operation Paperclip in November 1945, after paperclips were affixed to the folders of Nazi personnel to indicate they should be brought to the America. President Truman officially approved the program on September 3, 1946. \n\nThe program began identifying, locating and capturing German research and technical personnel. Many had been evacuated to Saxony and Thuringia ahead of the fall of Berlin, and the U.S. began a concerted evacuation operation in these areas, transporting 1,800 scientists and their family members to America.\n\n<b>Arrival in the U.S.</b>\nMany United States military and civilian institutions employed personnel from Operation Paperclip. Wernher von Braun and his V-2 rocket team worked on an intermediate-range ballistic missile (IRBM) program, before later working on the Explorer 1 and Apollo initiatives at Nasa. \n\n[[Stefan Reichardt|The Doctor]], chief doctor at Buchenwald concentration camp, was employed by the CIA to develop various interrogation and behavioural control methods,<sup>[[(1)|Doctor's Note #2]]</sup> most notably on [[Project Ilium]].\n\n</p>",
      "links": [
        {
          "text": "Stefan Reichardt",
          "destination": {
            "name": "The Doctor",
            "pid": 8
          }
        },
        {
          "text": "(1)",
          "destination": {
            "name": "Doctor's Note #2",
            "pid": 16
          }
        },
        {
          "text": "Project Ilium",
          "destination": {
            "name": "Project Ilium",
            "pid": 9
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "Psychedelic rock",
      "text": "<h1>Psychadelic rock</h1>\n\n<p><b>Psychedelic rock</b> is a style of rock music inspired by perception-changing hallucinogenic drugs and the culture surrounding it. Originating with British and American musicians in the mid 1960s, psychadelic rock is intended to mimic and enhance the experience of drugs such as LSD. The term applies to a wide range of different styles and genres.\n\n<b>Definition</b>\nAs a musical style, psychedelic rock incorporated elaborate studio techniques such as panning or phasing, unconventional song structures, improvisation, extended instrumental segments, and surreal or ambiguous lyrical content. \n\n<b>Notable acts</b>\nThe Beatles and the Beach Boys are generally considered two of the earliest progenitors of the genre, and both notably experimented with writing music while under the influence of psychedelic drugs. Other influential acts include The Doors and Jefferson Airplane. Despite psychedelic rock's drop in popularity in the early 1970s, the genre still produced some commercially successful groups, such as [[Unit]].\n</p>",
      "links": [
        {
          "text": "Unit",
          "destination": {
            "name": "Unit",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "William Scott",
      "text": "<h1>William Scott</h1>\n\n<p><b>William Scott</b> (August 2, 1939 - April 9, 1978) was an American television writer and producer. He is best remembered for creating the science-fiction series <i>[[Unity]]</i>. Born in Des Moines, Iowa, Scott was encouraged to read and write by his journalist father and librarian mother. After graduating from high school, he moved to California to pursue a career in screenwriting.\n\n<b>Career</b>\nScott started out as a freelance writer, writing scripts for numerous shows in the 1960s. He tried  to create several series of his own, including a series based on British police called <i>Bobbies</i> and a science-fction show called <i>Intrepid</i> pitched as \"Treasure Island in space\". None of them were picked up by networks.\n\nWith the help of a friend, Scott reworked aspects of the <i>Intrepid</i> idea into the show that would eventually become <i>Unity</i>. After successfully picthing the show, Scott was hired as producer. He wrote 21 of <i>Unity</i>'s 66 episodes and exercised a large amount of creative control during filming. \n\n<b>Death</b>\nScott wrote and directed the series finale, [[\"Reflection\"|\"Reflection\" (Unity)]], and was filming at a sound stage in Los Angeles on April 9, 1978. A short-circuit on a lighting rig started a fire that quickly engulfed the whole building. Scott and twenty other people, including many of <i>Unity</i>'s cast and crew, died in the blaze.</p>",
      "links": [
        {
          "text": "Unity",
          "destination": {
            "name": "Unity",
            "pid": 7
          }
        },
        {
          "text": "\"Reflection\"",
          "destination": {
            "name": "\"Reflection\" (Unity)",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "End one",
      "text": "<p>\nHave you been looking hard enough?\n\n(if: (history:) contains \"Code Two\")[<p>[[Do you want to go further?|End two]]</p>]\n\n</p>",
      "links": [
        {
          "text": "Do you want to go further?",
          "destination": {
            "name": "End two",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "End two",
      "text": "<p>You're very nearly there.\n\n(if: (history:) contains \"Code Three\")[<p>[[Are you ready?|End three]]</p>]",
      "links": [
        {
          "text": "Are you ready?",
          "destination": {
            "name": "End three",
            "pid": 38
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "Testers",
      "text": "<p>Thanks to the following people for testing the game and offering feedback:\n\nEmily Hughes\nSean Muir\nOzzie Rodgers\nStuart Knight\n\n[[Back|Start]]</p>",
      "links": [
        {
          "text": "Back",
          "destination": {
            "name": "Start",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "help",
      "text": "<p>\nThere are five codes hidden throughout the game.\n\nOnce you've seen all five of these codes, return to the Unit 322 Murder page.\n</p>",
      "links": []
    },
    {
      "pid": 35,
      "name": "Code Four",
      "text": "<p2>ZT AM 8J KY X5\nAK WJ 4R 8F Z8\nVO AJ 95 S2 QB\nV2 1A P2 U4 QT\nVE 3D Q1 0Y 2U\nEG 0L 9W ZZ GH\nV0 AS RU LS 1U\nB9 V8 OA KA CH\nD5 E6 QR P9 3H\nWS FO NY BF GQ\n\n[[ACCEPT|Unit 322 (Disambiguation)]]</p2>",
      "links": [
        {
          "text": "ACCEPT",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "Code Five",
      "text": "<p2>\nHH CB SW EH 97\nGJ XK XR SM T0\nIC J7 Q6 FR J3\nXJ ZR VG QF IP\nUQ WY QH 97 CL\nY9 RZ LX P6 3S\nTN JQ EC CF KQ\nTG VZ OZ UZ 51\nJY O2 FH 1G CV\nW9 85 I6 1S 9A\n\n[[ACCEPT|Unit 322 (Disambiguation)]]\n<p2>",
      "links": [
        {
          "text": "ACCEPT",
          "destination": {
            "name": "Unit 322 (Disambiguation)",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "New York Blackout",
      "text": "<h1>New York City blackout of 1977</h1>\n\n<p><b>The New York City blackout of 1977</b> was an electricity blackout that occured in New York City on July 13-14, 1977. A series of lightning strikes tripped circuit breakers in numerous substations, leading to a loss of power to most of the city. The blackout resulted in widespread arson and looting.\n\n<b>Effects</b>\nBy 9:30 p.m. EDT, the blackout had affected almost all of New York City, though there were some unaffected neighbourhoods in southern Queens and the Rockaways. In the mostly poor neighbourhoods that were without power, looting, vandalism and arson was widespread.\n\nIn total, 1,616 stores were damaged and emergency services responded to 1,037 fires. At one point, two entire blocks of Broadway were on fire. The violence resulted in the largest mass arrest in the city's history, with 3,776 people arrested. The police reported that many of the arrested vandals claimed to have no memory of their actions. \n\nThe damage to the city was estimated by one study to be $300 million.\n\n<b>Causes</b>\nThere has been a lot of debate as to why the rioting occurred. The city was in the grip of a severe economic downturn and tensions were high over the Son of Sam murders. Some commentators saw the hot July weather as a contributing factor. One newspaper columnist even claimed that, due to the similarities between the blackout and the events of an episode of <i>[[Unity]]</i> the previous week, the show was somehow responsible.</p>",
      "links": [
        {
          "text": "Unity",
          "destination": {
            "name": "Unity",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "End three",
      "text": "<p>Keep looking.\n\n(if: (history:) contains \"Code Four\")[<p>[[You're getting close|End four]].</p>]",
      "links": [
        {
          "text": "You're getting close",
          "destination": {
            "name": "End four",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "End four",
      "text": "<p>It's going to be exciting when you've seen it all.\n\n(if: (history:) contains \"Code Five\")[<p>[[It's time|Final note]].</p>]",
      "links": [
        {
          "text": "It's time",
          "destination": {
            "name": "Final note",
            "pid": 15
          }
        }
      ]
    }
  ]
}