{
  "passages": [
    {
      "pid": 1,
      "name": "End",
      "text": "And goddammit, I went out there anyway. I knew better. I KNEW better.\\n\\nIt was about like I figured.\\n\\n[[Finish]]",
      "links": [
        {
          "text": "Finish",
          "destination": {
            "name": "Finish",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "Banner 2",
      "text": "Once someone told me I would feel better if I actually had human emotions.\\n\\nThat confused me. There are a lot of personality quirks I won't admit to, but a lack of human emotion is not one of them. For example, I have always felt a great deal of emotion toward any political system. Irritation, on certain days.\\n\\nWhat they are looking for is patriotism, I think. Stand up and be counted, young men. Tearfully fling yourself upon the altar of Germany and sing songs of praise about the very flames that lick at your face.\\n\\nI don't sing very well, so that's out.\\n\\n[[back|Banner]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Banner",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "Banner 3",
      "text": "If he can't love his own country, they say, how can he love anything else? They don't know it isn't true.\\n\\n[[back|Banner]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Banner",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "Banner 1",
      "text": "Contrary to what they think, I knew all the words, to this and to all the other weepy-eyed anthems they sang across the nation. I can still tell you the lost verse of \"This Land is Your Land.\"\\n\\nThere was a big high wall there that tried to stop me\\nA sign was painted, it said \"private property.\"\\nBut on the other side it didn't say nothing\\nThis land was made for you and me.\\n\\nWritten by a communist for communists and still sung by masses of dim patriots throughout the country. It still makes me laugh.\\n\\n[[back|Banner]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Banner",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "Banner 6",
      "text": "At the time everything was bright. They felt that to fight this war morale had to be high, particularly on the civilian front. Everything was played positive. Even death served its purpose: in the movies, every death was a heroic one. You couldn't count all the brave soldiers who flung themselves in front of innocents to protect them from snipers, stayed behind to set off the explosives, and wrestled the Nazis off cliffs.\\n\\nIt was as if telling the public these things didn't actually happen would destroy the entire war effort. A hint of reality and suddenly we're all wearing lederhosen and goose-stepping to chants of heil Hitler.\\n\\n[[continue|Lies]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "Lies",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "Banner 4",
      "text": "I do love.\\n\\nI love myself. I love myself and my skin and my neck. More than life itself I love these things.\\n\\nOr is that redundant?\\n\\n[[back|Banner]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Banner",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "Banner 5",
      "text": "Pride is never an attractive trait, but they were eager to overlook that in times such as these. At that the time everything was calculated to encourage conformity, the idea being that if we all believed in this cause there was no need to question it.\\n\\nWell, I questioned.\\n\\n[[continue|Aid Effort]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "Aid Effort",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "Cartoons 6",
      "text": "Watching later it occurred to me to wonder at the variety of film quality. It was almost two whole minutes before I realized the better quality stuff was the New Jersey shelling an island for practice.\\n\\n[[continue|War]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "War",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "Cartoons 5",
      "text": "Italy was oddly absent from the cartoons. I think of the three parties the Japanese got the worst of it. The Germans were mostly attacked for Nazism. The Japanese were just Japanese, that's all. A bunch of genuflecting backstabbers with overbites and big glasses and insincere smiles. Funny how the Krauts in these pictures never had the black moustaches like their leader.\\n\\n[[back|Cartoons]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Cartoons",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "Cartoons 4",
      "text": "Something I've noticed: it isn't martyrdom if the beliefs you're dying for aren't your own.\\n\\n[[continue|Lies]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "Lies",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "Cartoons 3",
      "text": "What I wanted to think was that eventually as a nation we would move past it, that we would look at all this as a sickeningly mindless period in our history. Someday we would look back as a nation at the misguided idealism we had then and be ashamed.\\n\\nBut of course once you start down that road you don't go back.\\n\\n[[back|Cartoons]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Cartoons",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "Cartoons 2",
      "text": "\"Cock-a-doodle-doo, prease,\" said the rooster, shedding its skin to become a cringing buck-toothed vulture.\\n\\nDid you know the Japanese launch their planes via big catapult?\\n\\nCartoons would never be my favorite art form. Although I will admit that bringing the popular cartoon characters of the time onboard with the war effort was a pretty ingenious idea. How else should we convince children that trigger-happy Nazis were being shot into their own mines by our cunning spinach-snarfing sailors?\\n\\n[[back|Cartoons]]\\n\\n\\n\\n\\n\\n(Looney Tunes, produced by Leon Schlesinger. \"Tokyo Jokyo.\")\\n(Popeye the Sailor, a Famous Studios Production. \"Spinach fer Britain.\")",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Cartoons",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "Cartoons 1",
      "text": "They preached a gospel of self-righteousness and assimilationism. Togetherness, common virtues, each man hugging another and watching carefully for signs of deviance. So really it was no different than christianity.\\n\\n[[back|Cartoons]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Cartoons",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "Finish",
      "text": "\\n[[Disclaimer]] \\n<<if $lies lte 6>>[[Sources]]<<endif>>\\n<<if $lies lte 4>>[[Inspiration]]<<endif>>\\n<<if $lies lte 2>>[[Message]]<<endif>> ",
      "links": [
        {
          "text": "Disclaimer",
          "destination": {
            "name": "Disclaimer",
            "pid": 49
          }
        },
        {
          "text": "Sources",
          "destination": {
            "name": "Sources",
            "pid": 15
          }
        },
        {
          "text": "Inspiration",
          "destination": {
            "name": "Inspiration",
            "pid": 48
          }
        },
        {
          "text": "Message",
          "destination": {
            "name": "Message",
            "pid": 38
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "Sources",
      "text": "Sources\\n\\n\\n\\nInterdependence is based on an actual war, of course, and utilizes both public domain resources and government-issued publications. These include:\\n\\nthe \"Stuff for Stuff\" campaign PSA,\\n\\nParamount Pictures cartoons (Superman: the Eleventh Hour and Popeye the Sailor: Spinach fer Britain),\\n\\nLooney Tunes war propaganda (Tokyo Jokyo),\\n\\na memo from Lt. Gen. Collins of the army,\\n\\nand Mission Accomplished, a Corps-specific military publication.\\n\\n\\nApart from Lt. Gen. Collins' memo, all first-person narration is fictional. This includes the situation related in \"War\" and \"Truth,\" which, to the author's knowledge, never took place.\\n\\n[[back|Finish]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Finish",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "Aid Effort",
      "text": "During the early days of [[peace|Aid Effort 1]], the European Aid Effort came forward with a campaign to [[heal|Aid Effort 2]] the broken continent. They called it \"Stuff for Stuff.\" The idea was to take products from [[developing|Aid Effort 3]] nations and bring them to the aid of the devestated but developed European nations. It was [[closed-off|Aid Effort 4]] trading, heavy with tariffs, that caused the depression, and the depression that [[caused|Aid Effort 5]] the war. The interdependence of the countries involved would save us all, they told us all, swelled up with pride and [[confidence|Aid Effort 6]].",
      "links": [
        {
          "text": "peace",
          "destination": {
            "name": "Aid Effort 1",
            "pid": 50
          }
        },
        {
          "text": "heal",
          "destination": {
            "name": "Aid Effort 2",
            "pid": 51
          }
        },
        {
          "text": "developing",
          "destination": {
            "name": "Aid Effort 3",
            "pid": 52
          }
        },
        {
          "text": "closed-off",
          "destination": {
            "name": "Aid Effort 4",
            "pid": 45
          }
        },
        {
          "text": "caused",
          "destination": {
            "name": "Aid Effort 5",
            "pid": 46
          }
        },
        {
          "text": "confidence",
          "destination": {
            "name": "Aid Effort 6",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "War",
      "text": "\tThe capture of the city of Nordhausen opened our eyes to the sort of people we were fighting and showed us why Germany's surrender must be unconditional. When the leading armored columns drove into the city and began to [[ferret out|War 1]] its last Nazi defenders, the amazed tankers unearthed one of Germany's most infamous concentration camps. Thousands of slave laborers, men and women displaced from Russia, Poland, France, and otherconquered areas, were kept here to operate the huge V-bomb factory built deep into a hillside a short distance out of town. The inhumanity of their living conditions was appalling. The dead far outnumbered the living. Thousands of bodies were discovered in the partially destroyed barracks, lying in the fields, or stacked at the crematory, waiting to be burned. Bodies were found lying where [[their owners|War 2]] had died, or were crammed into rooms set aside for the dead and so full that the bony remains tumbled out when the doors were opened. It was not a pretty sight. Most of the dead had died of starvation. The living were practically dead, lying in the same rooms, even in the same beds with their dead and dying [[comrades|War 3]], too weak to move. Troops seeing this hell-hole needed no urging to get back into the fight against a race that could care so little for human life. In retribution for their parts in this awful crime, whether their parts consisted of active support of those who directed such horrors or merely of [[passive acceptance|War 4]] of the regime, all the male citizens of Nordhausen were made to dig graves on a hillside overlooking the city and to carry and bury all the bodies in this cemetery which will always bear evidence to the [[brutish sadism|War 5]] of the Nazis.\\n\\n\\n(Mission Accomplished: The Story of the Campaigns of the VII Corps United States Army in the War Against Germany 1944-1945. p. 67-8)\\n\\n\"This story is compiled from the official history of the VII Corps and faithfully summarizes the events which occurred during its participation in the defeat of Germany. All pictures are official Signal Corps photographs.\\n\\nPassed by Censor for mailing home.\\n\\nPrinted in Germany.\"",
      "links": [
        {
          "text": "ferret out",
          "destination": {
            "name": "War 1",
            "pid": 37
          }
        },
        {
          "text": "their owners",
          "destination": {
            "name": "War 2",
            "pid": 36
          }
        },
        {
          "text": "comrades",
          "destination": {
            "name": "War 3",
            "pid": 35
          }
        },
        {
          "text": "passive acceptance",
          "destination": {
            "name": "War 4",
            "pid": 40
          }
        },
        {
          "text": "brutish sadism",
          "destination": {
            "name": "War 5",
            "pid": 39
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "Officer School 2",
      "text": "SPAR, which stood for \"semper paratus--always ready,\" lasted until 1946. I suppose I'm the only one to see any irony in that fact.\\n\\n[[back|Officer School]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Officer School",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "Officer School 3",
      "text": "When my number came up I went to the theatre and sat in the back for a while. At three in the afternoon I must have been the oldest man in the room. For hours it was an endless parade of Hitler facsimiles and terrible puns. Oh I see, a Japanese minesweeping ship with a broom. How fortunate to be at war with an enemy so dense.\\n\\n[[continue|Cartoons]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "Cartoons",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "Officer School 1",
      "text": "We didn't call it the draft to begin with. In 1940 was the Selective Service Act. Years later I think they're still calling it that. And in its way, yes, it was the first act of inclusion. Everyone can join the army. Everyone will join the army. What happens to you after that depends on what you look like.\\n\\n[[continue|Lies]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "Lies",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "Officer School 6",
      "text": "It was about what I figured. If you can add two columns in your head and raise your voice without coughing they give you some stripes and you can stay out of the war for a while.\\n\\n 189\\n+456\\n____\\n 645\\n\\nI never found it that difficult. Add two hundred to the four fifty-six and you get six fifty-six. Subtract the difference--eleven--and you get six forty-five. They acted as if they'd snared Oppenheimer with the draft.\\n\\n[[back|Officer School]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Officer School",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "Officer School 4",
      "text": "There are no atheists in foxholes, your men are your brothers, for God and your country, they parrot.\\n\\nI learned my lines, I suppose. They ought to learn theirs.\\n\\n[[back|Officer School]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Officer School",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "Officer School 5",
      "text": "A starred general, sweating profusely and holding three inches of ash miraculously on the end of his cigarette, told us once in confidence that you don't get used to this. No matter how long you stay in this business you never get used to watching your boys die around you. It's like a part of you goes too and what they tell you about keeping morale up is the detached bullshit of professional beaurocrats and civilian dreamers.\\n\\nThey took him to the bughouse two days later, I think.\\n\\n[[back|Officer School]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Officer School",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "Truth 4",
      "text": "They didn't think of me as human. They thought I was made of tin. A wind-up toy, maybe, something they could turn the key in and send crawling through the bedroom door to frighten away any stray monsters who might be lurking under the bed.\\n\\n[[back|Truth]]",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Truth",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "Truth 5",
      "text": "They all huddled around and if I was smart I would have stayed right there with all that padding ringing me. A wall of cynicism is good to have against ideas, but to defend against bullets you need something a little more tangible.\\n\\nThe ones who were left didn't cry. Whether they were all coming to terms with what was happening to them or not I couldn't say even now. We couldn't talk without drawing the attention of snipers and I couldn't ask to satisfy my own curiousity.\\n\\nI couldn't even be sure what it was they expected me to do. Run for help? Signal a plane? Draw the sniper fire? Surely they weren't expecting me to pop off to the drug store and complete mission objectives while I was at it. This wasn't the movies, a simpering hail-America festival of red, white and blue in black and white and proceeded by public service announcements masquerading as news. Whatever they thought, that's not the purpose of officers. As the man said, one Johnny Rocco ain't worth dying for.\\n\\n[[back|Truth]]",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Truth",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "Truth 6",
      "text": "If I had a lick of sense I would have stood up and said I'm not that kind of anti-hero. Then I would have sat down beside the dead boy and they would have swept up both our brains into the same jar.\\n\\nBut it was the truth. I wasn't a hero. I had sense, more than they did, and my skin was mine and I'd prefer to keep it in one piece. I don't put my well-being on the line for anybody, not military sheep, not stupid boys who thought they were being heroes and playing dress-up in fancy uniforms, and not for a country like the one we served.\\n\\n[[continue|End]]",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "End",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "StoryAuthor",
      "text": "Megan Stevens",
      "links": []
    },
    {
      "pid": 28,
      "name": "Banner",
      "text": "Oh say can you see, by the dawn's early light,\\nWhat so [[proudly|Banner 5]] we hail by the twilight's last [[gleaming|Banner 1]].\\nWhose broad stripes and [[bright stars|Banner 6]], through the perilous fight,\\nO'er the ramparts we watched\\nWere so [[gallantly|Banner 2]] streaming.\\nAnd the rockets red glare,\\nThe bombs bursting in air,\\nGave proof through the night\\nThat our flag was still there.\\nOh say does that star spangled banner yet wave\\nO'er the land of the [[free|Banner 3]] and the home of the [[brave|Banner 4]].",
      "links": [
        {
          "text": "proudly",
          "destination": {
            "name": "Banner 5",
            "pid": 7
          }
        },
        {
          "text": "gleaming",
          "destination": {
            "name": "Banner 1",
            "pid": 4
          }
        },
        {
          "text": "bright stars",
          "destination": {
            "name": "Banner 6",
            "pid": 5
          }
        },
        {
          "text": "gallantly",
          "destination": {
            "name": "Banner 2",
            "pid": 2
          }
        },
        {
          "text": "free",
          "destination": {
            "name": "Banner 3",
            "pid": 3
          }
        },
        {
          "text": "brave",
          "destination": {
            "name": "Banner 4",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "Truth 1",
      "text": "When we were pinned down one of the boys began to cry. A brother would have gone over, head down, and comforted him. An intelligent man would stay put and focus on keeping his neck from sticking out. There were a few brothers there, and a few who were relatively intelligent. The brothers gathered around. The boy cried and cried and then a sniper blasted out a few square inches of his brains onto the men around him. They stared and then they scattered.\\n\\nWe were surrounded by snipers and open ground. Radios were out. Rumor had it we were just a few hundred yards from our final destination, as if we knew where we were. Our ever-fearless leader had been lost practically since we began and like sheep they turned to me.\\n\\n[[back|Truth]]",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Truth",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "Truth 2",
      "text": "I don't remember them saying a word. If they did it was probably a cliche or pleading and if I had had time to think about the war footage I probably would have laughed and then been sniped out from under my hat.\\n\\nI told them to stop looking at me like that. In better times those would have been mutinous thoughts I saw scampering around behind their eyes.\\n\\n[[back|Truth]]",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Truth",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "Truth 3",
      "text": "If I had half the sense... a quarter of the sense I'd been born with I would have ignored them. I was not stupid.\\n\\nThey wanted me to go out there and get shot. I don't like being shot at. I imagined I would like being shot significantly less.\\n\\n[[back|Truth]]",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Truth",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "Cartoons",
      "text": "Up in the sky, look, it's a bird. It's a plane. It's Superman.\\n\\nIn two of the three all-American colors Superman strikes a [[defiant|Cartoons 1]] pose, dark-haired against the Aryan ideal of our enemies. For truth and justice he fights the forces of Hirohito.\\n\\nYokohama. By day Clark Kent and Lois Lane are being held by small buck-toothed enemies of freedom. By night, specifically the hour of eleven P.M., Superman sinks warships and comforts Lois. But when he explodes one too many tanks, the enemy strikes below the belt. Lois Lane is dragged away by a [[snaggle-toothed|Cartoons 2]] soldier. Then warnings are posted:\\n\\nWARNING!\\nSUPERMAN\\nONE MORE ACT OF SABOTAGE\\nAND THE AMERICAN GIRL REPORTER\\nWILL BE EXECUTED AT ONCE!\\n\\nBut Superman, at the [[unfair|Cartoons 3]] disadvantage of being in an act of sabotage as they are posted, learns too late. He drags down a battleship and the execution drums begin to play. In elegant [[martyrdom|Cartoons 4]] Lois Lane's silhouette is marched to a wall by armed riflemen. Chin held high, she walks to the wall as, across the city, soldiers open fire on Superman. The riflemen raise their guns. Their commander raises a sword to prepare them. Then, as the sword comes crashing down, Superman swoops down from the sky, deflecting bullets with his chest and easily defeating the [[sallow-skinned|Cartoons 5]] soldiers.\\n\\nLois Lane returns on a ship to Metropolis and is [[accosted|Cartoons 6]] by reporters.\\n\\n\"How 'bout Clark Kent?\" one asks. \"Did he get away?\"\\n\\n\"No,\" Lois says, crossing her legs delicately. \"No, he's still over there. But don't worry. Superman promised to look after him.\"\\n\\nAnd, halfway around the world, the clock strikes eleven and an explosion rocks Yokohama as the Superman theme plays.\\n\\n\\n\\n\\n\\n\\n(Superman. A Famous Studios Production in Technicolor. \"The Eleventh Hour.\" By arrangement with Action Comics and Superman Magazines.)",
      "links": [
        {
          "text": "defiant",
          "destination": {
            "name": "Cartoons 1",
            "pid": 13
          }
        },
        {
          "text": "snaggle-toothed",
          "destination": {
            "name": "Cartoons 2",
            "pid": 12
          }
        },
        {
          "text": "unfair",
          "destination": {
            "name": "Cartoons 3",
            "pid": 11
          }
        },
        {
          "text": "martyrdom",
          "destination": {
            "name": "Cartoons 4",
            "pid": 10
          }
        },
        {
          "text": "sallow-skinned",
          "destination": {
            "name": "Cartoons 5",
            "pid": 9
          }
        },
        {
          "text": "accosted",
          "destination": {
            "name": "Cartoons 6",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "Truth",
      "text": "8 June 1945\\n\\nTo the Officers and Men of the VII Corps for whom this short account of our activities is primarily written, I want to say once more that all our [[success|Truth 1]] has been the direct result of your [[splendid teamwork|Truth 2]]. The proof of this is the fact that the fine divisions which have fought under us have been sorry to leave us and [[glad to come back|Truth 3]]. This means that the Corps Troops and Staff know their business and [[look after|Truth 4]] the divisions as they should. That can be true only because each one of us [[has had the true interests of the Corps at heart|Truth 5]] and has played his part up to the hilt. I am eternally [[grateful|Truth 6]] to each and every one of you.\\n\\nJ. Lawton Collins\\nLieutenant General, U.S. Army\\nCommanding VII Corps\\n",
      "links": [
        {
          "text": "success",
          "destination": {
            "name": "Truth 1",
            "pid": 29
          }
        },
        {
          "text": "splendid teamwork",
          "destination": {
            "name": "Truth 2",
            "pid": 30
          }
        },
        {
          "text": "glad to come back",
          "destination": {
            "name": "Truth 3",
            "pid": 31
          }
        },
        {
          "text": "look after",
          "destination": {
            "name": "Truth 4",
            "pid": 24
          }
        },
        {
          "text": "has had the true interests of the Corps at heart",
          "destination": {
            "name": "Truth 5",
            "pid": 25
          }
        },
        {
          "text": "grateful",
          "destination": {
            "name": "Truth 6",
            "pid": 26
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "StoryTitle",
      "text": "Our Boys in Uniform",
      "links": []
    },
    {
      "pid": 35,
      "name": "War 3",
      "text": "I'm sure it was very unfortunate about those boys, at least for those they left behind. As for me, I kept my head down and managed to keep it from getting shot off. What did it matter? Comrades-at-arms were dying everyday, some of whom I was acquainted with and others I would never meet. In a way it was all right. Better than being at home, I suppose, surrounded by genuflecting citizens and a media zippered up tight. I would stay right where I was and sit it out until the war blew over.\\n\\nI knew I could stay safe.\\n\\nI was too smart to be brave.\\n\\n[[back|War]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "War",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "War 2",
      "text": "Expecting quality journalism from the front in this of all wars was foolish. The publications from the military were the worst. Censors okayed everything we saw or heard or wrote.\\n\\nOne sentence in particular intrigued me. \"Bodies were found lying where their owners had died.\" While the old adage about atheists and foxholes was about as true as you'd expect, the army was swarming with Christians. My understanding was that Christians believe it's the body that dies, and the soul--or owner--lives on. So the bodies were found, still intact, and the soul had died.\\n\\nWhat did that mean?\\n\\n[[continue|Lies]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "Lies",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "War 1",
      "text": "It went well at first. They told us it was going brilliantly, as a matter of fact, and the qualitative formula for bullshit said that things had to be at least fine. But things don't hold well in a war zone. I expected no better.\\n\\n[[back|War]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "War",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "Message",
      "text": "Message\\n\\n\\n\\nRead banned books. Watched questionable movies. Wear a silly hat on your head and pretend to be a pirate. Stay beautiful.\\n\\n[[back|Finish]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Finish",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "War 5",
      "text": "They told us at first tales of our boys in uniform. How our soldiers are strong and smart, independent thinkers against the brain-washed masses of the enemy. They bleated it on every newspaper-hawking street corner, on the news reels before the John Wayne picture. They didn't so you footage of us. We were the swarm of frightened posturing boys in search of a father figure, clinging to someone who found it increasingly more difficult to care.\\n\\n[[back|War]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "War",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 40,
      "name": "War 4",
      "text": "I never thought that the sheep would out-smart me. They gave me two choices. I could follow the tanks into dangerous territory or I could save my neck and surrender my back to a bullet by way of treason. Decisions had to be made. I cut my risks. For all intents I took what they told me and believed it so. God, I was stupid.\\n\\n[[continue|Truth]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "Truth",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "Start",
      "text": "In the coming pages you will read a series of anectdotes and descriptions pertaining to American history. A number of words on each page have been highlighted for your convenience. One of these words is the truth and will take you forward through the story. One is a lie and will take you back. The rest are pure propaganda.\\n<<silently>><<set $lies = \"0\">><<endsilently>>\\n[[Begin.|Banner]]\\n",
      "links": [
        {
          "text": "Begin.",
          "destination": {
            "name": "Banner",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "Untitled Passage 2",
      "text": "",
      "links": []
    },
    {
      "pid": 43,
      "name": "Officer School",
      "text": "World War II was a vastly [[inclusive|Officer School 1]] war. Women were [[accepted|Officer School 2]] into the military for the first time, into the WAVES, the WAC, and the SPAR. Minorities of [[all kinds|Officer School 3]], including the Japanese, fought in both theatres. America herself was [[mobilized|Officer School 4]] into an [[intricate|Officer School 5]] machine, manufacturing food and clothing for the troops, military ordnance, and the trucks and tanks and planes and amphibous vehicles in which the troops were transported. It was a war effort like America would [[never|Officer School 6]] see again.",
      "links": [
        {
          "text": "inclusive",
          "destination": {
            "name": "Officer School 1",
            "pid": 20
          }
        },
        {
          "text": "accepted",
          "destination": {
            "name": "Officer School 2",
            "pid": 18
          }
        },
        {
          "text": "all kinds",
          "destination": {
            "name": "Officer School 3",
            "pid": 19
          }
        },
        {
          "text": "mobilized",
          "destination": {
            "name": "Officer School 4",
            "pid": 22
          }
        },
        {
          "text": "intricate",
          "destination": {
            "name": "Officer School 5",
            "pid": 23
          }
        },
        {
          "text": "never",
          "destination": {
            "name": "Officer School 6",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "Lies",
      "text": "If you're reading this, you've found the lie. Congratulations. I'll bet you feel better now.\\n\\nBut the lies don't go away just because you've discovered them. You just keep hearing them, over and over again.\\n<<silently>><<set $lies = $lies + 1>><<endsilently>>\\n[[And again.|Banner]] \\n",
      "links": [
        {
          "text": "And again.",
          "destination": {
            "name": "Banner",
            "pid": 28
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "Aid Effort 4",
      "text": "They call it \"isolationism,\" which I find amusing. If I remember correctly, even in times of neutrality we were never above making a quick buck.\\n\\n[[continue|Lies]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "Lies",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "Aid Effort 5",
      "text": "Unsurprisingly, there were few left who refused the propaganda. It was everywhere. On the news, on the advertisements that bracketed the radio broadcasts, on the billboards and the fences and the windows of the stores. It was in the water.\\n\\nMy cure for that was an impenetrable wall of cynicism. It rarely failed me.\\n\\n[[back|Aid Effort]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Aid Effort",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "Aid Effort 6",
      "text": "They always treated the war like the people in charge knew what they were doing. As long as you do what we tell you, you will survive and America shall reign in triumph over the enemy.\\n\\nLike I say, I love my own neck best and I don't fall for shit like that.\\n\\nLife likes irony. That must have been why I was drafted.\\n\\n[[continue|Officer School]] ",
      "links": [
        {
          "text": "continue",
          "destination": {
            "name": "Officer School",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "Inspiration",
      "text": "Inspiration\\n\\n\\n\\nThis story was inspired in part by the Humphrey Bogart movie \"Key Largo.\" After a late night showing, the already-cynical author was moved to write an even more cynical account of America's favorite war.\\n\\nThe other inspiration was the sheer amount of propaganda, particularly in cartoon form, surrounding World War II. The cartoons described here and many, many more can be viewed in full at archive.org.\\n\\n[[back|Finish]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Finish",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "Disclaimer",
      "text": "Disclaimer\\n\\n\\n\\nThe author of this story in no way endorses Holocaust denial or the actions of the Nazi party. She also does not endorse mass generalizations: the Japanese as a people were not bespectacled crawling creatures, the Germans as a people were not sadistic murderers, the Americans as a people were not unquestionably heroic and brave.\\n\\nInstead, the author asks you to consider why these stereotypes came about. Why were so many Germans members of the Nazi party? Why did so many fight in the war believing that theirs was the side of righteousness? Could it have something to do with an unquestioning belief in what they were told?\\n\\nAnd, on the other side of the coin, do we ever question what we are told about America's role in the war?\\n\\n[[back|Finish]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Finish",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "Aid Effort 1",
      "text": "I admit that at the time I was sure it would be months at best before we were all blasted off the face of the earth by the same thing that destroyed Hirosima and Nagasaki. Every day, it seemed, there were drills. When the bomb comes, throw yourself into a ditch or into a root cellar or under your desk. And everyone put so much faith into that. Yes, hide under your desk, children. The atomic bomb will never think to look for you under there.\\n\\nIt kept the masses calm, so I suppose it served its purpose. On occasion, when the moon was blue and the planets aligned and my body temperature was a tenth of a degree too low, I almost wished they could trick me. It would certainly have made dragging my worthless carcass into work everyday a sight easier.\\n\\n[[back|Aid Effort]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Aid Effort",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "Aid Effort 2",
      "text": "I refuse to believe such noble efforts. Not from a government like ours. See, there was a place where, early in the war, many young men died, men who went down for ulterior motives they knew nothing about. I don't believe in healing from a government that uses the name of that place to yank the heartstrings of the brainwashed sheep who would fund their worthless war.\\n\\n[[back|Aid Effort]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Aid Effort",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "Aid Effort 3",
      "text": "Hidden imperialism, of course. I never believed that crap about raising up poor orphaned children and crushing under America's heel the snake's head of Communism. I could see through it and so could anyone with any sense.\\n\\n[[back|Aid Effort]] ",
      "links": [
        {
          "text": "back",
          "destination": {
            "name": "Aid Effort",
            "pid": 16
          }
        }
      ]
    }
  ]
}