{
  "passages": [
    {
      "pid": 1,
      "name": "Frontmatter",
      "text": "{\n<div class=\"recto\" id=\"pastedown\">\n\t<img class=\"exlibris\" src=\"images/arms.png\" alt=\"Coat of arms\">\n\t<img class=\"ownerstamp\" src=\"images/stamp1.png\" alt=\"Stamp 1\">\n\t<p class=\"ownermark\">(font: \"CommentatorB\")[B.T.M. 1693]</p>\n\t<img class=\"miniature\" src=\"images/stain.png\" alt=\"Stain\">\n</div>\n<div class=\"verso\">\n\t<div class=\"exlibris\">\n\t\t|M1>[I acquired this from a Bookseller in Bern. He was very eager to sell it to me at a very reasonable price, but from what I can tell it is genuine. Judging by its contents, it was written in a nunnery in the eastern HRE. It includes some musical notation and illumination.]\n\t\t(click-replace: ?M1)[(css: \"font-family: Arsenal; font-size: 2.5vh;line-height: 100%;\")[I acquired this from a Bookseller in Bern. He was very eager to sell it to me at a very reasonable price, but from what I can tell it is genuine. Judging by its contents, it was written in a nunnery, though it is uncertain which one. It includes some musical notation and illumination.]]\n\t</div>\n\t<div class=\"shelfmark\" lang = \"en\">\n\t\t<h4>Codex angliae 37</h4>\nIn English, on parchment, written in 13th century textualis. Quarto, 14 leaves, in double columns, with rubrication and miniatures.\n\t\t<p>Fol.1r-14v: (text-style:\"bold\")[<span lang = \"la\">Vita et obitus Otiliae abbatissae</span>], by an unknown author of the 13th century.</p>\n\t\t<p>Marginalia in several hands of the 14th and 17th century.</p>\nPurportedly first seen in the Helfta armarium, but ultimately of unknown origin. Acquired by Archivum Laurenhammensis sometime before 1517. Missing from the 1649 inventory. Sold to BNF by private owner in 1788. Kept there under wrong shelfmark, rediscovered in 1867. Entered collection in exchange for a 14th-century Roman de Reynard on 28. Feb. 1873.\n\t</div>\n\t<div class=\"ownermark\" lang = \"la\">\n\t\t<p>(font: \"Arsenal\")[Arsenal 267-3]</p>\n\t\t<p>(font: \"CommentatorA\")[|M2>[Iste liber est Annae filiae Thomae]]</p>\n\t\t(click-replace: ?M2)[(css: \"font-family: Arsenal; font-size: 3vh;line-height: 100%;\")[Iste liber est Annae filiae Thomae]]\n\t</div>\n\t<img class=\"ownerstamp\" src=\"images/stamp2.svg\" alt=\"Stamp 2\">\n\t|next>[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click: ?next)[(goto: \"Introduction\")]\n}\n",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "Introduction",
            "pid": 24
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "Layout",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang = \"en\"></div>\n\t<div class=\"rhmargin\"></div>\n\t<div class=\"romargin\"></div>\n\t<div class=\"rfmargin\"></div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang = \"en\"></div>\n\t<div class=\"vhmargin\"></div>\n\t<div class=\"vomargin\"></div>\n\t<div class=\"vfmargin\"></div>\n\t|next>[<object class = \"wpl\">]\n</div>\n(click: ?next)[(goto: \"Frontmatter\")]\n}",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "Frontmatter",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "December",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/T.svg\" alt=\"Initial T\">\n\t\t<h3>he in&shyves&shyti&shyture of Oti&shylia</h3>\n\t\t<p class =\"redCap\">Shortly after All Saints' Day the venerated abbess Margaretha passed away unexpectedly. Great was the lamentation, far and wide. Alas, it soon became apparent that it would be necessary to decide on her successor.</p>\n\t\t<div>\n\t\t\t<p class=\"rmarginalia\">\n\t\t\t\t|M1>[Must have been an area with gravelkind law.]<br>\n\t\t\t\t<span class=\"CommentatorB\">|M2>[A common reason to found an abbey.]</span>\n\t\t\t\t(click-replace: ?M1)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Must have been an area with gravelkind law.]]\n\t\t\t\t(click-replace: ?M2)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[A common reason to found an abbey.]]\n\t\t\t</p>\n\t\t\t<p  class =\"blueCap\">The abbey had been founded over fifty years before as an act of piety by two houses that had held fiefs on the land. This had been a very good decision for both, since it allowed them to share the burden of building and maintaining the nunnery. It also made possible to circumvent the inheritance law, as it was from then on within the authority of the abbey to decide on the beneficiary of its holdings.</p>\n\t\t</div>\n\t\t<p class =\"redCap\">It was imperative that an arrangement be found that would not endanger this state of affairs and so it was decided that it would fall to Otilia to make her perpetual vows and become abbess while a bastard of the other house would be installed as steward.</p>\n\t\t<p class =\"blueCap\">The chapter convened shortly before Advent, in hopes that the investiture of the new abbess would be possible with the start of the new year. And so it came to it that Otilia, then only in her seventeenth year, spoke to the nuns of the abbey in defense of her nomination.</p>\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|c1>[<p class =\"greenCap\">Otilia explained how she would shoulder her responsibilities.</p>]\n\t\t|c2>[<p class =\"greenCap\">She pointed out that voting for her would be the only option.</p>]\n\t\t|VC1)[(display:\"DecChoice1\")]\n\t\t|VC2)[(display:\"DecChoice2\")]\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t(set: courage of $virtueDm to it +1)\n\t(replace: ?c2)[]\n\t(show:?VC1)\n\t(show:?next)\n}]\n(click-replace: ?c2)[{\n\t(set: sloth of $viceDm to it +1)\n\t(replace: ?c1)[]\n\t(show:?VC2)\n\t(show:?next)\n}]\n(click: ?next)[{(goto: \"January\")}]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "DecChoice1",
            "pid": 4
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "DecChoice2",
            "pid": 5
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "January",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "DecChoice1",
      "text": "{\n<p class =\"greenCap\">Otilia explained how she would shoulder her responsibilities and how she would show humility in her dealings with the many aspects of the cloistered life where others before her had left things in a good state. She then told the sisters of her desire to live a life of study and duty to the chapter, devoted to serving the Lord in song and prayer, guided by the cenobitic principles of the order.</p>\n<p class =\"redCap\">Her speech was received with much enthusiasm by the nuns, who proceeded to vote for her unanimously. After all, the new abbess was as noble and as faithful to her vow as the best of them. With hope in their hearts and great expectations for Otilia's term of office the whole congregation proceeded to the church, singing, to celebrate the Mass.</p>\n(set: nuns of $popularityDm to it +1)\n(set: $cenobitism to $cenobitism +1)\n(display:\"DecEnd\")\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "DecEnd",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "DecChoice2",
      "text": "{\n<p class =\"greenCap\">She pointed out that voting for her would be the only option as it would be impossible to find any other suitable candidate nor, indeed, anyone willing to break the contract between the founding houses. So she asked the sisters to quietly make their vote in the interest of the chapter. In this way we will get over with this quickly and each of us can go back to living her live quietly in her love for the Lord or in whichever other pursuit she may have been at. </p>\n<p class =\"redCap\">Why, she will make as good an abbess as anyone, and who am I to raise my concerns? Thought many a sister when it was her turn to make the choice. And so it came that Otilia was elected. Afterwards, the congregation made its way silently to the church to celebrate the Mass. </p>\n(set: nuns of $popularityDm to it -1)\n(set: $power to $power +1)\n(display:\"DecEnd\")\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "DecEnd",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "DecEnd",
      "text": "{\n<div>\n\t<div>\n\t\t<p class=\"vmarginalia\">\n\t\t\t|M3>[The usual dispense. It still costs money to get it today.]\n\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[The usual dispense. It still costs money to get it today.]]\n\t\t</p>\n\t\t<p class =\"blueCap\">A dispense had been obtained in advance, so the young abbess did not have to make the exerting journey to Rome for her confirmation. Instead, it was the bishop of a nearby diocese, who performed the rite, flanked on each side by an episcopus auxiliaris born a son of one of the two houses.</p>\n\t</div>\n\t<div>\n\t\t<p class=\"vmarginalia\">\n\t\t\t<span class=\"CommentatorB\">|M4>[The Carta, in a nunnery? Form really must have been everything.]</span>\n\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[The Carta, in a nunnery? Form really must have been everything.]]\n\t\t</p>\n\t\t<p class =\"redCap\">Otila was invested with ring, crosier, Regula Benedicti, Carta Caritatis and the consuetudines with the beginning of Advent and thereby given authority over the cloister and its inhabitants.</p>\n\t</div>\n<div>\n}",
      "links": []
    },
    {
      "pid": 7,
      "name": "January",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/O.svg\" alt=\"Initial O\">\n\t\t<h3>tilia ce&shyle&shybra&shytes <span lang=\"la\">Epi&shyphany</span></h3>\n\t\t<p class =\"redCap\">Before Christmas, the new steward had taken over his duties to maintain the abbey's fields, forests, fisheries and mills and to represent it to the outside world. As his first act in office, he confirmed the two holders of the fiefs in their titles.</p>\n\t\t<p class =\"blueCap\">The festive days were much yearned for and when Christmas finally arrived, the church resounded with the choir's song and the air was thick with incense.</p>\n\t\t<div>\n\t\t\t<p class=\"rmarginalia\">|M1>[How sleek of him to do this on a solemnity!]</p>\n\t\t\t(click-replace: ?M1)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[How sleek of him to do this on a solemnity!]]\n\t\t\t<p class =\"redCap\">As <span lang=\"la\">Epiphany</span> approached, the <span lang=\"la\">steward</span> invited Otilia to inspect the abbey's cellars so as to gain insight into the state of their holdings. This was surely an important matter, and yet the abbess also wished to oversee the preparations for the culmination of the festivities.</p>\n\t\t</div>\n\t\t|c1>[<p class =\"greenCap\">Abbess Otilia decided to take a good look at the cellars and left the preparations to the prioress.</p>]\n\t\t|c2>[<p class =\"greenCap\">Instead of visiting the cellars, she had the steward write a list of their contents while she herself oversaw the preparations for Epiphanias.</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|VC1)[(display:\"JanChoice1\")]\n\t\t|VC2)[(display:\"JanChoice2\")]\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">Abbess Otilia decided to take a good look at the cellars and left the preparations to the prioress. In the company of Ysabella, the cellera, who was to keep book of the inspection, and of two conversi, who would lend a hand, if needed, they descended into the vaults, their way lit only by the light of their lanterns.</p>\n\t<p class =\"blueCap\">The prioress, however, went to the church, where she was needed for the nativity play that was to be performed in honour of the <span lang=\"la\">familia sacra</span> and the three magi.</p>\n\t(replace: ?c2)[]\n\t(show:?VC1)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">Instead of visiting the cellars, she had the steward write a list of their contents while she herself oversaw the preparations for Epiphanias. The <span lang=\"la\">steward</span> bade he be given two conversi and one of the nuns with him to assist with the bookkeeping. This the abbess allowed and so he took the prioress, who was his cousin, with him.</p>\n\t<p class =\"blueCap\">Freed from this duty, Otilia made for the church, where the other nuns were preparing for the nativity play and the solemnity mass. </p>\n\t(replace: ?c1)[]\n\t(show:?VC2)\n}]\n(click: ?next)[(goto: \"February\")]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "JanChoice1",
            "pid": 8
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "JanChoice2",
            "pid": 9
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "February",
            "pid": 11
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "JanChoice1",
      "text": "{\n<p class =\"redCap\">They went through the wine cellar first, where the steward explained which barrel contained wine from which vineyard. The abbess and the cellera tasted each. Having thus consumed much more than their usual allowance, they counted the jars of preserved fruits and inspected the dried fish, cured meat and cheese wheels. It was then almost time for the Vespers, so the abbess decided they had seen enough.</p>\n<p class =\"blueCap\">As they made their way back upstairs, Otilia discovered a narrow door behind a wine barrel. Say, what lies behind this? She asked the steward, who answered that the conversi kept some tools in there.</p>\n|c3>[<p class =\"greenCap\">Otilia decided not to investigate further.</p>]\n|c4>[<p class =\"greenCap\">The abbess spoke: I would like to take a look at it.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Otilia decided not to investigate further. Maybe the steward was hiding something from her, but if he wouldn't show it to her readily, nothing good could come from making him do so.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">|M3>[Debatable. If he's not held to account, he'll go on stealing.]\n\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Debatable. If he's not held to account, he'll go on stealing.]]\n\t\t</p>\n\t\t<p class =\"redCap\">What if the door really only guarded some tools? It was surely not a good start to her term of office to needlessly inconvenience the steward and get onto his bad side, thought Otilia. I suppose thou knowest best, she told him. We do not have time for this right now.</p>\n\t</div>\n\t<p class =\"blueCap\">Otilia and Ysabella rushed back up the stairs and made it back just in time for the nativity play. Sister Agnes, the prioress, played Melchior, and received much praise for her performance.</p>\n\t(set: family of $popularityDm to it -1)\n\t(set: nuns of $popularityDm to it -1)\n\t(set: courage of $virtueDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $stewardOwes to true)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">The abbess spoke: I would like to take a look at it. The steward said the door was locked, but Otilia insisted on having it opened. After some debate, one of the conversi was sent to get the key.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">|M4>[Not such a big surprise for the steward.]\n\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Not such a big surprise for the steward.]]\n\t\t</p>\n\t\t<p class =\"redCap\">To the surprise of Ysabella and Otilia, there were another three vaults behind the door, filled with various foods of high quality. The abbess had these supplies duly added to the list. The steward however, his peculation now exposed, stood silent and in shame.</p>\n\t</div>\n\t<p class =\"blueCap\">Otilia and Ysabella rushed back up the stairs and made it back just in time for the nativity play. Sister Agnes, the prioress, played Melchior, and received much praise for her performance.</p>\n\t(set: family of $popularityDm to it +1)\n\t(set: envy of $viceDm to it +1)\n\t(replace: ?c3)[]\n\t(set: $economics to $economics +1)\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 9,
      "name": "JanChoice2",
      "text": "{\n<p class =\"redCap\">When Otilia arrived at the church and told the nuns that sister Agnes, the prioress, had to be excused, the nuns were much discouraged, for Agnes was to take the role of Melchior in the play. With her deep down in the vaults, how were they to rehearse?\n</p>\n|c3>[<p class =\"greenCap\">Do not be discouraged, said Otilia, I shall take on Agnes' part.</p>]\n|c4>[<p class =\"greenCap\">Wouldn't sister Ida make a great Melchior? suggested the abbess.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Do not be discouraged, said Otilia, I shall take on Agnes' part. She didn't have to argue for long, as everyone was immediately convinced of this idea. After Otila had been shown what she was to do and say, the day went by with rehearsals for the nativity play.</p>\n\t<p class =\"blueCap\">Before the Vespers mass, one last dress rehearsal was to be held. Otilia first felt a little strange wearing the clothes of a man, but that changed when she considered what a costume it was! A gold-embroidered, scarlet robe and a crown adorned with gems and jewels. How wonderful it is to become king for a day, she thought by herself.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\"><span class=\"CommentatorB\">|M3>[Must have been a rich abbey, with such costumes.]</span>\n\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Must have been a rich abbey, with such costumes.]]\n\t\t</p>\n\t\t<p class =\"redCap\">Thus the nuns celebrated Epiphany with a nativity play. Otilia's part was the high point of the play, and many a nun was moved to tears by the clear voices of the young novices.</p>\n\t</div>\n\t<p class = \"blueCap\">Agnes made it back from the cellars, just in time for the Mass. She had with her a list of all the provisions she had counted. But there was little time now, so Otilia decided to hear her report another day.</p>\n\t(set: nuns of $popularityDm to it +1)\n\t(set: pride of $viceDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $fun to $fun +1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">Wouldn't sister Ida make a great Melchior? suggested the abbess. Oh surely she would! Agreed the others, and Ida, the cantoress, who had been arranging for the song, took over Agnes' part.</p>\n\t<p class =\"blueCap\">Now that Ida was occupied, it fell naturally to Otilia to take care of the musical side of the mass, for she was a skilled singer. So she looked up Initio, Graduale and Offertorium and had the novices repeat them until she was satisfied with their performance. Ida would have gotten even more out of them, she thought by herself. It would have to do, though, as time was pressing.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">|M4>[Only these three on Epiphany?]<br>\n\t\t\t<span class=\"CommentatorB\">|M5>[No Tractus means no Sequence.]</span>\n\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Only these three on Epiphany?]]\n\t\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[No Tractus means no Sequence.]]\n\t\t</p>\n\t\t<p class =\"redCap\">Thus the nuns celebrated Epiphany with a nativity play and a holy mass. Ida's Melchior was praised by all, and everyone enjoyed the voices of the young novices when they sang the antiphones.</p>\n\t</div>\n\t<p class = \"blueCap\">Agnes made it back from the cellars, just in time for the Mass. She had with her a list of all the provisions she had counted. But there was little time now, so Otilia decided to hear her report another day.</p>\n\t(set: family of $popularityDm to it -1)\n\t(set: nuns of $popularityDm to it +1)\n\t(set: lust of $viceDm to it +1)\n\t(replace: ?c3)[]\n\t(set: $musicalSkill to $musicalSkill +1)\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 10,
      "name": "Ending",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang = \"en\">\n\t\t<img class=\"initial\" src=\"images/initials/introduction.svg\" alt=\"Initial H\">\n\t\t<h3>ere&shywith ends the tale</h3> \n\t\t<p class=\"redCap\">Otilia saw not the next spring. Her illness worsened by the day and she finaly passed away three weeks after Candlemas. When it became clear the end was near, the infirmaria washed her and she was dressed in her choir habit. She was then carried to the church, propped up with a pillow and her crosier placed into her hands. One after the other, every one of the nuns and novices tearfully bade farwell to the abbess. After the first four had made their turns, she was unable to answer any more, but showed a smile for each of the sisters. The bishop who had invested her was present to administer the unction. Otilia received the Viaticum to the song of the chapter and breathed her last.\t\t\t</p>\n\t\t<p class=\"blueCap\">She was laid to rest in the right aisle of the church, under a tombstone, created in her image and inscribed with her epitaph: |L1>[(text-colour: #e34234)[<span lang=\"la\">Breve et irreparabile tempus omnibus est vita.</span>]] It is still easily readable even after all these years.</p>\n\t\t(click-replace: ?L1)[A short and irretrievable time life is.]\n\t\t(set: $virtueMax to 0)\n\t\t(for:  each _item, ...(datavalues: $virtueDm))[{\n    \t\t(if: _item > $virtueMax)[{(set: $virtueMax to _item)}]\n\t\t}]\n\t\t(set: $viceMax to 0)\n\t\t(for:  each _item, ...(datavalues: $viceDm))[{\n    \t\t(if: _item > $viceMax)[{(set: $viceMax to _item)}]\n\t\t}]\n\t\t(if: $virtueMax >= $viceMax)[{\n\t\t\t(if: prudence of $virtueDm is $virtueMax)[{\n\t\t\t\t<p class=\"redCap\">Of her virtues in life, much has been said, but if one had to pick a single one, it would be prudence, for Otila showed prudence in many ways, through her words and works, to the benefit not only of herself, but of the chapter, as well.</p>\n\t\t\t}]\n\t\t\t(elseif: love of $virtueDm is $virtueMax)[{\n\t\t\t\t<p class=\"redCap\">Of her virtues in life, much has been said, but if one had to pick a single one, it would be caritas, for Otila harboured a love in her heart as has not been witnessed often, even in a nun. Moreso, it was reflected in her works.</p>\n\t\t\t}]\n\t\t\t(elseif: faith of $virtueDm is $virtueMax)[{\n\t\t\t\t<p class=\"redCap\">Of her virtues in life, much has been said, but if one had to pick a single one, it would be faith, for the faith in the Lord was strong in Otila throughout her life and also in death. She also encouraged others to keep their faith.</p>\n\t\t\t}]\n\t\t\t(elseif: temperance of $virtueDm is $virtueMax)[{\n\t\t\t\t<p class=\"redCap\">Of her virtues in life, much has been said, but if one had to pick a single one, it would be temperance, for Otilia was known to stay calm and composed no matter the occasion. Her quiet, soothing demeanor fit well the cloister.</p>\n\t\t\t}]\n\t\t\t(elseif: courage of $virtueDm is $virtueMax)[{\n\t\t\t\t<p class=\"redCap\">Of her virtues in life, much has been said, but if one had to pick a single one, it would be courage, for courage was what Otila displayed on many occasions when it was needed to further the cause of the chapter, and she shyed not away.</p>\n\t\t\t}]\n\t\t\t(elseif: justice of $virtueDm is $virtueMax)[{\n\t\t\t\t<p class=\"redCap\">Of her virtues in life, much has been said, but if one had to pick a single one, it would be justice, for fiercely Otilia would defend what was right, be it canonical, or worldly law. And right fine was her judgement in the absence of both.</p>\n\t\t\t}]\n\t\t\t(elseif: hope of $virtueDm is $virtueMax)[{\n\t\t\t\t<p class=\"redCap\">Of her virtues in life, much has been said, but if one had to pick a single one, it would be hope, for Otilia maintained hope throughout her abbiate. She kept it up until her death and gave much of it to others through her words and deeds.</p>\n\t\t\t}]\n\t\t}]\n\t\t(else:)[{\n\t\t\t(if: pride of $viceDm is $viceMax)[{\n\t\t\t\t<p class=\"redCap\">It is witless to vituperate the dead. Let it therefore suffice to say that Otilia, like anyone, was not without vices. To name but one, it has been said sometimes that she was full of sinful pride, although anyone would find this was difficult to forego in her position.</p>\n\t\t\t}]\n\t\t\t(elseif: gluttony of $viceDm is $viceMax)[{\n\t\t\t\t<p class=\"redCap\">It is witless to vituperate the dead. Let it therefore suffice to say that Otilia, like anyone, was not without vices. To name but one, it has been said sometimes that she engaged in gluttony, as ill befits any lady. But in a nun, it should be considered most sinful.</p>\n\t\t\t}]\n\t\t\t(elseif: greed of $viceDm is $viceMax)[{\n\t\t\t\t<p class=\"redCap\">It is witless to vituperate the dead. Let it therefore suffice to say that Otilia, like anyone, was not without vices. To name but one, it has been said sometimes that, although she had foregone all worldy possessions, she showed a propensity for greed and wished for riches.</p>\n\t\t\t}]\n\t\t\t(elseif: lust of $viceDm is $viceMax)[{\n\t\t\t\t<p class=\"redCap\">It is witless to vituperate the dead. Let it therefore suffice to say that Otilia, like anyone, was not without vices. To name but one, it has been said sometimes that she could not let go of worldly lust, especially, even though, as a nun, she had vowed to forego it.</p>\n\t\t\t}]\n\t\t\t(elseif: sloth of $viceDm is $viceMax)[{\n\t\t\t\t<p class=\"redCap\">It is witless to vituperate the dead. Let it therefore suffice to say that Otilia, like anyone, was not without vices. To name but one, it has been said sometimes that she was not as eager in her duties as one might have expected. Some even called her a sloth.</p>\n\t\t\t}]\n\t\t\t(elseif: wrath of $viceDm is $viceMax)[{\n\t\t\t\t<p class=\"redCap\">It is witless to vituperate the dead. Let it therefore suffice to say that Otilia, like anyone, was not without vices. To name but one, it has been said sometimes that she was not as forgiving as would befit her position. Indeed, her wrath hit those who wronged her.</p>\n\t\t\t}]\n\t\t\t(elseif: envy of $viceDm is $viceMax)[{\n\t\t\t\t<p class=\"redCap\">It is witless to vituperate the dead. Let it therefore suffice to say that Otilia, like anyone, was not without vices. To name but one, it has been said sometimes that she was envious of what others had, regardless of her own high office, and that unsightly it was to witness.</p>\n\t\t\t}]\n\t\t}]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang = \"en\">\n\t\t(display: \"EndingVerso\")\n\t</div>\n\t<div class=\"vfmargin\"><img class=\"miniature\" src=\"images/miniatures/topflowers1.svg\" alt=\"Miniature\"></div>\n\t|next>[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click: ?next)[(goto: \"Backmatter\")]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "EndingVerso",
            "pid": 45
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "Backmatter",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "February",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/february.svg\" alt=\"Initial A\">\n\t\t<h3>n ill&shyness hits the ab&shybey</h3>\n\t\t<p class =\"redCap\">In the weeks after Candlemas, a long spell of cold weather brought calamity to the chapter. Many a nun fell ill and had to spend her days resting at the infirmary. With more than one in four of the sisters so incapacitated, it soon became clear that those usually assigned to run the infirmary would need much assistance.</p>\n\t\t<p class =\"blueCap\">This left too few nuns free to keep up the regular liturgy of the hours. Agnes, the prioress, ordered Terce, Sext and None to be combined into a single prayer at mid-day but there were still many cases of sisters falling asleep in the choir stall.</p>\n\t\t<p class =\"redCap\">Faced with this state of affairs, the young abbess, although <span lang=\"la\">virtute officium</span> exempt from all these duties, felt she could not stand aside.</p>\n\t\t|c1>[<p class =\"greenCap\">She decided to lend a hand in the nursing of the sick.</p>]\n\t\t|c2>[<p class =\"greenCap\">Otilia decided to take part in the rotation for the night office.</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|VC1)[(display:\"FebChoice1\")]\n\t\t|VC2)[(display:\"FebChoice2\")]\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">She decided to lend a hand in the nursing of the sick. This was met with great astonishment by the others, as it was believed the illness was contagious. Indeed, one after the other, those who worked in the infirmary soon found themselves as patients there.</p>\n\t<p class =\"blueCap\">The abbess proclaimed: It is well that I should share that burden with you, like a sister. The sceptics acquiesced after a short while and she began her work.</p>\n\t(replace: ?c2)[]\n\t(show:?VC1)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">Otilia decided to take part in the rotation for the night office. By taking this measure, there would be others, more experienced than her in taking care of the sick, rested and ready for their work of charity.</p>\n\t<p class =\"blueCap\">As there had to be at least two nuns awake to sing the Invitatorium and Hymnus, Otilia arranged for her second cousin, Ida, to be assigned on the same Virgils as herself, in hopes it would make this duty a little merrier.</p>\n\t(replace: ?c1)[]\n\t(show:?VC2)\n}]\n(click: ?next)[(goto: \"March\")]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "FebChoice1",
            "pid": 12
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "FebChoice2",
            "pid": 13
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "March",
            "pid": 15
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "FebChoice1",
      "text": "{\n<p class =\"redCap\">The patients in the infirmary had been separated into two wards. Those who were expected to recover quickly were kept in the usual premises and those who were not expected to recover from their illness were kept in a second building that had been quickly turned over to this purpose.</p>\n<p class =\"blueCap\">There was, of course, no question of the abbess performing the more demanding tasks. These were left to the infirmaria and her famuli. Assistance was needed in both wards, but the nature of what was required differed. Otilia considered where to help.</p>\n|c3>[<p class =\"greenCap\">There is probably a lot more for me to learn in the first ward, her deliberations went.</p>]\n|c4>[<p class =\"greenCap\">The sisters in the second ward are more in need of their mother's consolation, she thought.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">There is probably a lot more for me to learn in the first ward, her deliberations went. So she decided to spend most of her time with the younger and stronger patients.</p>\n\t<p class =\"redCap\">Two weeks went by in which the young abbess learned how to provide the sick with food and drink when they were too weak to help themselves, how to bring down their temperature with calf packings, how to change their bedding when it was soiled, how to prepare a bath and how a clyster and how to start and stop a bloodletting.</p>\n\t(set: nuns of $popularityDm to it +1)\n\t(set: hope of $virtueDm to it +1)\n\t(replace: ?c4)[]\n\t(display:\"FebEnd\")\n\t(set: $caritas to $caritas +1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">The sisters in the second ward are more in need of their mother's consolation, she thought, and decided to spend the majority of her time with the older and weaker patients, who were most likely not to see spring this year.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">|M3>[Such grace of charity we seldom saw from abbot or abbess alike.]\n\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Such grace of charity we seldom saw from abbot or abbess alike.]]\n\t\t</p>\n\t\t<p class =\"redCap\">For two weeks, Otilia kept her dying sisters company. She held their hands, she read to them from the bible, she prayed with them and also for them on her own when they had lost such ability. Three nuns she saw the Lord take to him while she sat at their bedsides.</p>\n\t</div>\n\t(set: nuns of $popularityDm to it +1)\n\t(set: courage of $virtueDm to it +1)\n\t(replace: ?c3)[]\n\t(display:\"FebEnd\")\n\t(set: $asceticism to $asceticism +1)\n\t(show:?next)\n}]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "FebEnd",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "FebChoice2",
      "text": "{\n<p class =\"redCap\">When it was time for their first night office, the two nuns stayed in the church after Compline, eager to spend the time until midnight in silent prayer for those in the infirmary.</p>\n<p class =\"blueCap\">It was Ida, the cantoress, who first broke the order of nightly silence, waking her cousin. She spoke: Otilia, I am deathly cold, if we stay here in the church, we shall surely turn to ice.</p>\n<p class =\"redCap\">The abbess agreed and decided that this would not serve the Lord nor the chapter. She propounded: Let us go and seek shelter from the cold in my lodgings, the stove there gets warm quickly.</p>\n|c3>[<p class =\"greenCap\">On their way to the abbess' quarters, they stopped at the armarium to get a book.</p>]\n|c4>[<p class =\"greenCap\">Otilia said: A game of tables is just the right thing to keep us awake without breaking the holy silence that is mandatory for our night office.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">On their way to the abbess' quarters, they stopped at the armarium to get a book. With so many to choose from, they looked at but a few before they took Vitruvius' De Architectura with them and they read in it in silence, only occasionally asking each other for advice in a low voice, until they had to go to the church to pray the Matutine.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">|M4>[I once saw such at Cluny. T'was such a pleasure to have warm feet at night in church.]\n\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[I once saw such at Cluny. T'was such a pleasure to have warm feet at night in church.]]\n\t\t</p>\n\t\t<p class =\"blueCap\">The malady that had befallen the nuns continued for three more weeks. And so it came that the two cousins spend six more Vigils with books they hesitated to mention to the others during the day, lest their nightly reading became known. They finished Vitruvius and half of Aristotle's politics. In the end they both agreed that a hypocaustum would be good for the choir.</p>\n\t</div>\n\t(set: family of $popularityDm to it +1)\n\t(set: nuns of $popularityDm to it -1)\n\t(set: prudence of $virtueDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $vitruvius to true)\n\t(set: $technicalSkill to $technicalSkill +1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">Otilia said: A game of tables is just the right thing to keep us awake without breaking the holy silence that is mandatory for our night office, I happen to keep a board in the chest in my quarters, thou knowest which one. Ida agreed: What a splendid idea, Otilia! And so they played game after game in the abbess' lodgings without uttering a word until they had to go to the church to pray the Matutine.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">|M5>[While others lay sick in the infirmary! Praying for them is what they should have done.]\n\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[While others lay sick in the infirmary! Praying for them is what they should have done.]]\n\t\t</p>\n\t\t<p class =\"blueCap\">The malady that had befallen the nuns continued for three more weeks. Thus, the two cousins spend six more Vigils playing tables, much to their enjoyment. By the time every patient in the infirmary had regained her health or passed away, Ida and Otilia had both improved their play considerably.</p>\n\t</div>\n\t(set: family of $popularityDm to it +1)\n\t(set: nuns of $popularityDm to it -1)\n\t(set: gluttony of $viceDm to it +1)\n\t(replace: ?c3)[]\n\t(set: $fun to $fun +1)\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 14,
      "name": "FebEnd",
      "text": "{\n\t<p class=\"vmarginalia\"><span class=\"CommentatorB\">|M5>[A great help she was!]</span>\n\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[A great help she was!]]\n\t</p>\n\t<p class =\"blueCap\">Just as she had been warned, Otilia soon after came down with the same illness that had befallen so many of the sisters before her. And so the last week she spend in the infirmary, she herself had to be nursed back to health by the infirmaria.</p>\n</div>\n}",
      "links": []
    },
    {
      "pid": 15,
      "name": "March",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/march.svg\" alt=\"Initial A\">\n\t\t<h3> serf finds a mer&shylin fal&shycon near&shyby</h3>\n\t\t<p class =\"redCap\">\n\t\tNot long before Palm Sunday, a censuale caught a falcon in a field. Seeing that it had a ring, he brought it to the abbey's falconer. It was a young and strong lady merlin, but no one nearby was known to be in possession of such a bird, and the mark on the ring could not be read.\n\t\t</p>\n\t\t<p class =\"blueCap\">The falconer went to the prioress to ask her opinion on the catch, as sister Agnes was fond of falconing and therefore knew a great deal about it. This raptor must have been on its way north, it probably comes from far away, spoke she.</p>\n\t\t<p class =\"redCap\">They were none the wiser what to do with the catch and so they decided to hear the abbess' decision on the matter.</p>\n\t\t|c1>[<p class =\"greenCap\">The falcon is not ours to keep, said Otilia.</p>]\n\t\t|c2>[<p class =\"greenCap\">Since the bird's owner lives in a land far away, I shall keep it, Otilia exclaimed.</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|VC1)[(display:\"MarChoice1\")]\n\t\t|VC2)[(display:\"MarChoice2\")]\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">The falcon is not ours to keep, said Otilia. But its ring is from nowhere nearby, the owner is unlikely to find his bird now in any case. It is such a beautiful bird and it would be a shame not to put it to use now that it has come upon us! Protested Agnes, but Otilia wanted nothing to do with such an appropriation.</p>\n\t<p class =\"redCap\">The prioress suggested the bird be kept just for this summer, and be let go the next winter, when it might return to its owner somewhere far to the south, but the abbess said it wasn't right.</p>\n\t(replace: ?c2)[]\n\t(show:?VC1)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">Since the bird's owner lives in a land far away, so I shall keep it, Otilia exclaimed. Agnes was a bit startled by this but maintained her composure. The falconer excused himself to bring the falcon to the mews and left abbess and prioress alone.</p>\n\t<p class =\"redCap\">When he was gone, Agnes reminded Otilia that she had relinquished all her then and future property when she made her vows and that as such she could not keep the falcon for herself and would have to declare it part of the abbey's estate instead.</p>\n\t(replace: ?c1)[]\n\t(show:?VC2)\n}]\n(click: ?next)[(goto: \"April\")]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "MarChoice1",
            "pid": 17
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "MarChoice2",
            "pid": 16
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "April",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "MarChoice2",
      "text": "{\n<p class =\"blueCap\">The prioress was right, but nonetheless, Otilia would have liked to keep the merlin for herself. At the same time she knew Agnes would also be very fond of the beautiful bird of prey. After quickly considering her answer, she spoke thus:</p>\n|c3>[<p class =\"greenCap\">Agnes, thou hast already two peregrines at thy disposal, this merlin I will keep for myself.</p>]\n|c4>[<p class =\"greenCap\">Thou art right, sister Agnes. The bird rightfully belongs to the chapter and not to me.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Agnes, thou hast already two peregrines at thy disposal, this merlin I will keep for myself. What could the prioress say to this? It was well known she was the one who flew the falcons of the abbey. No one, not even the falconer himself, dared speak about the raptors of the abbey as anything but hers alone.</p>\n\t<p class =\"redCap\">Put into her place like this, the prioress acquiesced to Otilia's wish. The two nuns kept quiet about their agreement, as they both did not want their prizes discussed by the others. And yet it was soon known to everyone whos bird was whos.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\"><span class=\"CommentatorB\">|M6>[Same copybook as used with Pal.Lat.1071?]</span>\n\t\t(click-replace: ?M6)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Same copybook as used with Pal.Lat.1071?]]\n\t\t</p>\n\t\t<img class=\"miniature\" src=\"images/miniatures/merlin.png\" alt=\"Miniature\">\n\t</div>\n\t<div>\n\t\t<p class=\"vmarginalia\">\n\t\t\t|M5>[A Merlin for a lady. Peregrines are really to big.]\n\t\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[A Merlin for a lady. Peregrines are really to big.]]\n\t\t</p>\n\t<p class =\"blueCap\">In this manner did Otilia keep the merlin for herself. A disappointment it may have been for sister Agnes, but the abbess' decision righted her view of the chapter's falcons as her own exclusive entertainment.</p>\n\t</div>\n\t(set: people of $popularityDm to it -1)\n\t(set: nuns of $popularityDm to it -1)\n\t(set: greed of $viceDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $merlin to true)\n\t(set: $power to $power +1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">Thou art right, sister Agnes. The bird rightfully belongs to the chapter and not to me. It shall be my pleasure to share it with all those amongst us who like to fly raptors.</p>\n\t<p class =\"redCap\">It was well understood that the prioress was the only one who flew the abbey's falcons beside the falconer himself. Not that some of the other sisters wouldn't have liked to do so as well, but no one dared request so much in defiance of Agnes' wish to keep the falcons for herself.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\"><span class=\"CommentatorB\">|M6>[Same copybook as used with Pal.Lat.1071?]</span>\n\t\t(click-replace: ?M6)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Same copybook as used with Pal.Lat.1071?]]\n\t\t</p>\n\t\t<img class=\"miniature\" src=\"images/miniatures/merlin.png\" alt=\"Miniature\">\n\t</div>\n\t<p class =\"blueCap\">Otilia did not want to enrage the prioress either and so she conceded her the merlin. The two kept quiet about their little disagreement and so it was assumed the new falcon had come into Agnes' possession quite naturally and uncontended. Only the falconer knew otherwise.</p>\n\t(set: nuns of $popularityDm to it +1)\n\t(set: justice of $virtueDm to it +1)\n\t(replace: ?c3)[]\n\t(set: $agnesMerlin to true)\n\t(set: $agnesOwes to true)\n\t(set: $merlin to true)\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 17,
      "name": "MarChoice1",
      "text": "{\n<p class =\"blueCap\">Upon this, the falconer asked if he would be allowed to politely repeat his request for instructions, that is to say, what he was to do with the merlin if the abbess didn't want it to be kept.</p>\n<p class =\"redCap\">This had indeed been the question from the very beginning and a decision had to be made. Finally, Otilia answered the falconer the following:</p>\n|c3>[<p class =\"greenCap\">Let the bird go! Let it fly freely to wherever it will.</p>]\n|c4>[<p class =\"greenCap\">Ask around for the owner! Take the raptor and bring it to every castle, manor and cloister within two day's ride.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Let the bird go! Let it fly freely to wherever it will. If it escaped its owner, maybe the Lord meant for it to be free. Who are we to intervene?</p>\n\t<div>\n\t\t<p class=\"vmarginalia\"><span class=\"CommentatorB\">|M3>[Psalm 8,7]</span>\n\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Psalm 8,6]]\n\t\t</p>\n\t\t<p class =\"blueCap\">Scripture says otherwise: |L1>[(text-colour: #e34234)[<span lang = \"la\">Omnia subjecisti sub pedibus ejus, oves et boves universas, insuper et pecora campi, volucres cæli, et pisces maris qui perambulant semitas maris,</span>]] said Agnes</p>\n\t\t(click-replace: ?L1)[Thou hast put all things under his feet: All sheep and oxen, yea, and the beasts of the field; The fowl of the air, and the fish of the sea, and whatsoever passeth through the paths of the seas,]\n\t</div>\n\t<div>\n\t\t<p class=\"vmarginalia\"><span class=\"CommentatorB\">|M6>[Same copybook as used with Pal.Lat.1071?]</span>\n\t\t(click-replace: ?M6)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Same copybook as used with Pal.Lat.1071?]]\n\t\t</p>\n\t\t<img class=\"miniature\" src=\"images/miniatures/merlin.png\" alt=\"Miniature\">\n\t</div>\n\t<div>\n\t\t<p class=\"vmarginalia\"><span class=\"CommentatorB\">|M4>[Galatians 5,1]</span>\n\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Galatians 5,1]]\n\t\t</p>\n\t\t<p class =\"redCap\">But it also says: |L2>[(text-colour: #e34234)[<span lang= \"la\">Qua libertate Christus nos liberavit. State, et nolite iterum jugo servitutis contineri,</la>]] recited Otilia.</p>\n\t(click-replace: ?L2)[Stand fast therefore in the liberty wherewith Christ hath made us free, and be not entangled again with the yoke of bondage,]\n\t</div>\n\t<p class =\"blueCap\">I am not sure thy reading of the words is quite right there, the prioress remarked, but she yielded to Otilia's wish and the merlin was set free by the falconer that same day.</p>\n\t(set: people of $popularityDm to it +1)\n\t(set: love of $virtueDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $merlin to false)\n\t(set: $asceticism to $asceticism +1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">Ask around for the owner! Take the raptor and bring it to every castle, manor and cloister within two day's ride, spoke the abbess and the falconer did as he was told. He ranged to the north for four days, all for nought, before he came back to rest for a day. Then he made his way south.</p>\n\t<p class =\"blueCap\">A week later, he returned to report that the merlin belonged to a well-known baroness not far away to the south, who had aquired it only recently and lost it upon hunting with it for the first time.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\"><span class=\"CommentatorB\">|M6>[Same copybook as used with Pal.Lat.1071?]</span>\n\t\t(click-replace: ?M6)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Same copybook as used with Pal.Lat.1071?]]\n\t\t</p>\n\t\t<img class=\"miniature\" src=\"images/miniatures/merlin.png\" alt=\"Miniature\">\n\t</div>\n\t<p class =\"redCap\">She gives ye thanks, and sends this in return, the falconer ended his tale and presented Otilia a necklace with a silver cross, adorned with a blue gemstone.</p>\n\t(set: justice of $virtueDm to it +1)\n\t(replace: ?c3)[]\n\t(set: $merlin to false)\n\t(set: $power to $power +1)\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 18,
      "name": "April",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/april.svg\" alt=\"Initial M\">\n\t\t<h3>an&shyda&shytum on Di&shyes Ce&shynae Do&shymi&shyni</h3>\n\t\t<p class =\"redCap\">It was customary in many an abbey that on the day of the commemoration of the last supper, the abbot would wash the feet of twelve of his disciples, as our Lord Jesus had done with his.</p>\n\t\t<p class =\"blueCap\">Other monasteries, arguing that humility was the intention, had twelve pueri come into the cloister on Maundy Thursday to have their feet washed by the monks.</p>\n\t\t<p class =\"redCap\">Since the abbey concerned was a ladies' college, these customs had to be handled with care. The late abbess Margaretha had washed the feet of twelve sisters every year for the duration of her office, and it fell to Otilia to review the form of the mandatum during hers.</p>\n\t\t|c1>[<p class =\"greenCap\">Let's keep it the way my predecessor arranged it. Maundy will be done on twelve nuns.</p>]\n\t\t|c2>[<p class =\"greenCap\">On this Thursday alone, twelve of the poor shall be led into the cloister to have their feet washed.</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|VC1)[(display:\"AprChoice1\")]\n\t\t|VC2)[(display:\"AprChoice2\")]\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">Let's keep it the way my predecessor arranged it. Maundy will be done on twelve nuns. It would be uncalled for to allow poorfolk into the cloister. Thus spoke Otilia.</p>\n\t<p class =\"blueCap\">When out of earshot of the others, sister Ida approached the abbess and said: This would have been a good opportunity to show some virtue, Otilia.</p>\n\t<p class =\"redCap\">I can't change all the ways of this abbey in my first year, and I can't renege on my decision. It'll have to wait until next year, answered her cousin.</p>\n\t(replace: ?c2)[]\n\t(show:?VC1)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">On this Thursday alone, twelve of the poor shall be led into the cloister to have their feet washed. Let us strife in our service to the Lord to whom we are all bound.</p>\n\t<p class =\"blueCap\">Sister Agnes demured that it was questionable if the poorfolk would accept such a gesture from a woman, unordained as she must be.</p>\n\t<p class =\"redCap\">Then the steward will have to select people who won't mind, answered Otilia. Maybe twelve young girls would be best. I don't think there can be any objections to them entering the cloister.</p>\n\t(replace: ?c1)[]\n\t(show:?VC2)\n}]\n(click: ?next)[(goto: \"May\")]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "AprChoice1",
            "pid": 19
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "AprChoice2",
            "pid": 20
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "May",
            "pid": 21
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "AprChoice1",
      "text": "{\n<p class =\"blueCap\">Come Thursday, the nuns gathered in the cloister outside the refectory. The twelve sisters that had been selected to receive the mandatum this year entered the lavatorium and sat in a circle in the arcades.</p>\n<p class =\"redCap\">None of these nuns had received this honor in recent years, and they, like all others, had worked out long before to whom it would fall to this time. Anticipating their role, they did not want to cause their abbess embarressment and had washed their feet beforehand, so that they were now clean already.</p>\n|c3>[<p class =\"greenCap\">Seeing this, Otilia decided that performing the maundy to the letter, like the Lord had done, was unnecessary.</p>]\n|c4>[<p class =\"greenCap\">None the less, The abbess went down on her knees, washing each pair of feet in turn.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Seeing this, Otilia decided that performing the maundy to the letter, like the Lord had done, was unnecessary. She proceeded thus to splash a few drops of water on each pair of feet.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">\n\t\t\t|M3>[It is really a shame how the maundy in flunked in many cloisters.]\n\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It is really a shame how the maundy in flunked in many cloisters.]]\n\t\t</p>\n\t<p class =\"blueCap\">This was the way the ceremony had been performed for many years by the late abbess Margaretha and the sisters were happy with the mandatum being handled this way. Otilia had always liked this particular gesture and thought it showed precisely the amount of humility an abbess could show to anyone but the Lord himself.</p>\n\t</p>\n\t<p class =\"redCap\">With hindsight, it was later agreed that it was at around that time of the year that Otilia began to cough now and then.</p>\n\t(set: people of $popularityDm to it -1)\n\t(set: sloth of $viceDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $power to $power + 1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">None the less, The abbess went down on her knees, washing each pair of feet in turn, and dryed them with white linen. Silently, the chapter watched as she did her work of charity.</p>\n\t<p class =\"blueCap\">Not even the venerable abbess Margareth had performed the maundy with such humility and piety to the words of the Bible. Many of those, who had been unsure about their choice when they voted for Otilia to become abbess were now certain it would yet be for the best.</p>\n\t<p class =\"redCap\">With hindsight, it was later agreed that it was at around that time of the year that Otilia began to cough now and then.</p>\n\t(set: nuns of $popularityDm to it +1)\n\t(replace: ?c3)[]\n\t(show:?next)\n\t(set: $cenobitism to $cenobitism +1)\n}]\n}",
      "links": []
    },
    {
      "pid": 20,
      "name": "AprChoice2",
      "text": "{\n<p class =\"blueCap\">The chapter wondered what the outcome of Otilia's decision would be and anxiously awaited the Dies Cenae Domini. The steward. however, went to work and arranged for everything to be most becoming of the solemnity.</p>\n<p class =\"redCap\">Come Thursday, twelve young daughters of cerocensuales of the abbey were led into the cloister, each in her best attire, crowned with a girdle of white Dianthus. So lovely was the sight, even the most devoted amongst the members of the chapter stopped her prayer for a smile.</p>\n<p class =\"blueCap\">The steward had seen to it that all of them had been bathed beforehand and their feet were fair and white. In truth, there was no need for them to have their feet washed, again.</p>\n|c3>[<p class =\"greenCap\">No matter, thought the abbess, the gesture is what counts, and she proceeded to perform the maundy.</p>]\n|c4>[<p class =\"greenCap\">In this case, just splashing a few drops of water on each foot should be enough, thought Otilia.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">No matter, thought the abbess, the gesture is what counts, and she proceeded to perform the maundy. One after the other, she washed each pair of small feet and dried it with white linen.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">\n\t\t\t<span class=\"CommentatorB\">|M4>[That's how they did it in some monasteries in those days. Commendable, I say.]</span>\n\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[That's how they did it in some monasteries in those days. Commendable, I say.]]\n\t\t</p>\n\t<p class =\"redCap\">In lowering herself to such a task, the abbess found great appreciation among the people of the land and her piety was recognised far and wide.</p>\n\t</div>\n\t<p class =\"blueCap\">With hindsight, it was later agreed that it was at around that time of the year that Otilia began to cough now and then.</p>\n\t(set: people of $popularityDm to it +1)\n\t(set: love of $virtueDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $caritas to $caritas +1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">In this case, just splashing a few drops of water on each foot should be enough, thought Otilia. And so she did, happy with the beauty of the scene, as it was.</p>\n\t<p class =\"redCap\">The nuns all liked how Otilia had changed the way Maundy was celebrated at the abbey. The people of the land, however, had hoped for the children to be blessed by the touch of the noble abbess.</p>\n\t<p class =\"blueCap\">With hindsight, it was later agreed that it was at around that time of the year that Otilia began to cough now and then.</p>\n\t(set: nuns of $popularityDm to it -1)\n\t(set: sloth of $viceDm to it +1)\n\t(replace: ?c3)[]\n\t(set: $fun to $fun +1)\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 21,
      "name": "May",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/may.svg\" alt=\"Initial O\">\n\t\t<h3>ut on hor&shyse&shyback, fal&shyco&shyning</h3>\n\t\t<p class =\"redCap\">In the week after Ascension, the time came for falconing. Sister Agnes had been talking about it in anticipation for some weeks, so much so, that it was whispered she neglected her other duties. Otilia had promised her they would go fly the raptors as soon as the weather allowed and when that day came, they put on their hunting coats and rode out into the fields, while the falconer and his assistants followed afoot.</p>\n\t\t<p class =\"blueCap\">As they made their way through the pasture and fields, Otilia spotted a small group of travellers on the road that led towards the free city not far off to the west.</p>\n\t\t|c1>[<p class =\"greenCap\">Where might these people come from? It cannot hurt to take a closer look at them. Thinking like this, she steered her dappled steed towards the road.</p>]\n\t\t|c2>[<p class =\"greenCap\">Theirs is not our business, for we will fly our birds of prey today, and one shouldn't be so curious, anyway, she thought by herself.</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|VC1)[(display:\"MayChoice1\")]\n\t\t|VC2)[]\n\t</div> \n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">Where might these people come from? It cannot hurt to take a closer look at them. Thinking like this, she steered her dappled steed towards the road and fell into canter. Agnes, surprised by the sudden change in gait, followed her. One after the other, the two riders broke through the hedge and landed in front of the party on the sunken road.</p>\n\t<p class =\"redCap\">At first, the travellers feared robbery. The children in the group screamed in terror. But as soon as they discovered whom they were dealing with, they dropped to their knees on the side of the road.</p>\n\t(replace: ?c2)[]\n\t(show:?VC1)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">Theirs is not our business, for we will fly our birds of prey today, and one should not be so curious, anyway, she thought by herself. And so she paid no heed to the distraction on the sunken road. </p>\n\t(if: $merlin)[{\n\t<p class =\"redCap\">Around midday, the party arrived at the hunting grounds. It had been decided that they would be trying out the Merlin's hunting prowess on that day. The falconer had spent the last weeks on getting the bird to hunt from his fist, and the two nuns wanted to see the result of the training.</p>\n\t\t(replace: ?VC2)[(display: \"MayMerlin\")]\n\t}]\n\t(else:)[{\n\t<p class =\"redCap\">It had been decided that they would seek out a heron and attempt to bring it down with both of the abbey's peregrines. After the party had spent some time searching, they finally spotted a grey heron fishing a small lake. Agnes and the falconer released the raptors and in wide, staid circles, the two falcons climbed towards the ardea cinerea.</p>\n\t(replace: ?VC2)[(display: \"MayNoMerlin\")]\n\t}]\n\t(set: $beenHunting to true)\n\t(replace: ?c1)[]\n\t(show:?VC2)\n}]\n(click: ?next)[(goto: \"June\")]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "MayChoice1",
            "pid": 25
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "MayMerlin",
            "pid": 26
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "MayNoMerlin",
            "pid": 28
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "June",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 22,
      "name": "Binding",
      "text": "{\t\n\t(set: $musicalSkill to 0)\n\t(set: $technicalSkill to 0)\n\t(set: $economics to 0)\n\t(set: $caritas to 0)\n\t(set: $fun to 0)\n\t(set: $power to 0)\n\t(set: $asceticism to 0)\n\t(set: $cenobitism to 0)\n\t(set: $book to 0)\n\t\n\t(set: $stewardOwes to false)\n\t(set: $agnesOwes to false)\n\t(set: $knowsMusicianWell to false)\n\t(set: $beenHunting to false)\n\t(set: $vitruvius to false)\n\t(set: $merlin to false)\n\t(set: $agnesMerlin to false)\n\t(set: $agnesHuntedWithMerlin to false)\n\t(set: $millSeen to false)\n\t(set: $millUnderstood to false)\n\t(set: $idaGone to false)\n\t(set: $idaStays to false)\n\t(set: $seenFamine to false)\n\t(set: $agnesAbbess to false)\n\t(set: $YsabellaAbbess to false)\n\t(set: $idaAbbess to false)\n\t(set: $cousinSteward to false)\n\t(set: $musicianSteward to false)\n\t\n\t(set: $virtueDm to (dm:\n\t\t\t\"faith\",\t\t0,\n\t\t\t\"love\",\t\t\t0,\n\t\t\t\"hope\", \t\t0,\n\t\t\t\"prudence\",\t\t0,\n\t\t\t\"courage\", \t\t0,\n\t\t\t\"temperance\", \t0,\n\t\t\t\"justice\", \t\t0\n\t\t)\n\t)\n\t(set: $viceDm to (dm:\n\t\t\t\"lust\", \t\t0,\n\t\t\t\"gluttony\", \t0,\n\t\t\t\"greed\", \t\t0,\n\t\t\t\"sloth\", \t\t0,\n\t\t\t\"wrath\", \t\t0,\n\t\t\t\"envy\", \t\t0,\n\t\t\t\"pride\", \t\t0\n\t\t)\n\t)\n\t(set: $popularityDm to (dm:\n\t\t\t\"people\", 0,\n\t\t\t\"nuns\", 0,\n\t\t\t\"family\", 0\n\t\t)\t\n\t)\n<div class=\"recto\" id=\"binding\">\n\t|next>[<img class=\"miniature\" src=\"images/binding.png\" alt=\"Binding\">]\n</div>\n(click: ?next)[(goto: \"Frontmatter\")]\n}",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "Frontmatter",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "June",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang = \"en\">\n\t\t<img class=\"initial\" src=\"images/initials/june.svg\" alt=\"Initial T\">\n\t\t<h3>ra&shyvel&shylers seek shel&shyter</h3>\n\t\t<p class =\"redCap\">Not long after Dominica Trinitatis, a group of travellers asked for shelter at the abbey's gate. It was already late in the evening and it looked like a thunderstorm would come down at any moment, so the prioress decided to allow them into the abbey's immunity.</p>\n\t\t<p class =\"blueCap\">The group consisted of a knight and some of his squires. The reason for their journey was some legal matter and they had been on the road for two days. Agnes arranged for these noble born guests to be quartered in the abbess' guest house.</p>\n\t\t<p class =\"redCap\">Otilia decided to extend to the visitors the honor of taking the evening meal with her. While the thunderstorm raged outside, the abbess and the nuns she had invited much enjoyed the occasion to hear news from the outside world, of which the knight gladly told.</p>\n\t\t<p class =\"blueCap\">After the meal, one of the squires produced a lute from his luggage and suggested to play some music.</p>\t\n\t\t|c1>[<p class =\"greenCap\">Otilia answered: Please do, dear friend. It will be our pleasure to hear thy song.</p>]\n\t\t|c2>[<p class =\"greenCap\">Otilia accepted this suggestion and added: Our cantoress will surely want to join thee.</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t|song)[<img class = \"vfpMiniature\" src=\"images/miniatures/song.svg\" alt=\"Song\">]\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">Otilia answered: Please do, dear friend. It will be our pleasure to hear thy song. In truth, I shall join thee on my recorder. The young man thanked her and after they had decided how she would accompany him, he started singing. His song went thus:</p>\n\t(set: lust of $viceDm to it +1)\n\t(replace: ?c2)[]\n\t(set: $musicalSkill to $musicalSkill +1)\n\t(show:?song)\n\t(show:?next)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">Otilia accepted this suggestion and added: Our cantoress will surely want to join thee. Thus sister Ida sent for her recorder and after the two musicians had decided how she would accompany the young man's play, he began to sing this song:</p>\n\t(set: family of $popularityDm to it +1)\n\t(set: envy of $viceDm to it +1)\n\t(replace: ?c1)[]\n\t(set: $idaOwes to true)\n\t(show:?song)\n\t(show:?next)\n}]\n(click: ?next)[(goto: \"July\")]\n}",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "July",
            "pid": 29
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "Introduction",
      "text": "{\n<div class=\"recto\">\n\t<img class=\"rfpMiniature\" src=\"images/miniatures/frontispiece.png\" alt=\"Miniature\">\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/introduction.svg\" alt=\"Initial H\">\n\t\t<h3>ere begins the abbess' tale</h3>\n\t\t<p class =\"redCap\">The matter of this treatise shall be the life and works of Abbess Otilia, that is to say, her vita religiosa, the conduct with which she fulfilled her office and the spirit in which she utilised the privileges afforded to her by the institution thereof.</p>\n\t\t<p class =\"blueCap\">It is intended with this book to inform the reader of the matter thus defined, including its peculiarities in vocabulary and grammar, as well as to describe the ways of the world, how they have been and still are to this day, like it shall be seen by the events described herein.</p>\n\t\t<p class =\"redCap\">For those readers wishing to gain an understanding in these matters, it will be necessary to read the book many times, remember well what they have read, for it is put subtly, not on the surface of the words, as will be readily apparent when reading it.</p>\n\t\t<p class =\"blueCap\">It would be impossible to list all events of a lifetime, even if short it may have been. Therefore it will be written only of those occasions most memorable in the story here told. The choice thus selected can, of course, never please all, but the reader will agree that choosing some selection can not be avoided altogether. Thus, she is invited to make their own contributions from their own memory of the events.</p>\n\t</div>\n\t|next>[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click: ?next)[{(goto: \"December\")}]\n}",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "December",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 25,
      "name": "MayChoice1",
      "text": "{\n<p class =\"blueCap\">Circling their nervous horses, the two riders eyed the people cowering before them. They looked for all the world like beggars to Otilia. Agnes, however, recognised a face and declared that these were servi of the abbey, most likely on their way to the town in order to escape their master, who, she added, was the chapter, or rather, its abbess, Otilia.</p>\n<p class =\"redCap\">It seemed called for to speak to them, although the nuns were unsure if the fugitives would understand anything but the vernacular, which neither abbess nor prioress spoke fluently.</p>\n|c3>[<p class =\"greenCap\">Agnes, speak thee to them. Make them return to their farm. So spoke the abbess.</p>]\n|c4>[<p class =\"greenCap\">We are but nuns and won't make you return to your clod, but know that we are disappointed that you should leave us, she sought to tell the serfs.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Agnes, speak thee to them. Make them return to their farm. So spoke the abbess. The prioress threw her a furious look and began shouting at the people. Then she took to hitting them with her horsewhip. By these means she was able to chase them off running back towards their village.</p>\n\t<img class=\"miniature\" src=\"images/miniatures/falconing.png\" alt=\"Miniature\">\n\t<div>\n\t\t<p class=\"vmarginalia\">\n\t\t\t|M3>[She's right. Abandoning ones clod is wrong and should be punished.]\n\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[She's right. Abandoning ones clod is wrong and should be punished.]]\n\t\t</p>\n\t<p class =\"blueCap\">After she had calmed down, Agnes explained to her young abbess that the serfs were better off with this quick thrashing than with what they'd have had to expect had they been caught by the steward.</p>\n\t</div>\n\t(set: people of $popularityDm to it -1)\n\t(set: wrath of $viceDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $power to $power + 1)\n\t(set: $agnesOwes to false)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">We are but nuns and won't make you return to your clod, but know that we are disappointed that you should leave us, she sought to tell the serfs. And, after some gesticulation, the villains made for the town, much to their own and Agnes' bewilderment.</p>\n\t<img class=\"miniature\" src=\"images/miniatures/falconing.png\" alt=\"Miniature\">\n\t<div>\n\t\t<p class=\"vmarginalia\">\n\t\t\t|M4>[That seems an overly harsh punishment. Had they no recurse against this?]\n\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[That seems an overly harsh punishment. Had they no recurse against this?]]\n\t\t</p>\n\t<p class =\"blueCap\">The next day, the steward rode to the town and spoke to the city council. They handed over the fugitives so that the steward could enact his rightful punishment. The villeins were whipped, locked and marked with the iron.</p>\n\t</div>\n\t(set: people of $popularityDm to it +1)\n\t(set: love of $virtueDm to it +1)\n\t(replace: ?c3)[]\n\t(show:?next)\n\t(set: $caritas to $caritas +1)\n}]\n}",
      "links": []
    },
    {
      "pid": 26,
      "name": "MayMerlin",
      "text": "{\n<p class =\"blueCap\">The raptor was a strong specimen and it was hoped it would bring in a rabbit or possibly a pheasant that could be eaten at the abbess' table before Compline. Yet, when the bird was released, it wouldn't hunt for either and instead pounced on a sparrow, which it duly killed.</p>\n<p class =\"redCap\">The falconer lured the Merlin away from its prey by feeding it on his glove. It was known to everyone that the falcon, now almost satisfied, would only hunt once more that day at most, so it had better catch something edible this time lest Otilia and Agnes were to partake in the common meal with the others in the refectory.</p>\n|c3>[<p class =\"greenCap\">Try thee once more, falconer, spoke the abbess, for nothing could be gained from hesitation.</p>]\n|c4)[<p class =\"greenCap\">Let me try flying the merlin for once, falconer, it might bow to my will more eagerly than to thine, said Otilia.</p>]\n|c5)[<p class =\"greenCap\">Why don't thee try thy luck for once, Agnes? the bird belongs to everyone, after all, asked Otilia.</p>]\n(if: $agnesMerlin is true)[{(show: ?c5)}]\n(else:)[{(show: ?c4)}]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Try thee once more, falconer, spoke the abbess, for nothing can be gained from hesitation. And so he threw the merlin from his fist once more, and the raptor soared up and circled through the sky before it dove on its prey. When the hunting party arrived at the scene, they discovered it had caught a mouse.</p>\n\t<img class=\"miniature\" src=\"images/miniatures/falconing.png\" alt=\"Miniature\">\n\t<p class =\"blueCap\">Perhaps it had been the Lord's will from the outset that the chapter ate in the presence of its abbess that evening.</p>\n\t(replace: ?c4)[]\n\t(replace: ?c5)[]\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">Let me try flying the merlin for once, falconer, it might bow to my will more eagerly than to thine, said Otilia. The bird settled on the abbess' glove. She waited, tassel in hand, until she saw a rabbit dash accross the field. Alas, the rabbit was too quick and reached its hole before the bird of prey was in position.</p>\n\t<img class=\"miniature\" src=\"images/miniatures/falconing.png\" alt=\"Miniature\">\n\t<p class =\"blueCap\">Not bad for a beginner, said Agnes after the merlin had come back. I wonder what they had for supper.</p>\n\t(set: pride of $viceDm to it +1)\n\t(replace: ?c3)[]\n\t(replace: ?c5)[]\n\t(set: $fun to $fun +1)\n\t(show:?next)\n}]\n(click-replace: ?c5)[{\n\t<p class =\"greenCap\">Why don't thee try thy luck for once, Agnes? the bird belongs to everyone, after all, asked Otilia. This the prioress did, and lucky she was. When next a rabbit crossed the field, the pird of prey sank its sharp claws into its heart.</p>\n\t<img class=\"miniature\" src=\"images/miniatures/falconing.png\" alt=\"Miniature\">\n\t<p class =\"blueCap\">The prioress was justly proud of the feat and gladly she accepted Otilia's invitation to join her in the abbess' quarters for supper that night.</p>\n\t(set: temperance of $virtueDm to it +1)\n\t(replace: ?c3)[]\n\t(replace: ?c4)[]\n\t(set: $agnesOwes to true)\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 27,
      "name": "Backmatter",
      "text": "{\n<div class=\"recto\"></div>\n[[<div class=\"verso\" id=\"lastpage\">\n\t<div class=\"shelfmark\" lang = \"en\">\n\t\t<h4>Abbess Otilia's Life and Death</h4>\n\t\t<p>Written in Twine 2 (Harlowe 2)</p>\n\t\t<p>for the Interactive Fiction Competition 2018.</p>\n\t\t<p>The author is indebted to the Biblioteca Apostolica Vaticana, Biblioteca de Castilla y Leon, Trinity College Dublin, Bibliothèque nationale de France, Universiteitsbibliotheek Gent, Universitätsbibliothek Heidelberg and Erzbischofliche Diozesan- und Dombibliothek Köln for the inspiration they offered through their manuscript collections.</p>\n\t\t<p>Fonts used: 18th Century Kurrent, Albertsthal Typewriter,  Blackletter Hand, Hand Textur, Gotische Majuskel, Manic Monday and Typographer Unicialgotisch.</p>\n\t\t<p>Picture credits for the book cover and background textile go to the bod and the met, respectively. All other images by the author, but inspired by the work of many unknown illuminators.</p>\n\t</div>->Binding]]\n</div>\n}\n",
      "links": []
    },
    {
      "pid": 28,
      "name": "MayNoMerlin",
      "text": "{\n<p class =\"blueCap\">It was not long before it spotted them and began to ascend as well. Higher and ever higher the hunt spiralled towards the clouds as the raptors slowly gained until they had reached an altitude equal to that of the heron. Noticing that it could not shake the peregrines in this way, the heron bolted in a straight line across the sky.</p>\n<p class =\"redCap\">The falcons followed, still rising ever higher as they did so. The two nuns raced after the birds at the gallop, over stubble fields and through the woodland pasture, trying hard to keep up with the tearing speed of the pursuit. And then, finally, the raptors dived, wings folded, onto their majestic prey.</p>\n<div>\n\t\t<p class=\"vmarginalia\">\n\t\t\t<span class=\"CommentatorB\">|M5>[In our time one would just put a ring on the heron - one need'st not kill it.]</span>\n\t\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Nowadays one would just put a ring on the heron - one need'st not kill it.]]\n\t\t</p>\n\t<p class =\"blueCap\"> Just as the first attacker pounced the heron, it turned its slender neck and with a single, well aimed thrust of its beak, speared the falcon and sent it tumbling toward the ground. In came the second bird of prey and struck the ardea, this time fatally. Agnes and Otilia watched in awe. The young abbess did not speak, but in her heart she thought:</p>\n</div>\n|c3>[<p class =\"greenCap\">Is it not infinitely better to live, and, if possible, die, with some measure of nobility?</p>]\n|c4>[<p class =\"greenCap\">The proud are but for a moment, like a dream in the night of the summer solstice.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Is it not infinitely better to live, and, if possible, die, with some measure of nobility? What not would I give to have that right when the day finally comes? How many others there must be without such choice, unwilling to gain it and unbothered by its absence. I will not be one of them.</p>\n\t(set: pride of $viceDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $power to $power + 1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">The proud are but for a moment, like a dream in the night of the summer solstice. Death conquers all and in the end, no one is more than dust before the wind. More so, on the day of judgement, before the Lord, our wordly fortunes will be of no weight at all.</p>\n\t(replace: ?c3)[]\n\t(show:?next)\n\t(set: $asceticism to $asceticism +1)\n}]\n}",
      "links": []
    },
    {
      "pid": 29,
      "name": "July",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/O.svg\" alt=\"Initial O\">\n\t\t<h3>ti&shylia ins&shypects the land</h3>\n\t\t<p class =\"redCap\">As the seventh sunday after Trinitatis came to pass, it was time to bring in the grain harvest. The abbey's steward had to make his tour to assess how much each of the villages was to provide. He though this was a good opportunity to show the lands in the possession of the chapter to the abbess.</p>\n\t\t<p class =\"blueCap\">A travelling party was put together, each day's ride was set out and lodging arranged for the nights. With these preparations in place, the abbess began her inspection in the company of the steward, while the prioress stood in for her within the cloister.</p>\n\t\t<p class =\"redCap\">Otilia spent a few days visiting various granaries, each of which she found well-stocked with the peasants' tithe. At the end of the fourth day, she spoke to the steward:</p>\n\t\t|c1>[<p class =\"greenCap\">On the next estate we visit, I should like to take a look at the servi working in the fields.</p>]\n\t\t|c2>[<p class =\"greenCap\">When next we stop, show me some of the works of artifice that have been erected to further what was gained from the land.</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|VC1)[(display:\"JulChoice1\")]\n\t\t|VC2)[(display:\"JulChoice2\")]\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">On the next estate we visit, I should like to take a look at the servi working in the fields.</p>\n\t<p class =\"blueCap\">The steward did not seem convinced of this idea, but after the abbess emphatically asked him again to allow her a glimpse of the people, he promised to make it possible. He bade good night early to prepare the excursion while there was still some daylight left.</p>\n\t(replace: ?c2)[]\n\t(show:?VC1)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">When next we stop, show me some of the works of artifice that have been erected to further what was gained from the land.</p>\n\t<p class =\"blueCap\">The steward said he would gladly show her something of that nature the next day, which he was sure the abbess would find to her liking. With this, he bade good night.</p>\n\t(replace: ?c1)[]\n\t(show:?VC2)\n}]\n(click: ?next)[((if: $idaOwes is true)[(goto: \"AugustIda\")](else:)[(goto: \"AugustOtilia\")]]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "JulChoice1",
            "pid": 30
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "JulChoice2",
            "pid": 31
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "AugustIda",
            "pid": 32
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "AugustOtilia",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 30,
      "name": "JulChoice1",
      "text": "{\n<p class =\"redCap\">When they set out in the forenoon of the following day, the sun was already burning down mercilessly. Before long, they reached a small copse of trees from which they could observe the harvest in a nearby field.</p>\n<p class =\"blueCap\">The peasants moved in a single line, stooped over, taking long, regular strides and with a precise and regular action they laid down row after row. It was as though the sharp sickles of themselves worked through the rye. Behind them came the women and children, who picked up the fallen stems and collected them in panniers.</p>\n<p class =\"redCap\">As the young abbess watched the line slowly progress through the field in the scorching sun, she noticed a sensation, not unlike when she was reading, in herself: the supreme calmness of the sight had engulfed her.</p>\n|c3>[<p class =\"greenCap\">When it was time for the Vespers, Otilia could not believe how many hours had passed already.</p>]\n|c4>[<p class =\"greenCap\">Yet she wondered; was it only herself, sitting idly, sheltered from the heat, who felt this way?</p>]\n(click-replace: ?c3)[{\n\t<div>\n\t\t<p class=\"vmarginalia\">|M3>[I love to watch people at work, too. I could spend hours at it.]\n\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[I love to watch people at work, too. I could spend hours at it.]]\n\t\t</p>\n\t\t<p class =\"greenCap\">When it was time for the Vespers, Otilia could not believe how many hours had passed already. To the surprise of the steward, she decided to stay and observe the work in the fields until Compline.</p>\n\t</div>\n\t<p class =\"blueCap\">The persistent cough that Otilia had developed by now could not be ameliorated in any way. The infirmaria had tried her best, but it had been to no avail.</p>\n\t(set: envy of $viceDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $fun to $fun +1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<div>\n\t\t<p class=\"vmarginalia\">|M4>[No wonder they'd look famished, at that time of the year they would have been without much food for some weeks.]</span>\n\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[No wonder they'd look famished, at that time of the year they would have been without much food for some weeks.]]\n\t\t</p>\n\t<p class =\"greenCap\">Yet she wondered; was it only herself, sitting idly, sheltered from the heat, who felt this way? The servi seemed famished to her eye, perhaps their food stocks had run out early this year. Perhaps something could be done to feed them better, so went her thoughts.</p>\n\t</div>\n\t<p class =\"blueCap\">The persistent cough that Otilia had developed by now could not be ameliorated in any way. The infirmaria had tried her best, but it had been to no avail.</p>\n\t(set: people of $popularityDm to it +1)\n\t(set: justice of $virtueDm to it +1)\n\t(replace: ?c3)[]\n\t(set: $seenFamine to true)\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 31,
      "name": "JulChoice2",
      "text": "{\n<p class =\"redCap\">The sun stood high in the sky already when they left their quarter on the next day. The steward had said they would visit a mill and a mill it was they soon arrived at.</p>\n<p class =\"blueCap\">A weir had been build accross the floor of a narrow valley and below it a sizeable waterwheel kept turning in the flow of the water that now could only come down a wooden aqueduct, erected for just this purpose.</p>\n|c3>[<p class =\"greenCap\">I would love to see more of this technical marvel, please show me how it is operated, asked Otilia.</p>]\n|c4>[<p class =\"greenCap\">That dam looks like it took a mighty toil to build. I wonder if it was worth it? asked the abbess.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">I would love to see more of this technical marvel, please show me how it is operated, asked Otilia and the steward told the miller to explain the inner workings of the mill to her.</p>\n\t<p class =\"redCap\">They went inside and the man showed her all the pit-, crown- and lantern-wheels, large and small, and talked about the way they moved the millstones. The lower walls of the mill were build of masonry. This, as he explained, was to prolong the time the millhouse would withstand the force of the water that came down incessantly onto the wheel. The abbess also found out how the flow of the water was regulated and that the dam had to be inspected often lest it break unexpectedly.</p>\n\t<p class =\"blueCap\">The persistent cough that Otilia had developed by now could not be ameliorated in any way. The infirmaria had tried her best, but it had been to no avail.</p>\n\t(set: people of $popularityDm to it +1)\n\t(set: prudence of $virtueDm to it +1)\n\t(replace: ?c4)[]\n\t(set: $millUnderstood to true)\n\t(set: $technicalSkill to $technicalSkill +1)\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">That dam looks like it took a mighty toil to build. I wonder if it was worth it? asked the abbess. The steward explained how long it had taken and how many workers were needed to complete the recently finished works. </p>\n\t<p class =\"redCap\">Yes, but do the benefits outweight the costs? insisted Otilia. Perhaps yes, perhaps no, the steward answered, it will take many years until the chapter profits from this mill. But using the water's power frees many animals for other purposes. Otilia had the impression that seeing the finished mill itself had been reason enough for the steward to have it built.</p>\n\t<p class =\"blueCap\">The persistent cough that Otilia had developed by now could not be ameliorated in any way. The infirmaria had tried her best, but it had been to no avail.</p>\n\t(set: family of $popularityDm to it +1)\n\t(set: envy of $viceDm to it +1)\n\t(replace: ?c3)[]\n\t(set: $millSeen to true)\n\t(set: $economics to $economics +1)\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 32,
      "name": "AugustIda",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/augustIda.svg\" alt=\"Initial W\">\n\t\t<h3>hat ad&shyvi&shyce the ab&shybess ga&shyve</h3>\n\t\t<div>\n\t\t\t<p class=\"rmarginalia\">\n|M1>[Why would anyone wear her habit for this? Isn't that even more sinful?]<br>\n\t\t\t\t<span class=\"CommentatorB\">|M2>[Yes, but any one habit looks like any other...]</span>\n\t\t\t\t(click-replace: ?M1)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Why would anyone wear her habit for this? Isn't that even more sinful?]]\n\t\t\t\t(click-replace: ?M2)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Yes, but any one habit looks like any other...]]\n\t\t\t</p>\n\t\t\t<p class =\"redCap\">On the evening of the solemnity of the Assumption of Mary, after Compline, the abbess, unable to fall asleep, decided to take a walk. All alone she wandered along the immunity wall. As she came around the corner of one of the buildings of the infirmary, about to enter the garden, she suddenly spotted someone in a nun's habit. Why would anyone be up at this hour, wondered Otilia and decided to stay hidden and observe.</p>\n\t\t</div>\n\t\t<p class =\"blueCap\">It looked as though the nun was receiving something from the other side of the small gate that connected the herb garden with the pear orchard beyond the wall. By now the abbess had become very curious and when the hooded figure left the garden, she stepped out of her hiding place behind the corner to confront her.</p>\n\t\t<p class =\"redCap\">Who is this, up and about in breach of the curfew? She demanded, but was as surprised as the perpetrator herself when she found out it was her own second cousin, Ida, holding what looked like a letter in her hands. What is the meaning of this clandestine exchange? Hand it over! Ordered Otilia. Blushing bright red, the girl held onto the letter. Now, don't thee be stingy, said Otilia, winding it from her grasp.</p>\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t<p class =\"blueCap\">It turned out to be a letter of affection by noone else but the squire who had played the lute not long ago, when his master visited the abbey.<p>\n\t\t|c1>[<p class =\"greenCap\">The abbess scoldet her: Dear Ida, there is no way this can ever end well, thou wouldst be wise to give it up.</p>]\n\t\t|c2>[<p class =\"greenCap\">Otilia complained: Thou couldst have asked me for help in this matter any time, Ida. I am sure a solution can be found.</p>]\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">The abbess scoldet her: Dear Ida, there is no way this can ever end well, thou wouldst be wise to give it up. Thou art a nun, not a lady of the world. How canst thee be so forgetful of thy vows? I can only hope thou hast already confessed this, thou knowest it will require serious penance.</p>\n\t<p class =\"redCap\">Ida answered: I am but a simple nun, it's true. Unlike thee, I do not live the splendid live of an abbess. But also unlike thee, I've not made my perpetual vows. My cloistered life could end any day and I could yet become a bride!</p>\n\t<p class =\"blueCap\">When she heard such talk, Otilia felt pity with her friend and spoke thus: See clearly the truth, Ida. If he indeed wanted to marry thee, he would not be passing thee romantic letters, he would be asking thy father for thy hand. He is still a squire, and will want to remain so as long as he has not inherited. This, Ida, is nothing more than a game to him, and thou art a peon in it.</p>\n\t<p class =\"redCap\">Upon hearing this, her cousin burst into tears. Otilia consoled her: Don't worry, write thee to him that it's over, and no one need to hear a word about it. Should he run his mouth, I'll make sure he regrets it.</p>\n\t(set: family of $popularityDm to it -1)\n\t(set: faith of $virtueDm to it +1)\n\t(replace: ?c2)[]\n\t(set: $cenobitism to $cenobitism +1)\n\t(show:?next)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">Otilia complained: Thou couldst have asked me for help in this matter any time, Ida. I am sure a solution can be found.</p>\n\t<p class =\"redCap\">How, Otilia? I am a bride of our Lord Jesus Christ and cannot marry. Would it be proper for thee to let me continue exchanging letters of this kind? Love between him and me would only ever dwell in the shadows. I could never tell thee and I would thou hadst not found out about it! Ida cried out.</p>\n\t<p class =\"blueCap\">I think thou seest things a bit too earnestly in this matter, the abbess said joyfully. While it is commendable that thou think'st of thyself as wed to the Lord, remember that thou hast not yet made thy perpetual vows. If he was to ask thy father for thy hand, why of course thou couldst still marry him! Rest assured, Ida, I will let thee go if that's what is thy heart's sincere desire.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">\n\t\t\t|M3>[Had her oath expired by then?]<br>\n\t\t\t<span class=\"CommentatorB\">|M4>[Otilia probably waived it.]</span>\n\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Had her oath expired by then?]]\n\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Otilia probably waived it.]]\n\t\t</p>\n\t\t<p class =\"redCap\">Happy to hear such encouragement, Ida set to arranging her marriage with the young man. As he was from a well-established family, the date for their wedding was agreed on quickly between their fathers and so it came that Ida had left the abbey by the end of the month. </p>\n\t</div>\n\t(set: family of $popularityDm to it +1)\n\t(set: people of $popularityDm to it -1)\n\t(set: temperance of $virtueDm to it +1)\n\t(replace: ?c1)[]\n\t(set: $idaGone to true)\n\t(set: $musicianOwes to true)\n\t(show:?next)\n}]\n(click: ?next)[(goto: \"September\")]\n}",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "September",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "AugustOtilia",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/augustOtilia.svg\" alt=\"Initial A\">\n\t\t<h3>bout the letter to Otilia</h3>\n\t\t<p class =\"redCap\">On the evening of the solemnity of the Assumption of Mary, after Compline, the abbess bade good night to the chapter and one after the other, the nuns climbed up the stairs to the dormitorium. After the last one had passed her and Otilia was about to go to her own quarters. A straggler stepped into the cloister.</p>\n\t\t<p class =\"blueCap\">It was Ysabella, the cellera. She will have been to the latrines. Thought Otilia and decided to wait for her. How surprised was she when Ysabella, without a word, grabbed her arm and pulled her into the chapter hall.</p>\n\t\t<p class =\"redCap\">The sun had already begun to set and the thick, stained windows of the hall let in but little light. In the darkness, Otilia could not make out what it was that the cellera laid into her hands. It's from my cousin, she whispered, and quickly escaped out of the hall and up the stairs.</p>\n\t\t<p class =\"blueCap\">The abbess was not quite sure whether she had rightly heard suppressed laughter from upstairs when she passed the stairs to the dormitorium. Quickly she left for her quarters to take a look at the gift she had just received and upon arrving there, with much anticipation, she lit the candles on her desk to confirm what by now she had come to suspect it was by the parcel's touch.</p>\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t<p class =\"redCap\">And of course she had been right. It was a letter. What made her hesitate to open it was not only the conspicuous way in which it had been delivered, but also the absence of the sender's seal. More worryingly, she could not, for all the world, think of anyone who would address a letter to herself as simply to Otilia.<p>\n\t\t|c1>[<p class =\"greenCap\">Nothing good can come from opening this letter, it surely serves some illicit purpose. I won't put up with this.</p>]\n\t\t|c2>[<p class =\"greenCap\">The letter had raised her curiosity. It cannot hurt to take a look at it, decided Otilia.</p>]\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">Nothing good can come from opening this letter, it surely serves some illicit purpose. I won't put up with this. If anyone righteously wishes to approach me with something, they should do so openly. So thought the abbess, and thus she proceeded to burn the letter without having opened it.</p>\n\t<p class =\"blueCap\">Some weeks went by until the cellera was unable to contain her curiosity and when another opportunity arose, she asked the abbess what she thought of the letter. Otilia told her what she had done to it and added that whomever it had been amongst Ysabella's many cousins that had send it, they should feel ashamed of themselves.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">|M3>[Ah, such a shame, I would have read it.]<br>\n\t\t\t<span class=\"CommentatorB\">|M4>[She did the right thing fighting the temptation!]</span>\n\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Ah, such a shame, I would have read it.]]\n\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[She did the right thing fighting the temptation!]]\n\t\t</p>\n\t\t<p class =\"redCap\">Upon hearing this, the older girl pulled out another parcel and implored Otilia to at least take a look at its contents this time before she dismissed the sender's intentions.</p>\n\t</div>\n\t<p class =\"blueCap\">But Otilia would have none of it. Steadfastly she rejected the letter and even went on to scold the cellera for allowing herself to be employed as the messenger.</p>\n\t(set: family of $popularityDm to it -1)\n\t(set: faith of $virtueDm to it +1)\n\t(replace: ?c2)[]\n\t(set: $asceticism to $asceticism +1)\n\t(set: $IdaStays to true)\n\t(show:?next)\n}]\n(click-replace: ?c2)[{ \n\t<p class =\"greenCap\">The letter had raised her curiosity. It cannot hurt to take a look at it, decided Otilia and so she proceeded to open it. Inside, the sender started by addressing her as the lady of his heart in the salutatio and went on to describe her beauty and musical talent for the purpose of captatio benevolentiae.</p>\n\t<p class =\"blueCap\">Unsurprisingly, the petitio turned out to be a sign of her appreciation in return. The letter's peroratio consisted of actum, datum and the sender's given name: Theobald.</p>\n\t<div>\n\t\t<p class=\"vmarginalia\">|M5>[Writing these kinds of letters is so much fun. But was she not afraid of getting caught?]<br>\n\t\t<span class=\"CommentatorB\">|M6>[Who would punish her for it? She was the abbess.]</span>\n\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Writing these kinds of letters is so much fun. But was she not afraid of getting caught?]]\n\t\t(click-replace: ?M6)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Who would punish her for it? She was the abbess.]]\n\t\t</p>\n\t\t<p class =\"redCap\">Oh, I think I know him, Otilia thought. He must be the lutenist who's song I accompanied not long ago. I wonder if Ysabella helped him with the letter. It is, after all, of perfect form. Intrigued by the playful folly of it she decided to join into the game and began to compose her answer right away.</p>\n\t</div>\n\t<p class =\"blueCap\">The next day, she managed to pass her return message to the cellera unnoticed, though she didn't entertain much hope it would remain unknown for long.</p>\n\t(set: family of $popularityDm to it +1)\n\t(set: lust of $viceDm to it +1)\n\t(replace: ?c1)[]\n\t(set: $musicianOwes to true)\n\t(show:?next)\n}]\n(click: ?next)[(goto: \"September\")]\n}",
      "links": [
        {
          "text": "<goto>",
          "destination": {
            "name": "September",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "September",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/september.svg\" alt=\"Initial L\">\n\t\t<h3>and is be&shyque&shyath&shyed to the abbey</h3>\n\t\t<p class =\"redCap\">On the day of the Exaltation of the Cross the college came into possession of an endowment of land. It had been the allodium of a widow, who had been mentioned in the chapter's prayer often since her health had begun to fail some four months ago. She had wanted to show her gratitude, and the prioress had advised her to bestow the nunnery in her last will.</p>\n\t\t<div>\n\t\t\t<p class=\"rmarginalia\">\n\t\t\t\t<span class=\"CommentatorB\">|M1>[This was long before Indigo.]</span>\n\t\t\t\t(click-replace: ?M1)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[This was long before Indigo.]]\n\t\t\t</p>\n\t\t\t<p class =\"blueCap\">A decision was to be taken as to the way the land was to be used henceforth. The steward proposed to buy woad seeds and plant them on the land, for woad was much sought after in Flanders at the time and would thus surely provide good income.</p>\n\t\t</div>\n\t\t|c1>[<p class =\"greenCap\">It sounded like a good idea to Otilia, too, and she gave her consent to grow woad on the land.</p>]\n\t\t|c2>[<p class =\"greenCap\">Why not grow rye, instead? suggested the abbess and continued: Woad may dye cloth, but it won't feed the people.</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|VC1)[(display:\"SepChoice1\")]\n\t\t|VC2)[(display:\"SepChoice2\")]\t\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">It sounded like a good idea to Otilia, too, and she gave her consent to grow woad on the land. The steward knew of a merchant, who would be able to provide the seeds needed. While the price seemed extraordinarily high to Otilia, she knew of no other source of woad seeds and so she decided that the seeds be bought there.</p>\n\t<p class =\"redCap\">The prioress was especially happy about this, since  her relatives had had a payment outstanding to this very merchant. He had agreed in advance that the debt would be forgiven as a sign of gratitude should the chapter purchase the seeds.</p>\n\t(set: greed of $viceDm to it +1)\n\t(set: $economics to $economics +1)\n\t(set: $agnesOwes to true)\n\t(replace: ?c2)[]\n\t(show:?VC1)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">Why not grow rye, instead? Suggested the abbess and continued: Woad may dye cloth, but it won't feed the people. I believe the people are fed well, answered the steward. We grow enough rye, and can afford to invest in something else.</p>\n\t(if: $seenFamine is true)[{\n\t\t<p class =\"redCap\">I agree that it would be good to have another source of income, but isn't charity for the poor our duty first and foremost? I have seen the famished pueri on our estates, as hast thou, she continued. We cannot afford to invest in woad until we grow enough food for the people. The steward followed the abbess' wish.</p>\n\t\t(set: $caritas to $caritas +1)\n\t\t(show:?VC2)\n\t}]\n\t(else:)[{\n\t\t<p class =\"redCap\">He knew of a merchant, who would be able to provide the seeds. While the price seemed high to Otilia, she knew of no other source and agreed on the seeds being acquired from there. The prioress agreed as well. Her relatives had an outstanding dept to this very merchant. He had promised to forgive it if the chapter bought his seeds.</p>\n\t\t(show:?VC1)\n\t}]\n\t(replace: ?c1)[]\n}]\n(click: ?next)[(goto: \"October\")]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "SepChoice1",
            "pid": 35
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "SepChoice2",
            "pid": 36
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "October",
            "pid": 37
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "SepChoice1",
      "text": "{\n<p class =\"blueCap\">The Isatis was sowed hurriedly on the endowed land. With this done, it was high time to set in place all that would be needed to process the woad before it could be sent to the far away markets. It was assumed that drying the pods would not present great difficulties. Crushing them into powder, however, would require a mill. The steward proposed to erect a capstan, driven by a pair of donkeys. He was sure this could be done quickly by the carpenters that were in the area and would work reliably.</p>\n|c3>[<p class =\"greenCap\">Ask those carpenters to build us a capstan then, Otilia decided.</p>]\n|c4>[<p class =\"greenCap\">Should we not better make use of the flow of the stream and build a watermill? suggested the abbess.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Ask those carpenters to build us a capstan then, Otilia decided. And so the steward did and as he had predicted, the work was done quickly. When the finished capstan was shown to them, the prioress remarked to the abbess that it would be better to house the mill under a roof, as it would withstand the rain this way and could be used for much longer. Otilia gave her consent to build a roof.</p>\n\t<div>\n\t\t\t<p class=\"vmarginalia\">|M3>[That is a legitimate benefit of his position.]<br>\n\t\t\t\t<span class=\"CommentatorB\">|M4>[But it is getting out of hand nowadays.]</span>\n\t\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[That is a legitimate benefit of his position.]]\n\t\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[But it is getting out of hand nowadays.]]\n\t\t\t</p>\n\t\t<p class =\"redCap\">The steward, however, collected his share of the payments from the carpenters, whom he had helped so much to get this job when they were in dire need for work. He proceeded to order barrels from several coopers, to fill in the dye, and struck a contract with the wagoners' guild in the nearby free city to bring them to Flanders and Silesia. These decisions were well within his usual duties, and so were the commissions he received.</p>\n\t</div>\n\t(set: people of $popularityDm to it -1)\n\t(replace: ?c4)[]\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"redCap\">Should we not better make use of the flow of the stream and build a watermill? suggested the abbess. And where would we find someone to build it for us now? asked Agnes.</p>\n\t(if: $millUnderstood is true)[{\n\t\t<p class =\"blueCap\">I visited a watermill in July and I think I understood its workings well enough to draw a plan of one myself, answered Otilia. Those carpenters should be able to build it. Measuring his words carefully, the steward said: To get a waterwheel to turn, we'd also need to build a weir to pond the stream. I doubt we'll get that done by harvest time.</p>\n\t\t(if: $vitruvius is true)[{\n\t\t\t<p class =\"redCap\">According to Vitru&shyvius, that's not always necessary, answered Otilia. I think the flow of the stream alone will drive a wheel big enough for our needs. Her words swayed the opinion of the others and soon after, the work on the watermill began.</p>\n\t\t(set: $technicalSkill to $technicalSkill +1)\n\t\t}]\n\t\t(else:)[{\n\t\t\t<p class =\"redCap\">The nuns of the chapter felt that the water mill had been a good idea, since this would save the donkeys for some other task. Alas, no one knew how to make it possible in time and so it was agreed that the capstan be build.</p>\n\t\t}]\n\t}]\n\t(elseif: $vitruvius is true)[{\n\t\t<p class =\"blueCap\">I could draw a plan of one, answered Otilia. I've read Vitruvius and I think having that, it won't be difficult to build a working watermill for those carpenters. Measuring his words carefully, the steward said: i mean not to question your authority on matters of architecture, but to get a waterwheel to turn, we'd also need to build a weir to pond the stream. I doubt we'll get that done by harvest time.</p>\n\t\t(if: $millSeen is true)[{\n\t\t\t<p class =\"redCap\">That's necessary sometimes, answered Otilia. In this case, however, the flow of the stream alone will drive a small undershot wheel, enough for our needs. Her words swayed the opinion of the others and soon after, the work on the watermill began.</p>\n\t\t(set: $technicalSkill to $technicalSkill +1)\n\t\t}]\n\t\t(elseif: $idaGone is false)[{\n\t\t\t<p class =\"redCap\">I think the stream alone will drive a small undershot wheel, Ida entered the conversation. I've also read Vitruvius and believe this would suffice for our needs. Her words swayed the opinion of the others and soon after, the work on the watermill began.</p>\n\t\t(set: $technicalSkill to $technicalSkill +1)\n\t\t}]\n\t\t(else:)[{\n\t\t\t<p class =\"redCap\">The nuns of the chapter felt that the water mill had been a good idea, since this would save the donkeys for some other task. Alas, no one knew how to make it possible in time and so it was agreed that the capstan be build.</p>\n\t\t}]\n\t}]\n\t(else:)[{\n\t\t<p class =\"blueCap\">What could the young abbess possibly answer to that? She knew nothing of mills and weirs, nothing of mechanics and architecture. She reminded the chapter of the great works of artifice their order was known for, and asked them not to forego this opportunity to show off their heritage. Alas, the nuns felt that was not reason enough to jeopardise their profits and so they decided the capstan was to be build.</p>\n\t\t<div>\n\t\t\t<p class=\"vmarginalia\">|M5>[That is a legitimate benefit of his position.]<br>\n\t\t\t\t<span class=\"CommentatorB\">|M6>[But it is getting out of hand nowadays.]</span>\n\t\t\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[That is a legitimate benefit of his position.]]\n\t\t\t\t(click-replace: ?M6)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[But it is getting out of hand nowadays.]]\n\t\t\t</p>\n\t\t<p class =\"redCap\">The steward, however, collected his share of the payments from the carpenters, whom he had helped so much to get this job when they were in dire need for work.</p>\n\t\t</div>\n\t\t(set: $cenobitism to $cenobitism +1)\n\t}]\n\t(set: family of $popularityDm to it -1)\n\t(set: people of $popularityDm to it -1)\n\t(set: nuns of $popularityDm to it +1)\n\t(replace: ?c3)[]\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 36,
      "name": "SepChoice2",
      "text": "{\n<p class =\"blueCap\">The secale cereale was hurriedly sowed on the endowed land. With this done, it was high time to set in place all that would be needed to process the rye when it was harvested in spring. It was assumed that the threshing would not present great difficulties. Milling the corn into flour, however, would require a mill. The steward proposed to erect a capstan, driven by a pair of donkeys. He was sure this could be done quickly by the carpenters that were in the area and would work reliably.</p>\n|c3>[<p class =\"greenCap\">Ask those carpenters to build us a capstan then, Otilia decided.</p>]\n|c4>[<p class =\"greenCap\">Should we not better make use of the flow of the stream and build a watermill? suggested the abbess.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Ask those carpenters to build us a capstan then, Otilia decided. And so the steward did and as he had predicted, the work was done quickly. When the finished capstan was shown to them, the prioress remarked to the abbess that it would be better to house the mill under a roof, as it would withstand the rain this way and could be used for much longer. Otilia gave her consent to build a roof.</p>\n\t<div>\n\t\t\t<p class=\"vmarginalia\">|M3>[That is a legitimate benefit of his position.]<br>\n\t\t\t\t<span class=\"CommentatorB\">|M4>[But it is getting out of hand nowadays.]</span>\n\t\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[That is a legitimate benefit of his position.]]\n\t\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[But it is getting out of hand nowadays.]]\n\t\t\t</p>\n\t\t\t<p class =\"redCap\">The steward, however, collected the payment the carpenters had promised him if he was able to commission them this job. They had been in dire need for work and were willing to part with a large part of their profits. He proceeded to order barrels from several coopers, to fill in the dye, and struck a contract with the wagoners' guild in the nearby free city to bring them to Flanders and Silesia. These decisions were well within his usual duties, and so were the commissions he received.</p>\n\t</div>\n\t(set: family of $popularityDm to it +1)\n\t(set: people of $popularityDm to it +1)\n\t(set: nuns of $popularityDm to it -1)\n\t(replace: ?c4)[]\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">Should we not better make use of the flow of the stream and build a watermill? suggested the abbess. And where would we find someone to build it for us now? asked Agnes.</p>\n\t(if: $millUnderstood is true)[{\n\t\t<p class =\"blueCap\">I visited a watermill in July and I think I understood its workings well enough to draw a plan of one myself, answered Otilia. Those carpenters should be able to build it. Measuring his words carefully, the steward said: To get a waterwheel to turn, we'd also need to build a weir to pond the stream. I doubt we'll get that done by harvest time.</p>\n\t\t(if: $vitruvius is true)[{\n\t\t\t<p class =\"redCap\">According to Vitru&shyvius, that's not always necessary, answered Otilia. I think the flow of the stream alone will drive a wheel big enough for our needs. Her words swayed the opinion of the others and soon after, the work on the watermill began.</p>\n\t\t\t(set: $technicalSkill to $technicalSkill +1)\n\t\t}]\n\t\t(else:)[{\n\t\t\t<p class =\"redCap\">The nuns of the chapter felt that the water mill had been a good idea, since this would save the donkeys for some other task. Alas, no one knew how to make it possible in time and so it was agreed that the capstan be build.</p>\n\t\t}]\n\t}]\n\t(elseif: $vitruvius is true)[{\n\t\t<p class =\"blueCap\">I could draw a plan of one, answered Otilia. I've read Vitruvius and I think having that, it won't be difficult for those carpenters to build a working watermill. Measuring his words carefully, the steward said: i mean not to question your authority on matters of architecture, but to get a waterwheel to turn, we'd also need to build a weir to pond the stream. I doubt we'll get that done by harvest time.</p>\n\t\t(if: $millSeen is true)[{\n\t\t\t<p class =\"redCap\">That's necessary sometimes, answered Otilia. In this case, however, the flow of the stream alone will drive a small undershot wheel, enough for our needs. Her words swayed the opinion of the others and soon after, the work on the watermill began.</p>\n\t\t\t(set: $technicalSkill to $technicalSkill +1)\n\t\t}]\n\t\t(elseif: $idaGone is false)[{\n\t\t\t<p class =\"redCap\">I think the stream alone will drive a small undershot wheel, Ida entered the conversation. I've also read Vitruvius and believe this would suffice for our needs. Her words swayed the opinion of the others and soon after, the work on the watermill began.</p>\n\t\t\t(set: $technicalSkill to $technicalSkill +1)\n\t\t}]\n\t\t(else:)[{\n\t\t\t<p class =\"redCap\">The nuns of the chapter felt that the water mill had been a good idea, since this would save the donkeys for some other task. Alas, no one knew how to make it possible in time and so it was agreed that the capstan be build.</p>\n\t\t}]\n\t}]\n\t(else:)[{\n\t\t<p class =\"blueCap\">What could the young abbess possibly answer to that? She knew nothing of mills and weirs, nothing of mechanics and architecture. She reminded the chapter of the great works of artifice their order was known for, and asked them not to forego this opportunity to show off their heritage. Alas, the nuns felt that was not reason enough to jeopardise their profits and so they decided the capstan was to be build.</p>\n\t\t<div>\n\t\t\t<p class=\"vmarginalia\">|M5>[That is a legitimate benefit of his position.]<br>\n\t\t\t\t<span class=\"CommentatorB\">|M6>[But it is getting out of hand nowadays.]</span>\n\t\t\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[That is a legitimate benefit of his position.]]\n\t\t\t\t(click-replace: ?M6)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[But it is getting out of hand nowadays.]]\n\t\t\t</p>\n\t\t\t<p class =\"redCap\">The steward, however, collected his share of the payments from the carpenters, whom he had helped so much to get this job when they were in dire need for work.</p>\n\t\t</div>\n\t\t(set: $cenobitism to $cenobitism +1)\n\t}]\n\t(set: people of $popularityDm to it +1)\n\t(set: courage of $virtueDm to it +1)\n\t(replace: ?c3)[]\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 37,
      "name": "October",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/T.svg\" alt=\"Initial T\">\n\t\t<h3>he dream the abbess saw</h3>\n\t\t<div>\n\t\t\t<p class=\"rmarginalia\">|M1>[Consumption, the white plague. It takes us in our prime, and there is nothing to be done about it.]<br>\n\t\t\t\t<span class=\"CommentatorB\">|M2>[And it hasn't changed, since.]</span>\n\t\t\t(click-replace: ?M1)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[Consumption, the white plague. It takes us in our prime, and there is nothing to be done about it.]]\n\t\t\t(click-replace: ?M2)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[And it hasn't changed, since.]]\n\t\t\t</p>\n\t\t\t<p class =\"redCap\">In the weeks after the Festum Archangeli Michaelis, it became impossible for the abbess to hide the fact that the sputum ejected by her worsening cough was now bloody. As the autumn storms raged outside the abbey, she began to feel colder within its walls.</p>\n\t\t</div>\n\t\t<p class = \"blueCap\">Otilia spend her days in the scriptorium, where she could be sure she wouldn't be alone. Weakened as she was, she fell asleep in her chair beside the fireplace on some evenings. On such occasions, the others did not wish to wake her up and let her sleep where she was. One such night, Otilia dreamt a strange dream.</p>\n\t\t<p class =\"redCap\">It was as though she had awaken and was sitting alone in the scriptorium. She took a while to accustom herself to her surroundings before she noticed the large, beautiful youth coming in from the cloister, holding a scale in his hands.</p>\n\t\t<p class =\"blueCap\">Startled, the abbess asked this: Are ye Michael? Have you come to carry me away? It seems too soon. There is still so much left I had wanted to do in this world. Upon this the angel spoke: What wouldst thou need, still?</p>\n\t\t|c1>[<p class =\"greenCap\">There is one thing in particular I haven't done, yet.</p>]\n\t\t|c2>[<p class =\"greenCap\">I live for but one purpose, and I cannot stop now!</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|VC1)[(display:\"OctChoice1\")]\n\t\t|VC2)[(display:\"OctChoice2\")]\t\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">There is one thing in particular I haven't done, yet, answered Otilia after some deliberation.</p>\n\t(set: $book to 0)\n\t(replace: ?c2)[]\n\t(show:?VC1)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">I live for but one purpose, and I cannot stop now! she burst out without hesitation.</p>\n\t(replace: ?c1)[]\n\t(show:?VC2)\n}]\n(click: ?next)[(goto: \"November\")]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "OctChoice1",
            "pid": 38
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "OctChoice2",
            "pid": 39
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "November",
            "pid": 40
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "OctChoice1",
      "text": "{\n<p class =\"redCap\">It is not unheard of an extension be granted for such a purpose. The decision belongs not to me, said Michael, but if thee wert to tell me a little more about thy plans, I would be able to put that onto the scale and also put in a word for thee with him to whom it belongs.</p>\n<p class =\"blueCap\">I have spend my life heretofore in prayer and in the study of books in this very room, yet I fear that should I depart now, I would be remembered |L1>[(text-colour: #e34234)[<span lang=\"lat\">bene nati mediocriter edocti</span>]], said Otilia and went on: There is something I have been thinking about and I would like to leave my thoughts to others by writing them down.</p>\n(click-replace: ?L1)[well born and moderately educated]\n<p class =\"redCap\">Consider that a worthy treatise it would have to be,  said the archangel. What subject thinkest thee about?</p>\n|c4>[<p class =\"greenCap\">I had a treatise on economics in mind.</p>]\n|c5>[<p class =\"greenCap\">It would be a work on mechanics.</p>]\n|c6>[<p class =\"greenCap\">The subject would be caritas.</p>]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">I had a treatise on economics in mind, answered Otilia. It is a subject that I have harboured a favour for for some time now. Would that not be a worthy cause?</p>\n\t(if: $economics < 2)[{\n\t\t<p class =\"blueCap\">Interesting choice, answered the angel. I suppose culture depends on men again and again attempting to do what is difficult. And without saying any more, he turned around and left.</p>\t\n\t}]\n\t(else:)[{\n\t\t<p class =\"blueCap\">Poenoic and mnemotic, a good choice, said the angel. I think thou wilt find that easy and thy successors will find it worthy of consideration. With that, her turned around and left.</p>\n\t}]\n\t<div>\n\t\t\t<p class=\"vmarginalia\">|M3>[It must have been a vision.]<br>\n\t\t\t<span class=\"CommentatorB\">|M4>[It was only a dream.]</span>\n\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It must have been a vision.]]\n\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It was only a dream.]]\n\t\t</p>\n\t\t<p class =\"redCap\">When Otilia woke up, it was still dark outside. Ysabella, who had stayed with her in the scriptorium, was still sleeping. Quietly, so as not to wake her up, Otilia began to write.</p>\n\t</div>\n\t(set: $book to 1)\n\t(set: prudence of $virtueDm to it +1)\n\t(replace: ?c5)[]\n\t(replace: ?c6)[]\n\t(show:?next)\n}]\n(click-replace: ?c5)[{\n\t<p class =\"greenCap\">It would be a work on mechanics, answered Otilia. It is a subject that I have harboured a favour for for some time now. Would that not be a worthy cause?</p>\n\t(if: $technicalSkill < 2)[{\n\t\t<p class =\"blueCap\">Interesting choice, answered the angel. I suppose culture depends on men again and again attempting to do what is difficult. And without saying any more, he turned around and left.</p>\t\n\t}]\n\t(else:)[{\n\t\t<p class =\"blueCap\">My dear girl, that is a wise choice, said the angel. I think thou wilt find that easy and thy successors will find it worthy of consideration. With that, her turned around and left.</p>\n\t}]\n\t<div>\n\t\t<p class=\"vmarginalia\">|M5>[It must have been a vision.]<br>\n\t\t\t<span class=\"CommentatorB\">|M6>[It was only a dream.]</span>\n\t\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It must have been a vision.]]\n\t\t\t(click-replace: ?M6)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It was only a dream.]]\n\t\t</p>\n\t\t<p class =\"redCap\">When Otilia woke up, it was still dark outside. Ysabella, who had stayed with her in the scriptorium, was still sleeping. Quietly, so as not to wake her up, Otilia began to write.</p>\n\t</div>\n\t(set: $book to 2)\n\t(replace: ?c4)[]\n\t(replace: ?c6)[]\n\t(show:?next)\n}]\n(click-replace: ?c6)[{\n\t<p class =\"greenCap\">The subject would be caritas, answered Otilia. It is a subject that I have harboured a favour for for some time now. Would that not be a worthy cause?</p>\n\t(if: $caritas < 2)[{\n\t\t<p class =\"blueCap\">Interesting choice, answered the angel. I suppose culture depends on men again and again attempting to do what is difficult. And without saying any more, he turned around and left.</p>\t\n\t}]\n\t(else:)[{\n\t\t<p class =\"blueCap\">My dear girl, that is a wise choice, said the angel. I think thou wilt find that easy and thy successors will find it worthy of consideration. With that, her turned around and left.</p>\n\t}]\n\t<div>\n\t\t<p class=\"vmarginalia\">|M7>[It must have been a vision.]<br>\n\t\t\t<span class=\"CommentatorB\">|M8>[It was only a dream.]</span>\n\t\t\t(click-replace: ?M7)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It must have been a vision.]]\n\t\t\t(click-replace: ?M8)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It was only a dream.]]\n\t\t</p>\n\t\t<p class =\"redCap\">When Otilia woke up, it was still dark outside. Ysabella, who had stayed with her in the scriptorium, was still sleeping. Quietly, so as not to wake her up, Otilia began to write.</p>\n\t</div>\n\t(set: $book to 3)\n\t(set: hope of $virtueDm to it +1)\n\t(replace: ?c4)[]\n\t(replace: ?c5)[]\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 39,
      "name": "OctChoice2",
      "text": "{\n<p class =\"redCap\">Perfection lies in intensity, and what is most intense cannot be endured long, said the angel. But if thou must, then perhaps thou wouldst be allowed to seek perfection yet. Before thou start'st rejoicing though, tell me, what wouldst thou do with more life?</p>\n<p class = \"blueCap\">The abbess answered: You are right. The life I live is a life I could not endure until old age. My days are of happyness and suffering alike, they make life worthwhile and death welcome. There is no other life I should prefer but this:</p>\n|c3>[<p class =\"greenCap\">Seek closeness to the Lord in solitude, away from worldly matters.</p>]\n|c4>[<p class =\"greenCap\">Find comfort amongst my sisters in the cloister, as would become a nun.</p>]\n|c5>[<p class =\"greenCap\">Spend the last days of my youth in enjoyment rather than gloom.</p>]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Seek closeness to the Lord in solitude, away from worldly matters. Long since I've felt the thorn that life in other's company will thrust into our side, no matter where we are.</p>\n\t(if: $asceticism < 2)[{\n\t\t<p class =\"blueCap\">Interesting choice, answered the angel. I suppose culture depends on men again and again attempting to do what is difficult. And with that, he turned around and left.</p>\t\n\t}]\n\t(else:)[{\n\t\t<p class =\"blueCap\">That is a wise choice, said the angel. I think thou wilt find that easy and thy successors will find it worthy of consideration. With that, her turned around and left.</p>\t\n\t}]\n\t\n\t<div>\n\t\t<p class=\"vmarginalia\">|M3>[It must have been a vision.]<br>\n\t\t\t<span class=\"CommentatorB\">|M4>[It was only a dream.]</span>\n\t\t\t(click-replace: ?M3)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It must have been a vision.]]\n\t\t\t(click-replace: ?M4)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It was only a dream.]]\n\t\t</p>\n\t\t<img class=\"miniature\" src=\"images/miniatures/dream.png\" alt=\"Miniature\">\n\t\t<p class =\"redCap\">When Otilia woke up, it was still dark outside. Ysabella, who had stayed with her in the scriptorium, was still sleeping. Quietly, so as not to wake her up, Otilia began to pray.</p>\n\t</div>\n\t(set: nuns of $popularityDm to it -1)\n\t(set: $book to -1)\n\t(set: wrath of $viceDm to it +1)\n\t(replace: ?c4)[]\n\t(replace: ?c5)[]\n\t(show:?next)\n}]\n(click-replace: ?c4)[{\n\t<p class =\"greenCap\">Find comfort amongst my sisters in the cloister, as would become a nun. No other desire do I harbour but to sing in the choir with the others until my last breath.</p>\n\t(if: $cenobitism < 2)[{\n\t\t<p class =\"blueCap\">Interesting choice, answered the angel. I suppose culture depends on men again and again attempting to do what is difficult. And with that, he turned around and left.</p>\t\n\t}]\n\t(else:)[{\n\t\t<p class =\"blueCap\">That is a wise choice, said the angel. I think thou wilt find that easy and thy successors will find it worthy of consideration. With that, her turned around and left.</p>\t\n\t}]\n\t<div>\n\t\t<p class=\"vmarginalia\">|M5>[It must have been a vision.]<br>\n\t\t\t<span class=\"CommentatorB\">|M6>[It was only a dream.]</span>\n\t\t\t(click-replace: ?M5)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It must have been a vision.]]\n\t\t\t(click-replace: ?M6)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It was only a dream.]]\n\t\t</p>\n\t\t<img class=\"miniature\" src=\"images/miniatures/dream.png\" alt=\"Miniature\">\n\t\t<p class =\"redCap\">When Otilia woke up, it was still dark outside. Ysabella, who had stayed with her in the scriptorium, was still sleeping. Otila woke her up and together, they made for the church.</p>\n\t</div>\n\t(set: $book to -2)\n\t(set: faith of $virtueDm to it +1)\n\t(replace: ?c3)[]\n\t(replace: ?c5)[]\n\t(show:?next)\n}]\n(click-replace: ?c5)[{\n\t<p class =\"greenCap\">Spend the last days of my youth in enjoyment rather than gloom. What worth has life, not enjoyed? Song and play set man apart from animals and turn him into our Lord's image!</p>\n\t(if: $fun < 2)[{\n\t\t<p class =\"blueCap\">Interesting choice, answered the angel. I suppose culture depends on men again and again attempting to do what is difficult. And without saying any more, he turned around and left.</p>\t\n\t}]\n\t(else:)[{\n\t\t<p class =\"blueCap\">That is a wise choice, said the angel. I think thou wilt find that easy and thy successors will find it worthy of consideration. With that, her turned around and left.</p>\t\n\t}]\n\t<div>\n\t\t<p class=\"vmarginalia\">|M7>[It must have been a vision.]<br>\n\t\t\t<span class=\"CommentatorB\">|M8>[It was only a dream.]</span>\n\t\t\t(click-replace: ?M7)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It must have been a vision.]]\n\t\t\t(click-replace: ?M8)[(css: \"font-family: Arsenal; font-size: 2vh;line-height: 100%;\")[It was only a dream.]]\n\t\t</p>\n\t\t<img class=\"miniature\" src=\"images/miniatures/dream.png\" alt=\"Miniature\">\n\t\t<p class =\"redCap\">When Otilia woke up, it was still dark outside. Ysabella, who had stayed with her in the scriptorium, was still sleeping. Quietly, so as not to wake her up, Otilia began to pray.</p>\n\t</div>\n\t(set: people of $popularityDm to it -1)\n\t(set: $book to -3)\n\t(set: gluttony of $viceDm to it +1)\n\t(replace: ?c3)[]\n\t(replace: ?c4)[]\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 40,
      "name": "November",
      "text": "{\n<div class=\"recto\">\n\t<div class=\"rtext\" lang =\"en\">\n\t\t<img class=\"initial\" src=\"images/initials/may.svg\" alt=\"Initial 0\">\n\t\t<h3>tilia set&shytles her af&shyfairs</h3>\n\t\t<p class =\"redCap\">Having been very haggard and ailing for a while, Otilia finally became so short of breath she had to be admitted to the infirmary on the day of the Festum Omnium Sanctorum. She remained bedridden thereafter.</p>\n\t\t<p class =\"blueCap\">News of the dying abbess spread quickly and soon many came to the nunnery to visit her. Amongst these were certain relatives of her, who urged Otilia to recommend a successor to her office to the chapter. For the word of the abbess would have weight in the matter and in this way, perhaps, any uncertainty might be avoided altogether. After giving the proposition some thought, Otilia made her decision:</p>\n\t\t|c1>[<p class =\"greenCap\">Sister Agnes seems to me the logical choice, since she has been my deputy all this time.</p>]\n\t\t|c2>[<p class =\"greenCap\">The best candidate would probably be our cellera, Ysabella.</p>]\n\t\t|c3)[<p class =\"greenCap\">Upholding the balance of interests in this chapter would suggest my cousin Ida take up the office.</p>]\n\t</div>\n</div>\n<div class=\"verso\">\n\t<div class=\"vtext\" lang =\"en\">\n\t\t|VC1)[(display:\"NovChoice1\")]\n\t\t|VC2)[(display:\"NovChoice2\")]\n\t\t|VC3)[(display:\"NovChoice3\")]\n\t</div>\n\t|next)[<img class = \"wpl\" src=\"images/pagecurl.svg\" alt=\"Pagecurl\">]\n</div>\n(if: $idaGone is false)[{\n\t(show:?c3)\n}]\n(click-replace: ?c1)[{\n\t<p class =\"greenCap\">Sister Agnes seems to me the logical choice, since she has been my deputy all this time. She knows my duties better than myself. When Otilia told her of these thoughts, the prioress objected: Thou knowest well it can not happen. The office of abbess belongs to thy house, Otilia, just as the offices of steward and prioress belong to mine.</p>\n\t<p class =\"redCap\">Otilia answered thus: Perhaps it is time to change this arrangement, Agnes. If thou wert abbess, thy current office would be free for someone from my family, and I am sure there is a way to make the steward's post vacant.</p>\t\n\t(set: wrath of $viceDm to it +1)\n\t(replace: ?c2)[]\n\t(replace: ?c3)[]\n\t(show:?VC1)\n}]\n(click-replace: ?c2)[{\n\t<p class =\"greenCap\">The best candidate would probably be our cellera, Ysabella. She is related distantly to both houses and thus removed from all that, which any other candidate would have to face. She has been cellera for some years now and knows the conversi as well as the choir nuns.</p>\n\t<p class =\"redCap\">When Ysabella heard this, she vehemently objected: How canst thou ask this of me, Otilia? Agnes will want to be abbess. I've always been good friends with her and I should like to keep it at that. What if she stands for election, too? How could I stay here once I've lost to her? I beseech thee, Otilia, reconsider.</p>\n\t(set: temperance of $virtueDm to it +1)\n\t(replace: ?c1)[]\n\t(replace: ?c3)[]\n\t(show:?VC2)\n}]\n(click-replace: ?c3)[{\n\t<p class =\"greenCap\">Upholding the balance of interests in this chapter would suggest my cousin Ida take up the office. She has always fulfilled her duties as cantoress diligently and her candidacy will surely be supported by my family.</p>\n\t<p class =\"redCap\">When Ida heard this, she asked the abbess to spare her such a burden: I am but a girl, all I do is play music and pray. There are others, more knowledgeable of the world and of the many things to keep in mind in order to fulfill the demands of this office. They are better suited, as knowest thee and as know I.</p>\t\n\t(set: hope of $virtueDm to it +1)\n\t(replace: ?c1)[]\n\t(replace: ?c2)[]\n\t(show:?VC3)\n}]\n(click: ?next)[(goto: \"Ending\")]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "NovChoice1",
            "pid": 41
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "NovChoice2",
            "pid": 42
          }
        },
        {
          "text": "<display>",
          "destination": {
            "name": "NovChoice3",
            "pid": 43
          }
        },
        {
          "text": "<goto>",
          "destination": {
            "name": "Ending",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "NovChoice1",
      "text": "{\n(set: family of $popularityDm to it -1)\n<p class =\"blueCap\">The prioress thought about this proposal for a moment before she answered: As much as I should like to become abbess upon thy recommendation, dear Otilia, and help arrange things as thou hast said, I am quite sure our steward himself will object to thy plans of replacing him. Furthermore, who will take up his post? Knowest thee anyone who can?</p>\n|c4>[<p class =\"greenCap\">I am sure there will be someone within my family ready to become steward for this college.</p>]\n|c5)[<p class =\"greenCap\">Oh, but there is someone I know who'd fit the post perfectly.</p>]\n(if: $knowsMusicianWell is true)[{(show: ?c5)}]\n(click-replace: ?c4)[{\n\t(if: $power > 3)[{\n\t\t<p class =\"greenCap\">I am sure there will be someone within my family ready to become steward for this college. Worry thee not, Agnes, I have many a cousin who rejoiced were he given the post. Our current man I won't ask for his opinion. He will be informed when everything has been agreed.</p>\n\t\t<p class =\"redCap\">I see thou hast thought about it well, I will leave it to thee then, Otilia. I look forward to thy scheme to let me rule this abbey in name only. Well done, mother abbess. So spoke the prioress.</p>\n\t\t<p class =\"blueCap\">It has been said they both grinned in the others face in silence as they waited for their seals to be brought. Whether that is true or not, I dare not say. But it is well known they set about to write some letters together thereafter.</p>\n\t\t<p class = \"redcap\">The abbess had always been able to get her will and it thus came as little surprise to the nuns that her plan for the rearrangement of the holders of office in the college ended up as the recommendation that was given to them a few weeks later by the two founding houses.</p>\n\t(set: $cousinSteward to true) \n\t(set: $agnesAbbess to true)\n\t}]\n\t(else:)[{\n\t\t<p class =\"greenCap\">I am sure there will be someone within my family ready to become steward for this college. Do not worry, Agnes, I have many a cousin who rejoiced were he given the post. If thou werst to lay out our case before the current steward, he would surely agree that it is in the best interest of the chapter if he gave up his office. So spoke the abbess.</p>\n\t\t<p class =\"redCap\">I can try, Otilia, but I do not entertain much hope he will agree to follow thy plan. Thus warned her Agnes. But since this was Otilia's sincere wish, the prioress felt she had no choice but to go along with her deathbed decision.</p>\n\t\t<p class = \"blueCap\">As Agnes had predicted, the steward set in motion all he could when he heard of these plans. With the help of his relatives, he had the abbess' decision overturned. Noone had the heart, however, to inform Otilia of these developments and she was therefore unable to do anything about them. Right until the end, she believed she had settled the affairs of the abbey and those of her own in good order.</p>\n\t}]\n\t(replace: ?c5)[]\n\t(show:?next)\n}]\n(click-replace: ?c5)[{\n\t<p class =\"greenCap\">Oh, but there is someone I know who'd fit the post perfectly. We'll have to ask him first, of course, but I think he'll accept, if it's me, said the abbess without hesitation. </p>\n\t<p class =\"redCap\">I might have just the faintest idea whom thou art refering to, spoke Agnes and went on: It's worth a try and if he agrees, I'll support it, too. Send forth a messenger to him, Otilia, I will be pleased to watch thy little intrigue unfold. For there can be no doubt about thine intentions here. Thou wishest to stifle me by promoting me. Worry thee not, I'll play along, maybe, for a little while.</p>\n\t<p class =\"blueCap\">I would not have expected anything less from thee, Agnes, which is why thou wilt make a splendid abbess, answered Otilia and sent for her seal.</p>\n\t<p class =\"redCap\">Upon receiving her letter, Theobald immediately accepted the invitation to take over the stewardship, which he received in person from Otilia still, some time before she passed away.</p>\n\t(set: $musicianSteward to true) \n\t(set: $agnesAbbess to true)\n\t(replace: ?c4)[]\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 42,
      "name": "NovChoice2",
      "text": "{\n(set: family of $popularityDm to it -1)\n<p class =\"blueCap\">The young abbess thought about these words for a moment before she gave her answer.</p>\n|c4>[<p class =\"greenCap\">If that is how thou feelst earnestly, there is but little to be done about it.</p>]\n|c5)[<p class =\"greenCap\">I doubt that Agnes would mind staying prioress, really, if I ask her to support thy candidacy, Otilia said, finally.</p>]\n(if: $agnesOwes is true)[{(show: ?c5)}]\n(click-replace: ?c4)[{\n\t(replace: ?c5)[]\n\t(if: $power > 3)[{\n\t\t<p class =\"greenCap\">If that is how thou feelst earnestly, there is but little to be done about it. But I have known thee for some years now, Ysabella, and I believe there is no cause for thee to be afraid of Agnes. Thou art not weak, but wouldst no discontent. Yet thee woulst know how to dispell it. If thou wert to rise to the abbiate of this cloister, thou wouldst find thy way within it well enough. So spoke Otilia</p>\n\t\t<p class =\"redCap\">There is no secret to this office, Ysabella. Act generous and just, with goodwill towards everyone. Let Agnes reign what's hers to rule or where it does thee no offence. Stake out thy realm, where it is thine to keep and do defend it well. </p>\n\t\t<p class = \"blueCap\">Encouraged by the abbess' words, and eager now to rule the chapter well, the cellera agreed to stand for vote. Alas, soon after Otilias recommendation had become known, the steward raised his voice in many halls concerned. He wished not for the cellera to become abbess.</p>\n\t\t(if: $stewardOwes is true)[{\n\t\t\t<p class =\"redCap\">The cellera was quickly able to silence his mingling though, when she threatened to have the narrow door in the wine cellar opened, which Otilia had noticed when they inspected the vaults earlier that year.</p>\n\t\t\t(set: $YsabellaAbbess to true)\n\t\t}]\n\t\t(else:)[{\n\t\t\t<p class =\"redCap\">What could Otila do? She knew he feared Ysabella's able oversight. But while she herself was bedridden, he was free to visit all those he wished to, and in the end, his opinion in the matter was the one that was heard. Her plans for Ysabella to become her successor would come to nothing, as she bitterly had to concede.</p>\n\t\t}]\n\t\t(show:?next)\n\t}]\n\t(else:)[{\n\t\t<p class =\"greenCap\">If that is how thou feelst earnestly, there is but little to be done about it, so spoke Otilia. It seemed to her there was no other choice but to ask Agnes to become her successor.</p>\n\t\t<p class =\"blueCap\">The prioress rejoiced upon hearing of this plan, for it had indeed been her intention to become abbess. Otilia told her that if this was to be, the steward would have to be exchanged for someone from her own family, to uphold the balance of interests in the abbey.</p>\n\t(display: \"NovChoice2a\")\n\t}]\n}]\n(click-replace: ?c5)[{\n\t<p class =\"greenCap\">I doubt that Agnes would mind staying prioress, really, if I ask her to support thy candidacy, Otilia said, finally. I've done her a favour some time ago, why shouldn't she return it now?</p>\n\t<p class =\"redCap\">What favour hast thou done for her? Inquired Ysabella and Otilia answered thus: She likes to fly raptors, as thou knowest. I allow her to do so and keep her company. If thou wert to do the same, she'd be willing to remain prioress. Thou knowest also that it is her who rules this chapter in most matters, and that is what she likes to do. Again, her current office will suffice for her if thou promised her not to overstep thy privileges.</p>\n\t<p class = \"blueCap\">Encouraged by the abbess' words, more eager now, the cellera agreed to stand for vote. Alas, soon after Otilias recommendation had become known, the steward raised his voice in many halls concerned. He wished not for the cellera to become abbess.</p>\n\t(if: $stewardOwes is true)[{\n\t\t<p class =\"redCap\">The cellera was quickly able to silence his mingling though, when she threatened to have the narrow door in the wine cellar opened, which Otilia had noticed when they inspected the vaults earlier that year.</p>\n\t\t(set: $YsabellaAbbess to true)\n\t}]\n\t(else:)[{\n\t\t<p class =\"redCap\">What could Otila do? She knew he feared Ysabella's able oversight. But while she herself was bedridden, he was free to visit all those he wished to, and in the end, his opinion in the matter was the one that was heard. Her plans for Ysabella to become her successor would come to nothing, as she bitterly had to concede.</p>\n\t}]\t\n\t(replace: ?c4)[]\n\t(show:?next)\n}]\n}",
      "links": [
        {
          "text": "<display>",
          "destination": {
            "name": "NovChoice2a",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "NovChoice3",
      "text": "{\n(set: family of $popularityDm to it +1)\n<p class =\"redCap\">|L1>[(text-colour: #e34234)[<span lang=\"la\">Cum essem parvulus, loquebar ut parvulus, cogitabam ut parvulus. Quando autem factus sum vir, evacuavi quæ erant parvuli. Videmus nunc per speculum in ænigmate: tunc autem facie ad faciem. Nunc cognosco ex parte: tunc autem cognoscam sicut et cognitus sum.</span>]] Thus Otilia cited and then said: There is a mirror in that chest over there. Take a good look into it.</p>\n(click-replace: ?L1)[When I was a child, I spake as a child, I understood as a child, I thought as a child: but when I became a man, I put away childish things. For now we see through a glass, darkly; but then face to face: now I know in part; but then shall I know even as also I am known.]\n<p class =\"blueCap\">She waited as her cousin did as she had been told, before she continued: Seest thee a child there? If thou dost, it must be the mirror. For when I look at thee, I do not see a child. No, Ida, the girl thou once wert has become a lady, a devoted bride to the Lord, the leader of our song in the choir.</p>\n(if: ($agnesOwes is true and $stewardOwes is true) or $power > 3)[{\n\t<p class =\"redCap\">She continued: Remember that thou hast able helpers. Agnes follows her own whims, it is true, but she has kept this chapter in good discipline, nonetheless. I am sure thou knowest so better than myself. Ysabella is perhaps not the most devoted singer in the choir, but I assure thee she is a very dilligent cellera. As for the steward, well, every nunnery has one, and ours is hardly worse than any other I can think of.</p>\n\t<p class = \"blueCap\">Thus reassured, Ida agreed to stand for vote. This was what everyone in the family had been hoping for and it turned out for the best when the other house agreed to her candidacy.</p>\n\t(set: $idaAbbess to true)\n\t(show:?next)\n}]\n(elseif: $stewardOwes is false)[{\n\t<p class =\"redCap\">Ida felt reassured by these words and decided to stand for vote. Otilia's family was content with her choice and everything seemed settled, when it emerged that the other house would not support Ida's candidacy. So the abbess bade the steward to visit her and explain.</p>\n\t<p class = \"blueCap\">The steward answered her: I am not bothered by sister Ida becoming abbess. It's just that she is your chosen candidate, and I fear she will be as obstructive to my duties as you have been. You should have relented, and let me steward as a steward does. Now it is too late, and it will be others that decide on your successor.</p>\n\t(show:?next)\n}]\n(else:)[{\n\t<p class =\"redCap\">Ida felt reassured by these words and decided to stand for vote. Otilia's family was content with her choice and everything seemed settled, when it emerged that the prioress' family would not support Ida's candidacy. So the abbess bade sister Agnes to visit her and explain her doubts.</p>\n\t<p class = \"blueCap\">Agnes answered her: I am not bothered by Ida becoming abbess, Otilia, said Agnes. It's just that she is thy chosen candidate, and thou hast obstructed me once too often in my peaceful life within this abbey. To be honest, I have always wondered why thou wouldst not understand this simple truth. And with that, she left.</p>\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 44,
      "name": "NovChoice2a",
      "text": "{\n(set: family of $popularityDm to it -1)\n<p class =\"redCap\">I am quite sure our steward will object to thy plans of replacing him, said the prioress. Also: who will take up his post? Knowest thee anyone who can?</p>\n|c6>[<p class =\"greenCap\">I have many a cousin who rejoiced were he given the post.</p>]\n|c7)[<p class =\"greenCap\">There is someone I know who'd fit the post perfectly.</p>]\n(if: $knowsMusicianWell is true)[{(show: ?c7)}]\n(click-replace: ?c6)[{\n\t<p class =\"greenCap\">I have many a cousin who rejoiced were he given the post. If thou wert to lay out our case before the current steward, he would surely agree that to give up his office is in the best interest of the chapter. So spoke the abbess.</p>\n\t<p class =\"blueCap\">I can try, Otilia, but I do not entertain much hope he will agree, Agnes warned her. But since this was the dying abbess's sincere wish, the prioress felt she had no choice but to go along with it.</p>\n\t<p class = \"redCap\">As Agnes had predicted, the steward set in motion all he could when he heard of these plans. With the help of his relatives, he had the abbess' decision overturned.</p>\n\t(replace: ?c7)[]\n\t(show:?next)\n}]\n(click-replace: ?c7)[{\n\t<p class =\"greenCap\">There is someone I know who'd fit the post perfectly. We'll have to ask him first, of course, but I think he'll accept, if it's me, said the abbess</p>\n\t<p class =\"redCap\">Agnes smiled:. It's worth a try and if he agrees, I'll support it, she said. I will be pleased to watch thy little intrigue unfold. Worry thee not, I'll play along for a while. And I would not have expected anything less from thee, answered Otilia.</p>\n\t<p class =\"blueCap\">Upon receiving her letter, Theobald immediately accepted the invitation to take over the stewardship, which he received in person from Otilia still, some time before she passed away.</p>\n\t(set: $YsabellaAbbess to true)\n\t(replace: ?c6)[]\n\t(show:?next)\n}]\n}",
      "links": []
    },
    {
      "pid": 45,
      "name": "EndingVerso",
      "text": "{\n\t\t(if: $agnesAbbess is true and $cousinSteward is true)[{\n\t\t\t<p class=\"blueCap\">As she had recommended, the office of abbess was given to the prioress, Agnes, who went on to lead the chapter for many years. A cousin of Otilia became steward and sister Ysabella, the cellera, became prioress. These changes ensured the balance of interests in the nunnery was maintained.</p>\n\t\t}]\n\t\t(elseif: $agnesAbbess is true and $musicianSteward is true)[{\n\t\t\t<p class=\"blueCap\">As she had recommended, the office of abbess was given to the prioress, Agnes, who went on to lead the chapter for many years. Ysabella, the cellera, became prioress and one of her cousins, whom Otilia had loved dearly, became steward, ensuring the balance of interests in the nunnery.</p>\n\t\t}]\n\t\t(elseif: $YsabellaAbbess is true)[{\n\t\t\t<p class=\"blueCap\">Her predecessor had not been able to settle her affairs and in this way it had fallen to Otilia to become abbess. But such was not the case when she passed on. As she had recommended, the office was given to the cellera, Ysabella, who went on to lead the chapter for many years.</p>\n\t\t}]\n\t\t(elseif: $idaAbbess is true)[{\n\t\t\t<p class=\"blueCap\">Her predecessor had not been able to settle her affairs and in this way it had fallen to Otilia to become abbess. But such was not the case when she passed on. As she had recommended, the office was given to the cantoress, Ida, who went on to lead the chapter for many years.</p>\n\t\t}]\n\t\t(else:)[{\n\t\t\t<p class=\"blueCap\">Her plan to install a candidate of her choice as her successor failed. Instead, it was Agnes, the prioress, who was elected as the new abbess. Together with her bastard cousin, the steward, they henceforth siphoned away the riches of the abbey to members of their own house exclusively.</p>\n\t\t}]\n\t\t(if: $book > 0)[{\n\t\t\t(if: $book is 1 and $economics > 2)[{\n\t\t\t\t<p class=\"redCap\">Throughout her last months, the venerable abbess could often be seen writing. She was working on her book: |L2>[(text-colour: #e34234)[<span lang=\"la\">De administratione ex principiis.</span>]] It guided many a nun after her. Unfortunately, it can not be found in the library any more.\n\t\t\t\t(click-replace: ?L2)[On pricipled administration.]\n\t\t\t\t</p>\n\t\t\t}]\n\t\t\t(elseif: $book is 2 and $technicalSkill > 2)[{\n\t\t\t\t<p class=\"redCap\">Throughout her last months, the venerable abbess could often be seen writing. She was working on her book: |L2>[(text-colour: #e34234)[<span lang=\"la\">De constructione machinae agitatae aquae.</span>]] It guided many a nun after her. Unfortunately, it can not be found in the library any more.\n\t\t\t\t(click-replace: ?L2)[On the construction of water-driven machines.]\n\t\t\t\t</p>\n\t\t\t}]\n\t\t\t(elseif: $book is 3 and $caritas > 2)[{\n\t\t\t\t<p class=\"redCap\">Throughout her last months, the venerable abbess could often be seen writing. She was working on her book: |L2>[(text-colour: #e34234)[<span lang=\"la\">Caritas in auxilium humani necessitates.</span>]] It guided many a nun after her. Unfortunately, it can not be found in the library any more.\n\t\t\t\t(click-replace: ?L2)[Caritas in the service of human needs.]\n\t\t\t\t</p>\n\t\t\t}]\n\t\t\t(else:)[{\n\t\t\t\t<p class =\"redCap\">Throughout her last months, the venerable abbess could often be seen writing. She was working on a book of her own, but it remained unfinished and after a few years, the writing was scratched off and the parchment used for some other purpose. I have forgotten what it was about.</p>\n\t\t\t}]\n\t\t}]\n\t\t(else:)[{\n\t\t\t(if: $book is -1 and $asceticism > 2)[{<p class=\"redCap\">During the last few month of her life, the abbess was especially happy about the opportunity to spend her days alone in silent prayer. The others respected her wish and if anyone has found the Lord in solitude, it must surely be Otilia.</p>}]\n\t\t\t(elseif: $book is -2 and $cenobitism > 2)[{<p class=\"redCap\">During the last few month of her life, the abbess was especially happy about the company of the other nuns of the chapter. A regular schedule was arranged so there were always several sisters who prayed the liturgy of the hours with her.</p>}]\n\t\t\t(elseif: $book is -3 and $fun > 2)[{<p class=\"redCap\">During the last few month of her life, the abbess was especially happy about the musical performances that were put up in her bedroom for her and the many evenings that she spent in happy company. Frivolous, some might say, but to Otilia's consolation.</p>}]\n\t\t\t(else:)[{\n\t\t\t\t<p class =\"redCap\">During the last few month of her life, the abbess seemed discontent, as if driven by her desire to do something that continued to escape her grasp. When asked she would only say that it was something only she herself could find, but it seemed, that, in the end, she never did.</p>\n\t\t\t}]\n\t\t}]\n\t\t<p class=\"blueCap\">Was Otilia's life as abbess exemplary? Was it to her own satisfaction? It has to remain for the reader to judge. Time covering all in its mist and death being the only certainty, she may as well believe what is written here. And so we have come close to the end of this, my account of Abbess Otilias life and death.</p>\n\t\t<img class=\"miniature\" src=\"images/miniatures/writing.png\" alt=\"Miniature\">\n\t\t(set: $popularityMax to 0)\n\t\t(set: $popularityMin to 0)\n\t\t(for:  each _item, ...(datavalues: $popularityDm))[{\n    \t\t(if: _item > $popularityMax)[{(set: $popularityMax to _item)}]\n\t\t\t(if: _item < $popularityMin)[{(set: $popularityMax to _item)}]\n\t\t}]\n\t\t(if: $popularityMax > (abs: $popularityMin))[\n\t\t\t(if: nuns of $popularityDm is $popularityMax)[\n\t\t\t\t<p class =\"redCap\">What remains to be told? Perhaps just this: Hyperbole aside, Otilia truly was loved by her sisters, the nuns of her chapter, many of whom remember her fondly.</p>\n\t\t\t]\n\t\t\t(elseif: people of $popularityDm is $popularityMax)[\n\t\t\t\t<p class =\"redCap\">What remains to be told? Perhaps just this: Hyperbole aside, Otilia truly was loved by the people of the land, whom she had held in her heart throughout her life.</p>\n\t\t\t]\n\t\t\t(else:)[\n\t\t\t\t<p class =\"redCap\">What remains to be told? Perhaps just this: Hyperbole aside, Otilia truly was loved by her friends and her family, inside and outside of the abbey's cloister.</p>\n\t\t\t]\n\t\t]\n\t\t(else:)[\n\t\t\t<p class =\"redCap\">What remains to be told? Perhaps just this: It is well known that Otilia remained unloved in the office of abbess. When her whim was endulged, it happened without enthusiasm.</p>\n\t\t]\n}",
      "links": []
    }
  ]
}