{
  "passages": [
    {
      "pid": 1,
      "name": "red_no",
      "text": "You worry you haven't gathered enough items for the Caves. You recall a past run in the Caves when PlantOrb was hit by a unlucky critical and fainted after you'd already spent your one Revive on GearFish. You'd had to restart from the beginning. You should grind for a while to buy more items.\\n\\nYou spend you don't know how long on Road 44 outside of Chartreuse Township, catching BoneOrphans and selling them to Dr. Hornbeam for a tidy sum. Soon enough you have the PockCoin to purchase x2 Revives. You're [[ready|red_yes]] to face the Caves.",
      "links": [
        {
          "text": "ready",
          "destination": {
            "name": "red_yes",
            "pid": 45
          }
        }
      ]
    },
    {
      "pid": 2,
      "name": "pockm_n",
      "text": "You've three saves to choose from:\\n\\n1) [[RED|red]] (BADGES 4, POCKDECK 63, TIME 20:20)\\n2) [[RED|redder]] (BADGES 8, POCKDECK 124, TIME 34:45)\\n3) [[HERAKLES|her]] (BADGES 2, POCKDECK 44, TIME 0:09)\\n\\nThe first two saves are yours, but the third must be your friend's: you lent him your GBC once while you were away at camp. How'd he defeat two Guildmasters and capture so many Pockm_n in under ten minutes? He must've messed with the game somehow. You hope his tampering didn't corrupt your saves.\\n\\nSave 1 must be from after you captured your Genee. You saved right outside the Forbidding Caves, determined to find the Fallen Star that'd upgrade Genee to a Metatron. The Caves are dark as anything; it's not hard to lose your way. You tried dozens of times, never found the Star. You gave up and used a Sacred Flame instead to get Pyrotron. But you vowed to return and track down the Star.\\n\\nBy Save 2 you'd beaten the Council but you hadn't \"got 'em all.\" You'd bought a season pass to the Wilds in hopes of capturing the rare Pockm_n found there. Then the season passed and you got stuck in the Wilds and that's about when you thought you lost the GBC on the car trip.\\n\\nYou've no clue where your friend might be in the game. If he was glitching the game, he might not've been looking to \"win\" in the traditional sense. You wonder how he's doing now.",
      "links": [
        {
          "text": "RED",
          "destination": {
            "name": "red",
            "pid": 60
          }
        },
        {
          "text": "RED",
          "destination": {
            "name": "redder",
            "pid": 148
          }
        },
        {
          "text": "HERAKLES",
          "destination": {
            "name": "her",
            "pid": 106
          }
        }
      ]
    },
    {
      "pid": 3,
      "name": "skip",
      "text": "Whenever I least expect it, X appears, where X =\\n\\na) [[Jesus cold on the cross|answer]]\\nb) [[my west nightmare|answer]]\\nc) [[a peerless network|answer]]\\nd) [[{insufficient information}|answer]]\\ne) [[evanescence|answer]]\\n<<if $attribution is false>>f) [[your arm on fire|answer]]<<else>>@@.Q;f) [[your arm on fire|answer]] <--@@<<endif>>/%LDR, Summertime Sadness%/\\ng) [[Skip to the next question.|skipskip]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "Jesus cold on the cross",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "my west nightmare",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "a peerless network",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "{insufficient information}",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "evanescence",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "your arm on fire",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "Skip to the next question.",
          "destination": {
            "name": "skipskip",
            "pid": 133
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 4,
      "name": "hurl",
      "text": "All manner of unlikely implements, antiquities and bric-a-brac are soon mashed to bits by the ravening maw. Probably those crates contained some cool and clever puzzle, but you didn't come prepared, so now you'll never know. \\n\\nIn all honesty, you're abysmal at puzzles-- opening the crates could easily have been more frustrating than not opening them. And you got a kick out of seeing the teeth obliterate those dumb crates. It's fine.\\n\\n[[BACK|answer][$crates = true]]",
      "links": [
        {
          "text": "BACK",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        }
      ]
    },
    {
      "pid": 5,
      "name": "Endings",
      "text": "<<if $page_ending is false>>???????<<else>>\"The pages keep going\"<<endif>>\\n<<if $terminal_ending is false>>???????<<else>>\"Terminal room\"<<endif>>\\n<<if $home_ending is false>>???????<<else>>\"Went home\"<<endif>>\\n<<if $stay_ending is false>>???????<<else>>\"Stay in the Wilds\"<<endif>>\\n<<if $look_ending is false>>???????<<else>>\"Her last look\"<<endif>>\\n<<if $love_ending is false>>???????<<else>>\"Okay, bye! I love you\"<<endif>>\\n<<if $then_ending is false>>???????<<else>>\"Bye then\"<<endif>>\\n<<if $bye_ending is false>>???????<<else>>\"Bye\"<<endif>>\\n<<if $earth_ending is false>>???????<<else>>\"You never were of this earth\"<<endif>>\\n<<if $orange_ending is false>>???????<<else>>\"Orange marmalade\"<<endif>>\\n<<if $door1_ending is false>>???????<<else>>\"A delicious slurry (Door #1)\"<<endif>>\\n<<if $door2_ending is false>>???????<<else>>\"A delicious slurry (Door #2)\"<<endif>>\\n<<if $door3_ending is false>>???????<<else>>\"A delicious slurry (Door #3)\"<<endif>>\\n\\n[[BACK|Start.]]",
      "links": [
        {
          "text": "BACK",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 6,
      "name": "woods",
      "text": "<<if $absent is true>>The woods have a thousand eyes. They're all looking at you. So. Look out or get caught out. Not that I love the woods, no I do loathe them but-- you show respect where maybe respect's due. That's all.\\n\\nThere's no \"creatures of the forest\" anywhere near you. They know better than to be seen. The scene's dead quiet. Not a thread of wind. Not a worm surfacing. Not a thing. \\n\\n[[Keep walking|woods2]].<<else>>The woods have a thousand eyes. Every one is looking at you. So you ought to look out or get caught out. You need not love the woods. You show respect where maybe respect is due, is all.\\n\\nThere are no \"creatures of the forest\" nearby. They know better than to be seen. The scene is dead quiet. Not a thread of wind. Not a worm surfacing. Not a thing. \\n\\n[[Keep walking|woods2]].<<endif>>",
      "links": [
        {
          "text": "Keep walking",
          "destination": {
            "name": "woods2",
            "pid": 167
          }
        }
      ]
    },
    {
      "pid": 7,
      "name": "Start.",
      "text": "<center>@@font-size:30px;A Trial@@\\nB Minus Seven\\n<<remember $taking_content>><<remember $having_content>><<remember $changing_content>>\\n[[Start.|First][$late = false, $note = 0, $dunes = 0]]\\n[[Table of Content][$late = false]]\\n[[Endings]]: <<print $endings>>/13\\n[[Credits]]\\n[[Attribution][$attribution = true]]</center>",
      "links": [
        {
          "text": "Start.",
          "destination": {
            "name": "First",
            "pid": 72
          }
        },
        {
          "text": "Table of Content",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        },
        {
          "text": "Endings",
          "destination": {
            "name": "Endings",
            "pid": 5
          }
        },
        {
          "text": "Credits",
          "destination": {
            "name": "Credits",
            "pid": 150
          }
        },
        {
          "text": "Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 8,
      "name": "CPDformNoNo",
      "text": "You cannot be sure without any windows or clocks around, but you must have spent most of the day in here already. Even if you were to prove yourself and secure a nameless citizen's badge, you have no hope of reaching the CNR in time for your appointment.\\n\\nBest just go home and bury yourself in bed.\\n<<if $home_ending is false>><<remember $endings += 1>><<remember $home_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|CPDformWake]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "CPDformWake",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 9,
      "name": "dunes_pre2",
      "text": "<<if $smoke is false>>\"No, thank you.\"\\n\\n\"Sure, sure. Well, sit a while: we won't bite!\"\\n\\nYou sit cross-legged next to the woman. The man is across the fire from you. His eyes are red as anything: he looks fried, like shit left to sun on the duneside.\\n\\nThe third person has not looked up or acknowledged you in any way. Eyes closed: they are resting or meditating. You are not sure what to make of them, but they look peaceful.\\n\\n\"So, introductions then, mm? I'm Mary, pleased to meet to you. Jackson's over there, and this one here,\" tapping their shoulder lightly, \"is Sail.\" Mary clicks her tongue. \"She's not with us at this moment, but don't you worry: she's right as rain, always is.\" She turns to you. \"And who might you be?\"\\n\\n\"Oh, umm... I don't have a name.\"\\n\\nMary nods as if expecting that. \"No, sure, I mean: no harm in that, y'know? Who needs a name really -- a couple of syllables to pin yourself down and all! Well.\" She smiles. \"Mary's not my given name, y'know? It's not even,\" she lowers her voice some, \"//official//, okay?\" She pauses. \"And what's more, what's more is I spent some time in the Service, mmm? I don't know if you know, but: you only get a number there, sixteen digits. So, well, don't think I don't know about not having a name!\"\\n\\nQuiet. Then you nod, \"Okay.\"\\n\\n/%She picks up this slim thread. %/\"Okay, okay! All I mean is: just because you don't have a name, doesn't mean you don't have a story, y'know? So what's your story, what brings you here?\"\\n\\n- [[Evade|dunes_pre3][dunetruth = 1]]\\n- [[Half-truth|dunes_pre3][dunetruth = 2]]\\n- [[Spill|dunes_pre3][dunetruth = 3]]\\n\\n\\n<<else>>You <<if $smoke is 1>>smile<<else>>nod<<endif>>, sit down by the woman and take the pipe. <<if $smoke is 2>>The carb is on the wrong side? Okay, no, you got this.<<endif>> You take a hit.\\n\\nSmoke: smells like skunk but tastes like strawberry lawn dross. Curious.\\n\\nThe hit is not smooth, is not harsh -- a whisper prickling down your throat.\\n\\nYou cough. You say, \"Hey.\" You smile. You laugh. You ask for water -- she pulls out a jug and hands you a small clay cup. She seems all right.\\n\\n\"Well, I'll let you settle on that some, mm? Let it flow, you can talk when you like, y'know?\"\\n\\nYou do know. You have nearly nothing to say; you are nearly a parrot, if anything. Parrots are bright birds, but they do not do what they ought nearly often enough. [[So it goes.|dunes_pre3][$dunetruth = 4]]\\n<<endif>>",
      "links": [
        {
          "text": "Evade",
          "destination": {
            "name": "dunes_pre3",
            "pid": 23
          }
        },
        {
          "text": "Half-truth",
          "destination": {
            "name": "dunes_pre3",
            "pid": 23
          }
        },
        {
          "text": "Spill",
          "destination": {
            "name": "dunes_pre3",
            "pid": 23
          }
        },
        {
          "text": "So it goes.",
          "destination": {
            "name": "dunes_pre3",
            "pid": 23
          }
        }
      ]
    },
    {
      "pid": 10,
      "name": "run1",
      "text": "Got away safely!\\n\\nJust keep running -- it's not worth it to stay to fight. All the EXP in the world won't help if you don't reach the gate in time.\\n\\nYou rush alongside the lower stream: tearing through handsy brambles, clambering over rusty excuses, ducking clinically depressed tree-branches. Always moving as due east as possible, always keeping as low of a profile as possible. But They can creep up on you anywhere in the Wilds.\\n\\nWild RedReceptacle appeared!\\n\\nGo! PlantHypersphere!\\n\\nFIGHT\\nITEM\\nPKMN\\n[[RUN|run2]]",
      "links": [
        {
          "text": "RUN",
          "destination": {
            "name": "run2",
            "pid": 13
          }
        }
      ]
    },
    {
      "pid": 11,
      "name": "redder_move",
      "text": "You know more or less where to go. The Wilds shunt you along one of two streams; you have to go against them to escape. You escape when you feel the most high and you hide when you feel the most low and you lower yourself when you feel that They know who you are and They will lay you low.\\n\\nYou stay out of the tall grass, oil slicks and fields of flat but They find you anyway.\\n\\nWild CrystalWarrior appeared!\\n\\nGo! PlantHypersphere!\\n\\nFIGHT\\nITEM\\nPKMN\\n[[RUN|run1]]",
      "links": [
        {
          "text": "RUN",
          "destination": {
            "name": "run1",
            "pid": 10
          }
        }
      ]
    },
    {
      "pid": 12,
      "name": "run3",
      "text": "Got away safely!\\n\\nPlantHypersphere isn't your fastest Pockm_n, (that would be CeramicInsurrection,) but she's been by your side since the start. It's a comfort to see her step up, bristling, ready to face whatever the Wilds have to throw at you. She's been one of your more reliable companions, far better than myself.\\n\\nYou've done well so far, sticking to the shortest possible path. You've got a razor-thin cushion so long as you keep to it. \\n\\nThis next partition is a dead zone. The upside is no obstacles are stopping you from going directly east toward the gate. The downside is this place is [[swarming|run4]] with Dead-type Pockm_n.\\n",
      "links": [
        {
          "text": "swarming",
          "destination": {
            "name": "run4",
            "pid": 15
          }
        }
      ]
    },
    {
      "pid": 13,
      "name": "run2",
      "text": "Couldn't get away!\\n\\nEnemy RedReceptacle used MIME!\\n\\nPlantHypersphere's SPECIAL greatly fell!\\n\\nFIGHT\\nITEM\\nPKMN\\n[[RUN|run3]]",
      "links": [
        {
          "text": "RUN",
          "destination": {
            "name": "run3",
            "pid": 12
          }
        }
      ]
    },
    {
      "pid": 14,
      "name": "run5",
      "text": "Enemy SkeletonActivist used PATHOS!\\n\\nPlantHypersphere's DEFENSE greatly fell!\\n\\nRUN\\n\\nCouldn't get away!\\n\\nEnemy SkeletonActivist used MARX!\\n\\n(Ouch. That took away a solid sixth of her health.)\\n\\nRUN\\n\\nCouldn't get away!\\n\\nEnemy SkeletonActivist used EMPATHY!\\n\\nSkeletonActivist's SPECIAL rose!\\n\\nRUN\\n\\n[[Got away safely!|run6]]",
      "links": [
        {
          "text": "Got away safely!",
          "destination": {
            "name": "run6",
            "pid": 16
          }
        }
      ]
    },
    {
      "pid": 15,
      "name": "run4",
      "text": "Wild MummifiedRaptor appeared!\\n\\nGo! PlantHypersphere!\\n\\nRUN\\n\\nGot away safely!\\n-.-.-\\nWild EctoplasmicBromeliad appeared!\\n\\nGo! PlantHypersphere!\\n\\nRUN\\n\\nGot away safely!\\n-.-.-\\nWild SkeletonActivist appeared!\\n\\nGo! PlantHypersphere!\\n\\nRUN\\n\\n[[Couldn't get away!|run5]]",
      "links": [
        {
          "text": "Couldn't get away!",
          "destination": {
            "name": "run5",
            "pid": 14
          }
        }
      ]
    },
    {
      "pid": 16,
      "name": "run6",
      "text": "They leave you alone the rest of the way back, for whatever reason. Pity probably. (How you hate Them.)\\n\\nThe gate's got a gatekeeper who won't let you leave without a toll, when you've already paid through the nose for a season pass! His name's Dick.\\n\\nLuckily, Dick takes items in lieu of cash. You hand him x2 of your ill-gotten Reliefs and he waves you through. Home free. You save and quit.\\n\\n[[Shit: what time is it?|basement][$chest_open = true, $late = true]]",
      "links": [
        {
          "text": "Shit: what time is it?",
          "destination": {
            "name": "basement",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 17,
      "name": "father",
      "text": "<<if $father is 2>>The Father was the first figure of speech to flash upon our radar. He burns us still.\\n\\nThe Father father is a frail man you cannot look in the eye. He carries himself like you might carry a consignment of books to the school's charity sale.\\n\\nHe has this to say to you: \"You will come back to us.\"\\n\\nYou answer him: \"I will tie my hands into two thousand knots before I open the door to return to you.\" An unpleasant image, but [[he has nothing to say in return|nothingtosay2]].<<elseif $father is 1>>The Son is a model made into a mold. He spreads from one dark spot in the garage to cover up everything, to make everyone sane. He was an earnest, loving boy.\\n\\nThe Son father wears a wreath of gentle irony. He knows he is deeply uncool, and he knows better than to joke about it. He is the guidance counselor you wish your imaginary friend had had growing up.\\n\\nHe has this to say to you: \"I wish we could have talked about this sooner. There is so much I don't know about you.\"\\n\\nYou answer him: \"Yeah, me too. Here we are.\" [[He has nothing to say in return|nothingtosay2]]. He gives you an almost-not-awkward hug before you leave.<<else>>The God is a Greek bronze: his stern eyes tarnished and his raised fist tireless as ever. He is a coward.\\n\\nThe Godfather is a chainsmoker, in a 'cool' rather than 'depressing' way. He has made hard choice after hard choice: you do not envy him that. He is an unrepentant capitalist.\\n\\nHe has this to say to you: \"Do what you love.\"\\n\\nYou answer him: \"No.\" [[He has nothing to say in return|nothingtosay2]].<<endif>>",
      "links": [
        {
          "text": "he has nothing to say in return",
          "destination": {
            "name": "nothingtosay2",
            "pid": 75
          }
        },
        {
          "text": "He has nothing to say in return",
          "destination": {
            "name": "nothingtosay2",
            "pid": 75
          }
        }
      ]
    },
    {
      "pid": 18,
      "name": "her_outside",
      "text": "Oh. Now this is new: Packet Town is no more. Your home floats free-standing alone in the tall grass. No sign of ruins, any break in the plains -- nothing else was ever here.\\n\\nIt is noon by your clock, so the sun must be precisely above. The sun does not feature in this game, of course. But there's something in the glaring grass that points to a balance, an equanimity.\\n\\nWhat now?\\n\\n[[Go into the grass|her_grass]]\\n==Return to the house==\\n[[Quit the game|basement][$chest_open = true, $her_quit = true]]",
      "links": [
        {
          "text": "Go into the grass",
          "destination": {
            "name": "her_grass",
            "pid": 107
          }
        },
        {
          "text": "Quit the game",
          "destination": {
            "name": "basement",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 19,
      "name": "CPDformBirth",
      "text": "Pg. 2: Birth\\n\\nDOB (Date): [redacted]\\nLOB (Location): [redacted]\\n\\nMOB (Mother): [redacted]\\nAMOB (Alternate Mother): [redacted]\\nFOB (Father): [redacted]\\nAFOB (Alternate Father): [redacted]\\n\\nMDOB (Medical Doctor): [redacted]\\nPDOB (Psychological Doctor): [redacted]\\nSDOB (Spiritual Doctor): [redacted]\\nYDOB (Yxxxx Doctor): [redacted]\\n\\nGNOB (General Notary): [redacted]\\nKNOB (Keyword Notary): [redacted]\\nSNOB (Solitary Notary): [redacted]\\n\\nSLOB (Specified Locution): [redacted]\\nTLOB (Traditional Locution): [redacted]\\n\\nCROB (Chief Registrar): [redacted]\\nDROB (Deputy Registrar): [redacted]\\nPROB (Pursuant Registrar): [redacted]\\nWROB (Wailing Registrar): [redacted]\\nCRROB (Chief Representational Registrar): [redacted]\\nDRROB (Deputy Representational Registrar): [redacted]\\n\\nSOB (Signifier): [redacted]\\nSOB (Signified): [redacted]\\nSOB (Sun): [[Sol|CPDformLocation]]\\n\\nGDSOB (Genetic Designation Specialist): [redacted]\\nMFSOB (Maximized Filiation Specialist): [redacted]\\nCSSOB (Carbon Sources Specialist): [redacted]\\n\\nTOCKFOB (Tone Overridden Computational Knowledge Forensics): [redacted]\\nMOCKROB (Madrigal Officiated Coursing Kinesthetic Remedy): [redacted]\\nCLOTMOB (Conduit Loomings Oppositive Tremorous Mom): [redacted]\\nSLOTGLOB (Slobbering Lean Octopodes Toggle Ghost Luminary): [redacted]",
      "links": [
        {
          "text": "Sol",
          "destination": {
            "name": "CPDformLocation",
            "pid": 78
          }
        }
      ]
    },
    {
      "pid": 20,
      "name": "a door",
      "text": "<<if $absent is true>>You know this door well: you built it. It's a spline-jointed batten door, 33-1/4\" X 74\". You thought it'd end up in a garage far to the south: instead it's here, snug in a cabin in the North Woods. Oh my.\\n\\nYou know better than to flee: you've been here before. Better to babble in the arms of the one you're supposed to see than to collapse by the side of the road. Most likely they'll know what to do. You knock on the door.<<else>>Now why does this door feel so familiar? When you press your hand to it, it warms to you like an old friend. How odd, and improper. You depress the buzzer beside the door twice.<<endif>>\\n\\n\"Hello visitor: my name is Sal.\"\\n\\n<<if $absent is true>>\"Uhm, hello Sal, do you know where I am?\"\\n\\n\"You are deep in the North Woods, outside the Center for Nominal Reassignment (CNR.) Do you have an appointment?\"\\n\\nThe CNR? You're looking for your name, and this is the Center for names! You've ended up precisely where you need to be.\\n\\n\"... I think so. I don't remember my code, though.\"\\n\\n\"Hmm. Do you remember your Previous Proper/Formal Name?\"\\n\\n\"... No.\"\\n\\n\"Okay. That is unfortunate, but there is [[another way]] of ascertaining your appointment code.\"<<else>>\"Hello, Sal. I have an appointment at the CNR.\"\\n\\n\"Okay, great! What is your appointment code?\"\\n\\nYou have a card in your wallet. \"CC44EXE-UNT.\"\\n\\nA moment. \"Your code has been confirmed! Please [[proceed]] to the lifts.\"<<endif>>",
      "links": [
        {
          "text": "another way",
          "destination": {
            "name": "another way",
            "pid": 99
          }
        },
        {
          "text": "proceed",
          "destination": {
            "name": "proceed",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 21,
      "name": "on Starbird Road",
      "text": "Your friend Herakles lived on Starbird Road with his three maiden aunts. They were always baking when you came over, these queer pastries you weren't allowed to eat. You realized only in hindsight that they sold edibles to make ends meet.\\n\\nYour main bond was an obsession with a trading card game. You two spent every hour and dollar you could building decks to pit against each other. When they moved away in a sudden summer, he wordlessly gave you his cards. You knew no-one else who played.\\n\\n\\n  ",
      "links": []
    },
    {
      "pid": 22,
      "name": "Edit View Story Build",
      "text": "We wait.\\n\\nI drum my fingers against an armrest. You don't say anything, but the way you start to hold yourself tells me it annoys you. I stop. I'm just nervous, is all. I worry we might sit here forever.\\n\\nThe buzzhum of the air-conditioning unit is not as monotonous as it first appears. Given time, its pitch and timbre undergo a slow, subtle fluctuation. It's got a long period, but it does repeat. I don't wear a watch; I try to time the period by my pulse. Assuming my heartbeat's 75 bpm, give or take, the AC unit's period is about four minutes. I'm not technically-minded, so I've no idea how or why that would be the case. I'm writing it down anyway.\\n\\n--/--\\n\\nWe wait.\\n\\nYou've noticed the pen on the floor five paces from the lift buttons. You don't go to pick it up; you only consider it. Whose pen? Not a CNR worker, of course: they'd keep their pens at their desks or in some communal cache. Some petitioner, then: some nameless sap come to rejoin society. You picture a man with an anxious disposition -- it's a cheap ballpoint whose cap's been gnawed beyond all recognition.\\n\\nI see now you're worried too, not for yourself but for this man you've never met, this man who's mostly made up out of your imagination. You don't suppose things went well for him down there. They chewed him up and spat out a productive-enough citizen. The thought disgusts you. \\n\\nEven now you won't think of yourself. You leave that to me. This isn't an accusation, this is just to say: it wears me down, it does, thinking of what They might do to you. You know that. You won't speak of it, you won't say anything. You're ashamed. Of me? Of yourself? Of this bullshit town, this bullshit country? Of some fairy you thought would wave Her wand and make it all right? No, [[I'm not angry]], I'm just-- well, maybe I am. Fuck, I don't know, I don't. I'm sorry.",
      "links": [
        {
          "text": "I'm not angry",
          "destination": {
            "name": "I'm not angry",
            "pid": 31
          }
        }
      ]
    },
    {
      "pid": 23,
      "name": "dunes_pre3",
      "text": "<<if $dunetruth is 4>>\"Oh!\" You have spent a long while by the fire glowing, crackling, flickering, flaring. \"Oh, now I know.\"\\n\\n\"Oh?\" The woman turns to you slowly. \"What, then.\"\\n\\n\"I am a bird that's been plucked: a featherless biped. I have hidden my beak out of shame but still it is still there-- I can't change that.\"\\n\\nShe seems to understand. \"Yes, I suppose you are. A beautiful bird, then: your skin's fine without feathers. You sit next to me and you sing sweet smoke, and isn't that something?\" Her eyes are so bright -- you start to cry.\\n\\nYou do not know her, so you do not want to her to hold you, so she does not hold you. Still, she holds herself in such a way that you know she would hold you if you wanted her to.\\n\\n[[You sit together in silence.|dunes_pre4]]<<elseif $dunetruth is 3>>\"I'm not real.\" Why did you say that? Fuck. She will think you are weird; she will know not to like you. Oh well.\\n\\nShe nods. She smiles small. \"Okay.\"\\n\\n\"I mean, I don't mean I don't exist, nothing like that, I just mean-- I have no body, no solid substance. I'm only an idea, okay, in people's heads? Like they see me, they know who I am and we talk and it's great. Then they go and I'm gone again.\"\\n\\n\"I see.\" This is the same non-responsive, affirmative bullshit that one therapist pulled. It is much more convincing with you sitting in the chill sand, somehow.\\n\\n\"Umm, doesn't that bother you? Don't you want to talk with a real person?\"\\n\\n\"Reality is overrated.\" You smile in spite of yourself. A hippie like her //would// spout that shit-- she says it without a hint of self-consciousness. And of course, you agree: reality is overrated.\\n\\n\"So I shouldn't even bother then. Forsake reality, live out on the dunes, is that it? What's your story, anyway?\"\\n\\nMary grins. \"Glad you asked.\" A pause. \"I will need some accompaniment, however. Sail!\" \\n\\nShe taps the third person's shoulder, light. They stir as if never asleep to begin with. [[\"Yes?\"|dunes_pre4]]<<elseif $dunetruth is 2>>\"I don't know. I came out here to be alone, I guess, to think.\"\\n\\n\"Sorry we spoiled that for you, dear. Well, at least you can still think!\"\\n\\nA joke: you give her a thin smile. You find it hard to think even with only a few people around. What you are thinking gets mixed up with what you think they are thinking, and then when they say something you have a whole other hassle. Easier alone.\\n\\nMary takes a quick hit from the pipe and looks to you. “If you’d like to stay, stay; if you’d like to go, go. Plenty of room to be alone out here, though you should watch where you step-- but of course you know that!” \\n\\nShe coughs. “Certain thoughts... they’re hard as hell to speak, but they’re hell ten times over to keep quiet, y’know? I’ve had my share of those. If you want to talk I’ll listen, I won’t tell you how to feel about it. If you just want to sit a while, that’s fine too.”\\n\\n[[Spill|dunes_pre3][$dunetruth = 2]]\\n[[I should go|back2walk]]<<else>>“What’s the deal with the flag over there?”\\n\\nShe seems not to mind you avoiding her question. “It’s the flag of our country, Aerea. Had it made special at a spot up in Round District.”\\n\\n“I’ve never heard of a place called Aerea.”\\n\\n“That’s because it’s not a place! Aerea is a wandering country: we control no territory.”\\n\\n“So it’s just something you made up?”\\n\\n“Well now, all countries are something someone made up. Aerea is no different in that way, even if it’s younger than most.”\\n\\n“I guess.” Then, “So how many citizens do you have?”\\n\\n“Just us two for now, Sail and me.” You glance at Jackson. “Him, he’s an immigrant for the time being. Isn’t well enough yet to decide whether to naturalize or not.”\\n\\n“An immigrant? Does that mean I’m an immigrant too-- or maybe just a tourist?”\\n\\nShe smiles, shakes her head. “No, as I said, Aerea has no borders. Just being near us doesn’t mean you’ve entered the country.” Huh.\\n\\n“So, us talking is more like a diplomatic exchange, then?”\\n\\n“Ha! Well, I don’t know about you, but I’m speaking on behalf of myself, not my country. So I’d just call this a conversation.”\\n\\n“I guess I don’t really get the point of it all. Why call yourselves a country, why not just be two people?”\\n\\n“Sail would be able to explain better than I-- it was her idea. She says it’s the custom where she’s from. Here, I’ll see about bringing her back to us.”\\n\\nMary taps Sail’s shoulder gently. Sail’s eyes open, showing no sign of shaking off sleep. [[“Yes?”|dunes_pre4]]<<endif>>",
      "links": [
        {
          "text": "You sit together in silence.",
          "destination": {
            "name": "dunes_pre4",
            "pid": 27
          }
        },
        {
          "text": "\"Yes?\"",
          "destination": {
            "name": "dunes_pre4",
            "pid": 27
          }
        },
        {
          "text": "Spill",
          "destination": {
            "name": "dunes_pre3",
            "pid": 23
          }
        },
        {
          "text": "I should go",
          "destination": {
            "name": "back2walk",
            "pid": 95
          }
        },
        {
          "text": "“Yes?”",
          "destination": {
            "name": "dunes_pre4",
            "pid": 27
          }
        }
      ]
    },
    {
      "pid": 24,
      "name": "StoryTitle",
      "text": "A Trial",
      "links": []
    },
    {
      "pid": 25,
      "name": "east",
      "text": "You come across some small statutes almost at once.\\n----\\nTPC § 21.06/%Lawrence v. Texas%/\\n<<if $attribution is \"house\">>@@.Q;a) No lot enforcement official or agency of this district or a county, city, town or other political subdivision of this district may obstruct the free and fair subrogation of one party for another in the circumstance of a life debt.@@<<else>>a) No lot enforcement official or agency of this district or a county, city, town or other political subdivision of this district may obstruct the free and fair subrogation of one party for another in the circumstance of a life debt.<<endif>>\\n- - -\\n<<if $attribution is \"carson\">>@@.Q;\"The man who is caught / stealing during a fire shall be thrown into the fire.\"@@<<else>>\"The man who is caught / stealing during a fire shall be thrown into the fire.\"<<endif>> \\n- - -\\nWhereby, the ever-wise and august sovereign proclaims that whosoever draws sustenance from the bounty of Nature, which the Most Benevolent One has seen fit to entrust in his (the just and sagacious sovereign's) care, shall assemble in the center of the earth on the first day of the third month with every able-bodied member of his household.\\n- - -\\n<<if $attribution is \"chess\">>@@.Q;4.5\\nIf none of the pieces touched can be moved or captured, the player may make any legal move.@@<<else>>4.5\\nIf none of the pieces touched can be moved or captured, the player may make any legal move.<<endif>>\\n----\\n[[You turn the corner.|Natural Law]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "You turn the corner.",
          "destination": {
            "name": "Natural Law",
            "pid": 104
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 26,
      "name": "Present",
      "text": "You have to go apply for a new name. It is a trial to be sure: you have no way around it. Your old name was declared invalid a few months ago./%obsolete, expired, deleted, marked%/ Until you secure a new name, you are in a tough spot: namelessness is much misunderstood.\\n\\nThe Center for Nominal Reassignment (CNR) is off in a remote location. You [[walk]] into the North Woods for a few miles until you come to a door. They buzz you in; you make your way through the remains of an earlier Center. Last are the lifts: you can expect a long wait.",
      "links": [
        {
          "text": "walk",
          "destination": {
            "name": "walk",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 27,
      "name": "dunes_pre4",
      "text": "<<if $dunetruth is 4>>You sit until you can hear the dunes digesting, and then you sit until you cannot hear them anymore. This is not the first time you have settled into silence with someone, nor the twenty-fifth time, but [[this|dunes_pre3][$dunetruth = 3]] //is// better than most.<<else>>\\n“Sail, this is-- well, she’d like to know more about us, <<if $dunetruth is 3>>about why we’re here.<<else>>about Aerea.<<endif>> I thought you could help explain better, tell how we met.”\\n\\n“We met in the forest. You were searching.” They speak in slow, even tones.\\n\\nMary to you: “I’m a mushroom hunter, y'know, always have been.”\\n\\n“Searching for mushrooms, yes, and also for a way forward. You were lost.” A pause. “I was not lost, as I was not looking for anything -- I had been alone a long time in the forest. I met you and knew it was time to leave. I went with you.”\\n\\n“Sail didn’t speak at first-- I thought she maybe forgot, being in the woods so long. But she listened and understood, and I was happy to fill the silence myself.”\\n\\n“I did not speak any English when we first met-- or any earthly tongue. However, you can tell much just from another’s tones and movements, so I did gather bits and pieces. In time, the language came to me.”\\n\\n“We’d been traveling together a couple months when Sail told me her name. She said she’d come here from far away, across the stars.”\\n\\nYou: “Across the stars?”\\n\\nSail: “Yes, another world. Like you, it has no name. Like you, it is young, even younger: it is reborn every year. I came here with my old country, twelve in all.”\\n\\n“When you say ‘country’...”\\n\\n“The word is not a perfect match for what I mean, only the closest I know of. Most countries do not have borders; most are small, two to two hundred. But like here, you are only in one country at once, though there are disputes. You share proximity, common language and currency, often a flag, most always a constitution. Most are born into one country or another. Almost all stay in that same country until they die.”\\n\\n“Does everyone have a country?”\\n\\nA long pause. “Not everyone, but most everyone.” Another pause. “You ought not worry yourself. I believe you will find your country in good time.”\\n\\n“Mmm.” You are not so sure. “What happened to your old country?”\\n\\n“On my world, countries do not dissolve as easily as they do here. We war, as you do, out of pride or fear, but never with the intent of total destruction. Irreparable divides do arise within countries, usually in response to some extraordinary new circumstance. Coming to your world proved to be just such a circumstance. I have not seen any of them since.”\\n\\nYou let that sit a while. Then, “You don’t look any different from us.” Sail is uncommonly poised, but otherwise unremarkable. “Why is that?”\\n\\n“That I cannot tell you.”\\n\\n\"Do you have any proof that you are from another world?\"\\n\\n\"Nothing that would convince someone whose mind is closed to the possibility.\" Right.\\n\\nSail is either conducting a wildly elaborate con or in the grip of an all-encompassing delusion. You do not much mind either way: if the former, you have nothing worth stealing, and if the latter, you have had a few of those yourself. Their tale is harmless regardless.\\n\\n\"So you two met in the forest, founded a new country,\" gesturing to the flag, \"and came to these dunes. [[Why?|dunes_pre5]]\"<<endif>>",
      "links": [
        {
          "text": "this",
          "destination": {
            "name": "dunes_pre3",
            "pid": 23
          }
        },
        {
          "text": "Why?",
          "destination": {
            "name": "dunes_pre5",
            "pid": 130
          }
        }
      ]
    },
    {
      "pid": 28,
      "name": "CPDformContact",
      "text": "Pg. 6: Contact\\n\\nHome Number: (###) ###-####\\nCell Number: (###) ###-####\\nPage Number: (###) ###-####\\nBloc Number: (###) ###-####\\n\\nRoom Number: [###]\\nStrt Number: [###]\\nSqre Number: [###][###][###]\\n\\nTown Number: ##-###-#####\\nDist Number: ########\\n\\nName Number: N/A\\n\\n[[(And so on.)|CPDformDreams]]",
      "links": [
        {
          "text": "(And so on.)",
          "destination": {
            "name": "CPDformDreams",
            "pid": 94
          }
        }
      ]
    },
    {
      "pid": 29,
      "name": "pushdogs",
      "text": "The Emperor, so a parable runs, has sent a message to you, the humble subject, the insignificant shadow cowering in the remotest distance before the imperial sun; the Emperor from his deathbed has sent a message to you alone. He has commanded the messenger to kneel down by the bed, and has whispered the message to him; so much store did he lay on it that he ordered the messenger to whisper it back into his ear again. Then by a nod of his head he has confirmed that it is right. Yes, before the assembled spectators of his death--all the obstructing walls have been broken down, and on the spacious and loftily mounting open staircases stand in a ring the great princes of the Empire--before all these he has delivered his message. \\n\\nThe messenger immediately sets out on his journey; a powerful, an indefatigable man; now pushing with his right arm, now with his left, he cleaves a way for himself through the throng; if he encounters resistance he points to his breast, where the symbol of the sun glitters; the way is made easier for him than it would be for any other man. But the multitudes are so vast; their numbers have no end. If he could reach the open fields how fast he would fly, and soon doubtless you would hear the welcome hammering of his fists on your door. \\n\\nBut instead how vainly does he wear out his strength; still he is only making his way through the chambers of the innermost palace; never will he get to the end of them; and if he succeeded in that nothing would be gained; he must next fight his way down the stair; and if he succeeded in that nothing would be gained; the courts would still have to be crossed; and after the courts the second outer palace; and once more stairs and courts; and once more another palace; and so on for thousands of years; and if at last he should burst through the outermost gate--but never, never can that happen--the imperial capital would lie before him, the center of the world, crammed to bursting with its own sediment. Nobody could fight his way through here even with a message from a dead man. But you sit at your window when evening falls and dream it to yourself.\\n\\nKafka, An Imperial Message (trans. Willa and Edwin Muir)",
      "links": []
    },
    {
      "pid": 30,
      "name": "basement",
      "text": "<<if $keys is false>>You know you'd better fetch your keys and [[hurry|hallway][$inthishouse = true]] out before your name slips away. <<if $inthishouse is false>>In this house you often feel you've stepped outside of time. Who knows, maybe you'll find something you've forgotten in one of the other rooms.<<endif>>\\n\\n<<endif>>The basement is a nest of cardboard boxes. They've an integrity only attained by swearing off all human contact. They don't mind you being here: they don't consider you human.\\n\\nEverything you've ever hidden is down here. A special [[chest]] -- a shoddy chest, you made it in wood shop at age twelve -- is back behind some boxes of old forms.",
      "links": [
        {
          "text": "hurry",
          "destination": {
            "name": "hallway",
            "pid": 153
          }
        },
        {
          "text": "chest",
          "destination": {
            "name": "chest",
            "pid": 151
          }
        }
      ]
    },
    {
      "pid": 31,
      "name": "I'm not angry",
      "text": "We wait.\\n\\nWe wait.\\n\\nWe wait.\\n\\nWe wait..\\n\\nWe wait.\\n\\nWe wait.\\n\\n--/--\\n\\nThe lift arrives. We hug, we say goodbye.\\n\\nBye then.\\n<<if $then_ending is false>><<remember $endings += 1>><<remember $then_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|nothingtosay4]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "nothingtosay4",
            "pid": 80
          }
        }
      ]
    },
    {
      "pid": 32,
      "name": "walk",
      "text": "<<if $note is 0>><<if $dunes is 0>>You <<if $absent is true>>slip out<<else>>head out<<endif>> the back. The dry cold creeps into your sinuses. <<endif>><<endif>><<if $absent is true>><<if $late is false>>Still early: most people aren't up yet. You've got a long way to walk.<<else>>The sun tells you it's noon now. Almost everyone's up if not out; you might run into any enemy around a corner. You'll keep your eyes low and go ahead.<<endif>><<else>><<if $late is false>>Still early: most people are not yet up. You have a long way to walk.<<else>>It is noon now: not ideal. You know where not to go, so you should be okay. You never know.<<endif>><<endif>>\\n\\n<<if $absent is true>>You might go [[north]] past that one puzzling hole in the ground. Not much else up that way, however. Slightly north by north[[east]] there's the Center for Library Studies (CLS); you'll pass a fair few statutes heading that way. To the [[south][$dunes = true]] are the dunes. Your house isn't four blocks away -- you can reach them in no time. They're said to be treacherous this time of year. West of here's the Center for Sanitary Living (CSL). You won't go there.<<else>>You could go [[north]] past that one puzzling hole in the ground. Not much else of interest up that way, however. Slightly north by north[[east]] is the Center for Library Studies (CLS); you will pass a fair few statutes heading that way. To the [[south][$dunes = true]] are the dunes. Your house is not four blocks away -- you can reach them in no time. They are said to be treacherous this time of year. West of here is the Center for Sanitary Living (CSL). You will not be going there.<<endif>>\\n\\n<<if $absent is true>>The way to your name's neither her- nor their nor -- no, that isn't right.<<else>>The CNR is far north of here, well into the woods: either way will do.<<endif>><<if $note is 0>>\\n\\nYou hold a [[NOTE:]] in your <<if $absent is true>>left<<else>>right<<endif>> hand.<<endif>>",
      "links": [
        {
          "text": "north",
          "destination": {
            "name": "north",
            "pid": 116
          }
        },
        {
          "text": "east",
          "destination": {
            "name": "east",
            "pid": 25
          }
        },
        {
          "text": "south",
          "destination": {
            "name": "south",
            "pid": 88
          }
        },
        {
          "text": "NOTE:",
          "destination": {
            "name": "NOTE:",
            "pid": 74
          }
        }
      ]
    },
    {
      "pid": 33,
      "name": "CPDformDream",
      "text": "You dream.\\n\\nYou are running down a long hallway. No, you are running the wrong way. You turn to a door. You have the key, drop it, where is it? You go on running across the lobby, outside into the street. So crowded: you cannot run, you wade. Not fish-people, but they are all submerged. Everything is rote, written, rotten, reddening.\\n\\nYou bump into your brother: he is so happy! He has his arm around the one he loves. He loves you too, he does, but he loves her more. That is as it should be. He sneezes.\\n\\nYou hear the gears seize up, shudder-stop. \\n\\n[[You wake.|CPDformWake]]",
      "links": [
        {
          "text": "You wake.",
          "destination": {
            "name": "CPDformWake",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 34,
      "name": "dunes_pre",
      "text": "Ten minutes in, you top the crest of a dune and stumble upon a large flag laid on the sand. An unfamiliar design: an asterisk inside a circle inside a triangle, all in blue over a white background. \\n\\nA few yards away is a campsite: two tents, three people sitting around a fire. Two of them face away from you; the third sees you and startles. \"Are, are you...?\" He shakes his head and falls silent, returns to the fire.\\n\\nOne of the other two turns toward you. \"Ah, hello there!\" She has long gray hair and a smile that seems genuine. \"Come on over if you like, plenty of room around the fire.\"\\n\\nYou approach with some hesitance. The man is clearly uneasy about your appearance: a familiar reaction. You often unnerve people just by being near. It is tiring.\\n\\nThe woman sees you eyeing him and waves her hand dismissively. \"Oh, don't mind Jackson! Poor bastard smoked too much pot: he'll settle down soon enough.\" She holds up the glass pipe in her hand, as if noticing it for the first time. \"Speaking of which, would you like some? Pure mellow in moderation, don't you worry. Grew it myself!\"\\n\\n- [[Hell yes|dunes_pre2][$smoke = 1]]\\n- [[Um, sure|dunes_pre2][$smoke = 2]]\\n- [[No thanks|dunes_pre2][$smoke = false]]\\n- [[I should go|back2walk]]",
      "links": [
        {
          "text": "Hell yes",
          "destination": {
            "name": "dunes_pre2",
            "pid": 9
          }
        },
        {
          "text": "Um, sure",
          "destination": {
            "name": "dunes_pre2",
            "pid": 9
          }
        },
        {
          "text": "No thanks",
          "destination": {
            "name": "dunes_pre2",
            "pid": 9
          }
        },
        {
          "text": "I should go",
          "destination": {
            "name": "back2walk",
            "pid": 95
          }
        }
      ]
    },
    {
      "pid": 35,
      "name": "doorway_next",
      "text": "<<if $doorway is false>>You don't see any good choices here. [[You turn and go back.|answer][$none = true]]<<else>><<if $doorway is 3>>The plane is so high| now diving now rising|| If you could only find some plain somewhere| someplace straight and flat| you’d be free your heart light your head clear||| please lordhavemercy\\n\\nYou are made immobile, picked apart and painstakingly rendered into a delicious slurry. You will feed this creature for the next four years, five tops.\\n<<if $door3_ending is false>><<remember $endings += 1>><<remember $door3_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|doorway]]<<endif>><<elseif $doorway is 2>>You jump up to pull the skein loose. The first corner, the next, the next, the last. Yes, the yarn will burn but surely, surely it can last long enough to smother the fire first?\\n\\nOr smother you first: because yarn burning is not unlike every hair in your nose, every hair on your tongue burning, ear hairs, eye hairs burning, all burning. Burning-burnt.\\n\\nYou are made immobile, picked apart and painstakingly rendered into a delicious slurry. You will feed this creature for the next four years, five tops.\\n<<if $door2_ending is false>><<remember $endings += 1>><<remember $door2_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|doorway]]<<endif>><<else>>This fire is fickle, yet you imagine you can command it. You are so proud, such a loudmouth: SHUT UP. Nobody can hear you in here.\\n\\nYou are made immobile, picked apart and painstakingly rendered into a delicious slurry. You will feed this creature for the next four years, five tops.\\n<<if $door1_ending is false>><<remember $endings += 1>><<remember $door1_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|doorway]]<<endif>><<endif>><<endif>>\\n",
      "links": [
        {
          "text": "You turn and go back.",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "doorway",
            "pid": 82
          }
        }
      ]
    },
    {
      "pid": 36,
      "name": "CPDformYes",
      "text": "You go back and revise the Dreams page. To your dismay, you discover another page you have not yet filled out.\\n\\nPg. ??: Histories\\n\\n<<if $attribution is false>>//--so that human achievements may not be forgotten in time, and great and marvellous deeds -- some displayed by Greeks, some by barbarians -- may not be without their glory; and especially to show// why the two peoples fought with each other.<<else>>@@.Q;--so that human achievements may not be forgotten in time, and great and marvellous deeds -- some displayed by Greeks, some by barbarians -- may not be without their glory; and especially to show why the two peoples fought with each other.@@<<endif>>\\n\\nWhy did you spurn him?\\n\\na) I was not there.\\nb) [[He did not know me,|CPDformYes2]]\\nc) what I truly was: it\\nd) would have turned him\\ne) to a fist of stone.<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "He did not know me,",
          "destination": {
            "name": "CPDformYes2",
            "pid": 49
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 37,
      "name": "brother",
      "text": "<<if $brother is 0>>The first is an arrogant innocent, knowing nothing but himself and trusting nothing, not even himself. He is an only one.\\n\\nThe first brother is not much of a brother at all. He does not muscle his way to the top spot: he muzzles his obstacles. His surroundings must be completely silent before he will speak up.\\n\\nHe has this to say to you: <<if $attribution is false>>\"You think you know who you are, what's to come. You haven't even begun.\"<<else>>@@.Q;\"You think you know who you are, what's to come. You haven't even begun.\"@@<<endif>>/%Buffy, Restless%/\\n\\nYou answer him: \"You are a murderer and a thief.\" Not strictly speaking true, but [[he has nothing to say in return|nothingtosay3]].<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>><<elseif $brother is 1>>The second is an inconvenient unit of time. You can count it out and you do not. What does that say about you?\\n\\nThe second son is cursed with curls. He has no recourse; he has to confront them in the mirror each day. He has a voice like a monk in some '60s movie. What a guy.\\n\\nHe has this to say to you: \"I will love you no matter what.\"\\n\\nYou answer him: \"Umm...\" and you cry like the sentimental dork that you are. [[He has nothing to say in return|nothingtosay3]]. He returns an almost-not-awkward hug before you leave.<<else>>The third is the most balanced portion there is. Also the hardest to achieve. See for yourself: go and cut something into thirds right now. No? Thought so.\\n\\nThe third son is a balancing act. Two torches, three knives and a couple dozen chainsaws. Nothing gets past him. Nothing leaves him, either.\\n\\nHe has this to say to you: \"I see you, B.\"\\n\\nYou answer him: \"Word.\"/%Logos%/ [[He has nothing to say in return|nothingtosay3]].<<endif>>",
      "links": [
        {
          "text": "he has nothing to say in return",
          "destination": {
            "name": "nothingtosay3",
            "pid": 76
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        },
        {
          "text": "He has nothing to say in return",
          "destination": {
            "name": "nothingtosay3",
            "pid": 76
          }
        }
      ]
    },
    {
      "pid": 38,
      "name": "her_painting",
      "text": "<<if $attribution is false>>A plaque at the bottom of the frame: \"My Last Duchess.\"/%Robert Browning%/ It's signed by Frà Pandolf.<<else>>A plaque at the bottom of the frame: \"@@.Q;My Last Duchess@@.\" It's signed by @@.Q;Frà Pandolf@@.<<endif>>\\n\\n- [[Turn away|her]]\\n- [[Look on|her_look]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "Turn away",
          "destination": {
            "name": "her",
            "pid": 106
          }
        },
        {
          "text": "Look on",
          "destination": {
            "name": "her_look",
            "pid": 162
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 39,
      "name": "LOOM WIFE",
      "text": "LOOM WIFE\\n\\nLOOM OVER\\nLOOM WEAVER\\nLOOM LOVER\\nLOOM\\n\\nWIFE LOON\\nWIFE ROOM(S)\\nWIFE TUNE\\nWIFE\\n\\nLOW LIFE HER\\nROW OUT LIKE\\nWOMEN LIME R\\nENTOMBED CON\\n\\nWWWW .W. WW=\\nLLLLLLLLL..L\\nL.L.L.L.L.L.\\nW......LW.LW",
      "links": []
    },
    {
      "pid": 40,
      "name": "skipskipskipskipskipskip",
      "text": "[[Thank you.|answer]]",
      "links": [
        {
          "text": "Thank you.",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        }
      ]
    },
    {
      "pid": 41,
      "name": "No thanks",
      "text": "You'd rather I wasn't around. No, I get it, I do. I'll go. No big deal.\\n\\nJust— give me a call maybe, let me how it goes? Thanks! And good luck, don't let Them mess you up— okay, okay, I'm gone.\\n\\nBye.\\n<<if $bye_ending is false>><<remember $endings += 1>><<remember $bye_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|nothingtosay4]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "nothingtosay4",
            "pid": 80
          }
        }
      ]
    },
    {
      "pid": 42,
      "name": "inside",
      "text": "The house is still. The others are out. They're far away most of the day -- it's usually [[dark|hallway]] when you see them.\\n\\nThey're worried about you; they don't know what to say to you. You don't know what they could say. They believe in you. That's something.",
      "links": [
        {
          "text": "dark",
          "destination": {
            "name": "hallway",
            "pid": 153
          }
        }
      ]
    },
    {
      "pid": 43,
      "name": "mapnext",
      "text": "\"<<if $attribution is false>>Atticus pushed his glasses to his forehead; they slipped down, and he dropped them in the street. In the silence, I heard them crack. Atticus rubbed his eyes and chin; we saw him blink hard.<<else>>@@.Q;Atticus pushed his glasses to his forehead; they slipped down, and he dropped them in the street. In the silence, I heard them crack. Atticus rubbed his eyes and chin; we saw him blink hard.@@<<endif>>\"/%Harper Lee, To Kill A Mockingbird%/\\n\\na) [[In front of the Radley gate--what was left of his mind.|mapnext2]]\\nb) [[We saw his body go rigid.|mapnext2]]\\nc) [[We saw his body go.|mapnext2]]\\nd) [[He stopped (( (( (( the dog, squatted, turned (( (( tapped his finger (( his forehead (( his (( eye.|mapnext2]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "In front of the Radley gate--what was left of his mind.",
          "destination": {
            "name": "mapnext2",
            "pid": 140
          }
        },
        {
          "text": "We saw his body go rigid.",
          "destination": {
            "name": "mapnext2",
            "pid": 140
          }
        },
        {
          "text": "We saw his body go.",
          "destination": {
            "name": "mapnext2",
            "pid": 140
          }
        },
        {
          "text": "He stopped (( (( (( the dog, squatted, turned (( (( tapped his finger (( his forehead (( his (( eye.",
          "destination": {
            "name": "mapnext2",
            "pid": 140
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 44,
      "name": "postCLS",
      "text": "North of the CLS, downtown dissolves into featureless parcels. You pass a few more statutes on the way.\\n----\\nThere is no truer love than the love of the First Citizen for his country. Anyone who suggests otherwise will be taken to Freedom Square and hanged from the neck until dead.\\n- - -\\n<<if $attribution is false>>Do not fly near or over sensitive infrastructure or property such as power stations, water treatment facilities, correctional facilities, heavily traveled roadways, government facilities, etc.<<else>>@@.Q;Do not fly near or over sensitive infrastructure or property such as power stations, water treatment facilities, correctional facilities, heavily traveled roadways, government facilities, etc.@@<<endif>>/%knowbeforeyoufly.org Brochure%/, unless such a flight path is necessary to the preservation of human life.\\n- - -\\nSection 42\\nA) All individuals (see Section 36.J above) or corporate entities (see Section 36.K above) classified as 'dental arbitrageurs' (see Sections 38.A-L above) by the aforementioned investigation (see Sections 30-38 above) to be given notice no later than the first day of Q3 20XX. \\nB) Said notice (see Section 42.A above) to include a request for documents (see Sections 44.A-N below) relevant to an audit concerning 'dental commerce' (see Sections 38.A-L above) with a deadline of the first day of Q4 20XX. \\nC) Any 'dental arbitrageur' (see Sections 38.A-L above) failing to provide the requested documents (see Sections 44.A-N below) to be assigned an appropriate penalty (see Sections 46.A-O below.) \\nD) Notice of said penalty (see Sections 46.A-O below) to be sent out no later than the first day of Q1 20XY.\\n----\\n[[You turn the corner.|outskirts]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "You turn the corner.",
          "destination": {
            "name": "outskirts",
            "pid": 165
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 45,
      "name": "red_yes",
      "text": "The Forbidding Caves follow a geometry all their own. Upon entering, you can immediately [[step back|red_next]] and find yourself in another part of the Caves.\\n\\nBut who knows where you'd end up? It may well be better to [[press forward|red_next]], [[head right|red_next]], or [[turn left|red_next]].\\n\\nYou've never made much progress in the Caves; you're too proud to consult a strategy guide. Any direction is as good as any other.",
      "links": [
        {
          "text": "step back",
          "destination": {
            "name": "red_next",
            "pid": 69
          }
        },
        {
          "text": "press forward",
          "destination": {
            "name": "red_next",
            "pid": 69
          }
        },
        {
          "text": "head right",
          "destination": {
            "name": "red_next",
            "pid": 69
          }
        },
        {
          "text": "turn left",
          "destination": {
            "name": "red_next",
            "pid": 69
          }
        }
      ]
    },
    {
      "pid": 46,
      "name": "Absent",
      "text": "You've lost your name. You think it's been stolen: in fact you're sure of it. There's a name that everybody called you, but it's not the right one. They took your name from you -- They swapped it out for a fake when you weren't looking. You threw that one in the sewer. Your true name's loose out there.\\n\\nYou don't feel well without it. You can't look at yourself: you can't find your eyes. You don't eat much and you sleep when the moon is perfect. You don't see the sun unless you must. People know at a glance that you've lost your name. They laugh at how pathetic you are after you've gone; to your face they're almost polite.\\n\\nYou need to [[walk]] for a while and find your name. It'll be a trial: you've no way around it.",
      "links": [
        {
          "text": "walk",
          "destination": {
            "name": "walk",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 47,
      "name": "dunes_ab02",
      "text": "@@font-family: monospace;I have an eye but cannot blink,\\nI have a nose but cannot snort,\\nI have a mouth but cannot sour,\\nI have a throat but cannot die,\\nI have a collar but cannot tie,\\nI have a breast but cannot yet,\\nI have a bone but cannot crown,\\nI have an elbow but cannot lie,\\nI have a section but cannot so,\\nI have a trail but cannot send,\\nI have a mule but cannot flout,\\nI have an ilk but cannot crimp,\\nI have a constitution but cann,\\nI have a sole but cannot now c,\\nI have an island but cannot . ,\\nI have everything I could ever,\\nI have a hymnal wordless and w,\\nWhat am I?@@\\n\\n1) [[A lie|answer]]\\n2) [[A decent try|answer]]\\n3) [[A man now a fly|answer]]\\n4) [[A freely given smi|answer]]\\n5) [[All of the above|answer]]\\n\\n[[Skip to the next question.|skip]]",
      "links": [
        {
          "text": "A lie",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "A decent try",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "A man now a fly",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "A freely given smi",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "All of the above",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "Skip to the next question.",
          "destination": {
            "name": "skip",
            "pid": 3
          }
        }
      ]
    },
    {
      "pid": 48,
      "name": "CPDformYes3",
      "text": "The pages keep going.\\n\\nPg. ??: Owls\\n\\nMULE ESSENCE\\nBIRD BOTH\\nAN ABRUPT TRANSITION\\nTHE PAGES KEEP GOING\\n<<if $page_ending is false>><<remember $endings += 1>><<remember $page_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|CPDformWake]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "CPDformWake",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 49,
      "name": "CPDformYes2",
      "text": "You try to close the form. Instead you stumble across another unanswered question.\\n\\nPg. ??: <<if $attribution is false>>Objects\\n\\nGLAZED GLITTER.<<else>>@@.Q;Objects\\n\\nGLAZED GLITTER.@@<<endif>>\\n\\nI thought you had my back\\nI thought you knew how to keep us safe\\nI thought you felt the same\\n[[I thought you I thought you|CPDformYes3]]\\nI thought you knelt before the threshold<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "I thought you I thought you",
          "destination": {
            "name": "CPDformYes3",
            "pid": 48
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 50,
      "name": "dunes_yesyes",
      "text": "You: \"No, I need to be here.\"\\n\\nSail: \"You are here.\" Their hand is neither warm nor cold. It is, unnervingly, the exact same temperature as your own. Sail may not be an alien; they //are// a serious weirdo. They are very much in love -- that is what drew you to them in the first place. \\n\\nYou will fuck Jackson sometime later: he will not know what to do with you. You will talk it over and he still will not know. Then he will leave and that will be that.\\n\\nYou never were of this earth, were you?\\n<<if $earth_ending is false>><<remember $endings += 1>><<remember $earth_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|dunes_yes]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "dunes_yes",
            "pid": 67
          }
        }
      ]
    },
    {
      "pid": 51,
      "name": "presentlifts03",
      "text": "Oh: that must be the lift. Our time is up-- for now, only for now. Good luck!\\n\\nLook, just, um. Keep to yourself? You know who you are: all They have is a quiz and a few cheap tricks. Do not let Them get to you. \\n\\nOkay, bye! I love you.\\n<<if $love_ending is false>><<remember $endings += 1>><<remember $love_ending = true>><<endif>>\\n[[END|Start.]]",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 52,
      "name": "skipskipskipskipskip",
      "text": "<<if $attribution is false>>package //n.//\\n\\n<b>1</b> ^^o^^[[packet|answer]], ^^o^^parcel, ^^o^^box, container, ^^o^^case, carton, ^^o^^bundle\\n\\n<b>2</b> ^^o^^[[combination|answer]], ^^o^^unit, package deal\\n\\n--//v.//\\n\\n<b>3</b> ^^o^^[[wrap|answer]], ^^o^^pack, containerize, carton, ^^o^^case, encase, ^^o^^enclose, ^^o^^include, ^^o^^combine, ^^o^^unite, couple, ^^o^^incorporate\\n\\n[[Skip to the next question.|skipskipskipskipskipskip]]<<else>>@@.Q;package //n.//\\n\\n<b>1</b> ^^o^^[[packet|answer]], ^^o^^parcel, ^^o^^box, container, ^^o^^case, carton, ^^o^^bundle\\n\\n<b>2</b> ^^o^^[[combination|answer]], ^^o^^unit, package deal\\n\\n--//v.//\\n\\n<b>3</b> ^^o^^[[wrap|answer]], ^^o^^pack, containerize, carton, ^^o^^case, encase, ^^o^^enclose, ^^o^^include, ^^o^^combine, ^^o^^unite, couple, ^^o^^incorporate@@/%American Century Thesaurus%/\\n\\n[[Skip to the next question.|skipskipskipskipskipskip]]\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "packet",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "combination",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "wrap",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "Skip to the next question.",
          "destination": {
            "name": "skipskipskipskipskipskip",
            "pid": 40
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 53,
      "name": "dining room",
      "text": "<<if $keys is false>>You know you'd better fetch your keys and [[hurry|hallway][$inthishouse = true]] out before your name slips away. <<if $inthishouse is false>>In this house you often feel you've stepped outside of time. Who knows, maybe you'll find something you've forgotten in one of the other rooms.<<endif>>\\n\\n<<endif>>The dining room is a long <<if $table is false>>[[table]]<<else>>table<<endif>> and a set of chairs and a set of drawers. The chairs are well-ordered and <<if $drawers is false>>[[the drawers are in disarray|drawers]]. You've no time to set things right, but you might find something of use if you rummaged through them all.<<else>>the drawers are in disarray. You won't find anything useful by rummaging through them again.<<endif>>\\n\\nThe kitchen is to your left, but you aren't going there.",
      "links": [
        {
          "text": "hurry",
          "destination": {
            "name": "hallway",
            "pid": 153
          }
        },
        {
          "text": "table",
          "destination": {
            "name": "table",
            "pid": 101
          }
        },
        {
          "text": "the drawers are in disarray",
          "destination": {
            "name": "drawers",
            "pid": 81
          }
        }
      ]
    },
    {
      "pid": 54,
      "name": "presentlifts",
      "text": "A short story:\\n\\nOnce this one man missed everything. Everything flew over him.<<if $having_content is false>><<else>> He was a vanishing point: you never could see him, only calculate. This man. His name was Albert. He was a calm man; nothing ruffled him. He could slap you across the face and you would not say anything.\\n\\nAlbert was a statue because he took so long to make and he was not worth anything. He was a marble, a good thing to shoot but not nearly so good to talk to. You might think now I am too hard on him, but you have never been <<if $changing_content is false>>sunken<<else>>drunken<<endif>> crumbling in a bad place at a party with Albert. One other time he said he loved me, which is I think the third worst lie I have ever heard.\\n\\nOne day Albert left school. He did not come back, but he is there somewhere. He might have grown some since, but I doubt anyone has hit him back. He is dodgy.<<endif>>\\n\\nSorry that was sad. But [[you like sad stories|presentlifts02]], don't you?",
      "links": [
        {
          "text": "you like sad stories",
          "destination": {
            "name": "presentlifts02",
            "pid": 137
          }
        }
      ]
    },
    {
      "pid": 55,
      "name": "creatures",
      "text": "They read from the end of \"Autobiography of Red\" by Anne Carson, as you recall.\\n----\\n<<if $attribution is false>>I: One critic speaks of a sort of concealment drama going on in your work some special interest in finding out what or how people act when they know that important information is being witheld this might have to do with an aesthetic of blindness or even a will to blindness if that is not a tautology\\n\\nS: I will tell about blindness\\n\\nI: Yes do\\n\\nS: First I must tell about seeing\\n\\nI: Fine\\n\\nS: Up to 1907 I was seriously interested in seeing I studied and practiced it I enjoyed it\\n\\nI: 1907\\n\\nS: I will tell about 1907\\n\\nI: Please\\n\\nS: First I must tell about what I saw\\n\\nI: Okay\\n\\nS: Paintings completely covered the walls right up to the ceiling at the time the atelier was lit by gas fixtures and it glowed like a dogma but this is not what I saw\\n\\nI: No\\n\\nS: Naturally I saw what I saw\\n\\nI: Naturally\\n\\nS: I saw everything everyone saw\\n\\nI: Well yes\\n\\nS: No I mean everything everyone saw everyone saw because I saw it\\n\\nI: Did they\\n\\nS: I was (very simply) in charge of seeing for the world after all seeing is just a substance\\n\\nI: How do you know that\\n\\nS: I saw it\\n\\nI: Where\\n\\nS: Wherever I looked it poured out my eyes I was responsible for everyone's visibility it was a great pleasure it increased daily\\n\\nI: A pleasure you say<<else>>@@.Q;I: One critic speaks of a sort of concealment drama going on in your work some special interest in finding out what or how people act when they know that important information is being witheld this might have to do with an aesthetic of blindness or even a will to blindness if that is not a tautology\\n\\nS: I will tell about blindness\\n\\nI: Yes do\\n\\nS: First I must tell about seeing\\n\\nI: Fine\\n\\nS: Up to 1907 I was seriously interested in seeing I studied and practiced it I enjoyed it\\n\\nI: 1907\\n\\nS: I will tell about 1907\\n\\nI: Please\\n\\nS: First I must tell about what I saw\\n\\nI: Okay\\n\\nS: Paintings completely covered the walls right up to the ceiling at the time the atelier was lit by gas fixtures and it glowed like a dogma but this is not what I saw\\n\\nI: No\\n\\nS: Naturally I saw what I saw\\n\\nI: Naturally\\n\\nS: I saw everything everyone saw\\n\\nI: Well yes\\n\\nS: No I mean everything everyone saw everyone saw because I saw it\\n\\nI: Did they\\n\\nS: I was (very simply) in charge of seeing for the world after all seeing is just a substance\\n\\nI: How do you know that\\n\\nS: I saw it\\n\\nI: Where\\n\\nS: Wherever I looked it poured out my eyes I was responsible for everyone's visibility it was a great pleasure it increased daily\\n\\nI: A pleasure you say@@<<endif>>\\n----\\nThen you forget or you forgot to listen in the first place. You got off the couch and you went on to do a great many things.\\n\\nNow is [[no time|hallway]] for all that.<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "no time",
          "destination": {
            "name": "hallway",
            "pid": 153
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 56,
      "name": "afterword",
      "text": "//Utopias// afford consolation: although they have no real locality there is nevertheless a fantastic, untroubled region in which they are able to unfold; they open up cities with vast avenues, superbly planted gardens, countries where life is easy, even though the road to them is chimerical. //Heterotopias// are disturbing, probably because they secretly undermine language, because they make it impossible to name this //and// that, because they shatter or tangle common names, because they destroy 'syntax' in advance, and not only the syntax with which we construct sentences but also that less apparent syntax which causes words and things (next to and also opposite one another) to 'hold together'. This is why utopias permit fables and discourse: they run with the very grain of language and are part of the fundamental dimension of the //fabula//; heterotopias (such as those to be found so often in Borges) desiccate speech, stop words in their tracks, contest the very possibility of grammar at its source; they dissolve our myths and sterilize the lyricism of our sentences.\\n\\nMichel Foucault, Preface to //The Order of Things//",
      "links": []
    },
    {
      "pid": 57,
      "name": "handstory",
      "text": "Interlude: A Hand Story\\n\\nI have to hand it over to you: this egg that I found in a burrow behind the dispensary. Not because you compelled me to give you it, or even asked for it, or even knew I had it, or even knew of it: you did not. Not because the egg told me to: it did, but it is only an egg and so what does it know.\\n\\nNo, this (my entrusting the egg to your care) is nothing more than a matter of conscience on my part. It is not a cowardice -- of course my first instinct was to watch over the egg myself! In point of fact, I have done just that these past several weeks. And to the absolute limit of my abilities: I tell you there is nothing (nothing save my pursuit of Ann) that I have taken up with more devotion.\\n\\nIn spite of my best efforts, a preponderance of evidence has shown that I am, if not //the// worst, at least among the worst possible caretakers for the egg. (I cannot help but wonder if that very unfitness led me to chance upon the egg in the first place-- but I will not distract you with such speculations.) [[The faintest hint|red_next3]] of such evidence should be enough to convince you that such is indeed the case, so I will be brief.\\n\\n.--.-.\\n\\nFirst there is the matter of my hands. They are huge and next to useless. You know this well, having once shaken my hand. (We have since turned to hugs, leading us to the problem of shoulders-- but I am getting ahead of myself.) Their hugeness and uselessness is of a piece: they are not useless //because// they are huge, any more than they are huge because they are useless. It is one and the same.\\n\\nThey are a waste, an enormity, a barren expanse. Not a desert, where cacti might flower and hares might frolic. Not a blank slate, as such a space holds promise. They are perhaps closest to an ocean of lead, if lead were stripped of its industrial applications and left as pure poison. In my hands nothing sprouts, nothing flourishes: how could any good come of nesting the egg in them?\\n\\nNot that I was so careless as to cradle the egg for even a second in my bare palms! Of course I have taken precautions, of course. But what you might not understand (having small, fine hands) is that their sprawl inevitably infects all they touch. Even this very pen -- sharp, compact, to-the-point -- already it splutters out blots and it fails me, floods the page with extraneity. When all my wrists wish to express is an unadorned and earnest, modest truth, my huge hands find some way to divert, to delay. And how much the more so with this egg![...] \\n\\n\\n",
      "links": [
        {
          "text": "The faintest hint",
          "destination": {
            "name": "red_next3",
            "pid": 90
          }
        }
      ]
    },
    {
      "pid": 58,
      "name": "follow the signs",
      "text": "You take ten steps and walk straight into an ambush. Goddammit.\\n\\nThree men have something to say to you. They are all uncles: a [[tundra uncle|uncle][$uncle = 0]], a [[jungle uncle|uncle][$uncle = 1]] and a [[boreal forest uncle|uncle][$uncle = 2]]. None of them look too happy with you. If you defeat one, you imagine the other two will fold as well.",
      "links": [
        {
          "text": "tundra uncle",
          "destination": {
            "name": "uncle",
            "pid": 119
          }
        },
        {
          "text": "jungle uncle",
          "destination": {
            "name": "uncle",
            "pid": 119
          }
        },
        {
          "text": "boreal forest uncle",
          "destination": {
            "name": "uncle",
            "pid": 119
          }
        }
      ]
    },
    {
      "pid": 59,
      "name": "nothing to say",
      "text": "A few things I think we'd say if we had to:\\n\\nFile [[Edit View Story Build]] Help\\n\\n- Sipping syrup, 6 oz.\\n- Acetone, protein-enriched, 6 oz.\\n- The stars, the moon, 6 oz.\\n- A dying chorus, 6 oz.\\n- <<if $attribution is \"kuhn\">>@@.Q;The structure of scientific revolutions@@<<else>>The structure of scientific revolutions<<endif>>/%Kuhn, ibid%/, 6 oz.\\n- Dry roasted almonds, 6 oz.\\n- Our love, 6 oz.\\n\\nFAMILY AND CAREGIVERS MUST CLOSELY WATCH patients who take this medication.\\n\\nI told you I would never leave you, let you get too lost: I meant it. Should I die I'll find another body, find my way back to you. You know that, don't you?\\n\\n<<if $attribution is \"plato\">>@@.Q;\"Oh Phaedrus, if I don't know my Phaedrus I must be forgetting who I am myself--and neither is the case. I know very well that he did not hear Lysias' speech only once: he asked him to repeat it over and over again, and Lysias was eager to oblige. But not even that was enough for him. In the end, he took the book himself and pored over the parts he liked best. He sat reading all morning long, and when he got tired, he went for a walk, having learned--I am quite sure--the whole speech by heart, unless it was extraordinarily long. ...\"@@<<else>>\"Oh Phaedrus, if I don't know my Phaedrus I must be forgetting who I am myself--and neither is the case. I know very well that he did not hear Lysias' speech only once: he asked him to repeat it over and over again, and Lysias was eager to oblige. But not even that was enough for him. In the end, he took the book himself and pored over the parts he liked best. He sat reading all morning long, and when he got tired, he went for a walk, having learned--I am quite sure--the whole speech by heart, unless it was extraordinarily long. ...\"<<endif>>/%Plato, Phaedrus%/\\n\\nA Novel in Verse/%Carson, AoR%/<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "Edit View Story Build",
          "destination": {
            "name": "Edit View Story Build",
            "pid": 22
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 60,
      "name": "red",
      "text": "You're standing outside the Forbidding Caves with your starter PlantOrb at your side. You carry x5 PockBox, x3 SuperBox, x1 UltimateBox, x5 Antidote, x4 Mini Potion, x2 Huge Potion, x1 Revive and x1 Uncommon Delight.\\n\\nPlantOrb scratches at your leg; she's uneasy. Green-type Pockm_n aren't too fond of caves forever forsaken by the sun. But you've made up your mind: now's the time you find the Fallen Star. PlantOrb is by far your strongest Pockm_n, one you've come to rely on. You can't face the Caves without her. She understands but remains reluctant.\\n\\nEnter the Forbidding Caves?\\n- [[Yes|red_yes]]\\n- [[No|red_no]]",
      "links": [
        {
          "text": "Yes",
          "destination": {
            "name": "red_yes",
            "pid": 45
          }
        },
        {
          "text": "No",
          "destination": {
            "name": "red_no",
            "pid": 1
          }
        }
      ]
    },
    {
      "pid": 61,
      "name": "her_stairs",
      "text": "It's your mom. Not your mom-mom, your game-mom, (your //friend's// game-mom,) but all the same: your mom. She is animated, distraught. You can't talk to her -- she only wails, no response. The kitchen/dining room is undisturbed, no sign of strife. You can't imagine what is wrong.\\n\\nYou've never seen her like this. This must be your friend's doing, some glitch he tampered with. In fact, yes, now you notice where your mom's animation hiccups as it rolls back to the beginning. She's stuck in a loop.\\n\\nWhat a mess. What on earth was your friend doing, what could he have hoped to accomplish -- at such a cost! Your game-mom is only a few lines of code, of course. But this glitch was no simple shortcut, no speedrun toward utopia. He had something very particular in mind.\\n\\nMaybe he meant for you to find her like this; he did save the game right here and return the GBC to you. To what end? You never had much of an idea what your friend was thinking half the time. But then, he had even less insight into your thoughts. You were very quiet.\\n\\nGoing [[outside|her_outside]] might shed some light on things. ",
      "links": [
        {
          "text": "outside",
          "destination": {
            "name": "her_outside",
            "pid": 18
          }
        }
      ]
    },
    {
      "pid": 62,
      "name": "living room",
      "text": "<<if $keys is false>>You know you'd better fetch your keys and [[hurry|hallway][$inthishouse = true]] out before your name slips away. <<if $inthishouse is false>>In this house you often feel you've stepped outside of time. Who knows, maybe you'll find something you've forgotten in one of the other rooms.<<endif>>\\n\\n<<endif>>The living room is trying to belie its name, lying quiet, unstirring, colorless. You aren't taken in. The room's abuzz beneath it all--\\n\\n\"The electronic hearth.\" It's supposed to provide far sight, clear crisp visions to replace old muddled tea leaves. Lately, it's been stuck on <<if $tv is false>>[[one odd channel|WQWC]]<<else>>one odd channel<<endif>>: WQWC. Its programming's obscure, some sort of cypher you can't make out. You imagine an underground cell's attempting to contact you -- you haven't had the heart for decryption since you lost your name.\\n\\nThe positronic hearth (some call it the fireplace) is home to a species of creatures you won't find in any textbook. You won't find them in the fireplace, either. They hear you coming before you've even decided to come; they disperse themselves perfectly among the ashes. \\n\\nBut you're certain that they're there. One day when you felt unwell, you sank into the couch and did not move at all from dark to dark. After a number of hours, (supposing, not unreasonably, that you'd died,) [[the creatures started to speak|creatures]].\\n\\nYou can't lie in wait for them to speak again. You've a long way to walk.",
      "links": [
        {
          "text": "hurry",
          "destination": {
            "name": "hallway",
            "pid": 153
          }
        },
        {
          "text": "one odd channel",
          "destination": {
            "name": "WQWC",
            "pid": 118
          }
        },
        {
          "text": "the creatures started to speak",
          "destination": {
            "name": "creatures",
            "pid": 55
          }
        }
      ]
    },
    {
      "pid": 63,
      "name": "mapnext11",
      "text": "\"<<if $attribution is false>>I was havin' nightmares that I would never reach the finish line\\nIf pain is momentary I would never see the end of mine\\n'Til I realized that these bitches can't touch me\\nLike I'm a million fuckin' particles of nothing<<else>>@@.Q;I was havin' nightmares that I would never reach the finish line\\nIf pain is momentary I would never see the end of mine\\n'Til I realized that these bitches can't touch me\\nLike I'm a million fuckin' particles of nothing@@<<endif>>\"/%Angel Haze, Supreme%/\\n\\na) [[Now I walk around like I can't be knocked down / /\\sO>-X<k+M|mapend]]\\nb) [[There was a time where I would've quit and clocked out|mapend]]\\nc) [[There was a time locked out where I called you to talk about pilgrimage|mapend]]\\nd) [[I remember when I couldn't call myself real / Could look my name up and not see myself still|mapend]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "Now I walk around like I can't be knocked down / /\\sO>-X<k+M",
          "destination": {
            "name": "mapend",
            "pid": 66
          }
        },
        {
          "text": "There was a time where I would've quit and clocked out",
          "destination": {
            "name": "mapend",
            "pid": 66
          }
        },
        {
          "text": "There was a time locked out where I called you to talk about pilgrimage",
          "destination": {
            "name": "mapend",
            "pid": 66
          }
        },
        {
          "text": "I remember when I couldn't call myself real / Could look my name up and not see myself still",
          "destination": {
            "name": "mapend",
            "pid": 66
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 64,
      "name": "skipskipskipskip",
      "text": "Oh lord oh [[lord|answer]]\\nOh lord I don't know [[lordhavemercy|answer]]\\n\\nI do hope I hold my head up but oh [[lord|answer]]\\nIf you are holding me your hands are [[cold|answer]]\\n\\nOh lord if you are my lord you [[are|answer]]\\nGreat is the glory of [[lordhavemercy|answer]]\\n\\nIf I hope you hear someone it isn't [[me|answer]]\\nSo why speak [[when|answer]]\\n\\n[[Skip to the next question.|skipskipskipskipskip]]",
      "links": [
        {
          "text": "lord",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "lordhavemercy",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "cold",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "are",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "me",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "when",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "Skip to the next question.",
          "destination": {
            "name": "skipskipskipskipskip",
            "pid": 52
          }
        }
      ]
    },
    {
      "pid": 65,
      "name": "It's hopeless.",
      "text": "\"You won't talk? Fine. Don't talk to //her//, then.\" \\n\\nWith that, They are gone. In Their place is your mom in a chair opposite you. \"Hi, hon. How are you?\"\\n\\nIf They want you to talk to her, maybe you shouldn't? But you can't not.\\n\\n\"I'm okay--you?\" You turn aside her attention as best you can.\\n\\n\"You sure?\" You've told her you're 'okay' too often for her to take it at face value. \"You look tired. You've been sleeping?\"\\n\\n\"Some.\"\\n\\n\"You've been taking your meds?\"\\n\\n\"Yeah.\" Actually, you fucked up getting a refill, it's been almost two weeks. It's not that you're //not// taking them; you just don't have them. You'll handle it as soon as this name thing's sorted: it's a huge hassle, making doctor's appointments without a name.\\n\\nWait, right: the CNR! That's today. [[You need to get moving.|basement][$chest_open = true, $late = true]] You can get grilled by your glitch-mom some other time.",
      "links": [
        {
          "text": "You need to get moving.",
          "destination": {
            "name": "basement",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 66,
      "name": "mapend",
      "text": "\"Thank you. Please wait while we calculate your results.\"\\n\\n...\\n\\n\"We've verified your appointment. Please [[proceed to the lifts|proceed]].\" ",
      "links": [
        {
          "text": "proceed to the lifts",
          "destination": {
            "name": "proceed",
            "pid": 105
          }
        }
      ]
    },
    {
      "pid": 67,
      "name": "dunes_yes",
      "text": "You: \"I want to come with you.\" Whether they are deluded is beside the point: whatever happens with them will be something you will never see again. \"I would like to immigrate to your country.\"\\n\\nA silence that means something.\\n\\nMary: \"Yes. I believe you. But you're not alone in this world, no? You have other people to think about, right? You do. So think about them some, okay?\"\\n\\nShe is right, of course. There are the others: they have seen you through all this bullshit already. Now you are just going to //go//?\\n\\nYou should go. They are being dragged down by you; you know that better than anyone. They will cry to see you leave, but they will be inwardly relieved. You will relieve them of a terrible wait. You will leave them a note.\\n\\nBut how will it go for you? They will be okay; they do not need you even for an hour. But you do not know the first thing about you, (as they do,) so what are you doing? Running into nothing?\\n\\nThese two are not nothing: they are beautiful. They will imbue you with some far-off thing you do not even know. They are at peace and you are at war: maybe they can negotiate. Why not at least try?\\n\\n[[No, I need to be here|dunes_yesyes]]\\n==Oh, I'm sorry==\\n[[Yes, I should go|back2walk][$late = true]]",
      "links": [
        {
          "text": "No, I need to be here",
          "destination": {
            "name": "dunes_yesyes",
            "pid": 50
          }
        },
        {
          "text": "Yes, I should go",
          "destination": {
            "name": "back2walk",
            "pid": 95
          }
        }
      ]
    },
    {
      "pid": 68,
      "name": "Attribution",
      "text": "(The number for each citation takes you to the excerpt, which will be @@.Q;this color in bold@@. The links embedded in the excerpts are from the same source. In most cases, I have altered the source material slightly to drastically.) \\n----\\n<center>''Books''</center>\\n[[1)|mapnext3]] Auden, W. H. //Selected Poems//. Edited by Edward Mendelson. 2nd ed. New York: Vintage Books, 2007. 188-9.\\n\\n[[2)|her_painting]] Browning, Robert. //Men and Women and Other Poems//. Edited by Colin Graham. London: Everyman, 1993. 216.  \\n\\n[[3)|bottomless pit]] Carroll, Lewis. //Alice's Adventures in Wonderland//. New York: St. Martin's Press, 1977. 3-4. \\n\\n[[4)|east][$attribution = \"carson\"]] [[5)|creatures]] Carson, Anne. //Autobiography of Red: A Novel in Verse//. New York: Alfred A. Knopf, 1998. 89, 147-8.\\n\\n[[6)|mapnext10]] Cornell, Julien D. //The Trial of Ezra Pound: A Documented Account of the Treason Case//. New York: J. Day, 1966. \\n\\n[[7)|WQWC]] Euripides. //Cyclops. Alcestis. Medea//. Translated by David Kovacs. Cambridge: Harvard University, 1994.\\n\\n[[8)|mapnext8]] Faulkner, William. //Light in August: The Corrected Text//. New York: Vintage Books, 1990. 126-7.\\n\\n[[9)|CPDformYes]] Herodotus. //The Histories//. Translated by Aubrey de Sélincourt. New York: Penguin Putnam Inc, 2003. 3.\\n\\n[[10)|mapnext6]] Le Guin, Ursula K. //The Dispossessed: A Novel//. New York: Perennial Classics, 2003. 298-9. \\n\\n[[11)|mapnext]] Lee, Harper. //To Kill a Mockingbird//. New York: Warner Books, 1982. 96.\\n\\n[[12)|Look away][$attribution = \"mcneill\"]] McNeill, John and Helena Gamer. //Medieval Handbooks of Penance: A Translation of the Principal \"libri Poenitentiales\" and Selections from Related Documents//. New York: Columbia University, 1965.\\n\\n[[13)|a story][$attribution = \"moore\"]] Moore, Marianne. //The Poems of Marianne Moore//. Edited by Grace Schulman. New York: Viking, 2003. 127.\\n\\n[[14)|a story][$attribution = \"ovid\"]] Ovid. //Metamorphoses//. Translated by B Minus Seven. Book 1. Lines 5-13.\\n\\n[[15)|nothing to say][$attribution = \"plato\"]] Plato. //Complete Works//. Edited by John M. Cooper. Indianapolis: Hutchinson, 1997. 508.\\n\\n[[16)|Natural Law][$attribution = \"poe\"]] [[17)|mapnext7]] Poe, Edgar Allan. //The Fall of the House of Usher and Other Writings: Poems, Tales, Essays and Reviews//. Edited by David D. Galloway. Harmondsworth: Penguin, 1967. 105, 212.\\n\\n[[18)|Natural Law][$attribution = \"spinoza\"]] Spinoza, Baruch. //The Ethics ; Treatise on the Emendation of the Intellect ; Selected Letters//. Translated by Samuel Shirley. 2nd ed. Indianapolis: Hackett Pub., 1992. 76.\\n\\n[[19)|CPDformYes2]] Stein, Gertrude. //Tender Buttons//. Mineola: Dover, 1997. 1-3.\\n\\n[[20)|skipskipskipskipskip]] Urdang, Laurence. //The American Century Thesaurus//. New York: Warner Books, 1996. 288.\\n\\n[[21)|mapnext2]] Woolf, Virginia. //Mrs. Dalloway//. New York: Harcourt, Brace & World, 1953. 218.\\n\\n[[22)|Natural Law][$attribution = \"yeats\"]] Yeats, W. B. //Selected Poems and Four Plays of William Butler Yeats//. Edited by M. L. Rosenthal. 4th ed. New York: Scribner Paperback Poetry, 1996. 102.\\n\\n<center>''Film and Television''</center>\\n\\n[[23)|brother][$brother = 0]] Whedon, Joss. //Buffy the Vampire Slayer//. \"Restless.\" Performed by Amber Benson. 2000. Los Angeles: 20th Century Fox, 2003. DVD.\\n\\n<center>''Sound Recordings''</center>\\n[[24)|mapnext11]] Angel Haze. //Supreme//. © 2012. Self-released.\\n\\n[[25)|skip]] Lana del Ray. //Summertime Sadness//. © 2012. Interscope.\\n\\n[[26)|refill][$absent = true, $late = false]] Madonna. //Like a Prayer//. © 1989. Sire Records.\\n\\n[[27)|mapnext5]] Rihanna. //Umbrella//. © 2007 by Def Jam Recordings.\\n\\n<center>''Web Sources''</center>\\n[[28)|CPDformSex][$attribution = \"catamites\"]] Gillmurphy, Stephen \"thecatamites\". “Mouse Corp.” //itch.io//. Accessed April 1, 2015. {{{http://thecatamites.itch.io/mouse-corp}}}.\\n\\n[[29)|CPDformSex][$attribution = \"godhead\"]] “Godhead.” //The Church of Jesus Christ of Latter-Day Saints//. Accessed April 1, 2015. {{{https://www.lds.org/topics/godhead?lang=eng}}}.\\n\\n[[30)|uncle][$uncle = 2]] Heimbuch, Jaymi. \"30 Fascinating Facts about the Boreal Forest.\" //Treehugger//. Last modified August 16, 2011. {{{http://www.treehugger.com/natural-sciences/30-fascinating-facts-about-the-boreal-forest.html}}}.\\n\\n[[31)|east][$attribution = \"house\"]] \"House Bill 2162.\" //Arizona State Legislature//. Last modified April 30, 2010. {{{http://www.azleg.gov/legtext/49leg/2r/bills/hb2162c.pdf}}}\\n\\n[[32)|CPDformSex][$attribution = \"infrared\"]] “Infrared Cameras.” //FLIR//. Accessed April 1, 2015. {{{http://www.flir.com/instruments/display/?id=56784}}}.\\n\\n[[33)|uncle][$uncle = 1]] \"Interesting Facts on Rainforests.\" //Learning about Rainforests//. Accessed April 7, 2015. {{{http://www.srl.caltech.edu/personnel/krubal/rainforest/Edit560s6/www/facts.html}}}.\\n\\n[[34)|east][$attribution = \"chess\"]] “Laws of Chess: For competitions starting on or after 1 July 2014.” //World Chess Federation//. Accessed April 1, 2015. {{{https://www.fide.com/fide/handbook.html?id=171&view=article}}}.\\n\\n[[35)|CPDformQuality]] “Patient Health Questionnaire (PHQ-9).” //US Preventive Services Task Force//. Accessed April 1, 2015. {{{http://www.uspreventiveservicestaskforce.org/Home/GetFileByID/218}}}.\\n\\n[[36)|Look away][$attribution = \"potato\"]] “Potato - Columbia Root Knot Nematode, Bacterial Ring Rot.” //Maine.gov//. Accessed April 1, 2015. {{{http://www.maine.gov/sos/cec/rules/01/001/001c030.doc}}}. \\n\\n[[37)|cavestory]] Random-storykeeper and IdioticBaka1824. “Dragon Eggs.” //Cave Story Wiki//. Last modified April 19, 2014. {{{http://cavestory.wikia.com/wiki/Dragon_Eggs}}}.\\n\\n[[38)|postCLS]] “Recreational Users.” //Know Before You Fly//. Accessed April 1, 2015. {{{http://knowbeforeyoufly.org/for-recreational-users/}}}.\\n\\n[[39)|CPDformSex][$attribution = \"schofield\"]] Schofield, Kirsten. “3 Wrist Exercises to Prevent Carpal Tunnel Syndrome.” //Healthline//. Last modified September 3, 2014. {{{http://www.healthline.com/health/carpal-tunnel-wrist-exercises}}}.\\n\\n[[40)|CPDformLocation]] “Section 2. Location Identifiers System Administration.” //FAA//. Accessed April 1, 2015. {{{http://www.faa.gov/air_traffic/publications/atpubs/lid/0102.htm}}}.\\n\\n[[41)|uncle][$uncle = 44]] \"Tundra: Dry, Cold and Windy.\" //National Geographic//. Accessed April 7, 2015. {{{http://environment.nationalgeographic.com/environment/habitats/tundra-profile/}}}.\\n\\n[[42)|CPDformSex][$attribution = \"vance\"]] Vance, Brendan. “Fashion, Emptiness and Problem Attic.” //brendan vance//. Last modified November 2, 2013. {{{http://blog.brendanvance.com/2013/11/02/problem-attic/}}}.\\n\\n[[43)|passingtime2]] wikiHow contributors. “How to ‘Pass’ As a Woman: 13 Steps (with Pictures).” //wikiHow//. Accessed April 1, 2015. {{{http://www.wikihow.com/\"Pass\"-As-a-Woman}}}.\\n\\n[[44)|CPDformSex][$attribution = \"wikipedia\"]] Wikipedia contributors. “We Found Love.” //Wikipedia//. Accessed April 1, 2015. {{{http://en.wikipedia.org/wiki/We_Found_Love}}}.\\n\\n[[BACK|Start.][$attribution = false]]",
      "links": [
        {
          "text": "1)",
          "destination": {
            "name": "mapnext3",
            "pid": 139
          }
        },
        {
          "text": "2)",
          "destination": {
            "name": "her_painting",
            "pid": 38
          }
        },
        {
          "text": "3)",
          "destination": {
            "name": "bottomless pit",
            "pid": 127
          }
        },
        {
          "text": "4)",
          "destination": {
            "name": "east",
            "pid": 25
          }
        },
        {
          "text": "5)",
          "destination": {
            "name": "creatures",
            "pid": 55
          }
        },
        {
          "text": "6)",
          "destination": {
            "name": "mapnext10",
            "pid": 132
          }
        },
        {
          "text": "7)",
          "destination": {
            "name": "WQWC",
            "pid": 118
          }
        },
        {
          "text": "8)",
          "destination": {
            "name": "mapnext8",
            "pid": 146
          }
        },
        {
          "text": "9)",
          "destination": {
            "name": "CPDformYes",
            "pid": 36
          }
        },
        {
          "text": "10)",
          "destination": {
            "name": "mapnext6",
            "pid": 142
          }
        },
        {
          "text": "11)",
          "destination": {
            "name": "mapnext",
            "pid": 43
          }
        },
        {
          "text": "12)",
          "destination": {
            "name": "Look away",
            "pid": 166
          }
        },
        {
          "text": "13)",
          "destination": {
            "name": "a story",
            "pid": 158
          }
        },
        {
          "text": "14)",
          "destination": {
            "name": "a story",
            "pid": 158
          }
        },
        {
          "text": "15)",
          "destination": {
            "name": "nothing to say",
            "pid": 59
          }
        },
        {
          "text": "16)",
          "destination": {
            "name": "Natural Law",
            "pid": 104
          }
        },
        {
          "text": "17)",
          "destination": {
            "name": "mapnext7",
            "pid": 141
          }
        },
        {
          "text": "18)",
          "destination": {
            "name": "Natural Law",
            "pid": 104
          }
        },
        {
          "text": "19)",
          "destination": {
            "name": "CPDformYes2",
            "pid": 49
          }
        },
        {
          "text": "20)",
          "destination": {
            "name": "skipskipskipskipskip",
            "pid": 52
          }
        },
        {
          "text": "21)",
          "destination": {
            "name": "mapnext2",
            "pid": 140
          }
        },
        {
          "text": "22)",
          "destination": {
            "name": "Natural Law",
            "pid": 104
          }
        },
        {
          "text": "23)",
          "destination": {
            "name": "brother",
            "pid": 37
          }
        },
        {
          "text": "24)",
          "destination": {
            "name": "mapnext11",
            "pid": 63
          }
        },
        {
          "text": "25)",
          "destination": {
            "name": "skip",
            "pid": 3
          }
        },
        {
          "text": "26)",
          "destination": {
            "name": "refill",
            "pid": 102
          }
        },
        {
          "text": "27)",
          "destination": {
            "name": "mapnext5",
            "pid": 143
          }
        },
        {
          "text": "28)",
          "destination": {
            "name": "CPDformSex",
            "pid": 136
          }
        },
        {
          "text": "29)",
          "destination": {
            "name": "CPDformSex",
            "pid": 136
          }
        },
        {
          "text": "30)",
          "destination": {
            "name": "uncle",
            "pid": 119
          }
        },
        {
          "text": "31)",
          "destination": {
            "name": "east",
            "pid": 25
          }
        },
        {
          "text": "32)",
          "destination": {
            "name": "CPDformSex",
            "pid": 136
          }
        },
        {
          "text": "33)",
          "destination": {
            "name": "uncle",
            "pid": 119
          }
        },
        {
          "text": "34)",
          "destination": {
            "name": "east",
            "pid": 25
          }
        },
        {
          "text": "35)",
          "destination": {
            "name": "CPDformQuality",
            "pid": 96
          }
        },
        {
          "text": "36)",
          "destination": {
            "name": "Look away",
            "pid": 166
          }
        },
        {
          "text": "37)",
          "destination": {
            "name": "cavestory",
            "pid": 93
          }
        },
        {
          "text": "38)",
          "destination": {
            "name": "postCLS",
            "pid": 44
          }
        },
        {
          "text": "39)",
          "destination": {
            "name": "CPDformSex",
            "pid": 136
          }
        },
        {
          "text": "40)",
          "destination": {
            "name": "CPDformLocation",
            "pid": 78
          }
        },
        {
          "text": "41)",
          "destination": {
            "name": "uncle",
            "pid": 119
          }
        },
        {
          "text": "42)",
          "destination": {
            "name": "CPDformSex",
            "pid": 136
          }
        },
        {
          "text": "43)",
          "destination": {
            "name": "passingtime2",
            "pid": 84
          }
        },
        {
          "text": "44)",
          "destination": {
            "name": "CPDformSex",
            "pid": 136
          }
        },
        {
          "text": "BACK",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 69,
      "name": "red_next",
      "text": "Odd. You are certain you're in a different part of the Caves, though you can't say where. But you didn't move here, exactly, not in the \"one foot in front of the other\" sense. You just //are// here now.\\n\\nYou didn't teleport either, you don't think. It wasn't like your body (avatar, rather) was plucked from one spot and set down in another. More like, you were always already here but didn't realize it until just now -- a familiarity beyond deja vu.\\n\\nYou can't recall anything like this from your previous runs through the Caves. It's been ten years, but still. You suspect your friend's hacks might've bled into your saves as well.\\n\\nTry that again?\\n\\n[[Sure|red_next2]]\\n[[No, you should get going|basement][$chest_open = true]]",
      "links": [
        {
          "text": "Sure",
          "destination": {
            "name": "red_next2",
            "pid": 89
          }
        },
        {
          "text": "No, you should get going",
          "destination": {
            "name": "basement",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 70,
      "name": "CPDformNo2",
      "text": "No wait for an elevator: no-one waiting for one, either.\\n\\nThe 24th floor is ugly and cramped to discourage anyone from loitering. You.\\n\\nYou turn down the hallway just in time to see someone looking strikingly like you enter a room. You hurry: they entered room 2467, your room. The door is locked. You knock, knock again with some urgency. No answer. You are stuck.\\n\\n[[Fuck.|CPDformNo3]]\\n\\nYou guess you will have to go back to the beginning and explain. The person at the first counter will know what to do, or if not them the second, or if not them the third, or whatever. Someone will know what to do.",
      "links": [
        {
          "text": "Fuck.",
          "destination": {
            "name": "CPDformNo3",
            "pid": 71
          }
        }
      ]
    },
    {
      "pid": 71,
      "name": "CPDformNo3",
      "text": "You explain your difficulty to the person at the first counter. They are only authorized to greet people: the counter you want is the fifteenth. Okay.\\n\\nYou explain your difficulty to the person at the fifteenth counter. They nod and type your number into their console.\\n\\n“According to this, sir, you are already meeting in room 2467.”\\n\\n“But I’m not, I’m right here. Someone else has taken my place.”\\n\\n“I see. I will call up, then.”\\n\\n“Please do.”\\n\\n“I cannot promise that they will answer.” They pick up the phone and dial and wait. Five seconds in, someone picks up the other end. They mutter to each other and hang up.\\n\\n“According to the resident of room 2467, they are meeting with ticket-holder #44 right now. Everything is in order.”\\n\\n“I have ticket #44 right here!” You show them your ticket; they hold it up to the light. They nod.\\n\\n“This ticket appears legitimate, sir. Unfortunately, the system on occasion prints duplicate tickets. If the appointment for #44 has been filled already, then there’s not much I can do, sir. I am sorry.” They are not sorry.\\n\\n“But-- whoever’s there is an impostor! Isn’t there some way to prove that, sort it out?”\\n\\n“You do not have any valid ID.” No question there. “That poses some difficulty, sir,” a very long pause, “but it is not insurmountable.” They tap away at their console. “We have provisional metrics attached to each ticket-holder. We also have an expressive platform synched up to those metrics.” Another pause. “If you joined that platform, sir, and expressed yourself in such a way as to match the metrics attached to ticket #44, then you would have solid grounds for replacing whoever currently fills that appointment.”\\n\\n“Um. Okay?”\\n\\n“That there is the terminal room, sir.” They point to a door. “The terminal counter is over that way. They can give you a log-in code to start an account, if you choose to do so.”\\n\\n- [[Okay|CPDformNoYes]]\\n- [[Give up and go home|CPDformNoNo]]",
      "links": [
        {
          "text": "Okay",
          "destination": {
            "name": "CPDformNoYes",
            "pid": 156
          }
        },
        {
          "text": "Give up and go home",
          "destination": {
            "name": "CPDformNoNo",
            "pid": 8
          }
        }
      ]
    },
    {
      "pid": 72,
      "name": "First",
      "text": "First things first: are you here?\\n\\n[[Present][$absent = false]]\\n\\n<<if $endings is 0>>==Absent==<<else>>[[Absent][$absent = true]]<<endif>>",
      "links": [
        {
          "text": "Present",
          "destination": {
            "name": "Present",
            "pid": 26
          }
        },
        {
          "text": "Absent",
          "destination": {
            "name": "Absent",
            "pid": 46
          }
        }
      ]
    },
    {
      "pid": 73,
      "name": "bushes",
      "text": "No-nym noun-in known-net\\nTen-tick \\nTend-in twin-edit\\n\\nTide-trims trireme-eyed toad\\nDoubt-did drain-anon\\nDonned-isle\\n\\nElsi-she elm-elm ended-louse\\nEsoul-ear E-MT empathic\\n\\n- - -\\n\\nand supposing we went to enter the opening, and supposing we had found the appropriate mountain, and supposing we could heed some map or other, and supposing we held our hands still, and supposing we returned to the righthand cabinet, and supposing we weren't missed, and supposing we knew we were not far off, and supposing we had to shut our ears, and supposing we met her by the well, and supposing we were chased off by an immense hound, and supposing we sneezed, and supposing we had arrived at the opening,\\n\\n- - -\\n\\nhmoath hpawnh htinth hsaneh\\nhintersecth habsolutionh\\n\\nnvialn nmaden ncoiln ntrodn\\nnoilpaintingn nphenomenonn\\n\\nuwussu uployu ubassu uspayu\\nuassessmentu uundulationu\\n\\nyoutsy yrendy ykitsy ybindy\\nyitspointingy ydecahedrony\\n\\n- - -\\n\\nYou make it to the front; you sigh and head [[inside]]. \\n",
      "links": [
        {
          "text": "inside",
          "destination": {
            "name": "inside",
            "pid": 42
          }
        }
      ]
    },
    {
      "pid": 74,
      "name": "NOTE:",
      "text": "NOTE:\\n\\n<<if $absent is true>>You've left your keys inside somewhere. You could take the spare around to the front and go get them. Maybe you'd better [[go take inventory][$note = \"left\"]] once more before heading out. \\n\\nTrue, you'd have to brush past the bushes on the way there. But the comfort of having your keys might well outweigh the trouble. If you'd rather not, you could start your [[walk][$note = \"left\"]].<<else>>You have every right to be here, [[nameless|walk][$note = \"right\"]] or no. These roads are for the public and you are of the public. As long as you do not cause a disturbance, you have nothing to fear. \\n\\nAlthough-- perhaps you ought to go to the Center for Provisional Documentation [[(CPD)]] first? You never did get around to securing a 'nameless citizen's badge.' You had told yourself you were going to the CNR for a new name as soon as possible and so you did not need to bother with all that extra hassle. But now you have put it off for months -- your old ID is long out-of-date on top of being invalid. What if someone were to stop you?<<endif>>",
      "links": [
        {
          "text": "go take inventory",
          "destination": {
            "name": "go take inventory",
            "pid": 109
          }
        },
        {
          "text": "walk",
          "destination": {
            "name": "walk",
            "pid": 32
          }
        },
        {
          "text": "nameless",
          "destination": {
            "name": "walk",
            "pid": 32
          }
        },
        {
          "text": "(CPD)",
          "destination": {
            "name": "(CPD)",
            "pid": 122
          }
        }
      ]
    },
    {
      "pid": 75,
      "name": "nothingtosay2",
      "text": "The three fathers take their leave. You make it twenty or thirty more steps before a third ambush trips you up. You cannot even feign dismay at this point.\\n\\nAnother party of three men preparing a speech. They are all brothers: a [[first brother|brother][$brother = 0]], [[a second brother|brother][$brother = 1]] and a [[third brother|brother][$brother = 2]]. If you defeat one, you imagine the other two will fold as well.",
      "links": [
        {
          "text": "first brother",
          "destination": {
            "name": "brother",
            "pid": 37
          }
        },
        {
          "text": "a second brother",
          "destination": {
            "name": "brother",
            "pid": 37
          }
        },
        {
          "text": "third brother",
          "destination": {
            "name": "brother",
            "pid": 37
          }
        }
      ]
    },
    {
      "pid": 76,
      "name": "nothingtosay3",
      "text": "The three brothers go their separate ways. You take ten thousand steps before you find the final ambush.\\n\\nThere are three men clearing their throats. They are all agents: a [[secret agent|agent][$agent = 2]], a [[free agent|agent][$agent = 1]] and a [[travel agent|agent][$agent = 0]]. If you defeat one, you imagine the other two will fold as well.",
      "links": [
        {
          "text": "secret agent",
          "destination": {
            "name": "agent",
            "pid": 138
          }
        },
        {
          "text": "free agent",
          "destination": {
            "name": "agent",
            "pid": 138
          }
        },
        {
          "text": "travel agent",
          "destination": {
            "name": "agent",
            "pid": 138
          }
        }
      ]
    },
    {
      "pid": 77,
      "name": "taking",
      "text": "I am safe & sound enough to continue. I do hope you are also. Either way I am far away & I've already written all I have to say for now, but. I will say you should know (as you might/as you must) that you can't just go & be gone, before then there is a going, it is not noble & it is not selfish & it is not &&&&&&\\n\\n[[Include|Table of Content][$taking_content = true]]\\n[[Exclude|Table of Content][$taking_content = false]]",
      "links": [
        {
          "text": "Include",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        },
        {
          "text": "Exclude",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        }
      ]
    },
    {
      "pid": 78,
      "name": "CPDformLocation",
      "text": "Pg. 3: Location\\n\\n<<if $attribution is false>>''PLEASE READ FIRST:''\\n \\n''1-2-4.'' PERMANENCE\\na. Established nine-letter identifiers are considered permanent and will not be changed without strong and documented justification. Non-nine-letter identifiers may be changed due to status changes, e.g. private-use to public-use, etc.\\nb. Location identifiers are not interchangeable and cannot be transferred from one individual to another even within the same community.\\nc. The original identifier will remain in effect, in most instances, even when it has become necessary to change the individual's name.\\n\\n''1-2-5.'' DUPLICATION\\na. At the same location, the same identifier may be assigned to one navigational aid (which must be located upon or within the individual), to the individual, to a manned vehicle or facility, and to an onus on the individual. With certain restrictions, variations of the identifier may be assigned also to operational systems.\\nb. Some duplication of nine-letter assignments has been made between individuals in the contiguous Federated Districts, who are not associated primarily with an operational area, and F.D. COD overseas operations. For example, the second ILS for an individual in the F.D. and an operation in Italy, or an operation in Germany and an en route VORTAX in the F.D.\\nc. The first-three and second-three letters or second-three and third-three letters or third-three and first-three letters of a nine-letter identifier may not be duplicated with less than 200 nautical miles separation.<<else>>@@.Q;PLEASE READ FIRST:\\n \\n1-2-4. PERMANENCE\\na. Established nine-letter identifiers are considered permanent and will not be changed without strong and documented justification. Non-nine-letter identifiers may be changed due to status changes, e.g. private-use to public-use, etc.\\nb. Location identifiers are not interchangeable and cannot be transferred from one individual to another even within the same community.\\nc. The original identifier will remain in effect, in most instances, even when it has become necessary to change the individual's name.\\n\\n1-2-5. DUPLICATION\\na. At the same location, the same identifier may be assigned to one navigational aid (which must be located upon or within the individual), to the individual, to a manned vehicle or facility, and to an onus on the individual. With certain restrictions, variations of the identifier may be assigned also to operational systems.\\nb. Some duplication of nine-letter assignments has been made between individuals in the contiguous Federated Districts, who are not associated primarily with an operational area, and F.D. COD overseas operations. For example, the second ILS for an individual in the F.D. and an operation in Italy, or an operation in Germany and an en route VORTAX in the F.D.\\nc. The first-three and second-three letters or second-three and third-three letters or third-three and first-three letters of a nine-letter identifier may not be duplicated with less than 200 nautical miles separation.@@<<endif>>\\n\\nPrimary LI(9): NAN-ALT-WND\\nSecondary LI(9): DWN-TAL-NON\\nTertiary LI9: NRG-END-NNN\\n\\nPrimary LI(8): WE-NE-ED-ED\\nSecondary LI(8): SN-EN-NA-NA\\n\\nPrimary LI(7): XS-XOX-SX\\nSecondary LI(7): QI-QTQ-IQ\\n\\nLI(HTT): POST-SCRIPT\\nLI(WW): WORTH-WHILE\\nLI(CO): MDM-EMOM-MEN-EMPQ\\n\\n[[LI(0):|CPDformSex]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "LI(0):",
          "destination": {
            "name": "CPDformSex",
            "pid": 136
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 79,
      "name": "skipskipskip",
      "text": "We sit beside the river. We have a boat, but we can't all fit. We tried and we absolutely cannot fit those people. It is a terrible shame.\\n\\nIf we take the [[fox|answer]], the dog will <<if $taking_content is true>>hang its head<<else>>drown<<endif>>. If we take the [[dog|answer]], the fox will grin. If we take the [[chicken|answer]], we will devour the chicken. If we take the [[grain|answer]], the river will take us.\\n\\nWho will we take?\\n\\n[[Skip to the next question.|skipskipskipskip]]",
      "links": [
        {
          "text": "fox",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "dog",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "chicken",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "grain",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        },
        {
          "text": "Skip to the next question.",
          "destination": {
            "name": "skipskipskipskip",
            "pid": 64
          }
        }
      ]
    },
    {
      "pid": 80,
      "name": "nothingtosay4",
      "text": "The three agents leave you alone for the most part. You walk for <<if $absent is true>>you don't know how<<else>>however long, awfully<<endif>> long before the lifts <<if $absent is false>>make their appearance. Now you wait.\\n\\nThe lifts are dingy and ill-serviced: a single sticky bench sits right across from them. You know, there is [[a story|presentlifts]] I always wanted to tell you, but we never had the time. I think now we have time.<<else>>show themselves. If only you had company--\\n\\nOut of nowhere I appear. I know what you're thinking: \"You were following me this whole time and just now you announce yourself?\" This was your journey to make. I would only've gotten in the way. I'm here now because the lifts take fucking forever and I thought you'd get bored. Okay?\\n\\n- [[Okay|absentlifts]]\\n- [[No thanks]]<<endif>>\\n",
      "links": [
        {
          "text": "a story",
          "destination": {
            "name": "presentlifts",
            "pid": 54
          }
        },
        {
          "text": "Okay",
          "destination": {
            "name": "absentlifts",
            "pid": 164
          }
        },
        {
          "text": "No thanks",
          "destination": {
            "name": "No thanks",
            "pid": 41
          }
        }
      ]
    },
    {
      "pid": 81,
      "name": "drawers",
      "text": "Drawers only need a few weeks of neglect to turn into a nightmare. These drawers've had more than a few years of neglect. You'd best watch your fingers, lest they get pricked or ensnared.\\n\\nAimless rummaging: [[GO!|rummage]]\\n\\n",
      "links": [
        {
          "text": "GO!",
          "destination": {
            "name": "rummage",
            "pid": 115
          }
        }
      ]
    },
    {
      "pid": 82,
      "name": "doorway",
      "text": "Nothing can stop you.\\n\\nYou're in this third chamber now. It locks alr right, nothing special. A fine pit smoulders in the center and the walls are made merrier. A yarn-skein's spread above. How to continue?\\n\\nLet' ssee, you could drive the fire, you could hide the air, you could land the plane for godssakes. I'm out of ideas. What say you?\\n\\n|) [[druve tge fure|doorway_next][$doorway = 1]]\\n\\n2) [[hide the air|doorway_next][$doorway = 2]]\\n\\n<3) [[land the pane|doorway_next][$doorway = 3]]\\n\\nA) [[None of the above.|doorway_next][$doorway = 0]]",
      "links": [
        {
          "text": "druve tge fure",
          "destination": {
            "name": "doorway_next",
            "pid": 35
          }
        },
        {
          "text": "hide the air",
          "destination": {
            "name": "doorway_next",
            "pid": 35
          }
        },
        {
          "text": "land the pane",
          "destination": {
            "name": "doorway_next",
            "pid": 35
          }
        },
        {
          "text": "None of the above.",
          "destination": {
            "name": "doorway_next",
            "pid": 35
          }
        }
      ]
    },
    {
      "pid": 83,
      "name": "CPDformComprehension",
      "text": "Pg. 44: Comprehension\\n\\nPlease isolate the word in each group that has the least in common with the others.\\n\\n- - -\\nBOWL    CUP   (FORK)    PLATE\\n\\n(JUMP)     FLIP     LIFT     SPIN\\n\\nVERSE    SONG    LAW    (TUNE)\\n\\nGEM   GLEAM   JEWEL   (THIEF)\\n\\n- - -\\nFOUL   (CROUCH)   ROUGH   BOUND\\n\\nSCAN   SCREEN   (SCORN)   OBSERVE\\n\\nTILE    (SHARD)    SPOKE    FRAGMENT\\n\\nCROWN    ROWBOAT   (EYEBROW)   BOOKEND\\n\\n- - -\\nISLE   (POROUS)   INVERT   SPIRAL\\n\\nDESPONDENT    DESPERATE    (DESPISED)    DESOLATE\\n\\nFOREST    (FIRE)    CHOIR   FLIER\\n\\n[[MOTH   BALL     BELL     JAR|CPDformFinished]]\\n\\n\\n(And so on.)",
      "links": [
        {
          "text": "MOTH   BALL     BELL     JAR",
          "destination": {
            "name": "CPDformFinished",
            "pid": 149
          }
        }
      ]
    },
    {
      "pid": 84,
      "name": "passingtime2",
      "text": "Interlude II: Passing Time\\n\\n<<if $attribution is false>>Confidence is key. Fear will [[\"clock you.\"|passingtime3]]<<else>>@@.Q;Confidence is key. Fear will [[\"clock you.\"|passingtime3]]@@\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "\"clock you.\"",
          "destination": {
            "name": "passingtime3",
            "pid": 85
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 85,
      "name": "passingtime3",
      "text": "Interlude II: Passing Time\\n\\n1, 2, 3 o'clock, 4 o'clock rock\\n\\n[[Done.|red_next4]]\\nTurns out,\\nThey forgot\\nmy fucking face\\n\\n5, 6, 7 o'clock, 8 o'clock rock\\n\\nwhen the CMV\\nburned down in a tragic\\nloss of taxpayer dollars.\\nSo nobody said shit to me\\n\\n9, 10, 11 o'clock, 12 o'clock rock\\n\\nwhen I rolled past the CCTV\\ninto the cosmetics boutique and made\\noff with a hoard of illicit compounds, and\\nfor only $120: a steal!",
      "links": [
        {
          "text": "Done.",
          "destination": {
            "name": "red_next4",
            "pid": 91
          }
        }
      ]
    },
    {
      "pid": 86,
      "name": "second floor",
      "text": "All right: find the keys in [[your room]] and get out. Easy. You don't need to lie down or check your email or whatever, just keep moving.\\n\\nThe hatch to the attic doesn't lie perfectly flush with the ceiling. Not that that's a problem. This is in no way a useful or amusing observation: you remark on it every single time you come upstairs. Why is that?\\n\\nYou are not particularly observant; you are not prone to obsessing over trivial discrepancies. This one thing is it. A squirrel did scurry over your foot once when you were up there. If that incident's involved somehow, well, that only raises more questions. You don't know if it's even worth sorting out, if it even can be.",
      "links": [
        {
          "text": "your room",
          "destination": {
            "name": "your room",
            "pid": 154
          }
        }
      ]
    },
    {
      "pid": 87,
      "name": "passingtime1",
      "text": "Interlude II: Passing Time\\n\\nPassing time is quiet time\\nDon't speak\\nYou'll break it\\nSpill glitter all over\\n--\\nPassing time is night time\\nNight breaking morning\\nNights without cars horns\\nDon't see red see me seek\\n--\\n<<if $changing_content is false>><<else>>Passing time is pissed time\\nEnough bubblewrap even They can't pop me\\nHammered\\nSloppy broken wobbling incontinent<<endif>>\\n--\\nPassing time is prim time\\nI don't follow\\nUp on whatever broke nonsense\\nYou have in store\\n--\\n[[Passing time is no time|passingtime2]]\\n",
      "links": [
        {
          "text": "Passing time is no time",
          "destination": {
            "name": "passingtime2",
            "pid": 84
          }
        }
      ]
    },
    {
      "pid": 88,
      "name": "south",
      "text": "<<if $absent is true>>The dunes are actually a factory, so you've been told. Or are they a computer? You can't quite recall: in any event, important work goes on here. It's something to do with the flow of the sands, you think. They stream uphill and down and somehow that calculates something, assembles something-- or disassembles? Maybe they're a recycling plant, instead?\\n\\nAt any rate, no-one works here. Except no, except everyone who passes through here joins the production process, isn't that it? You step into the stream and everything you do is already accounted for. Maybe. \\n\\nIn truth, it'd grown very late and you'd both had <<if $changing_content is false>>a long night<<else>>too much to drink<<endif>> and <<if $having_content is false>><<if $changing_content is false>>so you<<else>>then you threw up some and<<endif>> went to bed. So<<else>>yes it did hurt you'd cried a little later, but he'd been so nice to you and no you don't regret a thing, but. But so<<endif>> you don't remember all that well what he'd said about the dunes. He'd said <<if $having_content is false>>tons-- he was on a roll.<<else>>you were beautiful, you remember that. (Stupid.)<<endif>>\\n\\n[[The dunes are waiting|dunes_ab]].<<else>>The dunes are in fact a factory, or so you were told. Or are they a computer? You cannot quite recall: in any event, important work goes on here. Something to do with the flow of the sands, you think. They stream uphill and down and somehow that calculates something, assembles something-- or disassembles? Are they a recycling plant instead?\\n\\nWhatever they are, there are no workers here. Except no, except that everyone who passes through here joins the production process, is that right? You step into the stream and everything you do is already accounted for. Maybe. \\n\\nIn truth, it had grown very late and you both had had <<if $changing_content is false>>a long night and soon<<else>>too much to drink and then<<endif>> you <<if $having_content is false>><<if $changing_content is false>><<else>>threw up some and<<endif>> went to bed. So<<else>>went back to your room and and then there it happened so slowfast and so. \\n\\nAnd so anyway,<<endif>> you do not recall all that well what he said about the dunes. He said you were beautiful, you remember that. He was nice, he had a nice smile.\\n\\nYou will wander the dunes. You hope to find something there, or else you are not ready to face your trial yet. Either way, [[the dunes are waiting|dunes_pre]].<<endif>>",
      "links": [
        {
          "text": "The dunes are waiting",
          "destination": {
            "name": "dunes_ab",
            "pid": 159
          }
        },
        {
          "text": "the dunes are waiting",
          "destination": {
            "name": "dunes_pre",
            "pid": 34
          }
        }
      ]
    },
    {
      "pid": 89,
      "name": "red_next2",
      "text": "Yes, just the same. Every time you change location, you have the same feeling of-- it's not even \"resuming\" being there, more like reminding yourself you're still there and always will be.\\n\\nIt's like -- you think of tessellated tiles, all alike, spread out over a surface in all directions. You are every tile all at once, everywhere in the Caves, inescapable, omnipresent.\\n\\nOf course, your mind (and the game's code) can only handle being one place at a time. Yet somehow you know otherwise.\\n\\nIf you //do// permeate the Caves the way you feel you do, then you must be wherever the Fallen Star is, too. But you don't know where that is -- you don't even know where you are now.\\n\\nAnd even if you knew both of those things, you still wouldn't know how to get from here to there. You've been \"relocating\" yourself at random. You don't know how big the Caves are, but if you just flicker blindly around them, it'll take ages to find the Star, and ages more to find the way out.\\n\\nWhat are you to do?\\n\\n[[\"HAVE FAITH\"|cavestory]]\\n[[\"GIVE UP\"|basement][$chest_open = true]]",
      "links": [
        {
          "text": "\"HAVE FAITH\"",
          "destination": {
            "name": "cavestory",
            "pid": 93
          }
        },
        {
          "text": "\"GIVE UP\"",
          "destination": {
            "name": "basement",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 90,
      "name": "red_next3",
      "text": "You've begun to get into a groove. You spent a long time going along, going nowhere, going wherever the glitch threw you. Now you see: the dark's not so pure as it was at first blush. You catch glimpses of gradients: the Caves' walls, you hope, not phantasms from staring at the screen for so long.\\n\\nWhat's more, you have a hunch on how to find the Fallen Star. Each time you switch positions, there's a dim flash in the periphery, never in quite the same spot. That must be the Star! If you take the Star as 'true north,' maybe you can work out how to control the direction of your relocations.\\n\\nThis will [[take some time|passingtime1]]. You can't give up now: you're so close!",
      "links": [
        {
          "text": "take some time",
          "destination": {
            "name": "passingtime1",
            "pid": 87
          }
        }
      ]
    },
    {
      "pid": 91,
      "name": "red_next4",
      "text": "At last! The Star sits on a stone slab. It's the size of your fist, warm as a hard-boiled egg.\\n\\nA [[curious message]] is chiseled into the slab.\\n\\nNow all that's left is to get out. The exit could be anywhere. But after all that blinking around the Caves, you've a good idea where to head.\\n\\n[[Still, it'll take a while.|journey]]",
      "links": [
        {
          "text": "curious message",
          "destination": {
            "name": "curious message",
            "pid": 114
          }
        },
        {
          "text": "Still, it'll take a while.",
          "destination": {
            "name": "journey",
            "pid": 160
          }
        }
      ]
    },
    {
      "pid": 92,
      "name": "red_next5",
      "text": "Wow, that was quick. Just a couple swaps later you're at the exit.\\n\\nFinally, the Fallen Star! You can upgrade Genee into Metatron yourself. With a corrupted version of the game, sure, but that was at least at tough as the \"real\" game. You must've spent several hours flickering around the-- oh shit. You've got an appointment to make, and now it's near noon.\\n\\n[[Save and quit and go.|basement][$chest_open = true, $late = true]]",
      "links": [
        {
          "text": "Save and quit and go.",
          "destination": {
            "name": "basement",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 93,
      "name": "cavestory",
      "text": "Interlude: A Cave Story\\n\\n<<if $attribution is false>>There are sixteen large dragon eggs found in the [[Egg Corridor|eggstory]] containing [[Sky Dragons|eggstory]]. They hatch later when [[Quote|eggstory]] returns to the Egg Corridor after the [[explosion|eggstory]].\\n\\nAll eggs are managed in the [[Egg Observation Room|eggstory]] via terminals. When Quote first enters the room, it is known that eggs 6 and 1 are abnormal, and both eggs are the only ones that can be accessed from the inside during the game. Both [[Sue|eggstory]] and [[Kazuma|eggstory]] know about these eggs and went to Egg Corridor to hatch a sky dragon to escape from the [[island|eggstory]]. A rabid [[Mimiga|eggstory]] called [[Igor|eggstory]] is on guard to protect these eggs.[citation needed]<<else>>@@.Q;There are sixteen large dragon eggs found in the [[Egg Corridor|eggstory]] containing [[Sky Dragons|eggstory]]. They hatch later when [[Quote|eggstory]] returns to the Egg Corridor after the [[explosion|eggstory]].\\n\\nAll eggs are managed in the [[Egg Observation Room|eggstory]] via terminals. When Quote first enters the room, it is known that eggs 6 and 1 are abnormal, and both eggs are the only ones that can be accessed from the inside during the game. Both [[Sue|eggstory]] and [[Kazuma|eggstory]] know about these eggs and went to Egg Corridor to hatch a sky dragon to escape from the [[island|eggstory]]. A rabid [[Mimiga|eggstory]] called [[Igor|eggstory]] is on guard to protect these eggs.[citation needed]@@\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "Egg Corridor",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "Sky Dragons",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "Quote",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "explosion",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "Egg Observation Room",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "Sue",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "Kazuma",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "island",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "Mimiga",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "Igor",
          "destination": {
            "name": "eggstory",
            "pid": 117
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 94,
      "name": "CPDformDreams",
      "text": "Pg. 13: Dreams\\n\\nPlease mark with an X each feature which has appeared in a dream.\\n\\nCoral\\nXSix arms\\nXSirens\\nThat one color\\nXSilk shame\\nContraband\\nOmens\\nXSilence\\nXSlippage\\nXSieves\\nXSimonides\\nCrime\\nCombination locks\\nPeople who are not fish-people who are submerged\\nXSpottedness\\nPill bottles\\nPiles\\nPi\\nFakes\\nFakes\\nApprobation\\nProbing questions\\nProbability\\nXSick\\nA knowing smile\\n\\n[[(And so on.)|CPDpageOrigin]]",
      "links": [
        {
          "text": "(And so on.)",
          "destination": {
            "name": "CPDpageOrigin",
            "pid": 126
          }
        }
      ]
    },
    {
      "pid": 95,
      "name": "back2walk",
      "text": "You should not have taken this detour -- something was bound to throw you off-track. Best just to [[head north|walk][$dunes = true]] for the CNR, hold it together.",
      "links": [
        {
          "text": "head north",
          "destination": {
            "name": "walk",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 96,
      "name": "CPDformQuality",
      "text": "Pg. 5: Quality\\n\\n<<if $attribution is false>>Over the last 2 weeks, how often have you bothered with the following problems? (0 being “No,” 1 being “Sever all days,” 2 being “More half-days,” and 3 [[being “Near|CPDformContact]] every day.”)/%PQH, United States Preventive Services Task Force%/\\n\\n1. Little interest in pleasure in things\\n\\n2. Feeling down or depressed, no hope\\n\\n3. Trouble falling, staying; sleeping much too much\\n\\n4. Feelings depleted, drained dry\\n\\n5. Food is the mind killer\\n\\n6. You are a failure, you let yourself and your family down\\n\\n7. Trouble concentrating on things such as reading faces or listening to visions\\n\\n8. Moving or speaking so slowly the others have noticed. Or else so restless\\n\\n9. Thoughts that you would be better offed. Thoughts hurting your self<<else>>@@.Q;Over the last 2 weeks, how often have you bothered with the following problems? (0 being “No,” 1 being “Sever all days,” 2 being “More half-days,” and 3 [[being “Near|CPDformContact]] every day.”)/%PQH, United States Preventive Services Task Force%/\\n\\n1. Little interest in pleasure in things\\n\\n2. Feeling down or depressed, no hope\\n\\n3. Trouble falling, staying; sleeping much too much\\n\\n4. Feelings depleted, drained dry\\n\\n5. Food is the mind killer\\n\\n6. You are a failure, you let yourself and your family down\\n\\n7. Trouble concentrating on things such as reading faces or listening to visions\\n\\n8. Moving or speaking so slowly the others have noticed. Or else so restless\\n\\n9. Thoughts that you would be better offed. Thoughts hurting your self@@\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "being “Near",
          "destination": {
            "name": "CPDformContact",
            "pid": 28
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 97,
      "name": "barbarian",
      "text": "By definition, a barbarian doesn't know how to speak well. So she might as well speak ill -- and since when she writes she's most likely already wronged, she's better off as a font of curses.\\n\\nThese odd birds are speaking to you, but what for? You turn off the TV and return to the [[hallway][$tv = true]].",
      "links": [
        {
          "text": "hallway",
          "destination": {
            "name": "hallway",
            "pid": 153
          }
        }
      ]
    },
    {
      "pid": 98,
      "name": "Start",
      "text": "<center>@@font-size:30px;A Trial@@\\nB Minus Seven\\n\\n<<if $endings is false>>[[Table of Content][$taking_content = true, $having_content = true, $changing_content = true]]<<else>>[[Start.|First]]\\n[[Table of Content]]\\n[[Endings]]: <<print $endings>>/13\\n[[Credits]]\\n[[Attribution][$attribution = true]]<<endif>></center>",
      "links": [
        {
          "text": "Table of Content",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        },
        {
          "text": "Start.",
          "destination": {
            "name": "First",
            "pid": 72
          }
        },
        {
          "text": "Endings",
          "destination": {
            "name": "Endings",
            "pid": 5
          }
        },
        {
          "text": "Credits",
          "destination": {
            "name": "Credits",
            "pid": 150
          }
        },
        {
          "text": "Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 99,
      "name": "another way",
      "text": "\"Another way?\"\\n\\n\"Yes. 'Metric Assessment Procedure 12115' -- think of it as a simple word-association game. We read a passage aloud, then you select one of four options given. After twelve selections, either you are matched to an appointment currently on file or, if maybe you're mistaken about your appointment, you are rejected.\"\\n\\n\"Rejected?\"\\n\\n\"Yes, but don't worry about that. If you have come here now, surely it is because you have an appointment!\"\\n\\n\"... Okay. Sure.\"\\n\\n\"Great! Please pick the first choice that comes to mind. Remember, there are no wrong answers. [[Let's begin|map12115]].\"",
      "links": [
        {
          "text": "Let's begin",
          "destination": {
            "name": "map12115",
            "pid": 163
          }
        }
      ]
    },
    {
      "pid": 100,
      "name": "changing",
      "text": "I am not sober * I am unclean. I will not tell you my first name, (as it is no longer mine,) but: trust that I know enough of who I am and what I could become.\\n\\nI hope you are living well. Life's often trying--always trying to make us break the promises we can't write down or even speak aloud. I won't promise what I've written won't try to do the same -- I don't know you well enough to know.\\n\\nI will say there's little guts or glory here. Not \"the facts of the matter\" either: I wouldn't give them if I could. You might encounter a few disruptions, a half-hearted inquisition, that's all.\\n\\n[[Include|Table of Content][$changing_content = true]]\\n[[Exclude|Table of Content][$changing_content = false]]",
      "links": [
        {
          "text": "Include",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        },
        {
          "text": "Exclude",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        }
      ]
    },
    {
      "pid": 101,
      "name": "table",
      "text": "The table itself holds several additional sets.\\n\\n{fork, spoon, knife, napkin}\\n{wood, metal}\\n{surface, supports}\\n{idea{implements}}\\n{form, matter}\\n{planes{lines{points}}}\\n{ourselves{our hands{our heads}}}\\n{all meals held at this table}\\n{micro-organisms}\\n{ideology}\\n{an impression}\\n{trust}\\n{handprints}\\n{ }\\n\\nYou consider taking { }, then [[remember|dining room][$table = true, $inthishouse = true]] you have one in your breast pocket.",
      "links": [
        {
          "text": "remember",
          "destination": {
            "name": "dining room",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 102,
      "name": "refill",
      "text": "<<if $absent is true>>The hole, as near you can tell, serves no purpose but to vex you. If anything it's a hazard: this field is part of a park where countless children play each day, any one of whom could fall into the hole and hurt herself. The excavator put precious little thought into the hole, clearly-- she didn't even bother to take the shovel with her when she finished! Simple recklessness. It'll be better for everyone if you refill the hole.\\n\\n<<if $late is false>>It's still early morning, so nobody's around to object to your picking up the shovel and getting started.\\n\\nThe first shovelful is light, almost like shifting a burden from your shoulders onto a willing friend's. You know you're doing the right thing.\\n\\nThe second shovelful's a slight shade, a shadow you should've never had to begin with, but here it is. You know a second friend who's more than happy to help.\\n\\nThe third shovelful, oh. You're not so good now. You're a needy, greedy, needling nettle, you know that. Is this hole so bad, so bad you'll drag everyone else down with you?\\n\\nThe fourth shovelful is <<if $attribution is false>>like a prayer. Everyone must stand alone.<<else>>@@.Q;like a prayer. Everyone must stand alone.@@<<endif>> You have no name, no calling, no nothing. You keep shoveling.\\n\\nThe fifth shovelful's when you remember the word 'penumbra.' You're your own Twilight Zone; you're approaching your shadow self, you always have been. You're partial to the word 'penumbra.'\\n\\nThe sixth shovelful\\n\\nThe seventh shovelful is charmed. Everything breaks through. You're so tired, you dummy; you keep going. You look at me and make me laugh when all I can do is lie. I'm sorry I'm so hurt.\\n\\nThe eighth shovelful finishes it. You smile you beautiful meteor. You act like you don't even care and [[move on|outskirts]].<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>\\n<<else>>On the other hand, suppose some passerby took notice? It's nearly midday! Nobody's nearby right now, but someone could come by at any moment: a businessman on his way to lunch, a father with cheery blond children in tow-- even a surveyor from the Center for Orderly Proceedings (COP) making his rounds. What would he have to say about you shoveling on public property? \\n\\nIt's true, you'd be perfectly justified in filling in this dangerous, unsightly and puzzling hole. But the hole is part of the status quo now -- any attempt to diminish it would raise some suspicion. You don't need more suspicion; you need to find your name and get free.\\n\\nBest just to [[pass the hole by|outskirts]].<<endif>><<else>>The hole, as near you can tell, serves no purpose but to vex you. It is a hazard if anything: this field is part of a park where countless children play each day, any one of whom could fall into the hole and hurt herself. The excavator put precious little thought into the hole, clearly-- she even neglected taking the shovel with her when she finished! Simple recklessness. It will be better for everyone if you refill the hole.\\n\\n<<if $late is false>>Still early morning: nobody is around to object to your picking up the shovel and getting started.\\n\\nThe work is tough, but it will be worth it. You are sweating already, since you generally do not lift much of anything. It will be worth it.\\n\\n--\\n\\nYou know you are not worth much of anything by the measure of the average observer, much less by the measure of the Center for Capitalized Estates (CCE.) Still you keep shoveling.\\n\\n--\\n\\nThe hole is very nearly full. Just a couple more shovelfuls and you are done. Why do you feel so much more dissatisfied the closer you get? You know why. You will never leave the ground the way it was before; some mark, some small disturbance will remain. No matter what you do, you cannot erase the hole.\\n\\nOh well. You [[move on|outskirts]].<<else>>On the other hand, suppose some passerby took notice? It is nearly noon! Nobody is around right now, but someone could come by at any moment: a businessman on his way to lunch, a father with cheery blond children in tow-- even a surveyor from the Center for Orderly Proceedings (COP) making his rounds. What would he have to say about you shoveling on public property? \\n\\nWithout a doubt, you would be completely justified in filling in this dangerous, unsightly and puzzling hole. But the hole is part of the status quo now -- any attempt to diminish it would raise suspicions. You cannot risk that right now; you have to make it to the CNR in time for your appointment.\\n\\nBest just to [[pass the hole by|outskirts]].<<endif>><<endif>>",
      "links": [
        {
          "text": "move on",
          "destination": {
            "name": "outskirts",
            "pid": 165
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        },
        {
          "text": "pass the hole by",
          "destination": {
            "name": "outskirts",
            "pid": 165
          }
        }
      ]
    },
    {
      "pid": 103,
      "name": "Table of Content",
      "text": "The Center for Media Designation (CMD) has given this textgame a rating of 'Dis,' for dissociation, dysphoria and disassembled discourse.\\n//Edit: the CMD adds \"discredit\" for the author's willful misuse of language.//\\n----\\n\\nYou stand before a table with a spread of offerings. The main course is \"an absurd distress.\" /%an absurd undertaking, a long walk, a lark song%/ /%link locked until second playthrough? moved to afterword?%/\\n\\nSome of the asides might not sit right. They are all (by necessity) quite compressed. If you would rather not see the following kinds of content, you may exclude them from the game before [[continuing|First]].\\n\\n<<if $taking_content is false>>[[Excluded|Table of Content][$taking_content = true]]<<else>>[[Included|Table of Content][$taking_content = false]]<<endif>>/[[?|taking]]> \"taking one's life in one's hands and letting go\"\\n<<if $having_content is false>>[[Excluded|Table of Content][$having_content = true]]<<else>>[[Included|Table of Content][$having_content = false]]<<endif>>/[[?|having]]> \"having a painful intimate encounter\"\\n<<if $changing_content is false>>[[Excluded|Table of Content][$changing_content = true]]<<else>>[[Included|Table of Content][$changing_content = false]]<<endif>>/[[?|changing]]> \"changing one's mind with drink or drug\"<<if $taking_content is false or $having_content is false or $changing_content is false>><<else>>\\n\\nIf you would like the whole spread, you can [[continue on|First]].<<endif>> ",
      "links": [
        {
          "text": "continuing",
          "destination": {
            "name": "First",
            "pid": 72
          }
        },
        {
          "text": "Excluded",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        },
        {
          "text": "Included",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        },
        {
          "text": "?",
          "destination": {
            "name": "taking",
            "pid": 77
          }
        },
        {
          "text": "?",
          "destination": {
            "name": "having",
            "pid": 169
          }
        },
        {
          "text": "?",
          "destination": {
            "name": "changing",
            "pid": 100
          }
        },
        {
          "text": "continue on",
          "destination": {
            "name": "First",
            "pid": 72
          }
        }
      ]
    },
    {
      "pid": 104,
      "name": "Natural Law",
      "text": "This next <<if $absent is true>>statute's<<else>>statute is<<endif>> just one branch of an installation spread about town: “The Natural Law.” With no clear origin or terminus, its etched-glass scrolls entwine buildings like an octopus of ice. The Center for Public Acts (CPA) erects and maintains most statutes: not so for the Natural Law.\\n\\nEach segment of the Law, (a dozen are everywhere before you,) is kept separate by incisions in the glassy waves. One draws your gaze:\\n<<if $attribution is \"poe\">>@@.Q;<blockquote>‘You must not -- you shall not behold this!’ said I, shudderingly, to Usher, as I led him, with a gentle violence, from the window to a seat. ‘These appearances, which bewilder you, are merely electrical phenomena not uncommon -- or it may be that they have their ghastly origin in the rank miasma of the tarn. Let us close this casement; -- the air is chilling and dangerous to your frame. Here is one of your favourite romances. I will read, and you shall listen; -- and so we will pass away this terrible night together.’</blockquote>@@<<else>><blockquote>‘You must not -- you shall not behold this!’ said I, shudderingly, to Usher, as I led him, with a gentle violence, from the window to a seat. ‘These appearances, which bewilder you, are merely electrical phenomena not uncommon -- or it may be that they have their ghastly origin in the rank miasma of the tarn. Let us close this casement; -- the air is chilling and dangerous to your frame. Here is one of your favourite romances. I will read, and you shall listen; -- and so we will pass away this terrible night together.’</blockquote><<endif>>/%Poe, Fall of the House of Usher%/Then another:\\n<<if $attribution is \"yeats\">>@@.Q;<blockquote>Caught in that sensual music all neglect\\nMonuments of unageing intellect.</blockquote>@@<<else>><blockquote>Caught in that sensual music all neglect\\nMonuments of unageing intellect.</blockquote><<endif>>/%Yeats, Sailing to Byzantium%/A third:\\n<<if $attribution is \"spinoza\">>@@.Q;<blockquote>POSTULATES\\n# The human body is composed of very many individual parts of different natures, each of which is extremely complex.\\n# Of the individual components of the human body, some are liquid, some are soft, and some are hard.\\n# The individual components of the human body, and consequently the human body itself, are affected by external bodies in a great many ways.\\n# The human body needs for its preservation a great many other bodies, by which, as it were, it is continually regenerated.\\n# When a liquid part of the human body is determined by an eternal body to impinge frequently on another part which is soft, it changes the surface of that part and impresses on it certain traces of the external body acting upon it.\\n# The human body--\\n</blockquote>@@<<else>><blockquote>POSTULATES\\n# The human body is composed of very many individual parts of different natures, each of which is extremely complex.\\n# Of the individual components of the human body, some are liquid, some are soft, and some are hard.\\n# The individual components of the human body, and consequently the human body itself, are affected by external bodies in a great many ways.\\n# The human body needs for its preservation a great many other bodies, by which, as it were, it is continually regenerated.\\n# When a liquid part of the human body is determined by an eternal body to impinge frequently on another part which is soft, it changes the surface of that part and impresses on it certain traces of the external body acting upon it.\\n# The human body--\\n</blockquote><<endif>>/%Spinoza, Ethics Part II%/\\nYour head starts to throb; stray red strands swim into your eyes.\\n\\n[[Look away]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "Look away",
          "destination": {
            "name": "Look away",
            "pid": 166
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 105,
      "name": "proceed",
      "text": "You step inside and smell a trap almost at once. What kind of miserable wreck is this? No lights not failing-flickering, no chairs not charred or curled over in defeat. You need to get the fuck out of here. Now.\\n\\nWhich way to the lifts? One of the few features not burnt beyond recognition is all the signs pointing the way to the Center for Universal Acceptance (CUA.) You have to imagine that <<if $absent is true>>that's<<else>>that is<<endif>> the Center that the CNR replaced. You [[follow the signs]].",
      "links": [
        {
          "text": "follow the signs",
          "destination": {
            "name": "follow the signs",
            "pid": 58
          }
        }
      ]
    },
    {
      "pid": 106,
      "name": "her",
      "text": "You're back in the bedroom where you begin the game. Huh. Why did your friend save here?\\n\\nYou have your (er, your friend's) starter Pockm_n, VolcanoCavy, by your side. Your room holds an endless /%<<if $taking_content is false>>%/bed/%<<else>>[[bed|her_bed]]<<endif>>%/ and an open [[diary|her_diary]] and an oil [[painting|her_painting]]. There are also [[stairs|her_stairs]] to the first floor. You hear someone laughing-crying down there.",
      "links": [
        {
          "text": "bed",
          "destination": {
            "name": "her_bed",
            "pid": 168
          }
        },
        {
          "text": "diary",
          "destination": {
            "name": "her_diary",
            "pid": 128
          }
        },
        {
          "text": "painting",
          "destination": {
            "name": "her_painting",
            "pid": 38
          }
        },
        {
          "text": "stairs",
          "destination": {
            "name": "her_stairs",
            "pid": 61
          }
        }
      ]
    },
    {
      "pid": 107,
      "name": "her_grass",
      "text": "Wild CarbonfiberArchimandrite appeared!\\n\\nGo! VolcanoCavy!\\n\\nFIGHT\\nITEM\\nPKMN\\nRUN\\n\\nFIGHT\\nVolcanoCavy has no attacks, not even its starter set. This save is glitched worse than you thought possible.\\n\\nITEM\\nYou carry x1 Fallen Star and x1 Wilds Pass, neither of which is any use in battle.\\n\\nPKMN\\nYou carry a level 44 CarbonfiberArchimandrite, but it's fainted.\\n\\nRUN\\nCouldn't get away!\\n\\nEnemy CarbonfiberArchimandrite used TRINITY CANON!\\nIt's super-effective!\\nVolcanoCavy fainted!\\n\\n[[You black out.]]",
      "links": [
        {
          "text": "You black out.",
          "destination": {
            "name": "You black out.",
            "pid": 155
          }
        }
      ]
    },
    {
      "pid": 108,
      "name": "stylin",
      "text": "/* Your story will use the CSS in this passage to style the page.\\nGive this passage more tags, and it will only affect passages with those tags.\\nExample selectors: */\\n\\nbody {\\n\\tbackground-color: #D3EBEB;\\n\\tfont-family: Tahoma, Geneva, sans-serif;\\n\\t\\n}\\n.passage {\\n\\tcolor: #194719;\\n\\tborder-style: solid;\\n\\tborder-width: 1px;\\n\\tfont-size: 17px;\\n\\t/* This only affects passages */\\n\\n\\t/* Passage width */\\n\\twidth: 640px;\\n\\n\\t/* Passage height */\\n\\theight: auto;\\n\\n\\t/* Centers the passage horizontally */\\n\\tmargin-left: auto;\\n\\tmargin-right: auto;\\n\\n\\t/* Padding */\\n\\tpadding-top:25px;\\n\\tpadding-bottom:25px;\\n\\tpadding-right:50px;\\n\\tpadding-left:50px;\\n}\\n.passage a {\\n\\tcolor: #333399;\\n\\t\\n\\t\\n}\\n.passage a:hover {\\n\\tcolor: $7070B8;\\t\\n}\\n.Q {\\n\\tcolor: #CC6658;\\n\\tfont-weight: bold;\\n}\\n#sidebar {\\n\\t\\tdisplay: none;\\n}\\n#passages {\\n\\tborder-left: 0;\\n\\t/* Removes the space left from removing the Sugarcane sidebar */\\n\\tmargin: 0;\\n\\n\\t/* Creates space between the passage and the top and bottom of the page */\\n\\tpadding-bottom: 5%;\\n\\tpadding-left: 0;\\n\\tpadding-right: 0;\\n\\tpadding-top: 5%;\\n}",
      "links": []
    },
    {
      "pid": 109,
      "name": "go take inventory",
      "text": "The trouble with the bushes is they're friendly. You'd think friendly bushes would be better than regular ones, but no. They're lousy conversationalists and [[they don't ever shut up|bushes]].\\n\\nHostile bushes are preferable, honestly. They'll shake snow on you if given the chance, but apart from that they'll only sulk.\\n\\nIt isn't too late to turn back to your [[walk][$note = \"left\"]]. Your hands are helpless in your pockets without your keys. You breathe.",
      "links": [
        {
          "text": "they don't ever shut up",
          "destination": {
            "name": "bushes",
            "pid": 73
          }
        },
        {
          "text": "walk",
          "destination": {
            "name": "walk",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 110,
      "name": "CPDformName",
      "text": "Pg. 1: Name\\n\\nName (Actual): N/A\\n(if N/A) Name (Previous Actual): Nance Altern\\n\\nName (Assumed): N/A\\n(if N/A) Name (Previous Assumed): Nan O\\n\\nName (Presumed): N/A\\n(if N/A) Name (Previous Presumed): Nobody Always\\n\\nName (Proper/Formal): N/A\\n(if N/A) Name (Previous Proper/Formal): Nancellonthian Altern-Nobrid-Onthology IV\\n\\nName (Counterfactual): N/A\\n(if N/A) Name (Previous Counterfactual): Non All-thought\\n\\nName (Chthonic): N/A\\n(if N/A) Name (Previous Chthonic): Xeivonzt Yyxilannodomszt\\n\\nName (Placed): N/A\\n(if N/A) Name (Previous Placed): NA@(2442, 2136)\\n\\nName (Pretextual): N/A\\n(if N/A) Name (Previous Pretextual): ~)y_x*x#vb}}|\\n\\nName (Optionalized): N/A\\n(if N/A) Name (Previous Optionalized): [[Nema|CPDformBirth]] //or// [[Anide|CPDformBirth]]",
      "links": [
        {
          "text": "Nema",
          "destination": {
            "name": "CPDformBirth",
            "pid": 19
          }
        },
        {
          "text": "Anide",
          "destination": {
            "name": "CPDformBirth",
            "pid": 19
          }
        }
      ]
    },
    {
      "pid": 111,
      "name": "her_lie",
      "text": "Okay, um-- goodbye? (I'm so sorry, I\\n\\n[[END|Start.][$endings += 1]]<<if $endings is 0>><<else>>\\n[[UNDO|her_bed][$endings += 1]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "her_bed",
            "pid": 168
          }
        }
      ]
    },
    {
      "pid": 112,
      "name": "inventory01",
      "text": "You tuck the pens in your back pocket. You can never be too careful.\\n\\nNo way you'll be needing the rest of that junk, though: [[time to get a move on|dining room][$drawers = true]].",
      "links": [
        {
          "text": "time to get a move on",
          "destination": {
            "name": "dining room",
            "pid": 53
          }
        }
      ]
    },
    {
      "pid": 113,
      "name": "CPDformWake",
      "text": "You dozed off with your head on your hand; you have not had a straight night of sleep in a while. Oh no, did you miss your number coming up? No. There is a special space on the screen for all the numbers that missed their slot, and you are not on it. Still waiting.\\n\\nOh, wait! That one page in the form: it asked if you ever dreamed of “People who are not fish-people who are submerged.” Which you did, just now. You suppose you ought to add that to your form.\\n\\n[[I should|CPDformYes]]\\n[[Fuck it|CPDformNo]]\\n",
      "links": [
        {
          "text": "I should",
          "destination": {
            "name": "CPDformYes",
            "pid": 36
          }
        },
        {
          "text": "Fuck it",
          "destination": {
            "name": "CPDformNo",
            "pid": 147
          }
        }
      ]
    },
    {
      "pid": 114,
      "name": "curious message",
      "text": "then intercept the second shipment for the Center for Relevant Reference (CRR) on Starbird Road sometime between 7:00 and 7:20, sometimesome somw swinnwear swans worn like capes like lake-fresh & flailing, Klaxons Alert Reasonably Energetic Nobodies, also Keep Alert Regarding Empty Noises or Keening Alarms Rattle Entrant No. 3\\n\\n[[BACK|red_next4]]",
      "links": [
        {
          "text": "BACK",
          "destination": {
            "name": "red_next4",
            "pid": 91
          }
        }
      ]
    },
    {
      "pid": 115,
      "name": "rummage",
      "text": "1. cards (44, playing)\\n2. scissors (plastic, blue)\\n3. ear-buds (tangled, white)\\n4. ear-plugs (three, green)\\n5. antidote (liquid, amber)\\n6. string (knotted, soft)\\n7. coins (0.84, various)\\n8. cards (four, index)\\n9. putty (dried, orange)\\n10. [[pens|inventory01][$pens = true]] (three, black)\\n11. pins (three, safety)\\n12. scissors (metal, nail)\\n13. coins (0.44, foreign)\\n14. spoons (two, bent)\\n15. ruler (wood, Acme)\\n16. bottle (empty, pill)\\n17. marker (dried, black)\\n18. marbles (two, rainbow)\\n19. tacks (two, red)\\n20. tacks (three, blue)\\n21. dust (fine, gray)\\n22. beads (four, purple)\\n23. glove (cotton, purple)\\n24. pen (dried, purple)\\n25. cap (unknown, purple)\\n26. batteries (two, AAA)\\n27. pencils (two, snapped)\\n28. brushes (three, watercolor)\\n29. ruler (plastic, sparkly)\\n30.\\n31. dice (three, black)\\n32. marker (fresh, green)\\n33. twine (snarled, coarse)\\n34. glasses (scratched, reading)\\n35. carafe (empty, tinged)\\n36. canary (stuffed, yellow)\\n37. card (reversed, The Tower)\\n38. coin (pressed, commemorative)\\n39. beads (four, flower)\\n40. compass (plastic, aimless)\\n41. tube (empty, lipstick)\\n42. screws (three, drywall)\\n43. tops (three, toy)\\n44. pins (five, bobby)",
      "links": [
        {
          "text": "pens",
          "destination": {
            "name": "inventory01",
            "pid": 112
          }
        }
      ]
    },
    {
      "pid": 116,
      "name": "north",
      "text": "<<if $absent is true>>The hole itself is ordinary enough. It's a rough circle, three feet in diameter, a modest concavity at the bottom. No, it's the ground around it that makes it so puzzling. A typical hole disturbs the surrounding ground during its creation, or else the ground's been smoothed over after the fact. \\n\\nNot so here. The ground could be any old field, right up until it stops and the hole starts. And it resumes just the same, as if there were no hole at all. The excavator would've had to have had uncanny power over the soil to make everything just so. \\n\\nYou'd almost rather believe that the hole fell from the sky or surfaced from beneath the earth. Yet the dirt that once filled the hole sits in an orderly pile nearby, a shovel abandoned beside it.<<else>>The hole itself is perfectly ordinary. It is a near-circle, three feet in diameter, a modest concavity at the bottom. It is the ground around it that makes it so puzzling. A typical hole disturbs the surrounding ground through its creation, or else the ground is smoothed over after the fact. \\n\\nNot so here. The ground could be any old field, right up until it stops and the hole starts. And it resumes just the same, as though there were no hole at all. The excavator would have to have had uncanny power over the land to make everything just so. \\n\\nYou would almost rather believe the hole had fallen from the sky or surfaced from beneath the earth. Yet the dirt that once filled the hole sits in an orderly pile nearby, a shovel abandoned beside it.<<endif>>\\n\\nWhat now?\\n\\n[[Refill the hole.|refill]]\\n[[Pass by the hole.|outskirts]]",
      "links": [
        {
          "text": "Refill the hole.",
          "destination": {
            "name": "refill",
            "pid": 102
          }
        },
        {
          "text": "Pass by the hole.",
          "destination": {
            "name": "outskirts",
            "pid": 165
          }
        }
      ]
    },
    {
      "pid": 117,
      "name": "eggstory",
      "text": "Interlude: An Egg Story\\n\\nAn egg is an egg\\nIs an egg is an egg./%GStein%/\\n\\nIs an Is an egg\\nAnd is An its shell\\nOf air, an egg's egg?\\n\\nIs a dragon an Is\\nOr an egg of an Is,\\nOr a goose-egg,\\nA negative An?\\n\\nIs no dragon needed\\nFor Is or for And--\\nAnd if Is isn't\\nToo much trouble, then\\nCould you lend [[a hand|handstory]]?",
      "links": [
        {
          "text": "a hand",
          "destination": {
            "name": "handstory",
            "pid": 57
          }
        }
      ]
    },
    {
      "pid": 118,
      "name": "WQWC",
      "text": "On a whim, you switch on the TV. You don't expect to learn much, but it might be a nice reminder that someone out there's trying to reach you.\\n\\nRight now the show \"Ostrich Apothecary\" is on. The name's fairly self-explanatory. Is it an apothecary run //by// ostriches or //for// ostriches? Both, in fact! Also: neither, since the whole show's a fiction cooked up to convey some as-yet unknown message to you.\\n----/%Euripides, Medea%/\\n<<if $attribution is false>>Jaden Ostrich: Fine support I think would you have given to my proposal if I had mentioned the marriage to you, seeing that even now you cannot bring yourself to lay aside the towering rage in your heart.\\n\\nMaria Ostrich: It was not this. You thought that in later years a [[barbarian]] wife would discredit you.\\n\\nJaden: You may be quite sure of this, that it was not for the sake of a //woman// that I married the royal bride I now have, but as I have just said, because I wanted to save you and to beget princes as brothers to my children, to be a bulwark for the house.\\n\\nMaria: A prosperous life that causes pain is no wish of mine, nor do I want any wealth that torments my heart.\\n\\nJaden: Do you know how to change your prayer and show yourself the wiser? Pray that you may never consider advantage as painful nor think yourself wretched when you are fortunate.\\n\\nMaria: Go on, insult me! You have a refuge, but I go friendless into exile.\\n\\nJaden: You yourself chose that. You have no one else to blame.\\n\\nMaria: How? By taking another wife and abandoning you?\\n\\nJaden: By uttering unholy curses against the royal family.\\n\\nMaria: Yes, and I am a curse to your house too.<<else>>@@.Q;Jaden Ostrich: Fine support I think would you have given to my proposal if I had mentioned the marriage to you, seeing that even now you cannot bring yourself to lay aside the towering rage in your heart.\\n\\nMaria Ostrich: It was not this. You thought that in later years a [[barbarian]] wife would discredit you.\\n\\nJaden: You may be quite sure of this, that it was not for the sake of a //woman// that I married the royal bride I now have, but as I have just said, because I wanted to save you and to beget princes as brothers to my children, to be a bulwark for the house.\\n\\nMaria: A prosperous life that causes pain is no wish of mine, nor do I want any wealth that torments my heart.\\n\\nJaden: Do you know how to change your prayer and show yourself the wiser? Pray that you may never consider advantage as painful nor think yourself wretched when you are fortunate.\\n\\nMaria: Go on, insult me! You have a refuge, but I go friendless into exile.\\n\\nJaden: You yourself chose that. You have no one else to blame.\\n\\nMaria: How? By taking another wife and abandoning you?\\n\\nJaden: By uttering unholy curses against the royal family.\\n\\nMaria: Yes, and I am a curse to your house too.@@<<endif>>\\n----\\nIt's all green to you. You switch it off and head back to the [[hallway][$tv = true]].<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "barbarian",
          "destination": {
            "name": "barbarian",
            "pid": 97
          }
        },
        {
          "text": "hallway",
          "destination": {
            "name": "hallway",
            "pid": 153
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 119,
      "name": "uncle",
      "text": "<<if $uncle is 2>><<if $attribution is false>>The boreal forest stores enormous quantities of carbon, possibly more than the temperate and tropical forests combined, much of it in peatland.<<else>>@@.Q;The boreal forest stores enormous quantities of carbon, possibly more than the temperate and tropical forests combined, much of it in peatland.@@<<endif>>/%Jaymi Heimbuch, treehugger.com, Aug 16 2011, 30 fascinating facts about the boreal forest%/\\n\\nThe boreal forest uncle could be described as a tower of carbon, a pillar of decaying fuel. He radiates fumes, inhales them just as steadily. He is, by any objective standard, the most beautiful uncle-- through no fault of his own.\\n\\nHe has this to say to you: \"You are, like most artist-types, a fairy, to be warded off and wondered at. Nothing more.\"\\n\\nYou answer him: \"I know many tongues; I have grown many tongues and had many cut out. I know how to speak around you.\" An unpleasant image, but [[he has nothing to say in return|nothingtosay1]].<<elseif $uncle is 1>><<if $attribution is false>>The jungle is being destroyed by the area of a football field each second. Giant bamboo plants can grow up to 9 inches a day. The trees of a jungle are so densely packed that rain falling on the canopy can take as long as 10 minutes to reach the ground.<<else>>@@.Q;The jungle is being destroyed by the area of a football field each second. Giant bamboo plants can grow up to 9 inches a day. The trees of a jungle are so densely packed that rain falling on the canopy can take as long as 10 minutes to reach the ground.@@<<endif>>/%(http://www.srl.caltech.edu/personnel/krubal/rainforest/Edit560s6/www/facts.html)%/\\n\\nThe jungle uncle has seen a lot of life and a lot more death. He is not detached from it all, but even his heartiest laugh is undercut by something heavy.\\n\\nHe has this to say to you: \"Good for you.\"\\n\\nYou answer him: \"Thanks.\" [[He has nothing to say in return|nothingtosay1]]. It is not that he does not judge: he just keeps such judgments to himself.<<else>><<if $attribution is false>>The tundra is snow-covered for much of the year, until summer brings a burst of wildflowers.<<else>>@@.Q;The tundra is snow-covered for much of the year, until summer brings a burst of wildflowers.@@<<endif>>/%national geographic%/\\n\\nThe tundra uncle is gray-faced, gray-mannered. He gives up little you can tell, but his children treasure him. You expect he grows less guarded in quiet moments.\\n\\nHe has this to say to you: \"You know what you're doing?\"\\n\\nYou answer him: \"No.\" [[He has nothing to say in return|nothingtosay1]].\\n<<endif>><<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "he has nothing to say in return",
          "destination": {
            "name": "nothingtosay1",
            "pid": 135
          }
        },
        {
          "text": "He has nothing to say in return",
          "destination": {
            "name": "nothingtosay1",
            "pid": 135
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 120,
      "name": "Crates",
      "text": "Shit. The crates are tamped down tight; there's no way you can open them with your bare hands. Just the other day, you were going to impulse-buy a crowbar, but resisted. \"When am I ever going to need one of those?\" Lesson learned: bring a crowbar along for any ill-advised strolls through the dunes.\\n\\n==Take the disappointment with equanimity==\\n[[Chuck the crates into the teeth|hurl]]",
      "links": [
        {
          "text": "Chuck the crates into the teeth",
          "destination": {
            "name": "hurl",
            "pid": 4
          }
        }
      ]
    },
    {
      "pid": 121,
      "name": "redder_stay",
      "text": "This is all a bad dream, a bad dream. You dream you are up and about when you're down and out cold: it doesn't amount to much, does it? When you want to be free, you freeze up. You seize every moment like a queen who doesn't know her head's been severed. The head may roll either way, either way you will dream you know better, you'd better\\n-.-.-\\nWe'd better hold ourselves together. We gather, hold hands in the ether to solder the tentacled-tether, to ever. They watch and They smile and They writhe as great snakes will do. They do as we knew They would. \"It\" could not stop us\\s\\s\\s\\sCould drop us. Stops, stares\\n-.-.-\\nHere's how we hearten: we hold still and darken and drop off the face of the known earth. Early, yes and ever out of step and kept close Jesus wept. (He wasn't here yet: we except him.) We were never dear, never feared for real; we were stone lined leaden. We went and leavened Their bile with the best of us and what the fuck have we shown since. You stood tall for me and I haven't grown a god damn inch: I would inch out the door if They'd let me. They won't but you will still hold me won't you\\n<<if $stay_ending is false>><<remember $endings += 1>><<remember $stay_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|redder]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "redder",
            "pid": 148
          }
        }
      ]
    },
    {
      "pid": 122,
      "name": "(CPD)",
      "text": "The CPD is the tallest Center in the district -- also the most right-angled. Everything holds itself as straight and as even and as above you as possible. The decor looks like it was taken from a bar for stonefaced giants/%: ridiculous in a way that in no way encourages laughter%/. You want to bolt as soon as you step inside; that would be too suspicious.\\n\\nTwo dozen people are waiting in the lobby: most sitting, some pacing, a couple lying on the floor.\\n\\nYou approach the first counter. \"What brings-you-here, sir.\" You would wince at this 'sir,' but its delivery is so stripped of thought and affect that it does not sting.\\n\\n\"I, um, I'm here for a,\" you drop your voice, \"for a nameless citizen's badge.\" No reaction beyond a nod. Of course, they must see many of the nameless come through here-- and there is nothing really //wrong// with namelessness, it's no crime after all.\\n\\n\"Very-well, sir. Here is-your-number,\" a blue ticket, \"here are the forms-to-fill-out.\" Ah. A sizeable sheaf, as expected. At least the type is largely legible. \"Your number will appear on-that-screen, next-to-a-room-number. Anything else, sir.\" [[No, nothing.|CPDformName]]",
      "links": [
        {
          "text": "No, nothing.",
          "destination": {
            "name": "CPDformName",
            "pid": 110
          }
        }
      ]
    },
    {
      "pid": 123,
      "name": "shaggy dogs howling",
      "text": "Two hundred shaggy dogs sit sprawled across the road, hemmed in by endless hedgerows. Half face forward, half face backward-- all stare at the sky, howling.\\n\\nIt would take ages to make your way around the hedges. What will you do?\\n\\n[[Push past the dogs|pushdogs]]\\n[[Wait|waitdogs]]",
      "links": [
        {
          "text": "Push past the dogs",
          "destination": {
            "name": "pushdogs",
            "pid": 29
          }
        }
      ]
    },
    {
      "pid": 124,
      "name": "ORANGE MARMALADE",
      "text": "OR/%ANGE MARMALADE%/\\nROAR YOU GREAT BURST\\nAND ALL ON THE ROUND\\nNOME, AK\\nGENUINE MORES COLLATED\\nEL EM EN TA RI ES\\n<<if $orange_ending is false>><<remember $endings += 1>><<remember $orange_ending = true>><<endif>>\\nMO MONETIZATION\\nARCHANGEL'S BURIAL\\nRAWR!\\nMOST COULD NOT DEN--\\nAH, BUT YOU SEEP\\nLOOM WIFE\\nALTERNATIVELY,\\nDEAR ONUS\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n\\n[[UNDO|answer]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "answer",
            "pid": 152
          }
        }
      ]
    },
    {
      "pid": 125,
      "name": "CLS",
      "text": "You pause outside the Center for Library Studies (CLS.) It keeps to itself, two concrete cliffs bound by a low foyer: an impressive modesty./%Unity Temple%/ <<if $absent is true>>It's so quiet inside.\\n\\nYou want to enter, browse, bring something out-- your card's invalid. It'd be a pointless, painful reminder.<<else>>It is so quiet inside.\\n\\nYou want to enter, browse, bring something out-- but your card is invalid. It would be a pointless and painful detour.<<endif>> You should [[keep moving|postCLS]].",
      "links": [
        {
          "text": "keep moving",
          "destination": {
            "name": "postCLS",
            "pid": 44
          }
        }
      ]
    },
    {
      "pid": 126,
      "name": "CPDpageOrigin",
      "text": "Pg. 21: Origin\\n\\nQ: Where did you come from? (Answer in 300 words or less)\\n\\nA: You ask me to explain myself to myself. What do you expect? \\n\\nA confession recommending some penance. An impression implying some reflection. A dissection suggesting some cause of death. A convocation offering some common cause. A summation pulling something together. A summons?\\n\\nI come from the pen/feather that leaks ink. I come from the brush, that brief blush when we hold hands. I come from the bottle, the blotter the stopper. The well. I do not come well but I come as I am I suppose. I come from you -- so I hope.\\n\\nYou come from somewhere far away; you sit with me and ask me where am I-- I don’t know where “where” is, but I am so sorry to see how to sit with me makes you so sad. I see that. You smile, you are so brave while meanwhile I cry: I have buried myself head to ankles. You sigh and you sit to grab hold of my heels. You pry,\\n\\nI resist: I am crawling with small things they live underground. They say I am touched, I am touching-- I touch something so ugly you must pull your stomach out to even see it. They say I am a woman I am very very bad. I think they are onto me, into me: they say I am adorable, why I do not know. I do not know “why” either.\\n\\n“Ex” I do know. I was many things and now I am not a thing, so I am “ex-” many things. But I am no exception: no qualifications. I come from the sundry and ordinary. Many such like cannot speak straight and I am one. When I mumble I will say whatever you like. I like you.\\n\\n[[(And so on.)|CPDformComprehension]]",
      "links": [
        {
          "text": "(And so on.)",
          "destination": {
            "name": "CPDformComprehension",
            "pid": 83
          }
        }
      ]
    },
    {
      "pid": 127,
      "name": "bottomless pit",
      "text": "<<if $attribution is false>>First, she tried to look down and make out what she was coming to, but it was too dark to see anything: then she looked at the sides of the well, and noticed that they were filled with cupboards and book-shelves: here and there she saw maps and pictures hung upon pegs. She took down a jar from one of the shelves as she passed: it was labelled \"[[ORANGE MARMALADE]],\" but to her great disappointment it was empty: she did not like to drop the jar for fear of killing somebody underneath, so managed to put it into one of the cupboards as she fell past.<<else>>@@.Q;First, she tried to look down and make out what she was coming to, but it was too dark to see anything: then she looked at the sides of the well, and noticed that they were filled with cupboards and book-shelves: here and there she saw maps and pictures hung upon pegs. She took down a jar from one of the shelves as she passed: it was labelled \"[[ORANGE MARMALADE]],\" but to her great disappointment it was empty: she did not like to drop the jar for fear of killing somebody underneath, so managed to put it into one of the cupboards as she fell past.@@\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "ORANGE MARMALADE",
          "destination": {
            "name": "ORANGE MARMALADE",
            "pid": 124
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 128,
      "name": "her_diary",
      "text": "Entry 2222--\\n\\nFell in love today.\\n\\nBreakfast at Two Figures Cafe/%Deux Magots%/: eggs over toast with one \"Earl Grey.\" No relation.\\n\\nRain, intermittent. Cloudy all day. No word from N. or N.A.\\n\\nMet a man in the park with a small dog. He said he works as a consultant for mobile start-ups. Sounded well-rehearsed. We exchanged numbers.\\n\\nWrote, but little. Heard [[a story]] well worth recording in its entirety:",
      "links": [
        {
          "text": "a story",
          "destination": {
            "name": "a story",
            "pid": 158
          }
        }
      ]
    },
    {
      "pid": 129,
      "name": "Ann",
      "text": "You reassured me\\nyou are not me,\\nwhich was awful nice\\nof you, considering.\\n\\nDon't you remember\\nwe topped the hill at dawn\\nand I was high you'd been laid off but\\nso we spoke saying next to nothing\\n\\nabout it all. We were start-\\nled by a noise in the woods with the fur-\\nitiveness of a skunk snuffling. We f-\\nroze for about fifteen minutes. We\\n\\n",
      "links": []
    },
    {
      "pid": 130,
      "name": "dunes_pre5",
      "text": "Mary and Sail exchange a look. Then Mary says, \"We've been traveling since we first met: four years ago now. I'm not much for settling down, and Sail doesn't mind either way. She's told me all about her world: the people, the places, everything. It's no paradise, that's for sure, but still-- well, let me put it this way. I've been all over this world; I've seen most of the good and damn near all the bad it has to offer. The earth's taken every love from me, every hate too-- everything, really. Why let it take my bones too? I asked Sail if we could travel back.\"\\n\\nSail: \"I told her we could, but we have to be careful. We need both focus and foresight to stay safe. Focus will keep us in one piece as we travel; foresight will keep us in one piece after we travel.\"\\n\\nMary: \"We need someplace quiet to focus, and someplace, um, someplace that's connected? To see things. Fuck, you can explain it better, Sail.\"\\n\\nSail: \"Everywhere is connected to everywhere else: I see you already know that.\" Maybe? 'Universal interconnectedness' was some dumb idea you had one time; you have had a dozen others like it and never thought much of any of them. You do not believe in God or in love.\\n\\nSail: \"Some places are more 'friendly,' more ready to reconnect with old or distant places. These dunes are very friendly.\" A pause. \"They are also very quiet. So here we are.\"\\n\\nYou: \"... So you came here to travel to another world.\"\\n\\nMary & Sail: \"Yes.\"\\n\\n- [[I have to get in on this|dunes_yes]]\\n- ==Best of luck, bye==\\n- [[Um, I should go|back2walk][$late = true]]",
      "links": [
        {
          "text": "I have to get in on this",
          "destination": {
            "name": "dunes_yes",
            "pid": 67
          }
        },
        {
          "text": "Um, I should go",
          "destination": {
            "name": "back2walk",
            "pid": 95
          }
        }
      ]
    },
    {
      "pid": 131,
      "name": "chessboxing",
      "text": "You walk past a garage where two figures dance, backlit by the dawn-sun. Sparring: they dart about the concrete, trading taunts and jabs. Shadows boxing. You catch a few fragments passing by.\\n\\n\"...call those toothpicks of yours arms?\"\\n\"If you ever flossed I wouldn't have to go so hard on your ass!\"\\n\"...\"\\n\"...\"\\n\"...look tired, wanna take a breather?\"\\n\"Funny, I said the exact same thing to your girl last night!\"\\n\"Ahh, fuck you!\"\\n\"...\"\\n\"...\"\\n\"...knock you out the boxframe, shots pop skulls like glass globes / I float by in my cruiser, flow smoother than silk robes--\"\\n\"Were you just using the Wu-Tang school method against me?\"\\n\"I've learned so many styles, forgive me!\"\\n\"...\"\\n\"...\"",
      "links": []
    },
    {
      "pid": 132,
      "name": "mapnext10",
      "text": "\"<<if $attribution is false>>He is extremely free in his conversation; he has not been reticent by any stretch of the imagination, but his production has been unusually hard to follow. He speaks in bunches of ideas.<<else>>@@.Q;He is extremely free in his conversation; he has not been reticent by any stretch of the imagination, but his production has been unusually hard to follow. He speaks in bunches of ideas.@@<<endif>>\"/%Trial of Ezra Pound, p. 188%/\\n\\na) [[Q. You me an h is pro duct ion of s peech?|mapnext11]]\\nb) [[A. Yes, and rambling and illogical.|mapnext11]]\\nc) [[S. Yea, andling andlogical.|mapnext11]]\\nd) [[.he is convinced had he been allowed to message the axis there would have been no axis even.|mapnext11]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "Q. You me an h is pro duct ion of s peech?",
          "destination": {
            "name": "mapnext11",
            "pid": 63
          }
        },
        {
          "text": "A. Yes, and rambling and illogical.",
          "destination": {
            "name": "mapnext11",
            "pid": 63
          }
        },
        {
          "text": "S. Yea, andling andlogical.",
          "destination": {
            "name": "mapnext11",
            "pid": 63
          }
        },
        {
          "text": ".he is convinced had he been allowed to message the axis there would have been no axis even.",
          "destination": {
            "name": "mapnext11",
            "pid": 63
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 133,
      "name": "skipskip",
      "text": "Q: I thought you loved me?\\n\\nA: Well you see so I did, then I fell so my face broke open, I saw through the sidewalk, you were there and you were laughing you were everywhere, I couldn't sleep or sign or make myself sick, so everything filled me until I was only anything, you were still there everywhere you were a radius babe and I was almost everything else, and then now I was so sad I thought that I thought that I wasn't, wrongly but so I thought, so I left, I went to Mexico then Mars before I came to, and but now you are now you and I am not ever so\\n\\n[[Skip to the next question.|skipskipskip]]",
      "links": [
        {
          "text": "Skip to the next question.",
          "destination": {
            "name": "skipskipskip",
            "pid": 79
          }
        }
      ]
    },
    {
      "pid": 134,
      "name": "\"an absurd distress.\"",
      "text": "Or else it's what I might call \"breaking-open bemusement\" or \"a bugged backroom.\"\\n\\n-..--.\\n\\nAs a child I often drew maps I made up on the spot. A mountain range here, a chain of islands there, and a world was born. Partly in imitation of the fantastic maps at the start of many beloved books, (Narnia, Earthsea, Dark Materials,) but also from the simple joy of creation.\\n",
      "links": []
    },
    {
      "pid": 135,
      "name": "nothingtosay1",
      "text": "The three uncles melt back into the ruins. Literally ten more steps later, you stumble into another ambush. <<if $absent is true>>You're<<else>>You are<<endif>> having some crap luck with random encounters.\\n\\nThree more men have some things to say to you. They are all fathers: a [[Father father|father][$father = 2]], a [[Son father|father][$father = 1]], and a [[Godfather|father][$father = 0]]. They look troubled. If you defeat one, you imagine the other two will fold as well.",
      "links": [
        {
          "text": "Father father",
          "destination": {
            "name": "father",
            "pid": 17
          }
        },
        {
          "text": "Son father",
          "destination": {
            "name": "father",
            "pid": 17
          }
        },
        {
          "text": "Godfather",
          "destination": {
            "name": "father",
            "pid": 17
          }
        }
      ]
    },
    {
      "pid": 136,
      "name": "CPDformSex",
      "text": "Pg. 4: Exs\\n\\n(Answer in 24 words or less.)\\n\\nXE: <<if $attribution is \"infrared\">>@@.Q;extend from the simplest point-shoot-detect@@<<else>>extend from the simplest point-shoot-detect<<endif>>/%{flir.com, infrared cameras}%/\\n\\nSX: <<if $attribution is \"wikipedia\">>@@.Q;consecutive weeks and two additional weeks (after 2 weeks at number two) at the top of the@@<<else>>consecutive weeks and two additional weeks (after 2 weeks at number two) at the top of the<<endif>>/% {wikipedia, we found love}%/\\n\\nEX: <<if $attribution is \"godhead\">>@@.Q;distinct beings with distinct roles, they are one in purpose and doctrine. They are perfectly united in bringing@@<<else>>distinct beings with distinct roles, they are one in purpose and doctrine. They are perfectly united in bringing<<endif>>/%{lds.org, godhead}%/\\n\\nSE: <<if $attribution is \"schofield\">>@@.Q;far as you can, then “steeple” the fingers by separating palms of hands, but keeping fingers@@<<else>>far as you can, then “steeple” the fingers by separating palms of hands, but keeping fingers<<endif>>/% {healthline, 3 wrist exercises}%/\\n\\nES: <<if $attribution is \"catamites\">>@@.Q;a field of caves and ruins under the benign aspect of the Mouse@@<<else>>a field of caves and ruins under the benign aspect of the Mouse<<endif>>/% {the catamites, mouse corp}%/\\n\\nXS: <<if $attribution is \"vance\">>@@.Q;else would look inside of us and see an absurd, incomprehensible, hopelessly compromised mess; we ourselves would see <<if $taking_content is false>>[[nothing, of course, but the way|CPDformContact]]<<else>>[[nothing, of course, but the way|CPDformQuality]]<<endif>>@@<<else>>else would look inside of us and see an absurd, incomprehensible, hopelessly compromised mess; we ourselves would see <<if $taking_content is false>>[[nothing, of course, but the way|CPDformContact]]<<else>>[[nothing, of course, but the way|CPDformQuality]]<<endif>><<endif>>/%{brendan vance, fashion, emptiness & problem attic}%/<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "nothing, of course, but the way",
          "destination": {
            "name": "CPDformContact",
            "pid": 28
          }
        },
        {
          "text": "nothing, of course, but the way",
          "destination": {
            "name": "CPDformQuality",
            "pid": 96
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 137,
      "name": "presentlifts02",
      "text": "No, I will tell you a happy one too. You will sit by the lifts a while yet, we still have time. Not that I think I will lose you, but--\\n\\nNo, I do worry, but you don't want to talk about that, so we won't. Okay. Let me tell you another story, a happy story:\\n\\nOnce there was a princess so lovely she shone like a second sun. Her loveliness was, as you can imagine, hard on her parents, and even harder on her two lovely-but-not-that-lovely sisters. It was hardest on her because no-one could make eye contact, which is a very important component of child development.\\n\\nFortunately, as royalty her parents had access to every resource she could ever need. (Most other children as lovely as second suns end up human supernovae.) The physicians tried various lenses, masks, veils, potions, etc., but every effort failed. Finally, her family went with the last resort. They took the princess to the Isle of Harpies.\\n\\nAll harpies have perfect 20/10 color vision, but no harpy can see beauty. They appreciate mundanity and ugliness as well as anyone -- they see nothing as beautiful. So they were the perfect caretakers for this excruciatingly lovely princess. They were sharp and attentive and not a little funny: so too was the princess.\\n\\nShe grew her claws, her wings, her foul mane out among them-- she grew outrageous. Her family's eyes no longer burned looking at her; instead their guts turned traitor on their lungs. They almost ran, but they did still love her. They took her back with them. She took them into consideration. She did still love them.\\n\\nThey all sat down and saw each other.\\n\\nThe other two sisters left, married. The king fell off a horse; the queen fell down a couple different times. The princess was alone. Then she met a roaring spirit of the river. She held her as she died with next to no regrets. [[The end|presentlifts03]].",
      "links": [
        {
          "text": "The end",
          "destination": {
            "name": "presentlifts03",
            "pid": 51
          }
        }
      ]
    },
    {
      "pid": 138,
      "name": "agent",
      "text": "<<if $agent is 2>>The secret is there is no secret.\\n\\nThe secret agent is an honest asshole. He will explain at any opportunity, \"Sorry, I'm such an asshole,\" which does not make things any better. He is not any better than a stream of hungry stinkpots (and much more common.)\\n\\nHe has this to say to you: \"Hey, you like to party?\"\\n\\nYou answer him: \"Get the fuck away from me, you scummy motherfucker.\" [[He has nothing to say in return|nothingtosay4]], but he does follow for another hundred steps before giving up.<<elseif $agent is 1>>The free are the people who can lie without even knowing it. They are rich: they unwrap a rare gift left out in the rain.\\n\\nThe free agent is operating under contract. He is just looking to make an honest buck. He has two small children.\\n\\nHe has this to say to you: \"What am I supposed to tell them?\"\\n\\nYou answer him: \"Tell them you do not know what to say. See what happens.\" He does not look amused, but he laughs. [[He has nothing to say in return|nothingtosay4]].<<else>>The travel is a twin thing, a triumph and a defeat. You never get there but you always get somewhere. \\n\\nThe travel agent has already worn out his welcome. He looks like if you dropped a dozen eggs and two hundred guppies into a wading pool.\\n\\nHe has this to say to you: \"Bermuda is beautiful this time of year.\"\\n\\nYou answer him: \"...\" [[He has nothing to say in return|nothingtosay4]].<<endif>>",
      "links": [
        {
          "text": "He has nothing to say in return",
          "destination": {
            "name": "nothingtosay4",
            "pid": 80
          }
        }
      ]
    },
    {
      "pid": 139,
      "name": "mapnext3",
      "text": "\"<<if $attribution is true>>@@.Q;Unendowed with wealth or pity,\\nLittle birds with scarlet legs,\\nSitting on their speckled eggs,\\nEye each flu-infected city.@@<<else>>Unendowed with wealth or pity,\\nLittle birds with scarlet legs,\\nSitting on their speckled eggs,\\nEye each flu-infected city.<<endif>>\"/%W.H. Auden, The Fall of Rome%/\\n\\na) [[Altogether elsewhere vast reindeer Lashes|mapnext4]]\\nb) [[Miles and miles of golden moss,|mapnext4]]\\nc) [[Miles miles moss, imaginary|mapnext4]]\\nd) [[Silentle and very fast.|mapnext4]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "Altogether elsewhere vast reindeer Lashes",
          "destination": {
            "name": "mapnext4",
            "pid": 144
          }
        },
        {
          "text": "Miles and miles of golden moss,",
          "destination": {
            "name": "mapnext4",
            "pid": 144
          }
        },
        {
          "text": "Miles miles moss, imaginary",
          "destination": {
            "name": "mapnext4",
            "pid": 144
          }
        },
        {
          "text": "Silentle and very fast.",
          "destination": {
            "name": "mapnext4",
            "pid": 144
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 140,
      "name": "mapnext2",
      "text": "\"<<if $attribution is false>>So she sewed. When she sewed, he thought, she made a sound like a kettle on the hob; bubbling, murmuring, always busy, her strong little pointed fingers pinching and poking; her needle flashing straight.<<else>>@@.Q;So she sewed. When she sewed, he thought, she made a sound like a kettle on the hob; bubbling, murmuring, always busy, her strong little pointed fingers pinching and poking; her needle flashing straight.@@<<endif>>\"/%Virginia Woolf, Mrs. Dalloway pg. 218%/\\n\\na) [[looking at his looking sock at the looking of the sofa;|mapnext3]]\\nb) [[(one must be scientific above all, scientific)|mapnext3]]\\nc) [[(one must be above all,)|mapnext3]]\\nd) [[Looking was wonderful.|mapnext3]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "looking at his looking sock at the looking of the sofa;",
          "destination": {
            "name": "mapnext3",
            "pid": 139
          }
        },
        {
          "text": "(one must be scientific above all, scientific)",
          "destination": {
            "name": "mapnext3",
            "pid": 139
          }
        },
        {
          "text": "(one must be above all,)",
          "destination": {
            "name": "mapnext3",
            "pid": 139
          }
        },
        {
          "text": "Looking was wonderful.",
          "destination": {
            "name": "mapnext3",
            "pid": 139
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 141,
      "name": "mapnext7",
      "text": "\"<<if $attribution is false>>I was sick -- sick unto death with that long agony; and when they at length unbound me, and I was permitted to sit, I felt that my senses were leaving me.<<else>>@@.Q;I was sick -- sick unto death with that long agony; and when they at length unbound me, and I was permitted to sit, I felt that my senses were leaving me.@@<<endif>>\"\\n\\na) [[It conveyed to my soul the idea of //revolution// -- perhaps fancy, perhaps unbound.|mapnext8]]\\nb) [[I saw the lips of the black-robed judges.|mapnext8]]\\nc) [[I saw judges lips summaries.|mapnext8]]\\nd) [[I saw them shine with a deadly locution.|mapnext8]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "It conveyed to my soul the idea of //revolution// -- perhaps fancy, perhaps unbound.",
          "destination": {
            "name": "mapnext8",
            "pid": 146
          }
        },
        {
          "text": "I saw the lips of the black-robed judges.",
          "destination": {
            "name": "mapnext8",
            "pid": 146
          }
        },
        {
          "text": "I saw judges lips summaries.",
          "destination": {
            "name": "mapnext8",
            "pid": 146
          }
        },
        {
          "text": "I saw them shine with a deadly locution.",
          "destination": {
            "name": "mapnext8",
            "pid": 146
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 142,
      "name": "mapnext6",
      "text": "\"<<if $attribution is false>>Anarres had no flag to wave, but among the placards proclaiming the general strike, and the blue and white banners of the Syndicalists and the Socialist Workers, there were many homemade signs showing the green Circle of Life, the old symbol of the Odonian Movement of two hundred years before. All the flags and signs shone bravely in the sunlight.<<else>>@@.Q;Anarres had no flag to wave, but among the placards proclaiming the general strike, and the blue and white banners of the Syndicalists and the Socialist Workers, there were many homemade signs showing the green Circle of Life, the old symbol of the Odonian Movement of two hundred years before. All the flags and signs shone bravely in the sunlight.@@<<endif>>\"\\n\\na) [[It was good to be walk-swing/breath/spring-morning.|mapnext7]]\\nb) [[the Hymn of the Insurrection|mapnext7]]\\nc) [[HI|mapnext7]]\\nd) [[rattled rattled and hissed over the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the soft suspects, sin-vast and sparkling.|mapnext7]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "It was good to be walk-swing/breath/spring-morning.",
          "destination": {
            "name": "mapnext7",
            "pid": 141
          }
        },
        {
          "text": "the Hymn of the Insurrection",
          "destination": {
            "name": "mapnext7",
            "pid": 141
          }
        },
        {
          "text": "HI",
          "destination": {
            "name": "mapnext7",
            "pid": 141
          }
        },
        {
          "text": "rattled rattled and hissed over the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the continuous, soft, vast murmur of the soft suspects, sin-vast and sparkling.",
          "destination": {
            "name": "mapnext7",
            "pid": 141
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 143,
      "name": "mapnext5",
      "text": "\"<<if $attribution is false>>Now that it's raining more than ever\\nKnow that we'll still have each other\\nYou can stand under my umbrella\\nYou can stand under my umbrella<<else>>@@.Q;Now that it's raining more than ever\\nKnow that we'll still have each other\\nYou can stand under my umbrella\\nYou can stand under my umbrella@@<<endif>>\"/%Rihanna, Umbrella%/\\n\\na) [[Y#u c#n r#n i##o my a##s|mapnext6]]\\nb) [[So go on let the rain pour|mapnext6]]\\nc) [[So let pour the power play act up|mapnext6]]\\nd) [[When the sun shines, we'll writhe together|mapnext6]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "Y#u c#n r#n i##o my a##s",
          "destination": {
            "name": "mapnext6",
            "pid": 142
          }
        },
        {
          "text": "So go on let the rain pour",
          "destination": {
            "name": "mapnext6",
            "pid": 142
          }
        },
        {
          "text": "So let pour the power play act up",
          "destination": {
            "name": "mapnext6",
            "pid": 142
          }
        },
        {
          "text": "When the sun shines, we'll writhe together",
          "destination": {
            "name": "mapnext6",
            "pid": 142
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 144,
      "name": "mapnext4",
      "text": "\"In case of accidental eye contact, immediately flush eyes out.\"/%Cutex, Warning edit%/\\n\\na) [[Contact a doctor.|mapnext5]]\\nb) [[In case of accidental ingestion, do not induce vomiting.|mapnext5]]\\nc) [[In case of dental arbitrage, do not smile.|mapnext5]]\\nd) [[Harmful to synthetics, finishes plastics.|mapnext5]]",
      "links": [
        {
          "text": "Contact a doctor.",
          "destination": {
            "name": "mapnext5",
            "pid": 143
          }
        },
        {
          "text": "In case of accidental ingestion, do not induce vomiting.",
          "destination": {
            "name": "mapnext5",
            "pid": 143
          }
        },
        {
          "text": "In case of dental arbitrage, do not smile.",
          "destination": {
            "name": "mapnext5",
            "pid": 143
          }
        },
        {
          "text": "Harmful to synthetics, finishes plastics.",
          "destination": {
            "name": "mapnext5",
            "pid": 143
          }
        }
      ]
    },
    {
      "pid": 145,
      "name": "mapnext9",
      "text": "\"Review Your Current Account Balance and Payoff Figures (Updated Daily)!\"/%ECSI envelope%/\\n\\na) [[UpdateBakeBankSeconds!|mapnext10]]\\nb) [[Download All Entitlement Forms (Deferment, Cancellation, Forbearance, etc. ...)|mapnext10]]\\nc) [[Downl...mapnext10)|mapnext10]]\\nd) [[Special Links Too: News Items, Loan & CRC Web Sites!|mapnext10]]",
      "links": [
        {
          "text": "UpdateBakeBankSeconds!",
          "destination": {
            "name": "mapnext10",
            "pid": 132
          }
        },
        {
          "text": "Download All Entitlement Forms (Deferment, Cancellation, Forbearance, etc. ...)",
          "destination": {
            "name": "mapnext10",
            "pid": 132
          }
        },
        {
          "text": "Downl...mapnext10)",
          "destination": {
            "name": "mapnext10",
            "pid": 132
          }
        },
        {
          "text": "Special Links Too: News Items, Loan & CRC Web Sites!",
          "destination": {
            "name": "mapnext10",
            "pid": 132
          }
        }
      ]
    },
    {
      "pid": 146,
      "name": "mapnext8",
      "text": "\"<<if $attribution is false>>He was sitting in his splint chair in the doorway, the open book upon his knees. When she approached she saw that it was the Bible. But she just noticed this, as she might have noticed a fly upon his leg.<<else>>@@.Q;He was sitting in his splint chair in the doorway, the open book upon his knees. When she approached she saw that it was the Bible. But she just noticed this, as she might have noticed a fly upon his leg.@@<<endif>>\"/%Faulkner, Light in August%/\\n\\na) [[his present[ he was incongruity.|mapnext9]]\\nb) [[His eyes were quite clear, quite gray, quite cold.|mapnext9]]\\nc) [[His eyes were like an over excitement.|mapnext9]]\\nd) [[So they the coalgrimed doorway,|mapnext9]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "his present[ he was incongruity.",
          "destination": {
            "name": "mapnext9",
            "pid": 145
          }
        },
        {
          "text": "His eyes were quite clear, quite gray, quite cold.",
          "destination": {
            "name": "mapnext9",
            "pid": 145
          }
        },
        {
          "text": "His eyes were like an over excitement.",
          "destination": {
            "name": "mapnext9",
            "pid": 145
          }
        },
        {
          "text": "So they the coalgrimed doorway,",
          "destination": {
            "name": "mapnext9",
            "pid": 145
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 147,
      "name": "CPDformNo",
      "text": "They know enough. You fold your hands in your lap and wait. \\n\\nAnd wait and wait. Wait. You do wait. Waiting. &wait&waitwait.\\n\\nOnly so many ways to say “You wait.” You exhaust them. The CPD has no clocks; no Centers do. You know why. You wait.\\n\\n.\\n\\nNow there you are. #44 in room 2467. [[Let’s go.|CPDformNo2]]",
      "links": [
        {
          "text": "Let’s go.",
          "destination": {
            "name": "CPDformNo2",
            "pid": 70
          }
        }
      ]
    },
    {
      "pid": 148,
      "name": "redder",
      "text": "Foolishly, you'd saved over your save outside the Wilds because you caught a NitrogenObelisk, one of the rarest Pockm_n in the game. You'd failed to realize the season was nearing its end and you were a good thousand steps from the exit. You'll have to choose your path with care to make it out before the gates close.\\n\\nYou carry x5 SuperBox, x10 UltimateBox, x3 AbsoluteBox, x7 Antidote, x7 Mini Potion, x7 Huge Potion, x7 Revive and x99 Relief from All Suffering Ever Conceived or Borne.\\n\\nYou cheated a bit to get unlimited Reliefs. Still, they will be little help in escaping the Wilds unless you watch your steps.\\n\\n[[Move along|redder_move]]\\n[[Stay put|redder_stay]]",
      "links": [
        {
          "text": "Move along",
          "destination": {
            "name": "redder_move",
            "pid": 11
          }
        },
        {
          "text": "Stay put",
          "destination": {
            "name": "redder_stay",
            "pid": 121
          }
        }
      ]
    },
    {
      "pid": 149,
      "name": "CPDformFinished",
      "text": "You finish the form, though not before running one pen dry. The replacement they gave you is blue, not black-- no matter. It is over, this first obstacle. You look to the screen; your number is nowhere to be seen. They are not following any numerical order: room 201 has #4893, room 202 has #5, room 203 is stubbornly empty, and so on. You hold #44.\\n\\nThis disorder might be due to the diverse nature of the applicants’ needs. How could they know what you need when they haven’t even seen your form? The Center knows more than they let on.\\n\\n[[You wait.|CPDformDream]]",
      "links": [
        {
          "text": "You wait.",
          "destination": {
            "name": "CPDformDream",
            "pid": 33
          }
        }
      ]
    },
    {
      "pid": 150,
      "name": "Credits",
      "text": "\"How do people get better? Well, in my understanding people get better when they start to understand that they are valuable, and they're not valuable because they got a whole lot of money or because somebody think they sexy, but they're valuable because they've been created by God. And God makes you valuable, and whether or not you recognize that value is one thing.\"\\n -- Yasiin Bey, \"Fear Not of Man\"\\n\\nI am not a believer. Never had a god, never looked for one: never bothered me much. But when I listen to this track, (as I've done a lot lately,) I want to believe. \\n\\nI suppose I am valuable: I don't believe it. I can't say with Bey's casual conviction that I've been brought here by some One who loves me without doubt or fear. I'm a flimsy thing and so are my loved ones and we will all be dust. \\n\\nI might die by degrees well before my body does, or die tomorrow. People I pass in the street might spit hate until I believe them. I might get so hungry, so lonely I'll eat my own shit. I don't know, I don't think so. I hope not.\\n\\n----\\n\\nI'd like to thank everyone who ever told me I am valuable. Here isn't the best place for that, so that's more of a promise than anything.\\n\\nThanks to my friends and family: your love means more than I can say. Thanks for everything, for all your encouragement and feedback on this thing.\\n\\nThanks to my beta testers Caleb Wilson and Devi Acharya. Your playthroughs were diligent and your comments were thoughtful -- having an outside take was super helpful.\\n\\nThanks to all the writers who've inspired me, (many of whom I snuck into this thing.) For those of you who are still alive: if you don't want me quoting you, let me know! My email is \"b.minus.seven@gmail.com\".\\n\\nThanks to Chris Klimas and everyone else developing Twine. Without Twine I'd still be writing sad poems, but maybe five people would see them.\\n\\nThanks to Aaron A. Reed for running Spring Thing. It's a tough job and no-one has to do it, but I'm glad you are! \\n\\n[[BACK|Start.]]",
      "links": [
        {
          "text": "BACK",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        }
      ]
    },
    {
      "pid": 151,
      "name": "chest",
      "text": "<<if $chest_open is false>>The top of the chest's lined with notebooks from before you knew better than to put yourself down in a journal. Can't open them, can't part with them, so: the stash.\\n\\nThe next layer's silty miscellany. Rocks, bolts, statuettes, each marking a moment you couldn't recall if you cared to. Fuck! Something sharp; you nicked your engagement finger. You nurse away the budding blood and continue to dig.\\n\\nNow you're getting to the good shit. All your old cute clothes are here -- scrunched, shrunk, smuggled in like the stuff of a rat who lives in a thin wall. Clothes of every color, mostly black. You want to take something out to carry as a talisman, but you won't.\\n\\nWe both know what you came here for. You dump out your fears, dig through your lies, claw off your face and--\\n\\n<<endif>>~Rare Drop!~ You found the Game Bot Color (Anemic Purple) you thought you'd lost on that car trip to Lincoln's grave. Oh wow, it's even got the copy of Pockmark Monsters/%Pokemon, natch%/ you used to play at lunch instead of talking to people! Do you scrounge for batteries and turn it on?\\n\\n-- [[Yes, of course|pockm_n]]",
      "links": [
        {
          "text": "Yes, of course",
          "destination": {
            "name": "pockm_n",
            "pid": 2
          }
        }
      ]
    },
    {
      "pid": 152,
      "name": "answer",
      "text": "Yes. You know me all too well.\\n\\nYou're swept into the next chamber -- a set of large and appallingly sharp teeth awaits. They don't await you in particular: they're set well off to the left side of the chamber. They //are// gnashing in a rather menacing manner, but maybe they're just nervous?<<if $crates is true>><<else>>\\n\\n[[Crates]] sit in a row before the gnashing teeth. Maybe they've got food for the teeth, maybe they've got ~valuable power-ups~: only one way to find out!<<endif>>\\n\\nTwenty paces in front of you is a <<if $none is false>>[[doorway]]. It looks like you could pass through without any delay or difficulty whatsoever.<<else>>doorway. You'd rather not go back there.<<endif>>\\n\\n<<if $taking_content is false>>To your right is a latch labeled [[STORAGE|bottomless pit]]. Worth checking out?<<else>>To your right, you see a [[bottomless pit]]. There's nothing for you there but a deadened end. Is that all you deserve?<<endif>>",
      "links": [
        {
          "text": "Crates",
          "destination": {
            "name": "Crates",
            "pid": 120
          }
        },
        {
          "text": "doorway",
          "destination": {
            "name": "doorway",
            "pid": 82
          }
        },
        {
          "text": "STORAGE",
          "destination": {
            "name": "bottomless pit",
            "pid": 127
          }
        },
        {
          "text": "bottomless pit",
          "destination": {
            "name": "bottomless pit",
            "pid": 127
          }
        }
      ]
    },
    {
      "pid": 153,
      "name": "hallway",
      "text": "<<if $inthishouse is false>>You don't turn on the lights. You know where everything is: you can't get tripped up here. If you fall you can sprawl on the floor for as long as you like.\\n\\n<<endif>>You're facing south down the entryway. The living room's to your [[right|living room]]. The dining room's [[straight|dining room]] ahead. The stairs to the second floor are to your far [[left|second floor]] -- your room's up there. Your keys are likely in there. The stairs to the basement (and your stash) are to your immediate [[left|basement]].",
      "links": [
        {
          "text": "right",
          "destination": {
            "name": "living room",
            "pid": 62
          }
        },
        {
          "text": "straight",
          "destination": {
            "name": "dining room",
            "pid": 53
          }
        },
        {
          "text": "left",
          "destination": {
            "name": "second floor",
            "pid": 86
          }
        },
        {
          "text": "left",
          "destination": {
            "name": "basement",
            "pid": 30
          }
        }
      ]
    },
    {
      "pid": 154,
      "name": "your room",
      "text": "Oh, right. You forgot, your room's still got some reminders of your bad night last night. You won't linger here.\\n\\nYou shake everything out over the bed until the keys give themselves up, then you get the fuck [[out|walk]].",
      "links": [
        {
          "text": "out",
          "destination": {
            "name": "walk",
            "pid": 32
          }
        }
      ]
    },
    {
      "pid": 155,
      "name": "You black out.",
      "text": "You come back to your senses somewhere unexpected, as you expected. Blacking out should take you to the nearest Center for Pockm_n Repairs (CPR) or back to your bedroom, but little is as it should be here. \\n\\nYou're sitting in a chair in a fuzzed field. Each tile's every tile smushed together, a gentle flicker of waves, flames and familiar faces. You're the center of a circle of twelve Rose-type Pockm_n. They sway as They survey you.\\n\\nYou try to rise up, but your body's nonresponsive. You can only wait for whatever They've got planned. You're halfway broken already: it won't take much.\\n\\n\"Don't be silly -- we're not here to hurt you! We're your friends,\" They speak as one. \"We want to help any way we can, lend an ear or a shoulder or a ladder back to-- back to where you were.\"\\n\\nThey are not your friends. They want to help you back into your hole so They don't have to look at you.\\n\\n\"Please, please talk to us: we can't help if you won't let us in.\"\\n\\nYou've tried to tell Them dozens, hundreds of times. Always the same answer: They don't understand. You slip into some unknown tongue whenever you explain, or else They stop up their ears in secret. [[It's hopeless.]]",
      "links": [
        {
          "text": "It's hopeless.",
          "destination": {
            "name": "It's hopeless.",
            "pid": 65
          }
        }
      ]
    },
    {
      "pid": 156,
      "name": "CPDformNoYes",
      "text": "You receive your log-in and go into the terminal room. It is altogether bare except for row after row of tables, chairs, monitors and keyboards. It would be silent but for the chatter of ten thousand fingers. Nobody turns from the terminals to take you in; they are utterly absorbed.\\n\\nYou pass dozens of rows before finding an empty terminal. You sit down and log in. The system is single-minded: one program, one file folder without end. The folder looks to hold only images -- since you have neither the time nor the inclination to exhaust its contents, it could contain anything and everything.\\n\\nThe program's documentation is, in full: \"First, select a file from the folder provided. Next, attach a comment. Last, type 'POST' to post.\"\\n\\n[[You begin.|https://cpdacct44.wordpress.com/]]\\n<<if $terminal_ending is false>><<remember $endings += 1>><<remember $terminal_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|CPDformWake]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "CPDformWake",
            "pid": 113
          }
        }
      ]
    },
    {
      "pid": 157,
      "name": "dive",
      "text": "You saw what They refused to, pierced the veil and fell beneath the earth. You find a world of wonderment They couldn't even have dreamed. Your arms and your neck ache terribly. Every glance is lit with the stuff of life. You rest and last.\\n\\nEND",
      "links": []
    },
    {
      "pid": 158,
      "name": "a story",
      "text": "1./%Ovid, Metamorphoses%/\\n<<if $attribution is \"ovid\">>@@.Q;Before the sea the earth the\\nSky to cover up everything\\nNature all one face no composure\\nChaos by name: unruly masses\\nNothing but a heap of troublesome\\nAtoms mixed-up shaken agitated\\n\\nNo dawn no day no moon-maiden\\nFilling her purse with snatched silver\\nNo earth aloft in air an ornament@@<<else>>Before the sea the earth the\\nSky to cover up everything\\nNature all one face no composure\\nChaos by name: unruly masses\\nNothing but a heap of troublesome\\nAtoms mixed-up shaken agitated\\n\\nNo dawn no day no moon-maiden\\nFilling her purse with snatched silver\\nNo earth aloft in air an ornament<<endif>>\\n\\n2.\\nBodies but no bones about\\nSilly pudgy sponges molluscs\\nNightly\\nClinging to a shy cliff-face\\nNames no: <<if $attribution is \"moore\">>@@.Q;shells one keeps\\nAdjusting the ash heaps@@<<else>>shells one keeps\\nAdjusting the ash heaps<<endif>>/%Marianne Moore, The Fish%/\\n\\nNeighborliness is all\\nFluttering waves tongues futile\\nNo way to tell one another\\n\\n3.\\nBushels stolen sundry rodents\\nSo we built a granary\\nNine and counting cat-tails\\nCords knotted backs pace\\nNews from the front of the line\\nAll out\\n\\nName one good thing: alters\\nFurious old blood lets go\\nNow before They find [[love|her]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "love",
          "destination": {
            "name": "her",
            "pid": 106
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 159,
      "name": "dunes_ab",
      "text": "Ten minutes in, the sand opens up without warning. You find yourself in the belly of some great beast./%Frank Herbert, Dune%/\\n\\nYou're in some sort of waiting room, somewhere before the digestive system proper -- you're quite comfortable in fact. The walls/linings/bounds are yielding but supportive, a cushion laid over an inestimable trampoline. Yes, all is blank and the air's from a cave that's held death, but there's much less decomposition going on than you'd think. You wonder how long you'll be here.\\n\\nYou notice [[writing|dunes_ab02][$crates = false]] on the surrounds/confines/muscles just above you. You can't tell if it's an official posting or graffiti.",
      "links": [
        {
          "text": "writing",
          "destination": {
            "name": "dunes_ab02",
            "pid": 47
          }
        }
      ]
    },
    {
      "pid": 160,
      "name": "journey",
      "text": "Interlude III: You and Me\\n\\n[[My meager share's a few big words;\\nYou know the tunes of all the birds.|red_next5]]",
      "links": [
        {
          "text": "My meager share's a few big words;\\nYou know the tunes of all the birds.",
          "destination": {
            "name": "red_next5",
            "pid": 92
          }
        }
      ]
    },
    {
      "pid": 161,
      "name": "StoryAuthor",
      "text": "B Minus Seven",
      "links": []
    },
    {
      "pid": 162,
      "name": "her_look",
      "text": "It is the secrecy of her look that draws you in. She has eyes only for the ones lying on the canvas surface. The behold beheaded, she smiles on-- she behaves as a radio dialed: now this exact frequency, and now that, and now that //is not// what she meant, not at all, not at all.\\n\\nHer red was never so faint. So feigned in fact, so as to render aimless all approaches -- the sun shines on (a duke or a duplicity,) the clouds are curtains and justice, just pretence. The painter is a pine needle.\\n\\nPretend to live before 'tense' or before a certain end. Still she precedes you! Even a lead collar will carry you along the current a while. Together down, Sir!\\n\\nYou see her now: she is a sting, a film, a flood. You cry out you don't wish to know and she does not listen, she cannot help you hear.\\n<<if $look_ending is false>><<remember $endings += 1>><<remember $look_ending = true>><<endif>>\\n[[END|Start.]]<<if $endings is 1>><<else>>\\n[[UNDO|her_painting]]<<endif>>",
      "links": [
        {
          "text": "END",
          "destination": {
            "name": "Start.",
            "pid": 7
          }
        },
        {
          "text": "UNDO",
          "destination": {
            "name": "her_painting",
            "pid": 38
          }
        }
      ]
    },
    {
      "pid": 163,
      "name": "map12115",
      "text": "For incidental cuts and scrapes. Proper care is important to avoid future complications./%Antibacterial Sheer, Walgreens edit%/\\n\\na) [[Use the following as a helpful guide|mapnext]]\\nb) [[1. Stop the bleeding|mapnext]]\\nc) [[1. Stop when bleeding|mapnext]]\\nd) [[4. Change when needed|mapnext]]",
      "links": [
        {
          "text": "Use the following as a helpful guide",
          "destination": {
            "name": "mapnext",
            "pid": 43
          }
        },
        {
          "text": "1. Stop the bleeding",
          "destination": {
            "name": "mapnext",
            "pid": 43
          }
        },
        {
          "text": "1. Stop when bleeding",
          "destination": {
            "name": "mapnext",
            "pid": 43
          }
        },
        {
          "text": "4. Change when needed",
          "destination": {
            "name": "mapnext",
            "pid": 43
          }
        }
      ]
    },
    {
      "pid": 164,
      "name": "absentlifts",
      "text": "It's been a long time: eight, nine years? Wow. You've grown so much so sudden. You were a hurt-quiet boy before, a mumbling bloom in some backstage drama -- now you're a hurt-beautiful woman. A glint-ring.\\n\\nYou knew me as the loud goof I was even then: I thought I knew everything about you. I was like that one bird we had in class that would not lay eggs. I was unproductive. You knew that I loved you now didn't you?\\n\\nThis one air-conditioning unit sits about fifty feet to the southwest. It doesn't buzz, it doesn't hum: it emits some fumbling amalgam. No other noise around us, not that I can tell.\\n\\nWe sit together and wait. You smile and I try to. We've got [[nothing to say]] to each other.",
      "links": [
        {
          "text": "nothing to say",
          "destination": {
            "name": "nothing to say",
            "pid": 59
          }
        }
      ]
    },
    {
      "pid": 165,
      "name": "outskirts",
      "text": "<<if $absent is true>>You reach the edge of town without further incident. Before the woods is a small trailhead with a kiosk and a picnic table.\\n\\nThe picnic table's barren; the kiosk's a mistake like every other kiosk. Your taste is a burden here: the layout's wrong, color's wrong, font's wrong, kerning's real wrong. It's all wrong. ''WELCOME TO THE NORTH WOODS OF FLUORITE DISTRICT.''<<else>>You reach the edge of town without further incident. Before the woods is a small trailhead with a kiosk and a picnic table.\\n\\nThe picnic table is barren; the kiosk is a mistake like all kiosks. Your taste is a burden here: layout is wrong, color is wrong, font is wrong, kerning is real wrong. All wrong. ''WELCOME TO THE NORTH WOODS OF FLUORITE DISTRICT.''<<endif>>\\n\\n==Examine the kiosk.==\\n[[Head down the trail without a second thought.|woods]]/%(Center for Natural Kinds) (Natural Landscapes) (Natural Rights/Rites)\\n\\t{\"North Woods of Fluorite District\")\\n(kiosk, CYOA brochure) \\n\\t(for a map, turn to pg x)\\n\\t(for history of the forest)\\n\\t(for a list of everyone who has gone missing in the forest)\\n\\t(for \"Forest Safety Tips\" [Friedrich the Friendly Forester])%/\\n",
      "links": [
        {
          "text": "Head down the trail without a second thought.",
          "destination": {
            "name": "woods",
            "pid": 6
          }
        }
      ]
    },
    {
      "pid": 166,
      "name": "Look away",
      "text": "You stare at your feet and stagger down the street. Your head soon clears; when the Law no longer haunts your periphery, you look up again.\\n\\nThe Natural Law is a menace, plain and simple. No-one seems to know what to do about it. The Law is hardly a popular topic of discussion: the subject, when it does come up, tends towards lurid speculation on the fates of those who dare deface it. Mostly you try not to think about it.\\n\\nMercifully, the next few streets house only more modest statutes.\\n----\\nAll stores must close on Sunday.\\n- - -\\n<<if $attribution is \"mcneill\">>@@.Q;If one destroys another by his magic, he shall do penance for three years with an allowance of bread and water, and for three years more he shall abstain from wine and meats, and then at last in the seventh year he shall be admitted to communion. But if anyone is a magician for the sake of love and destroys nobody, that person, if a cleric, shall do penance for an entire year on bread and water; a layman, half that time; a deacon, two years; a priest, three. Especially if by this means anyone deceives a woman with respect to the birth of a child; for this each shall add besides six periods of forty days, lest he be chargeable with homicide.@@<<else>>If one destroys another by his magic, he shall do penance for three years with an allowance of bread and water, and for three years more he shall abstain from wine and meats, and then at last in the seventh year he shall be admitted to communion. But if anyone is a magician for the sake of love and destroys nobody, that person, if a cleric, shall do penance for an entire year on bread and water; a layman, half that time; a deacon, two years; a priest, three. Especially if by this means anyone deceives a woman with respect to the birth of a child; for this each shall add besides six periods of forty days, lest he be chargeable with homicide.<<endif>>/%McNeill and Gamer%/\\n- - -\\n<<if $attribution is \"potato\">>@@.Q;Chapter 30: Quarantine (Potato), III A\\n\\n3.\\tTablestock. Potatoes intended for purposes of consumption shall be allowed entrance into Pine District only if:\\n\\na.\\tThe potatoes have been washed.\\nb.\\tThere is no evidence of surface or internal defects caused by the controlled pests;\\nc.\\tThe potatoes have been treated with a sprout inhibitor when shipped during the period between February 1st and May 30th of each year; and\\nd.\\tThe potatoes have been packed in consumer bags.@@<<else>>Chapter 30: Quarantine (Potato), III A\\n\\n3.\\tTablestock. Potatoes intended for purposes of consumption shall be allowed entrance into Pine District only if:\\n\\na.\\tThe potatoes have been washed.\\nb.\\tThere is no evidence of surface or internal defects caused by the controlled pests;\\nc.\\tThe potatoes have been treated with a sprout inhibitor when shipped during the period between February 1st and May 30th of each year; and\\nd.\\tThe potatoes have been packed in consumer bags.<<endif>>/%Maine, Quarantine (Potato)%/\\n- - -\\nAll who pollute the river Alph/%Coleridge, Kubla Khan%/, (be it by swimming or wading in the river, rowing or sailing in the river with a profane vessel, drawing water from the river with a profane vessel, washing dirty linens in the river, throwing refuse into the river, urinating or defecating in the river, spilling blood into the river, spitting or sneezing into the river, weeping into the river, throwing profane stones into the river, drowning oneself or another in the river, giving birth in the river, damming or diverting the river, fishing in the river, or performing profane rites in the river,) shall pay a fine no less than $125 but no more than $500.\\n----\\n[[You turn the corner.|CLS]]<<if $attribution is false>><<else>>\\n\\n[[Back to Attribution|Attribution]]<<endif>>",
      "links": [
        {
          "text": "You turn the corner.",
          "destination": {
            "name": "CLS",
            "pid": 125
          }
        },
        {
          "text": "Back to Attribution",
          "destination": {
            "name": "Attribution",
            "pid": 68
          }
        }
      ]
    },
    {
      "pid": 167,
      "name": "woods2",
      "text": "The North Woods were never meant to hurt you. Not you in general, certainly not //you// in particular. They have grown a touch grouchy over the years. Neglect, recklessness, etc.\\n\\nJust numb yourself when they needle you. Just jump back when they lunge at you. Just dash off when they thrash at you. Just duck when they attempt beheading you. Just throw up a force-field when they blast you. Just shiver like a vision when they tell you you are not real.\\n\\nNow here is [[a door]] to deliver you.",
      "links": [
        {
          "text": "a door",
          "destination": {
            "name": "a door",
            "pid": 20
          }
        }
      ]
    },
    {
      "pid": 168,
      "name": "her_bed",
      "text": "If you lie down on this bed, you will never get up. And you imagine that's for the best?\\n\\n- [[Lie down|her_lie]]\\n- [[Please please don't|her]]",
      "links": [
        {
          "text": "Lie down",
          "destination": {
            "name": "her_lie",
            "pid": 111
          }
        },
        {
          "text": "Please please don't",
          "destination": {
            "name": "her",
            "pid": 106
          }
        }
      ]
    },
    {
      "pid": 169,
      "name": "having",
      "text": "This wasn't something I meant to write from the start. The words bubbled up from under the dunes and it felt wrong to take them out, so I kept them. Nothing more than that: there's no unpacking, no broader theme. It's left as a Thing That Happened.\\n\\nI don't know all that much about moving on, so I won't try and tell you where to go -- when I feel well-placed to do so, I swear I'll let you know.\\n\\n[[Include|Table of Content][$having_content = true]]\\n[[Exclude|Table of Content][$having_content = false]]",
      "links": [
        {
          "text": "Include",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        },
        {
          "text": "Exclude",
          "destination": {
            "name": "Table of Content",
            "pid": 103
          }
        }
      ]
    }
  ]
}